{"title":"Michael Burks - 2003 - I Smell Smoke FLAC","uid":8775969,"size":391382673,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00031bd9600e68056feb2aa8fb5cc0e1b50e8221&amp;dn=Michael+Burks+-+2003+-+I+Smell+Smoke+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eika256","files":-1,"time":1375557368,"description":"Michael Burks - 2003 - I Smell Smoke\n\nA continuation of the sound established on his Alligator debut, I Smell Smoke is even more impressive than its much-heralded predecessor. While vocally Michael Burks still invites comparison to Albert King, especially on gospel-fried ballads like &quot;Lie to Me&quot; (the Flying V guitar he sports on this album's cover shot further reinforces the similarities between the two artists), his guitar work has become more electrified and confident. With a tone sounding at times like Eric Clapton's psychedelic work in Cream and a rugged four-piece band supporting him, this is a tough, uncompromising contemporary blues/blues-rock/R&amp;B album that doesn't pull punches. Co-produced and mixed by veteran Jim Gaines, the sound is professional but not polished, with Burks' strong persona commanding attention. However, the songs -- which are far above average -- are as important as the performance. Mostly written by outside sources, Burks avoids the crowd-pleasing covers that populate his live shows, instead digging into obscure tunes such as Latimore's &quot;Let the Doorknob Hit You,&quot; delivering them with his gutsy punch. His playing often takes on a Buddy Guy-styled intensity, with leads that reach out of the speakers, wrapping around and reeling you in. Even the slow blues tracks are played full-bore, but the closing &quot;Snake Eggs,&quot; with just guitar and Billy Gibson's fiery, overdriven Little Walter-styled harmonica, shows that Michael Burks doesn't need help to create all the smoke he wants. (AllMusic)\n\nTrack list:\n01 - All Your Affection Is Gone\n02 - One More Chance\n03 - I Smell Smoke\n04 - Time I Came In Out Of The Rain\n05 - Hard Love\n06 - Miss Mercy\n07 - Let The Door Knob Hit You\n08 - Lie To Me\n09 - Willing To Crawl\n10 - I Hope He's Worth My Pain\n11 - Good Man, Bad Thing\n12 - Snake Eggs\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:00031bd9600e68056feb2aa8fb5cc0e1b50e8221","amp;dn":"Michael+Burks+-+2003+-+I+Smell+Smoke+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00031bd9600e68056feb2aa8fb5cc0e1b50e8221","infoHashBuffer":{"type":"Buffer","data":[0,3,27,217,96,14,104,5,111,235,42,168,251,92,192,225,181,14,130,33]},"announce":[],"urlList":[]}}