{"title":"Lost Minnesota - Stories of Vanished Places (History Photo Arch)","uid":16035467,"size":72215191,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0082a0e8c6cfda4a7026d820791719ce0e9dd087&amp;dn=Lost+Minnesota+-+Stories+of+Vanished+Places+%28History+Photo+Arch%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":7,"uploader":"STBGD","files":1,"time":1476476045,"description":"Jack El-Hai, &quot;Lost Minnesota: Stories of Vanished Places&quot; \r\nEnglish | 2000 | 0816635153 | PDF | pages: 224 | 68,8 mb\r\n\r\nThe first book to tour forgotten landmarks throughout the state of Minnesota.\r\n\r\nBelieve it or not, Minnesota's architectural landscape has included a house made from the fuselage of a B-29 bomber, a hotel that spent its final years as a chicken hatchery, a Civil War cemetery, a treehouse built and occupied year-round by an eccentric university professor, and a railway that once carried passengers up Duluth's steep incline from Lake Superior.\r\n\r\nThey are all gone now, along with countless houses, parks, bridges, theaters, sports stadiums, courthouses, and farm buildings in which Minnesotans have worked, played, and lived their lives. Though other books have looked at the lost architecture of Minneapolis and St. Paul, Jack El-Hai's Lost Minnesota is the first book to tell the stories of buildings and landmarks from rural and small-town Minnesota, as well as those of the residential and suburban areas of the state's largest cities.\r\n\r\nFrom Rochester's Hotel Zumbro and the Charles H. Mayo House to the Hastings Spiral Bridge and the Lyceum Theater of Duluth, El-Hai rediscovers a lost landscape and the values and lifestyle of a bygone era. He tours not only Twin Cities buildings, such as the Fairoaks mansion, the Wilder Baths, and the Beyrer Brewery, but also its sites, such as the Wonderland amusement park, in order to re-create not only where but how Minnesotans lived.\r\n\r\nLost Minnesota presents eighty-nine beautifully illustrated stories about these fascinating places and those who built them, lived in them, and tore them down. This is a book sure to delight the Minnesota history enthusiast and anyone who is curious about the state's changing urban, small-town, and rural landscapes.\r\n\r\nJack El-Hai is a freelance journalist and columnist for Architecture Minnesota magazine, and the author of Minnesota Collects (1992) and (with Barbara Degroot) The Insiders' Guide to the Twin Cities (1995). He lives in Minneapolis","torrent":{"xt":"urn:btih:0082a0e8c6cfda4a7026d820791719ce0e9dd087","amp;dn":"Lost+Minnesota+-+Stories+of+Vanished+Places+%28History+Photo+Arch%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0082a0e8c6cfda4a7026d820791719ce0e9dd087","infoHashBuffer":{"type":"Buffer","data":[0,130,160,232,198,207,218,74,112,38,216,32,121,23,25,206,14,157,208,135]},"announce":[],"urlList":[]}}