{"title":"Sustainability in Engineering Design","uid":12114554,"size":76470756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00bab41ba7c08e064c7ab3325ad9efbfcc7eae69&amp;dn=Sustainability+in+Engineering+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":2,"time":1436656970,"description":"Sustainability in Engineering Design (Elsevier Academic Press, 2014)\n\nISBN 9780080993690\n\nDesigned for use in engineering design courses, and as a reference for industry professionals learning sustainable design concepts and practical methods, Sustainability in Engineering Design focuses on designers as the driving force behind sustainable products. This book introduces sustainability concepts and explains the application of sustainable methods to the engineering design process.\n\nThe book also covers important design topics such as project and team management, client management, performance prediction, and the social and environmental effects of sustainable engineering design. These concepts and methods are supported with a wealth of worked examples, discussion questions, and primary case studies to aid comprehension.\n\nApplies research-based methods to achieve real-world results for rapidly evolving industry trends\nFocuses on design engineers as the starting point of creating sustainable design\nProvides practical methods and design tools to guide engineering designers in creating sustainably designed and engineering products\nIncorporates all aspects of sustainable engineering design, including the material selection, production, and marketing of products\nIncludes cutting-edge sustainable design model case studies based on the authors' own research and experiences","torrent":{"xt":"urn:btih:00bab41ba7c08e064c7ab3325ad9efbfcc7eae69","amp;dn":"Sustainability+in+Engineering+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00bab41ba7c08e064c7ab3325ad9efbfcc7eae69","infoHashBuffer":{"type":"Buffer","data":[0,186,180,27,167,192,142,6,76,122,179,50,90,217,239,191,204,126,174,105]},"announce":[],"urlList":[]}}