{"title":"Lydia Loveless - Somewhere Else","uid":9669255,"size":102492988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0187a9ab39eee5d793787dee09dd09f247541245&amp;dn=Lydia+Loveless+-+Somewhere+Else&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pigwiggle","files":11,"time":1393429312,"description":"Quothe AllMusic.com:\n\nJudging from Lydia Loveless' second album for Bloodshot, 2014's Somewhere Else, relationships don't come easy for her. She falls for married men, she thinks a lot about her old boyfriends, she's lonely, she's needy, she gets lust mixed up with love (and vice versa), and she wants the sort of grand-scale romance that doesn't work in real life. In short, she's a twenty-something woman who lives in the real world (it doesn't get much more real than Columbus, Ohio) and has developed an uncanny ability to talk about matters of the heart and soul with a lyrical voice that's graceful, keenly observed, and brutally honest. Loveless' singing is just as outstanding as her songcraft -- she can move from sweet country and canny pop to fierce, Stones-style rock &amp; roll at the drop of a hat and nail it at every turn -- and as good as 2011's Indestructible Machine and the 2013 EP Boy Crazy were, Somewhere Else feels like the point where she's really mastered the recording studio. The production by Loveless and Joe Viers is subtle but captures the full range of Loveless' moods and ideas, and her interaction with her band is intuitive in the best way; she sings with the musicians, not over them. And while the tone of the songs on Somewhere Else is often confessional, she makes the details feel powerfully authentic and deeply felt; there's no shock value in Loveless doing cocaine to get a man off her mind in &quot;Really Wanna See You&quot; or telling her lover what she wants and needs in &quot;Head,&quot; there's just the clear, unashamed sound of someone laying her life bare for us, and the effect is liberating. (And Kirsty MacColl's &quot;They Don't Know&quot; is a pretty inspired choice for a cover.) At the age of 23, Loveless is still young enough to be fearless, but she's matured enough as an artist to make something truly special out of her stories, and Somewhere Else confirms she's the most strikingly accomplished woman to emerge in roots rock since Neko Case. It's anyone's guess where Loveless will go from here, but she's already made an album that's genuinely dazzling, and Somewhere Else sounds like a real contender for best album of 2014. \n\nAll praise to the Original Uploader.","torrent":{"xt":"urn:btih:0187a9ab39eee5d793787dee09dd09f247541245","amp;dn":"Lydia+Loveless+-+Somewhere+Else","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0187a9ab39eee5d793787dee09dd09f247541245","infoHashBuffer":{"type":"Buffer","data":[1,135,169,171,57,238,229,215,147,120,125,238,9,221,9,242,71,84,18,69]},"announce":[],"urlList":[]}}