{"title":"After Kieslowski - The Legacy of Krzysztof Kieslowski (Film Art)","uid":15353353,"size":6231505,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:018e984c251d20fd37c9f03f2c0ef50965aabd24&amp;dn=After+Kieslowski+-+The+Legacy+of+Krzysztof+Kieslowski+%28Film+Art%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1468957266,"description":"After Kieslowski: The Legacy of Krzysztof Kieslowski\r\n2009 | English | 0814333265 | 264 pages | PDF | 6 MB\r\n\r\nThis title traces the legacy of Krzysztof Kieslowski in films made after his death using his scripts or ideas and in the work of other filmmakers. Polish filmmaker Krzysztof Kieslowski died unexpectedly in March 1996 at precisely the moment he had reached the height of his career and gained a global audience for his work with the &quot;Three Colors&quot; trilogy (1993-94). Since his death he has been hailed as one of the greatest and most influential directors of all time, elevated to the elite of world cinema alongside Jean Renoir, Robert Bresson, Federico Fellini, Yasujiro Ozu, Max Ophuls, and Andrei Tarkovsky. In &quot;After Kieslowski&quot;, leading contributors diverge from the typical analysis of Kieslowski's work to focus on his legacy in films made after his death, including those based on his scripts and ideas and those made entirely by other filmmakers. Kieslowski's rich legacy is rooted in not only a very significant body of early work made before his breakthrough films but another trilogy of films that he had been working on prior to his death, several of which have gone on to be produced. Furthermore, actors and assistant directors involved with Kieslowski also made films that develop his earlier, incomplete projects or that derive thematically and stylistically from his work. &quot;After Kieslowski&quot; considers Kieslowski's legacy from three broad perspectives - the Polish, the European, and the global. Contributors trace his direct influence on filmmakers in Poland and Europe, including Jerzy Stuhr, Krzysztof Zanussi, Emmanel Finkiel, Julie Bertucelli, and Tom Tykwer, as well as points of thematic coincidence between his work and that of Jean-Luc Godard, P. T. Anderson, David Lynch, Michael Haneke, Abbas Kiarostami, and Paul Haggis. This collection also traces the reemergence of Kieslowski's unique visual signature in films by Ridley Scott, Santosh Sivan, John Sayles, and Julian Schnabel, and his highly original use of television serial-narrative form that is echoed in at least two major American television series, HBO's &quot;Six Feet Under&quot; and ABC's &quot;Lost&quot;. Examining Kieslowski's legacy is a way of thinking both about the unique features of Kieslowski's work and about issues that are now at the heart of contemporary filmmaking. Film scholars and students will appreciate this groundbreaking volume","torrent":{"xt":"urn:btih:018e984c251d20fd37c9f03f2c0ef50965aabd24","amp;dn":"After+Kieslowski+-+The+Legacy+of+Krzysztof+Kieslowski+%28Film+Art%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"018e984c251d20fd37c9f03f2c0ef50965aabd24","infoHashBuffer":{"type":"Buffer","data":[1,142,152,76,37,29,32,253,55,201,240,63,44,14,245,9,101,170,189,36]},"announce":[],"urlList":[]}}