{"title":"Canada Over the Edge - Season 2  (1080p)","uid":11162794,"size":20002252096,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:01b7d2d0de46c27a3de19cd6bad5c7ffd139cb5b&amp;dn=Canada+Over+the+Edge+-+Season+2++%281080p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"thezilos","files":-1,"time":1412577457,"description":"Canada Over the Edge is an aerial-documentary series exploring the features that define Canada:\n-----------------------------------------------------------\n\nTake to the skies for a breathtaking view of British Columbia's spectacular coast. From the rocky shores of Vancouver Island to the silt-laden mouth of the Fraser, over ancient rainforests and waterways carved by glaciers, to the remote beauty of Bella Coola and Haida Gwaii, this 13-part series explores our province's natural wonders from a rarely seen perspective. Along the way, we visit wilderness reserves, recreation areas, cities, seaside towns and island communities, and experience the culture and history etched in the contours of the Pacific coastline.\n\n-----------------------------------------------------------\n\nEp. 1 - Canada's Southern Boundary\nWith Washington State's Olympic Mountain Range as a backdrop, this incredible journey passes through Victoria, which is considered one of the most beautiful cities in North America. The spectacular waters of the Salish Sea that surrounds the city lead north to beautiful Salt Spring Island and Gulf Islands National Park Reserve. This southern tip of Vancouver Island is packed with adventure and mystery, including sea caves, marine life, and coastal forests, along with a number of man-made historic wonders such as Race Rocks Lighthouse and Fort Rodd Hill National Historic Site.\n\n\nEp. 2 - Vancouver Island's Eastern Coastline\nTraveling along Vancouver Island's eastern coast is a 200-kilometre journey along one of Canada's most spectacular waterways, and both land and sea are bursting with life. From Nanaimo to Campbell River, the towns and settlements along this coast are steeped in culture and history, and some of the world's most beautiful islands - Denman, Hornby, and Quadra - are only a short ferry ride away. Along the coast we also visit Discovery Passage, a key navigation route enjoyed by Mariners around the world, and learn about its dangerous past. Further inland, Vancouver Island is a world unto its own, offering rugged scenery that includes 800-year-old Douglas firs and soaring mountain peaks.\n\n\nEp. 3 - Vancouver Island's Northern Coastline\nFrom the tiny outpost of Telegraph Cove, sea lions, dolphins, humpback whales, and other awe-inspiring sea life mark the beginning of a rare journey along one of the world's most remote and barren marine perimetres. A cultural story also thrives just kilometres away: On Cormorant Island, in the community of Alert Bay, the U'Mista Cultural Centre holds a collection of ceremonial masks that tell the story of the Namgis people. And in Alert Bay's ceremonial longhouse, traditional dance continues to flourish. This aerial tour comes to an end beyond the remote Cape Scott, where we pass over jagged rocks and incredible sea caves.\n\nEp. 4 - Vancouver Island's Western Coastline\nShowcasing this region's unique coastal rainforest, this journey takes us through a collection of scenic towns, parks, and forest, including the charming surf town of Tofino, Pacific Rim National Park Reserve, and Clayoquot Sound UNESCO Biosphere Reserve. To the east, the town of Port Alberni holds a unique history as the heart of Vancouver Island's natural resources industry and the site of a world-famous tsunami that changed the face of disaster relief in the region. Further north, the towering mountains and vast valleys of Strathcona Provincial Park remain one of this region's most iconic landscapes.\n\nEp. 5 - Lower Mainland\nThis aerial exploration of BC's lower mainland begins high above the rocky contours of the Fraser Canyon and follows the winding waters of the Fraser River. At the town of Chilliwack we head west, exploring the communities of Surrey and Fort Langley - the birthplace of British Columbia. To the south, we travel along Zero Avenue, a unique roadway that follows the 49th parallel. Residents on one side of the road live in America, residents on the other side live in Canada. As we head north, we come to one of the top-rated cities in the world - Vancouver. Here we explore the spectacular bridges, buildings, and parks set against the mountains that tower over this awesome cityscape.\n\n\nEp. 6 - Sea to Sky\n\nAs we head northwest from the city of Vancouver, the open waters of the Pacific become the sheltered waters of Howe Sound. Here the landscape rises and the world-famous Sea-to-Sky corridor comes to life. It is one of the West Coast's most iconic landscapes, featuring Brunswick Mountain and Stawamus Chief Provincial Park. The cultural history of the region is revealed through the Brittania Beach Mine Museum and the West Coast Railway Association's Heritage Park. This journey culminates further north at the cable cars and mountain bike trails of world-famous Whistler-Blackcomb.\n\n\nEp. 7 - Sunshine Coast\n\nFrom high above British Columbia's Bowen and Gambier Islands, we begin an epic aerial exploration that follows the rugged contours of the Sunshine Coast. The town of Gibsons is one of Canada's most iconic towns, and it was once the setting for one of the country's longest running television programs, Beachcombers. Today, as the heart of the region's forestry sector, the town continues to be a flurry of activity. Later in the journey, we reveal a different type of forestry altogether at the site of a Hydro Dam built decades ago. The trees, perfectly preserved for future harvest, are a spectacular sight from the air. Heading inland, our journey culminates at the breathtaking Princess Louisa Inlet, one of the West Coast's most hidden gems.\n\n\nEp. 8 - End of the Road\nStarting in the town of Powell River, we head 20 kilometres northwest to the literal end of the road - Mile ,0&quot; of the Pacific Coastal Highway. Further along, we come to BC's unique coastal inlets, which offer stunning vistas and sheltered waters for the pleasure crafts and ferries that supply some of BC's remote communities. Moving inland, we find Mount Meager - a volcano with a violent geological past - and it's an impressive sight. At the end of the journey, we return to the Pacific to explore Stuart Island, the Octopus Islands, and a forgotten World War II defense installation on tiny Yorke Island.\n\n\nEp. 9 - Secrets of the Interior\nStarting just off the coast of Vancouver Island, we head inland, following the contours of Knight Inlet. The surrounding mountain ranges are covered in snow and ice, but for how long? From high above, we explore Klinaklini Glacier, a landmark many scientists believe foreshadows the continued future of global warming and the inevitable loss of these ice-capped peaks. Heading back to the coast, we come to Calvert Island and the seldom-seen Hakai Protected Area. Then, as we head inland once more, wildlife photographer Ian McAllister sets out on an unforgettable journey through the winding waterways surrounding Denny Island and BC's inland rainforests.\n\n\nEp. 10 - Bella Coola to Prince Rupert\nStarting in the tiny town of Bella Coola, we begin an inland aerial journey west, exploring the towering Mount Saugstad and the spectacular blue waters of Queen Charlotte Sound. Further west, Cascade Inlet leads to the community of Bella Bella and then the Great Bear Rainforest. Heading North, the incredible mountain ranges of the Kitlope Heritage Conservancy Protected Area and Foch Gitoyees Park lead to civilization in the towns of Kitimat and Terrace. From here we continue west, following the winding Skeena River to the town of Prince Rupert, and the rugged wildlife that surrounds it.\n\n\nEp. 11 - BC's Northern Coastal Boundary\nBeginning more than 100 kilometres inland, this rare aerial exploration of BC's northern coastal boundary begins high above the incredible mountain peaks of Seven Sisters Provincial Park. As we head northwest, the landscape of Nisga's Memorial Lava Bed Park is full of eerily coloured lava formations as far as the eye can see. Finally, at the Alaska border, we come to Salmon Glacier, which towers above the town of Stewart. Heading south, we trace the Canada-US border along the calm waters of the Portland Canal. And finally, we follow the contours of the Yellowhead Highway to the town of Powell River and its unique float-plane fleet.\n\n\nEp. 12 - Haida Gwaii North\nHaida Gwaii is home to one of the world's most remote and incredible landscapes. Soaring high above the scenic Yakoun River and Massett inlet, we head east to Rose Point, the entrance to Naikoon Provincial Park. Here miles of sandy beaches create a backdrop for the legends of the Haida people, who have inhabited this archipelago for thousands of years. At Queen Charlotte City we move west to the open waters of the Pacific. Then we head north to trace the remote western coastline of Graham Island. Flying just metres above it, we explore shipwrecks, sea lion colonies, the Langara Island Lighthouse, and the open waters beyond.\n\n\nEp. 13 - Haida Gwaii South\nStarting at British Columbia's mainland, we head west to the spectacular shores of Haida Gwaii. The Haida people's cultural past is told through the town of Skidegate's residents, artists, chefs, and cultural interpreters. Heading south beyond the town of Sandspit, we explore the remote Moresby Island, which makes up most of the southern portion of Haida Gwaii. Here we explore the stunning landscape and unique geology of Gwaii Haanas National Park Reserve. Traveling north along the archipelago's southwest coast, the journey culminates with the breathtaking peaks of the San Christoval mountain range.\n\n &lt;a href=&quot;\nhttp://www.canadaovertheedge.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canadaovertheedge.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:01b7d2d0de46c27a3de19cd6bad5c7ffd139cb5b","amp;dn":"Canada+Over+the+Edge+-+Season+2++%281080p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b7d2d0de46c27a3de19cd6bad5c7ffd139cb5b","infoHashBuffer":{"type":"Buffer","data":[1,183,210,208,222,70,194,122,61,225,156,214,186,213,199,255,209,57,203,91]},"announce":[],"urlList":[]}}