{"title":"Neuroanatomical Basis of Clinical Neurology, 2nd Edition [2014]","uid":13041047,"size":14281420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01d11743b4d75c27120f18fab4ffd4ade47102d0&amp;dn=Neuroanatomical+Basis+of+Clinical+Neurology%2C+2nd+Edition+%5B2014%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"NoctDeath","files":2,"time":1450537329,"description":"Title: Neuroanatomical Basis of Clinical Neurology \r\nAuthor: Orhan E. Arslan \r\nFormat: PDF \r\nHardcover: 520 pages \r\nPublisher: CRC Press; 2 edition (August 7, 2014) \r\nLanguage: English \r\nISBN: 9781439848333 \r\n\r\n\r\nBridging the gap between the peripheral and central nervous systems, the second edition of Neuroanatomical Basis of Clinical Neurology enriches understanding of neurological conditions through a conceptual approach to neuronal circuitry. The book retains the basic outline of contents from the first edition, integrating structural organization with pertinent clinical disorders, while reflecting the substantial growth and ever-changing information in neuroscience\r\n\r\nAfter an introduction to the developmental and cellular aspects of the nervous system, the book discusses in depth the morphology and internal organization of the central nervous system. It examines the somatic and autonomic components of the peripheral nervous system, emphasizing nerve entrapments and neuropathies. The author describes various dysfunctions by demonstrating the neuronal interconnectivity between higher and lower autonomic centers and the mediation of visceral reflexes.\r\n\r\nThe Second Edition incorporates and highlights common and relevant clinical conditions. Topics include:\r\n\r\n- Various forms of cortical dysfunctions, such as seizures, disconnection syndrome, coma, and dementia\r\n- The role of prefrontal cortex in behavior and attention, introducing the topic of autism\r\n- Up-to-date information on the auditory, vestibular, gustatory, and limbic systems\r\n- The neurochemistry of the limbic system, memory and associated disorders, and the structural and neuronal circuitry of the hippocampal gyrus\r\n- Structural organization and associated pathways of the extrapyramidal system, demonstrating the neurochemical basis of movement disorders\r\n\r\nThis new edition skillfully integrates over a decade of discovery in neuroscience since the publication of the first edition, and introduces deepened insights into the neuronal synaptic connectivity and the mechanisms that underlie neurologic disorders. The book remains an essential source of information for medical and allied health students, practitioners of neurology, and students of neuroscience","torrent":{"xt":"urn:btih:01d11743b4d75c27120f18fab4ffd4ade47102d0","amp;dn":"Neuroanatomical+Basis+of+Clinical+Neurology%2C+2nd+Edition+%5B2014%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d11743b4d75c27120f18fab4ffd4ade47102d0","infoHashBuffer":{"type":"Buffer","data":[1,209,23,67,180,215,92,39,18,15,24,250,180,255,212,173,228,113,2,208]},"announce":[],"urlList":[]}}