{"title":"Thomas Merton - New Seeds of Contemplation (epub, mobi)","uid":8690072,"size":2235378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01ed392780f6f2c49924813d1bf918117b8dd9ec&amp;dn=Thomas+Merton+-+New+Seeds+of+Contemplation+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373868981,"description":"Thomas Merton (Sue Monk Kidd, introduction) - New Seeds of Contemplation (New Directions, 1962, 2007).\n\nHigh quality retail source epub and mobi files.\n\nShort description:\n\nClassic meditations by the best-known and most influential American Catholic writer of the past century. Merton was revolutionary for his time: not only a great spiritual writer, he also was a pioneer in exploring radical nonviolence, Eastern religions, the meaning of American racism and militarism, etc.\n\nDescription:\n\nA much-enlarged and revised version of Seeds of Contemplation--one of the late Father Merton's most widely-read and best-loved works--New Seeds of Contemplation seeks to awaken the dormant inner depths of the spirit so long neglected by Western man and to nurture a deeply contemplative and mystical dimension in our spiritual lives.\n\nAmazon Review\n\n&quot;It can become almost a magic word,&quot; Thomas Merton says of contemplation; &quot;or if not magic, then inspirational, which is almost as bad.&quot; With these words, Merton takes us through the reality of contemplation, which is, the author says, &quot;life itself, fully awake, fully active, fully aware that it is alive. It is spiritual wonder.&quot; Above all, contemplation is &quot;awareness of the reality&quot; of the Source, &quot;with a certitude that goes beyond reason and beyond simple faith.&quot; As these definitions should suggest, in this 20th-century classic on the contemplative life, as in the best of Merton's work, this Trappist monk wonderfully combines a disciplined and deeply learned intellect with the lyrical passion of the poet. It is this rare combination that makes this book not only informative but also moving. Covering a diverse range of subjects (&quot;Faith,&quot; &quot;The Night of the Senses,&quot; &quot;Renunciation&quot;), it moves the reader through certain traditional &quot;phases&quot; of contemplation, and gives an idea of what to expect in this spiritual process (including despair and darkness). The book describes, but it also enacts. In its own prose it invites the reader to &quot;cast our awful solemnity to the winds and join in the general dance.&quot;\t\n\n-----\n\nMany thanks to the original uploader.\n\n-----\n\npdf version here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8169669&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8169669&lt;/a&gt;","torrent":{"xt":"urn:btih:01ed392780f6f2c49924813d1bf918117b8dd9ec","amp;dn":"Thomas+Merton+-+New+Seeds+of+Contemplation+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01ed392780f6f2c49924813d1bf918117b8dd9ec","infoHashBuffer":{"type":"Buffer","data":[1,237,57,39,128,246,242,196,153,36,129,61,27,249,24,17,123,141,217,236]},"announce":[],"urlList":[]}}