{"title":"Super Gold Thai Film Star In Fire Escape","uid":11928608,"size":698597883,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0257fc53a96ceec9e35eda354526afec33f8e2bd&amp;dn=Super+Gold+Thai+Film+Star+In+Fire+Escape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1431754126,"description":"Where do you meet a fit babe decked out in gold and ready to give polite and enthusiastic service? On the street corner or in a high class bar? No, I met Bundi in the fire escape, which I was going up instead of going through the lobby, so as not to get caught by the apartment manager for not paying my rent. And there was some super fucking lovely cutie in high heels and shiny leggings. Not sure what she was doing there, but I think she was trying to get out of the apartment before her boyfriend found out she really did not love him. So I got my penis out, and Bundi went straight down on it, in the stairwell. No one else was around. Nice slow deep gulping motion. She followed me up to my apartment and got her kit off. Incredible film star figure in a bright gold bra and knickers that clearly showed off her firm double round titties and firm double round camel toe. Super easy delicious fuck, I even slapped her in irons. She loved that too. Never getting the lift again, I always go in the unusual exit, high def stairwell video","torrent":{"xt":"urn:btih:0257fc53a96ceec9e35eda354526afec33f8e2bd","amp;dn":"Super+Gold+Thai+Film+Star+In+Fire+Escape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0257fc53a96ceec9e35eda354526afec33f8e2bd","infoHashBuffer":{"type":"Buffer","data":[2,87,252,83,169,108,238,201,227,94,218,53,69,38,175,236,51,248,226,189]},"announce":[],"urlList":[]}}