{"title":"Queen - Greatest Hits (1981) [24 bit FLAC] vinyl","uid":9514135,"size":2007123521,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02c67016bdd82bdf1c0ecdf4d8e9bcbd079208b1&amp;dn=Queen+-+Greatest+Hits+%281981%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"politux","files":-1,"time":1390484891,"description":"\n  Queen - Greatest Hits (1981) [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Hard Rock, Glam Rock, Arena Rock\n  Source: Elektra Records vinyl\n  Codec: FLAC\n  Bitrate: ~ 5,600 kbps\n  Bit Depth: 24 \n  Sampling Rate: 192,000 Hz\n\n  A1 Bohemian Rhapsody \n  A2 Another One Bites the Dust \n  A3 Killer Queen \n  A4 Fat Bottomed Girls \n  A5 Good Old-Fashioned Lover Boy\n  A6 Don't Stop Me Now \n  A7 Save Me \n  A8 Under Pressure\n\n  B1 Crazy Little Thing Called Love \n  B2 Somebody to Love\n  B3 Now I'm Here\n  B4 Teo Torriate\n  B5 You're My Best Friend\n  B6 Play the Game\n  B7 Flash Theme\n  B8 We Will Rock You \n  B9 We Are the Champions \n\n  They may not have started out that way, but by 1981 Queen definitely was perceived as a singles act. This record gathers their biggest US/UK hits, 1973-1981, including the collaboration with David Bowie, &quot;Under Pressure,&quot; which was not on the reissue from EMI. Not to be confused with the 1992 Hollywood Records (61625) release also called Greatest Hits.\n\n  Few bands embodied the pure excess of the '70s like Queen. Embracing the exaggerated pomp of prog rock and heavy metal, as well as vaudevillian music hall, the British quartet delved deeply into camp and bombast, creating a huge, mock-operatic sound with layered guitars and overdubbed vocals. Queen's music was a bizarre yet highly accessible fusion of the macho and the fey. For years, their albums boasted the motto &quot;no synthesizers were used on this record,&quot; signaling their allegiance with the legions of post-Led Zeppelin hard rock bands. But vocalist Freddie Mercury brought an extravagant sense of camp to Queen, pushing them toward kitschy humor and pseudo-classical arrangements, as epitomized on their best-known song, &quot;Bohemian Rhapsody.&quot; \n\n  Mercury, it must be said, was a flamboyant bisexual who managed to keep his sexuality in the closet until his death from AIDS in 1991. Through his legendary theatrical performances, Queen became one of the most popular bands in the world in the mid-'70s; in England, they remained second only to the Beatles in popularity and collectibility in the '90s. Despite their enormous popularity, Queen were never taken seriously by rock critics -- an infamous Rolling Stone review labeled their 1979 album Jazz as &quot;fascist.&quot; In spite of such harsh criticism, the band's popularity rarely waned; even in the late '80s, the group retained a fanatical following except in America. In the States, their popularity peaked in the early '80s, just as they finished nearly a decade's worth of extraordinarily popular records. And while those records were never praised, they sold in enormous numbers, and traces of Queen's music could be heard in several generations of hard rock and metal bands in the next two decades, from Metallica to Smashing Pumpkins.","torrent":{"xt":"urn:btih:02c67016bdd82bdf1c0ecdf4d8e9bcbd079208b1","amp;dn":"Queen+-+Greatest+Hits+%281981%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02c67016bdd82bdf1c0ecdf4d8e9bcbd079208b1","infoHashBuffer":{"type":"Buffer","data":[2,198,112,22,189,216,43,223,28,14,205,244,216,233,188,189,7,146,8,177]},"announce":[],"urlList":[]}}