{"title":"Raindance Producers' Lab Lo-To-No Budget Filmmaking - Elliot Gro","uid":10121024,"size":17124630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:031680c6c364a81b8317ea2607494a425de3bf12&amp;dn=Raindance+Producers%27+Lab+Lo-To-No+Budget+Filmmaking+-+Elliot+Gro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1399674905,"description":"If you're looking for clear-cut information on how to make a film on a minimal budget that is based on tried and tested techniques - look no further. Elliot Grove has worked on hundreds of low-budget productions, teaches Lo-to-No Budget filmmaking courses and runs the Raindance Film Festival (the largest independent film festival in Europe.) His wealth of teaching and filmmaking experience combined with knowledge of the winning formulas that work is the basis of this book. Refreshingly clear, no-nonsense tricks of the trade. \n\nThis is a must have read for filmmakers serious about making and selling films. Creative and technical expertise coupled with a behind the scenes look at the film industry makes this book an excellent starting point for beginners. For experienced filmmakers there are plenty of practical approaches in here for you to try, from developing CV's, showreels and business plans to information on pitching, raising finance, creating publicity and much much more. Use it as a point of departure or as an everyday reference tool.","torrent":{"xt":"urn:btih:031680c6c364a81b8317ea2607494a425de3bf12","amp;dn":"Raindance+Producers%27+Lab+Lo-To-No+Budget+Filmmaking+-+Elliot+Gro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031680c6c364a81b8317ea2607494a425de3bf12","infoHashBuffer":{"type":"Buffer","data":[3,22,128,198,195,100,168,27,131,23,234,38,7,73,74,66,93,227,191,18]},"announce":[],"urlList":[]}}