{"title":"Aqua Teen Hunger Force: Season 1","uid":5158573,"size":1659361280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:033967b01458d147894906ac390b39fccc852fff&amp;dn=Aqua+Teen+Hunger+Force%3A+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Beta_Tron","files":-1,"time":1257999398,"description":"--------------------\nFor Season 2: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5161042/Aqua_Teen_Hunger_Force__Season_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5161042/Aqua_Teen_Hunger_Force__Season_2&lt;/a&gt;\n--------------------\nAqua Teen Hunger Force: Season One:\n\n1. Rabbot [1]\n\nFirst aired: 12/30/2000\n\nDr. Weird unveils his latest creation, the Rabbot, but when he sprays it with French perfume, it breaks its way out of the laboratory and crushes Carl's car, and heads for downtown New Jersey. When Carl comes out of his house the next morning, Shake decides to put the Aqua Teens onto the case, in order to make $20 off of Carl. While the trio are at the mall, Shake becomes tired of the case and becomes eager to close it, though Frylock insists on continuing the investigation after finding some heavy evidence. However, as the Aqua Teens leave the mall, they pass through downtown New Jersey, where the Rabbot has gained the ability to turn anything in its path very hairy...\n\nWriter: Matt Maiellaro, Dave Willis\n\n2. Escape from Leprechaupolis [2]\n\nFirst aired: 9/9/2001\n\nLeprechauns use Dr. Weird's Rainbow Maker 400 to capture people from afar, taking them to the middle of the woods, and then stealing their shoes. Their antics eventually lead to the involvement of the Aqua Teens.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Andy Merrill (Merle), Scott Hilley (Flargon)\n\n3. Bus of the Undead [3]\n\nFirst aired: 9/30/2001\n\nDr. Weird creates a mutant moth/human called Mothmonsterman, but it flies out of the giant hole left by Rabbot and toward the Aqua Teen's house craving the bright light it sees coming from within. However, the Aqua Teens are using Carl's electricity, and when he makes them turn off the light, Mothmonsterman does everything in his power to get it turned back on, scaring the living daylights out of Meatwad and Shake.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: H. Jon Benjamin (Mothmonsterman)\n\n4. Mayhem of the Mooninites [4]\n\nFirst aired: 10/14/2001\n\nA pair of two-dimensional creatures called the Mooninites fly in from space, and happen to land in the Aqua Teens' town. When Shake rents them a room to earn money, they soon corrupt Meatwad, and threaten the town with their false superiority.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Err)\n\n5. Balloonenstein [5]\n\nFirst aired: 12/23/2001\n\nMeatwad recieves electrical powers after Shake accidentally traps him in the clothes dryer for a week, and soon proceeds to create a balloon monster using static, once again, on accident.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\n\n6. Space Conflict from Beyond Pluto [6]\n\nFirst aired: 4/7/2002\n\nFrylock attempts to make contact with aliens and is successful... but there's only two problems. First, the aliens want to take over Earth, and second, they're too stupid to pull it off.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Mike Schatz (Emory), Andy Merrill (Oglethorpe) , Mary Kraft (Computer Voice)\n\n7. Ol' Drippy [7]\n\nFirst aired: 4/21/2002\n\nShake makes a large mess in the kitchen and refuses to clean it, eventually resulting in the formation of a new lifeform which Meatwad gleefully names &quot;Ol Drippy.&quot; Shake becomes jealous of the attention that the new character receives.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Todd Field (Ol' Drippy)\n\n8. Revenge of the Mooninites [8]\n\nFirst aired: 5/5/2002\n\nThe Mooninites return to cause more havoc. They &quot;help Meatwad&quot; get tickets to get a ten speed bicycle. However, they spend the tickets instead on the Foreigner belt, which is infused with all the magical powers of the 70's Rock band of the same name. And like Carl says, Foreigner does indeed rock, and so does the belt.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Err)\n\n9. MC Pee Pants [9]\n\nFirst aired: 5/19/2002\n\nSubliminal messages in the music Meatwad has been listening to draw the team to a warehouse, where they find out that rap artist behind the music is actually a giant spider.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Chris Ward (IV) (MC Pee Pants), Matt Maiellaro (Satan)\n\n10. Dumber Dolls [10]\n\nFirst aired: 11/3/2002\n\nMeatwad gets a new doll, Happy Time Harry, which has a dreadfully bitter and jaded personality. Happy Time Harry's time is up when his negativity begins to affect everyone.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: David Cross (Happy Time Harry)\n\n11. Bad Replicant [11]\n\nFirst aired: 11/10/2002\n\nMaster Shake is kidnapped by returning characters Emory and Oglethorpe. The two aliens replace him with a &quot;replicant.&quot; But Frylock and Meatwad soon realize that the Shake &quot;replicant&quot; doesn't resemble Shake at all.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Andy Merrill (Oglethorpe), Mike Schatz (Emory) , Matt Harrigan (Major Shake)\n\n12. Circus [12]\n\nFirst aired: 11/17/2002\n\nMaster Shake sells Meatwad to the circus, but when Meatwad becomes a huge big top success, Shake gets jealous and tries to get in on the act. It's a battle of the freaks!\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Randy The Astonishing's father)\n\n13. Love Mummy [13]\n\nFirst aired: 11/24/2002\n\nFrylock discovers a mummy in the crawlspace under the house. The mummy begins to exhort his bratish favors from Frylock by threatening him with an ancient Egyptian curse.\n\n14. Dumber Days [14]\n\nFirst aired: 12/1/2002\n\nAfter Shake uses Meatwad's brain to perform stunts in the pool, it's discovered that Meatwad's brain is nothing more than a toy with a jingle bell in it. After Meatwad goes through a brief depression, Carl gets him a new live brain against Frylock's will. After Meatwad gets his new brain, he begins to grow smarter and larger.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\n\n15. Interfection [15]\n\nFirst aired: 12/8/2002\n\nWhile looking up teeth conspiracies (and Metallica) on the internet in Frylock's room, Shake and Meatwad make various popup windows appear in Frylock's room which start to spread throughout the house.\n\nWriter: Dave Willis, Matt Maiellaro\nDirector: Jay Edwards\nGuest star: Todd Hanson (The www.yzzerdd.com)\n\n16. PDA [16]\n\nFirst aired: 12/15/2002\n\nShake is missing his Personal Digital Assistant. The gang proceeds to look in the Adirondack mountains and in Carl's pool for it, until finally they confront the thief. If he IS a thief. Or maybe Shake's just greedy and wants his PDA.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Todd Barry (Romulox), Vishal Roney (Himself)\n\n17. Mail Order Bride [17]\n\nFirst aired: 12/22/2002\n\nAs a Christmas present to themselves, Shake and Carl split the cost of a mail-order bride from Russia. Unfortunately, once she gets a look at her new &quot;husbands&quot; she freaks out and locks herself in Carl's house, leaving Carl stuck outside.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: George Lowe (George The Wedding DJ), Rita McGrath (Svetlana)\n\n18. Cybernetic Ghost of Christmas Past from the Future [18]\n\nFirst aired: 12/29/2002\n\nCarl is visited by the Cybernetic Ghost Of Christmas Past From The Future and learns that his house is built on an elfin graveyard thus causing his pool to fill with blood. Then the Cybernetic Ghost Of Christmas Past From The Future recounts a long story about the first Christmas.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Cybernetic Ghost of Christmas Past), Chris Ward (IV) (Young Carl) , Glenn Danzig (Himself) \n","torrent":{"xt":"urn:btih:033967b01458d147894906ac390b39fccc852fff","amp;dn":"Aqua+Teen+Hunger+Force%3A+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"033967b01458d147894906ac390b39fccc852fff","infoHashBuffer":{"type":"Buffer","data":[3,57,103,176,20,88,209,71,137,73,6,172,57,11,57,252,204,133,47,255]},"announce":[],"urlList":[]}}