{"title":"Merivel: A Man of His Time by Rose Tremain","uid":9646088,"size":422840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0366d6b5b84de436d6f015082c56d5f7d11e81ab&amp;dn=Merivel%3A+A+Man+of+His+Time+by+Rose+Tremain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"PirateBook","files":1,"time":1393000337,"description":"\nThe gaudy years of the Restoration are long gone. Robert Merivel, physician and courtier to Charles II, loved for his gift to turn sorrow into laughter, now faces the agitations and anxieties of middle age. Questions crowd his mind: has he been a good father? Is he a fair master? \n\nIs he the King's friend or the King's slave? In search of answers, Merivel sets off for the French court. But Versailles - all glitter in front and squalor behind - leaves Merivel in despair, until a chance encounter with Madame de Flamanville, a seductive Swiss botanist, allows him to dream of an honourable future. \n\nBut will that future ever be his? Back home at Bidnold Manor, his loyalty and medical skill are tested to their limits, while the captive bear he has brought back from France begins to cause unlooked-for havoc in his heart and on his estate. \n\nWith a cascade of lace at his neck and a laugh that can burst out of him in the midst of torment, Merivel is a uniquely brilliant creation, soulful, funny, outrageous and achingly sad. He is Everyman. His unmistakable, self-mocking voice speaks directly to us down the centuries.\n\nGenre: Historical Fiction","torrent":{"xt":"urn:btih:0366d6b5b84de436d6f015082c56d5f7d11e81ab","amp;dn":"Merivel%3A+A+Man+of+His+Time+by+Rose+Tremain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0366d6b5b84de436d6f015082c56d5f7d11e81ab","infoHashBuffer":{"type":"Buffer","data":[3,102,214,181,184,77,228,54,214,240,21,8,44,86,213,247,209,30,129,171]},"announce":[],"urlList":[]}}