{"title":"Dirty Deeds, My Life Inside and Outside of AC-DC [Epub &amp; Mob","uid":10433917,"size":10683553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03882828790d11908ed645a50beb7c18950472f3&amp;dn=Dirty+Deeds%2C+My+Life+Inside+and+Outside+of+AC-DC+%5BEpub+%26amp%3B+Mob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"krystine","files":-1,"time":1403820360,"description":"Dirty Deeds: My Life Inside and Outside of AC/DC\nAuthor: Mark Evans\nPublished: 2011\nPublisher: Allen and Unwin\nISBN: 9781742375793\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nA few days after his 19th birthday, rock and roll lover and bass player Mark Evans wandered into his local to check out the band - and his life would never be the same again. Two days later he was playing his first show as bass player with AC/DC; within a week he was on Countdown, rocking out next to wildman Bon Scott, who was dressed as a pigtailed, cigarette-smoking schoolgirl - and waving a mallet - and Angus who was - of course - decked out as a schoolboy. And all for the princely wage of $60 a week!\n\nThen came nearly being burnt alive on the video shoot for 'Jailbreak', and working with legends Vanda and Young on the massive album TNT, on which Mark's take-no-prisoners basslines anchored such immortal hits as 'TNT' and 'It's a Long Way To the Top'. Within a year, the band had relocated to London and were on the road to rock 'n' roll stardom, living the life of rock gods and making the most of all that had to offer. Until the tragic death of his good friend Bon Scott changed everything.\n\nDirty Deeds is the first book about AC/DC written from the inside, by an insider - which is gold for any AC/DC fan. It is an honest, gripping, sometimes laugh-out-loud account of a band that lived fast, played hard and broke every one of the rules - before they broke all the records. It is also a revealing and frank memoir of a man who's had to contend with everything life has thrown at him - a rough-as-guts upbringing, lucky breaks and soaring highs, as well as terrible personal tragedy and loss. The hard lessons Mark has learned along the way will inspire any reader.","torrent":{"xt":"urn:btih:03882828790d11908ed645a50beb7c18950472f3","amp;dn":"Dirty+Deeds%2C+My+Life+Inside+and+Outside+of+AC-DC+%5BEpub+%26amp%3B+Mob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03882828790d11908ed645a50beb7c18950472f3","infoHashBuffer":{"type":"Buffer","data":[3,136,40,40,121,13,17,144,142,214,69,165,11,235,124,24,149,4,114,243]},"announce":[],"urlList":[]}}