{"title":"The Ice Storm (Xvid)","uid":4095510,"size":734049526,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:03fc70291279bbe636cea2df7a1b0ae5c791ddbe&amp;dn=The+Ice+Storm+%28Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"circlensess","files":2,"time":1206296040,"description":"The Ice Storm(Xvid)(Darkside_RG).avi (700.04 megabyte)\n\nPlot Outline: 1973, suburban Connecticut: middle class families experimenting with casual sex, drink, etc., find their lives out of control.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119349/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119349/&lt;/a&gt;\n\n\nTHE ICE STORM (1997) ****\n\nStarring: Kevin Kline, Joan Allen, Sigourney Weaver, Tobey Maguire, Christina Ricci, Elijah Wood, and Katie Holmes Director: Ang Lee 113 minutes Rated R (for strong sexual content, and for drug use &amp; language)\n\nBy Blake French: \n\nAng Lee&amp;#039;s &quot;The Ice Storm&quot; is such a provocative and unsettling experience that it made Gene Siskel&amp;#039;s top movie of 1997. Since then, Siskel has recently passed away. But Being an avid film reviewer and buff, I thought that it would be appropriate for me to screen &quot;The Ice Storm&quot; for a second time, this time in full awareness of Siskel&amp;#039;s thoughts on the film. After careful inspection, I think that I agree with my favorite movie critic&amp;#039;s opinion, and feel obligated to post a review explaining why.\n\nWatching &quot;The Ice Storm&quot; is a unique occurrence. Movie&amp;#039;s don&amp;#039;t get this powerful every time one visits a local multiplex. The story is basically a series of sins and involvement&amp;#039;s that dig the characters deeper and deeper into an emotional crater. \n\nThe time period is about thirty to forty years ago. Kevin Kline and Joan Allen are Ben and Elena Hood. They have a son whose 16, Paul, and a sexually confused 14 year old daughter named Wendy. This is not a happy family and the film never pretends otherwise. \n\nBen is having an adulterous affair with his neighbor&amp;#039;s wife, Janey Carver. Her husband, Jim, is pretty much unsuspecting, but Ben&amp;#039;s wife is dubious of her mysteriously acting spouse. The Carvers also have teenage children named Mikey and Sandy. Mickey is ready to explore a sexual underworld with Wendy, and she is prepared to experiment with whoever comes down her path first.\n\nElena is caught stealing from a local party store one day and that triggers an effect that causes her to react openly to her husband about his involvement&amp;#039;s with Janey Carver. When Ben and Elena visit a wife swapping party where the guests put their keys in a dish to see who an individual will sleep with, things become even more adulterous with the Carvers.\n\nThe film is propelled by unique, one of a kind performances by all the actors in the cast. Sigourney Weaver, receiving a best supporting actress nomination for her performance, is superb, in a slutty, whorish kind of a way. Joan Allen is also perfection delivering a sense of egresses and desire without ever speaking that much. Tobey Maguire, Christina Ricci, Elijah Wood, and Adam Hann-Byrd all act well as the teens. Basically all the one screen appeal of &quot;The Ice Storm&quot; is top class. \n\nBut there is something more than just the on screen appeal with this movie. Something that allows the audience to experience a feeling of confusion along with the characters. We can become so involved in the story because all the story consists of is a pile of heavy sins. We feel the character&amp;#039;s needs. Relate to the issues. Things happen that struck me so profoundly that I find myself listing the film on my list of top 100 movies of all time. In the last scene of &quot;The Ice Storm&quot; a key character brakes down and cries like a baby, with his family next to his side. We look back at all the wrongdoing he has done, at all the sins he has committed, and all the reasons he has to cry, and we fell his pain--and somewhere, deep down, we try to forgive him.","torrent":{"xt":"urn:btih:03fc70291279bbe636cea2df7a1b0ae5c791ddbe","amp;dn":"The+Ice+Storm+%28Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03fc70291279bbe636cea2df7a1b0ae5c791ddbe","infoHashBuffer":{"type":"Buffer","data":[3,252,112,41,18,121,187,230,54,206,162,223,122,27,10,229,199,145,221,190]},"announce":[],"urlList":[]}}