{"title":"FS9 FS2004 : PMDG 737-800/900 v1.1 iso","uid":3962723,"size":166822853,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0405bc08a19259ae769fc62f02d256252e6b5239&amp;dn=FS9+FS2004+%3A+PMDG+737-800%2F900+v1.1+iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"samayot","files":115,"time":1199552018,"description":"PMDG 737-800/900 The Next Generation simulation to the next level (found on WOS).\n\nProduct Features\nNew GMax 737-800/900 Models - Accurately modeled down to the smallest detail complete with high resolution textures, optional winglets and working windshield wipers.\n\nDynamic Virtual Cockpit - every switch and lever can be operated with the mouse\nNew Cockpit Graphics.\n\nAll 2D panel and virtual cockpit artwork has been replaced to enhance depth of image and add photo-based textures.\n\n2D or 3D Cockpit - choose between 2D cockpit views and our dynamic virtual cockpit.\n\nComplete Avionics - sharp vector graphic cockpit displays matching their real world counterparts with optional classic and Next Generation layout and functional lower display unit.\n\nAircraft Systems - 737-800/900 specific systems have been implemented such as pneumatics differences.\n\nOptimized Performance - Many routines have been improved for the best PC performance to enhance your 737 experience.\n\nFlight Management Computer (FMC) - interactive FMC operating to real world standards with many new features such as soft constraints, offset routes, optimal/maximum altitude calculations, realistic cost index, long range cruise option and many more.\n\nFlight Model - Developed from scratch by our own aeronautics professional, the flight characteristics operate within a narrow margin of operator&amp;#039;s specifications.\n\nSound Set - Recorded from the real flight deck, the sounds are complete from the powerful jet engines to the fire warning bells, even extending the speedbrakes in flight is noticeable.\n\nVirtual Cabin - In addition to the virtual cockpit, a complete cabin is available for the best wing views when using Active Camera 2004\nOperating Manual - Hundreds of pages including operating procedures, limitations and more Professional Features.\n\nAutopilot includes VNAV, LNAV, FL CHG, Control Wheel Sterring (CWS), complete TCAS2 system, altitude/speed intervention.\n\nCustomizable Features - Select different pre-defined airline configurations, change units, flight director styles, display colors and more\nNew Documentation - Many items have been added to cover 737-800/900 data and FMC procedures\nLoad Manager.","torrent":{"xt":"urn:btih:0405bc08a19259ae769fc62f02d256252e6b5239","amp;dn":"FS9+FS2004+%3A+PMDG+737-800%2F900+v1.1+iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0405bc08a19259ae769fc62f02d256252e6b5239","infoHashBuffer":{"type":"Buffer","data":[4,5,188,8,161,146,89,174,118,159,198,47,2,210,86,37,46,107,82,57]},"announce":[],"urlList":[]}}