{"title":"Statistics for Engineers: An Introduction","uid":6005799,"size":1104049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0485e7ebc14e966ccad467379b4738a424ecae49&amp;dn=Statistics+for+Engineers%3A+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1291316364,"description":"This practical text is an essential source of information for those wanting to know how to deal with the variability that exists in every engineering situation.   Using typical engineering data, it presents the basic statistical methods that are relevant, in simple numerical terms. In addition, statistical terminology is translated into basic English. \nIn the past, a lack of communication between engineers and statisticians, coupled with poor practical skills in quality management and statistical engineering, was damaging to products and to the economy. The disastrous consequence of setting tight tolerances without regard to the statistical aspect of process data is demonstrated. \n\nThis book offers a solution, bridging the gap between statistical science and engineering technology to ensure that the engineers of today are better equipped to serve the manufacturing industry. \n\nInside, you will find coverage on: \n\nthe nature of variability, describing the use of formulae to pin down sources of variation; \nengineering design, research and development, demonstrating the methods that help prevent costly mistakes in the early stages of a new product; \nproduction, discussing the use of control charts, and; \nmanagement and training, including directing and controlling the quality function. \nThe Engineering section of the index identifies the role of engineering technology in the service of industrial quality management. The Statistics section identifies points in the text where statistical terminology is used in an explanatory context. \n\nEngineers working on the design and manufacturing of new products find this book invaluable as it develops a statistical method by which they can anticipate and resolve quality problems before launching into production. This book appeals to students in all areas of engineering and also managers concerned with the quality of manufactured products. \n\nAcademic engineers can use this text to teach their students basic practical skills in quality management and statistical engineering, without getting involved in the complex mathematical theory of probability on which statistical science is dependent. \n\nHardcover: 192 pages \nPublisher: Wiley (August 3, 2009) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:0485e7ebc14e966ccad467379b4738a424ecae49","amp;dn":"Statistics+for+Engineers%3A+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0485e7ebc14e966ccad467379b4738a424ecae49","infoHashBuffer":{"type":"Buffer","data":[4,133,231,235,193,78,150,108,202,212,103,55,155,71,56,164,36,236,174,73]},"announce":[],"urlList":[]}}