{"title":"The Rise and Fall of American Growth (2016) epub","uid":13308258,"size":5813076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0513c32a2a3c03e06ce108c379a6045579ae308d&amp;dn=The+Rise+and+Fall+of+American+Growth+%282016%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bookzilla","files":1,"time":1453751910,"description":"The Rise and Fall of American Growth: The U.S. Standard of Living since the Civil War \r\n\r\n\r\nIn the century after the Civil War, an economic revolution improved the American standard of living in ways previously unimaginable. Electric lighting, indoor plumbing, home appliances, motor vehicles, air travel, air conditioning, and television transformed households and workplaces. With medical advances, life expectancy between 1870 and 1970 grew from forty-five to seventy-two years. Weaving together a vivid narrative, historical anecdotes, and economic analysis, The Rise and Fall of American Growth provides an in-depth account of this momentous era. But has that era of unprecedented growth come to an end?\r\n\r\nGordon challenges the view that economic growth can or will continue unabated, and he demonstrates that the life-altering scale of innovations between 1870 and 1970 can't be repeated. He contends that the nation's productivity growth, which has already slowed to a crawl, will be further held back by the vexing headwinds of rising inequality, stagnating education, an aging population, and the rising debt of college students and the federal government. Gordon warns that the younger generation may be the first in American history that fails to exceed their parents' standard of living, and that rather than depend on the great advances of the past, we must find new solutions to overcome the challenges facing us.\r\n\r\nA critical voice in the debates over economic stagnation, The Rise and Fall of American Growth is at once a tribute to a century of radical change and a harbinger of tougher times to come","torrent":{"xt":"urn:btih:0513c32a2a3c03e06ce108c379a6045579ae308d","amp;dn":"The+Rise+and+Fall+of+American+Growth+%282016%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0513c32a2a3c03e06ce108c379a6045579ae308d","infoHashBuffer":{"type":"Buffer","data":[5,19,195,42,42,60,3,224,108,225,8,195,121,166,4,85,121,174,48,141]},"announce":[],"urlList":[]}}