{"title":"YS Origin ENGLISH","uid":6722613,"size":2169208887,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:052943f51299cd6fed6343f5191f22199408bf99&amp;dn=YS+Origin+ENGLISH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"SlasherX","files":18,"time":1317836440,"description":"YS Origin on English. \n\nPlease follow this instructions in exact order.\n\n1. For Vista/7 users. We need to set language for non-Unicode programs. To do so, type Region in search bar (at start menu) and click on Region and Language. Or you can find it in control panel, Clock, Language, and Region, and then Region and Language. In Administrative tab, click on Change system locale... and chose Japanese (Japan). System needs to be restarted after that.\n\n2. Mount &quot;YSO.iso&quot; using daemon tools lite. Start file &quot;fsetup2.exe&quot;. Fancy that, we can see normal Japanese installation and not some crap. Follow installation procedure, always clicking on left most button for yes. You should use default folder installation.\n\n3. After installation, go to folder Ys Origin Extra Disk and start file &quot;fsetup2_yso.exe&quot;. Click update, and follow instalation procedure. It should be quick. This way we have pushed YSO version to 1.1.0.0 with all extra content. \n\n4. Now, enter folder YSO ENG Patch and start file &quot;YsO_ENG_v1.0.exe&quot;. Follow instalation until it shows instlataion folder. REALY IMPORTANT!!! Automatic folder checker in installer is not working properly so you need to manualy chose instalation folder. Its &quot;C:/FALCOM/YSO_WIN&quot;. You should now have some command prompt windows poping in and out suggesting its doing patch properly. \n\nNOTE: in future visit http://www.figlidigaucci.eu/ for update on translation patch if needed.\n\n5. And finaly the crack. The only one i found and its virus free is &quot;YSO_Mini_Image.iso&quot;. How does it work? Just mount it with daemon tools lite when ever you want to play YS Origin. Have fun!!!","torrent":{"xt":"urn:btih:052943f51299cd6fed6343f5191f22199408bf99","amp;dn":"YS+Origin+ENGLISH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"052943f51299cd6fed6343f5191f22199408bf99","infoHashBuffer":{"type":"Buffer","data":[5,41,67,245,18,153,205,111,237,99,67,245,25,31,34,25,148,8,191,153]},"announce":[],"urlList":[]}}