{"title":"Mahajan &amp; Gupta Textbook of Preventive &amp; Social Medicine","uid":10078748,"size":8897631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:054a9e2f59e6ca82e2905923d0506c62f24dee57&amp;dn=Mahajan+%26amp%3B+Gupta+Textbook+of+Preventive+%26amp%3B+Social+Medicine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"vickey1992","files":1,"time":1398960839,"description":"Almost all the chapters have been thoroughly revised and updated in this edition; notably among those are epidemiology, communicable and noncommunicable diseases, MCH and family planning, management, demography and vital statistics, disaster, biomedical waste management, food and nutrition, immunization, geriatrics, communication, etc. National Health Programs have also been thoroughly revised and updated. New data have been incorporated, wherever applicable. Latest SRS and census data have also been included. Various domains that are of importance, both in theory, practical and viva of MBBS examination have been highlighted with examples and justification. Many postgraduate study materials have also been incorporated with references for further reading. Various flow charts, diagrams and pictures have been introduced for clarity of understanding. Students will be benefited for their preparation in answering MCQ for their Postgraduate Entrance Examination. Table of Contents Part I: General Part II: Epidemiological Triad Part III: Health Statistics, Research and Demography Part IV: Health Care and Services.","torrent":{"xt":"urn:btih:054a9e2f59e6ca82e2905923d0506c62f24dee57","amp;dn":"Mahajan+%26amp%3B+Gupta+Textbook+of+Preventive+%26amp%3B+Social+Medicine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054a9e2f59e6ca82e2905923d0506c62f24dee57","infoHashBuffer":{"type":"Buffer","data":[5,74,158,47,89,230,202,130,226,144,89,35,208,80,108,98,242,77,238,87]},"announce":[],"urlList":[]}}