{"title":"Seasick Steve Walkin Man {The Best Of Seasick Steve } (blues)(20","uid":6883249,"size":502130739,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05744b8882777ca0bab44a6f8ed215961661bee1&amp;dn=Seasick+Steve+Walkin+Man+%7BThe+Best+Of+Seasick+Steve+%7D+%28blues%29%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rogercc1","files":24,"time":1323722772,"description":"SEASICK STEVE WALKIN MAN THE BEST OF SEASICK STEVE\nLabel Rhino \nReleased: 2011\nFormat:Flac\n\nGrizzled bluesman Steven Gene Wold's rags-to-riches life story will surely one day end up being adapted for one of those life-affirming musical biopics that so often sweep the boards come awards season. The man now known best as Seasick Steve left home to escape from his abusive stepfather as a young teen, lived as a hobo across Tennessee and Mississippi for the better part of nearly two decades, and was on the fringes of the same scene as Janis Joplin and Joni Mitchell while performing as a session musician in the '60s, before eventually receiving an unlikely commercial breakthrough at the grand old age of 65. It's this eventful back-story that makes the 21 primitive blues offerings on Walkin' Man: The Best of Seasick Steve, his first full-length compilation, so compelling. Indeed, as his whiskey-soaked tones gruffly work their way through songs with such brilliantly old-fashioned titles as &quot;I Started Out with Nothin' and I Still Got Most of It Left&quot; and &quot;Don't Know Why She Loves Me But She Do,&quot; you're left in no doubt that he means every single word. However, this fairly representative retrospective (which shares three tracks with 2010's mini-collection ...Songs for Elisabeth) shows that there's more to him than his world-weary delivery and hard-luck tales. From the distorted grungy blues of &quot;Cheap&quot; and the twanging rockabilly of &quot;8 Ball&quot; (both from the 2004 debut recorded with Swedish band the Level Devils), to the four skeletal country-fused numbers from 2006's Dog House Music (the album performed and produced entirely solo), to the likes of the gospel-tinged collaboration with Ruby Turner on &quot;Happy Man,&quot; the percussive &quot;I Want Candy&quot;-inspired rock &amp; roll of &quot;Diddley Bo,&quot; and the sparse banjo-plucking folk of &quot;Treasures,&quot; this collection showcases the sound of a rough-and-ready showman unafraid to play around with the conventions of traditional blues. It's a credit to his workmanlike approach that despite a major-label deal and three consecutive U.K. Top Ten albums, his recent material is just as raw, ragged, and ramshackle as the music that originated from his busking days, ensuring that Walkin' Man is an impressively cohesive, if resolutely unpolished, body of work, which should provide a little hope for any unknown sexagenarian musicians who feel they've missed the boat\n\nTracklist:\n\n01 Dog House Boogie 03:31\n02 Cheap (Album Version) 04:05\n03 Started Out With Nothin 03:38\n04 Diddley Bo 03:51\n05 Thunderbird 04:16\n06 Happy Man 03:31\n07 Cut My Wings 03:23\n08 Treasures 03:54\n09 St. Louis slim 03:37\n10 8 Ball (Album Version) 03:41\n11 Don't Know Why She Love Me But She Do 03:30\n12 Walkin Man 02:42\n13 You Can't Teach An Old Dog New Tricks 03:36\n14 Fallen Off A Rock 04:36\n15 The Banjo Song 03:30\n16 Never Go West 03:30\n17 My Donny 04:02\n18 Prospect Lane 02:19\n19 Xmas Prison Blues (Album Version) 04:16\n20 That's All 04:39\n21 Dark 03:55\n","torrent":{"xt":"urn:btih:05744b8882777ca0bab44a6f8ed215961661bee1","amp;dn":"Seasick+Steve+Walkin+Man+%7BThe+Best+Of+Seasick+Steve+%7D+%28blues%29%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05744b8882777ca0bab44a6f8ed215961661bee1","infoHashBuffer":{"type":"Buffer","data":[5,116,75,136,130,119,124,160,186,180,74,111,142,210,21,150,22,97,190,225]},"announce":[],"urlList":[]}}