{"title":"Blink-182 - 5 Albums [24 bit FLAC] vinyl","uid":8299619,"size":8708430856,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05a62eba4ee3d7e43bb3f2f3a4cf1387d057b153&amp;dn=Blink-182+-+5+Albums+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"24.96","files":-1,"time":1364237222,"description":"  Blink-182 - 5 Albums [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Style: Punk\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 192,000 Hz\n\n  Buddha\n  Enema Of The State\n  Take Off Your Pants And Jacket\n  Blink-182 2LP\n  Neighborhoods 2LP\n\n  The new-school punk trio blink-182 were formed in the suburbs of San Diego, California around guitarist/vocalist Tom DeLonge, bassist/vocalist Mark Hoppus, and drummer Scott Raynor. Originally known as simply Blink, the band debuted in 1993 with a self-released EP, Fly Swatter. After releasing the album Buddha in 1994, the trio signed to Grilled Cheese/Cargo and released Cheshire Cat the following year. The threat of a lawsuit from a similarly named Irish band forced them to change their name to blink-182, but the group earned a higher profile touring the world with Pennywise and NOFX on the 1996-1997 Warped Tour, plus appearing on innumerable skate/surf/snowboarding videos.\n\n  After selling over four million copies of Enema of the State, the trio played on with the limited-edition release The Mark, Tom, and Travis Show (The Enema Strikes Back) in fall 2000. The album featured their radio hits in a live setting, intertwined with their quirky sense of humor as well as the new song &quot;Man Overboard.&quot; Take Off Your Pants and Jacket, issued in spring 2001, saw the band return to its SoCal punk rock roots. Maturity, of a sort, came with 2003's self-titled album, released on Geffen. Not only did the album sport a song (&quot;All of This&quot;) that featured Robert Smith of the Cure, but &quot;I Miss You&quot; also topped the modern rock charts in 2005. In February 2005, however, popular as ever and seemingly indestructible, blink-182 unexpectedly announced they would be going on an &quot;indefinite hiatus,&quot; supposedly to spend more time with their growing families. Asking fans for help in selecting tracks, the group issued Greatest Hits that November. \n\n  In 2009, blink-182 announced that they were reuniting and would be getting back to work on new material as well as touring again, hitting the road with Weezer for their reunion tour. They went into the studio later that year and began laying down the groundwork for a new album, which would be plagued by delays until 2011, when they were eventually able to release their sixth studio album, Neighborhoods.","torrent":{"xt":"urn:btih:05a62eba4ee3d7e43bb3f2f3a4cf1387d057b153","amp;dn":"Blink-182+-+5+Albums+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05a62eba4ee3d7e43bb3f2f3a4cf1387d057b153","infoHashBuffer":{"type":"Buffer","data":[5,166,46,186,78,227,215,228,59,179,242,243,164,207,19,135,208,87,177,83]},"announce":[],"urlList":[]}}