{"title":"Islamic Chinoiserie: The Art of Mongol Iran","uid":11739186,"size":5443282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05d457d9b38619236b5718113d3d76147a190203&amp;dn=Islamic+Chinoiserie%3A+The+Art+of+Mongol+Iran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425692131,"description":"The Mongol invasion in the thirteenth century marked a new phase in the development of Islamic art. Trans-Eurasian exchanges of goods, people and ideas were encouraged on a large scale under the auspices of the Pax Mongolica. With the fascination of portable objects brought from China and Central Asia, a distinctive, hitherto unknown style - Islamic chinoiserie - was born in the art of Iran.Highly illustrated, Islamic Chinoiserie offers a fascinating glimpse into the artistic interaction between Iran and China under the Mongols. By using rich visual materials from various media of decorative and pictorial arts - textiles, ceramics, metalwork and manuscript painting - the book illustrates the process of adoption and adaptation of Chinese themes in the art of Mongol-ruled Iran in a visually compelling way. The observation of this unique artistic phenomenon serves to promote the understanding of the artistic diversity of Islamic art in the Middle Ages.Key Features*Covers various media of decorative and pictorial arts from Iran, Central Asia and China*Deals with a diverse range of issues related to the East-West artistic relationship in the Middle Ages*Features in-depth studies of style, technique and iconography in Iranian art under the Mongols*Includes 125 illustrations, 24 in colour","torrent":{"xt":"urn:btih:05d457d9b38619236b5718113d3d76147a190203","amp;dn":"Islamic+Chinoiserie%3A+The+Art+of+Mongol+Iran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d457d9b38619236b5718113d3d76147a190203","infoHashBuffer":{"type":"Buffer","data":[5,212,87,217,179,134,25,35,107,87,24,17,61,61,118,20,122,25,2,3]},"announce":[],"urlList":[]}}