{"title":"DAZ3D - Poser: Prison Bundle + Prison Death Chamber","uid":15581073,"size":2613825839,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:05df16c093234dba213a68ed87b2a20635c6be30&amp;dn=DAZ3D+-+Poser%3A+Prison+Bundle+%2B+Prison+Death+Chamber&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":null,"files":134,"time":1471409570,"description":"---Previously uploaded to KAT by TraVin67---\r\n\r\nIncludes:\r\n\r\n\r\nDoing Time Poses for Genesis 2 Male(s)\r\n--------------------------------------\r\nNobody enjoys spending time in prison, but sometimes you need to give your characters a &quot;time out&quot; to think about what they have done. This set of poses captures all of the despair and ennui of prison life. While these poses were designed to compliment the Prison Cell Block K set by David Brinnen and ForbiddenWhispers, you aren't limited to using them in a prison setting. Anywhere where you have beds, stairs, or a need for walking or standing around, you'll have instant storyline poses at your fingertips.\r\n\r\nAs an added bonus, there are included are 20 Go-To position poses to quickly put the action in various locations around the gorgeously crafted prison.\r\n \nhttps://pximg.xyz/images/518a1b5d252970d419c9215297bafc5c.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/21446\r\n\r\n\r\nPrison Cell Block 'K'\r\n---------------------\r\nPresenting a dark, dank, depressing Prison Cell Block for your renders. This highly detailed model features 12 prison cells, a fully detailed stairway system.\r\n\r\nIncluded in this set are radiators, a heater system, alarm system and fully rigged doors throughout. The cell interiors feature a bunk bed, sink, toilet, mirror and stool.\r\n\r\nVarious texture options for the props provided throughout the set for extra versatility.\r\n \nhttps://pximg.xyz/images/2885c3dd564bea7f40aab39e232a0b01.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/21221\r\n\r\n\r\nPrison Clothes and Scrubs for Genesis 2 Female(s)\r\n-------------------------------------------------\r\nAdd a little danger to your renders! Are your characters behaving badly? Maybe some time in jail will straighten them out! And remember-they can still look fabulous!\r\n\r\nThe clothes also work as outfits for medical scrubs, janitors and similar outfits.\r\n \nhttps://pximg.xyz/images/7aab5e716c313035eb1e4a492f960d5a.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/21170\r\n\r\n\r\nPrison Death Chamber\r\n--------------------\r\nA beautifully detailed Prison Execution chamber. Complete with main viewing area, family viewing area, control room and two corridors enabling you to do 'kit bashing' if you so desire.\r\n\r\nThe doors are all rigged to open and close, and 3Delight and Iray materials are included throughout.\r\n \nhttps://pximg.xyz/images/1e46823440a3e811cdae161f07e8a1a6.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/22637\r\n\r\n\r\nPrison Exercise Yard\r\n--------------------\r\nA piece of enclosed ground in a prison on which your Runtime and Library Inmates can exercise in order to get fit and to remain healthy.\r\n\r\nThe set includes a basketball court with hoop and ball, weight bench with weights (fully poseable), punching bag, and exercise bars. As well as a three tiered bench for inmates to chill out on.\r\n \nhttps://pximg.xyz/images/057b856f8f905c229f587f1ae31b0ba7.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/24071\r\n\r\n\r\nPrison Guard Tower\r\n------------------\r\nPresenting a imposing, highly detailed Prison Guard Tower set for your Renders. This set features 3 size of tower, with accompanying fences and barricades.\r\n\r\nEach tower features windows and doors that all open and close, as well as search lights which tilt up and down. For extra versatility each towers' walls can be hidden for ease of use with camera angles.\r\n\r\nMany elements of this set make use of the DAZ Studio and Poser Internal Sub-Division. So please make sure you have the most compatible software.\r\n \nhttps://pximg.xyz/images/104838715b190d8b53644ecc06426698.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/21433\r\n\r\n\r\nPrison Shower Complex\r\n---------------------\r\nA highly detailed Prison Shower Room complete with benches, showers, plumbing, and static soap prop. An access corridor with security door and exit walkway allows for kitbashing with other sets in your Runtime..... \r\n\r\nMaterials for both Iray and 3Delight are included throughout.\r\n \nhttps://pximg.xyz/images/07578d64766f2b55071b088c229bfc41.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/22752\r\n\r\n\r\nPrison Visitors Room\r\n--------------------\r\nPresenting a dark, dank, depressing Prison Visitors Room for your renders. This highly detailed model features seating for several prisoners and visitors. All windows and doors open and close. Extra quirky details such as poseable clock dials are included for that added extra realism.\r\n\r\nProps include; an ashtray, pack of ciggies, a single ciggie, lighter, love letter and tazer. \r\n\r\nHighly detailed textures throughout.\r\n \nhttps://pximg.xyz/images/e45651b3004532fb6e212f9bdc8eb05f.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/21600\r\n\r\n---------------\r\nAll are for DAZ Studio and Poser except Prison Clothes and Scrubs for Genesis 2 Females (D|S only)","torrent":{"xt":"urn:btih:05df16c093234dba213a68ed87b2a20635c6be30","amp;dn":"DAZ3D+-+Poser%3A+Prison+Bundle+%2B+Prison+Death+Chamber","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05df16c093234dba213a68ed87b2a20635c6be30","infoHashBuffer":{"type":"Buffer","data":[5,223,22,192,147,35,77,186,33,58,104,237,135,178,162,6,53,198,190,48]},"announce":[],"urlList":[]}}