{"title":"Through the Eyes of a Pro - Nikon","uid":5249841,"size":2047023854,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:060c3f50bf71dbd934f30aeed7ddaa4c58247592&amp;dn=Through+the+Eyes+of+a+Pro+-+Nikon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"78Staff","files":3,"time":1262286569,"description":"DVD Rip to XVID\n\n===\n\nNot very Nikon specific despite the title.  These get mixed reviews, I haven't watched yet but reportedly not near as usefull as Bob Krist or Joe McNally's titles...\n\n\nDisk 1\n# Actors: Tim Mantoani\n# Directors: Blue Crane Digital\n# Format: Dolby, NTSC\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Number of discs: 1\n# Studio: Blue Crane Digital\n# DVD Release Date: November 7, 2007\n# Run Time: 100 minutes\n\nDisk 2\n# Actors: Tim Mantoani\n# Directors: Blue Crane Digital\n# Format: Dolby, NTSC\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Number of discs: 1\n# Studio: Blue Crane Digital\n# DVD Release Date: November 7, 2007\n# Run Time: 100 minutes\n\n\nIf you could peek over the shoulder of a professional photographer and learn how great photographs are made, would YOUR photography improve?\n\nThis series follows Tim Mantoani as he creates stunning images for both his professional practice and his personal use. Tim reveals secrets he has learned from over twenty years behind the lens. You will see exactly how he approaches his craft to get fantastic results with some of the same equipment you already own.\n\n\nIn Volume 1 of this series Tim covers:\n\n* Learning to see as a photographer\n* The importance of light, gesture, and composition\n* Simple camera controls that really make a difference\n* Understanding metering: incident and reflective\n* Lens selection within a budget and for professional use\n* Manipulating light on a budget\n* Using shutter speed to get the shot you want\n\nShooting sessions:\n1. Outdoor portrait session\n2. Sporting event\n3. Stock photo shoot\n* And much more!\n\nIn Volume 2 of this series, Tim covers:\n\n* Using available light in non-traditional ways\n* Setting expectations for superior performance\n* How photographer behavior effects the end result\n* Tripods and hand held meters\n* Using the tools at hand to make the best image\n* Stock photo shoot (complete sequence)\n* And much more \n\n\nTim Mantoani has been a professional photographer for seventeen years. Shooting everything from professional athletes and celebrities, to fashion and products, his work has appeared in numerous national advertising campaigns and magazines including a recent cover of Sports Illustrated. He has written a nationally distributed column on photographic lighting for thirteen years and continues to teach seminars at the Brooks Institute in Santa Barbara, California.\n\nThis DVD assumes you already know how your camera works, but want to raise your photography to the next level.\n\nThrough a series of interviews and real world photographic sessions, Tim walks you through the process of getting great images, even under challenging conditions. He also discusses the business of selling your work, and the level of investment in time and equipment necessary to be successful at any level.\n\nWhether you own a D3, D300, D2x, D200, D80, D70s, D50, D40x, or any other Nikon DSLR, this series can help because it focuses on you, the photographer behind the lens. This DVD assumes you are comfortable with your camera controls and menus. If you feel like your photography has hit a plateau, this DVD will lift you to the next level.\n\nTim uses a variety of equipment from different manufacturers during this presentation including Nikon and Canon. All demonstrations and discussions can be applied to any Nikon DSLR.\n\n","torrent":{"xt":"urn:btih:060c3f50bf71dbd934f30aeed7ddaa4c58247592","amp;dn":"Through+the+Eyes+of+a+Pro+-+Nikon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"060c3f50bf71dbd934f30aeed7ddaa4c58247592","infoHashBuffer":{"type":"Buffer","data":[6,12,63,80,191,113,219,217,52,243,10,238,215,221,170,76,88,36,117,146]},"announce":[],"urlList":[]}}