{"title":"Queen - The Best Of - Flac","uid":9627429,"size":1395873803,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:06348058ac4494eda3ab6c3ea305adc06b8cf947&amp;dn=Queen+-+The+Best+Of+-+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jmwreck","files":63,"time":1392613089,"description":"Queen are a British rock band formed in London in 1970, originally consisting of Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), John Deacon (bass guitar), and Roger Taylor (drums, vocals). Queen's earliest works were influenced by progressive rock, hard rock and heavy metal, but the band gradually ventured into more conventional and radio-friendly works, incorporating further diverse styles into their music.\n\nBefore joining Queen, Brian May and Roger Taylor had been playing together in a band named Smile with bassist Tim Staffell. Freddie Mercury (then known as Farrokh/Freddie Bulsara) was a fan of Smile, and encouraged them to experiment with more elaborate stage and recording techniques after Staffell's departure in 1970. Mercury himself joined the band shortly thereafter, changed the name of the band to &quot;Queen&quot;, and adopted his familiar stage name. John Deacon was recruited prior to recording their eponymous debut album (1973). Queen enjoyed success in the UK with their debut and its follow-up, Queen II (1974), but it was the release of Sheer Heart Attack (1974) and A Night at the Opera (1975) that gained the band international success. The latter featured &quot;Bohemian Rhapsody&quot;, which stayed at number one in the UK Singles Chart for nine weeks; it charted at number one in several other territories, and gave the band their first top ten hit on the US Billboard Hot 100. Their 1977 album, News of the World, contained two of rock's most recognisable anthems, &quot;We Will Rock You&quot; and &quot;We Are the Champions&quot;. By the early 1980s, Queen were one of the biggest stadium rock bands in the world, and their performance at 1985's Live Aid is widely regarded as one of the greatest in rock history. In 1991, Mercury died of bronchopneumonia, a complication of AIDS, and Deacon retired in 1997. Since then, May and Taylor have infrequently performed together, including a collaboration with Paul Rodgers under the name Queen + Paul Rodgers which ended in May 2009.\n\nThe band have released a total of 18 number one albums, 18 number one singles, and 10 number one DVDs. Estimates of their album sales generally range from 150 million to 300 million albums, making them one of the world's best-selling music artists. They received the Outstanding Contribution to British Music Award from the British Phonographic Industry in 1990, and were inducted into the Rock and Roll Hall of Fame in 2001.\n\nWIKI","torrent":{"xt":"urn:btih:06348058ac4494eda3ab6c3ea305adc06b8cf947","amp;dn":"Queen+-+The+Best+Of+-+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06348058ac4494eda3ab6c3ea305adc06b8cf947","infoHashBuffer":{"type":"Buffer","data":[6,52,128,88,172,68,148,237,163,171,108,62,163,5,173,192,107,140,249,71]},"announce":[],"urlList":[]}}