{"title":"Let Thy Food Be Thy Medicine: Plants and Modern Medicine","uid":12183156,"size":21528717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:075180e06c80388ec5b97eae45f0f475ef1ded67&amp;dn=Let+Thy+Food+Be+Thy+Medicine%3A+Plants+and+Modern+Medicine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438498298,"description":" Kathleen Hefferon, &quot;Let Thy Food Be Thy Medicine: Plants and Modern Medicine&quot;\n\nEnglish | ISBN: 0199873976 | 2012 | 208 pages | PDF | 20 MB\n\nAre herbal medicines effective? Are organic foods really better for you? Will the cure to cancer eventually come from a newly discovered plant which dwells in the Amazon basin? Will medicines ever become affordable and available to the neediest? How will we produce enough food to keep up with an ever-increasing world population? Written with these issues in mind, Let Thy Food Be Thy Medicine is a response to the current flood of conflicting information regarding the use of plants for both consumption and medicinal purposes. Kathleen Hefferon addresses the myths and popular beliefs surrounding the application of plants in human health, revealing both their truths and inaccuracies, and provides an overview of the technologies scientists are using to further their research.\n\nThe book covers herbal medicines, functional and biofortified foods, plants and antibiotics, edible vaccines, and organic versus genetically modified foods, discussing each from a scientific standpoint. It these topics together for the first time, providing a much-needed overview of plants as medicine. Intended for scientists and professionals in related disciplines as well as the interested reader educated in the sciences, this book will confront claims made in the media with science and scientific analysis, providing readers with enough background to allow them to make their own judgments","torrent":{"xt":"urn:btih:075180e06c80388ec5b97eae45f0f475ef1ded67","amp;dn":"Let+Thy+Food+Be+Thy+Medicine%3A+Plants+and+Modern+Medicine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075180e06c80388ec5b97eae45f0f475ef1ded67","infoHashBuffer":{"type":"Buffer","data":[7,81,128,224,108,128,56,142,197,185,126,174,69,240,244,117,239,29,237,103]},"announce":[],"urlList":[]}}