{"title":"Man and His Symbols - Carl G. Jung.pdf","uid":5253951,"size":91375310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:078a0c366258a143fc637d17ab028f784b888491&amp;dn=Man+and+His+Symbols+-+Carl+G.+Jung.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"lucidlight","files":-1,"time":1262469537,"description":"Man and His Symbols - Carl G. Jung (PDF) (OCR Text with imbedded images)\n\nIllustrated throughout with revealing images, this is the first and only work in which the world-famous Swiss psychologist explains to the layperson his enormously influential theory of symbolism as revealed in dreams.\n\n\nNote: This hardcover edition has more illustrations and images than the softcover.\n\nHardcover: 320 pages \nPublisher: Anchor (1964) \nLanguage: English \nISBN-10: 0385052219 \n\n\n\nReview:\nMan and His Symbols - Review by Aisling Ireland\n\n\nCarl Jung was one of the foremost authorities on the subject of dream -- their interpretation, meaning, and symbolism. He was primarily an academic and most of the books he wrote were meant for the academic community -- it was never his intent to write for the public.\n\nThat all changed with the publication of &quot;Man and His Symbols&quot;.\n\nJung was the focus of a documentary being aired in the UK. The filmmaker had spent a great deal of time with Jung and over the course of working with Jung, he became more and more aware of how valuable Jung's insights were. He was also aware that Jung's work was largely inaccessible. He asked Jung if he had ever considered or if he might be interested in writing a book that expressed his ideas in a way the public might readily understand. Jung considered the question and then said, &quot;No.&quot;\n\nJung was not known for changing his mind and the filmmaker considered the issue closed. However, on a subsequent visit, the filmmaker learned that Jung was busy at work on a book designed with the general public in mind. \n\nWhat had changed Jung's mind?\n\nA dream. \n\nImmediately after the conversation with the filmmaker, Jung had a dream where he was delivering a paper to a crowd of blue-collar workers. When he awaken, he realized the dream was a directive to create such a book. The result was &quot;Man and His Symbols.&quot;\n\n&quot;Man and His Symbols&quot; is divided into four parts, each dealing with a different aspect of individuation--specifically the integration of the four major archetypes: the shadow, the anima, the animus, and the Self. \n\nJung himself wrote only the first section; the remaining sections are written by three other pre-eminent Jungian psychoanalysts: M.-L. von Franz, Joseph L. Henderson, Jolande Jacobi, and Aniela Jaffe.\n\nWhile &quot;Man and His Symbols&quot; is directed toward the general public, this does not mean that it is &quot;dumbed-down&quot;. It is intelligently written and explains the basic concepts of Jungian psychology in a straight-forward manner. It is an exceptional work and a great primer for Jungian dream analysis. The hardcover edition has photos and artwork accompanying the text. \n\nIf you are looking for a book that lays a solid foundation for helping you solve the meaning of your dreams and assisting with personal growth, this book is for you!\n\nUntil next time, sleep well and dream out loud!\n\n\n===&gt;\nThis is as much an Art Album as a psychology book.\n\nIt's the illustrations from the large format book. that increase the size.\n\nIt's scanned a a modest 300 DPI with de-screening option for pictures which is the precise resolution needed for quality pictures on the computer screen neither too much or too little,\n\nEach page was painstakingly delineated and areas defined for text-OCR versus pictures areas for using the conversion software. This is after the scanning process was done\n\n\n\n","torrent":{"xt":"urn:btih:078a0c366258a143fc637d17ab028f784b888491","amp;dn":"Man+and+His+Symbols+-+Carl+G.+Jung.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078a0c366258a143fc637d17ab028f784b888491","infoHashBuffer":{"type":"Buffer","data":[7,138,12,54,98,88,161,67,252,99,125,23,171,2,143,120,75,136,132,145]},"announce":[],"urlList":[]}}