{"title":"Field Book of Western Wild Flowers (gnv64)","uid":9808399,"size":34249949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:078c5483b010625db7fad4c642a2093199204e46&amp;dn=Field+Book+of+Western+Wild+Flowers+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1395446517,"description":"Field Book of Western Wild Flowers: The Ultimate Guide to Flowers Growing West of the Rocky Mountains \nby Margaret Armstrong\nSkyhorse Publishing | March 2014 | ISBN-10: 1628737956 | ePUB | 352 pages | 32.6 mb &lt;a href=&quot;\nhttp://www.amazon.in/Field-Book-Western-Wild-Flowers/dp/1628737956&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.in/Field-Book-Western-Wild-Flowers/dp/1628737956&lt;/a&gt;\n\nMargaret Armstrong, a prolific book cover designer and illustrator, spent a few years travelling around the western United States at the beginning of the twentieth century and in 1911 she was one of the first women to descend to the floor of the Grand Canyon. There she discovered some new flower species and began writing and illustrating the exquisite and thorough Field Book of Western Wild Flowers.\nThis was the first comprehensive handbook to supply detailed information about the plethora of flowers growing in the western United States and includes detailed information on seventy-five plant families, like water-plantain, lilly, buttercup, poppy, mustard, hydrangea, plum, rose, cactus, wintergreen, figwort, and valerian families, and many others.\nArmstrong includes information on key characteristics of each species, including height, leaf and petal features, colors, where each flower can most likely be found, ideal conditions they flourish in, and much more.\n\nAbout the Author\nMargaret Armstrong (1867-1944) was born in New York to a wealthy family. She was a prolific book cover designer and her design work has been the focus of several major exhibits and is widely collected today. She is the author of &quot;Fanny Kemble, A Passionate Victorian,&quot; and &quot;Trelawny, A Man's Life&quot; as well as three murder mysteries.","torrent":{"xt":"urn:btih:078c5483b010625db7fad4c642a2093199204e46","amp;dn":"Field+Book+of+Western+Wild+Flowers+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078c5483b010625db7fad4c642a2093199204e46","infoHashBuffer":{"type":"Buffer","data":[7,140,84,131,176,16,98,93,183,250,212,198,66,162,9,49,153,32,78,70]},"announce":[],"urlList":[]}}