{"title":"The Social Contract by Jean-Jacques Rousseau (explained)","uid":6839176,"size":56993738,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:079d9774a8d4128d2e84ca9dae38f2cdfcd701d1&amp;dn=The+Social+Contract+by+Jean-Jacques+Rousseau+%28explained%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"michaelrizzo","files":-1,"time":1322113521,"description":"&quot;Man is born free - yet everywhere he is in chains&quot; - Jean-Jacques Rousseau\n(The social contract) - Perhaps the greatest known French Philosopher of\nthem all.\n\nIn order to gain moral freedom says Rousseau, it is necessary to impose a\ntyranny of sorts - in the application of societal laws - the effects of which \nwould be to free man from the worse fate - of being at the whims of instinct\nrather than moral reason in guiding his affairs. (Hobbes uses a slightly similar\napproach I submit).\n\nHe does suggest that Christians are happy to become slaves rather than\nmasters of their own fate perhaps and he isn't any kinder to the Jewish faith\neither in his appraisal of its fate in most societies as a result of having\n&quot;too many rituals&quot; as he puts it (section 2d). Many a time he seems to express\na cynical disposition towards human nature overall that would suggest he has not\na man who could have been without some need to conform as perhaps from within\nhe lacked a good enough enthusiasm of his own to fit in with humankind equally\nacross the board. He even gave up his own children (fully five in fact) to\ninstitutional living - blaming others for his lack of better luck as it were.\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:079d9774a8d4128d2e84ca9dae38f2cdfcd701d1","amp;dn":"The+Social+Contract+by+Jean-Jacques+Rousseau+%28explained%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079d9774a8d4128d2e84ca9dae38f2cdfcd701d1","infoHashBuffer":{"type":"Buffer","data":[7,157,151,116,168,212,18,141,46,132,202,157,174,56,242,205,252,215,1,209]},"announce":[],"urlList":[]}}