{"title":"Pompeii - Art, Industry and Infrastructure (History Ebook).pdf","uid":11379782,"size":40005709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07a5845f22f480264f805e9dbfe2a3368c92b933&amp;dn=Pompeii+-+Art%2C+Industry+and+Infrastructure+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1415200951,"description":"Pompeii: Art, Industry and Infrastructure\nKevin Cole, Miko Flohr, Eric Poehler | 2011 | True PDF | ISBN: 1842179845 | 201 pages | 38 Mb\n\nEven after more than 250 years since its discovery, Pompeii continues to resonate powerfully in both academic discourse and the popular imagination. This volume brings together a collection of ten papers that advance, challenge and revise the present conceptions of the city's art, industry and infrastructure. The discussions of domestic art in this book, a perennial topic for Pompeian scholars, engage previously neglected subjects such as wall ornaments in domestic decoration, the sculpture collection in the house of Octavius Quartio, and the role of the covered walkways in luxury villa architecture. The famous cupid's frieze from the house of the Vettii is given a novel and intelligent reinterpretation. The place of industry at Pompeii, in both the physical and economic landscapes has long been overlooked. The chapters on building practice in inhabited houses, on the presence of fulling workshops in atrium houses, and on the urban pottery industry serve as successful contributions to a more complete understanding of the life of the ancient city. Finally, this volume breaks new ground in the consideration of the urban infrastructure of Pompeii, a topic that has won serious attention only in the last decades, but one that is playing an increasingly central role in Pompeian studies. The final three chapters offer a reassessment of the Pompeian street network, a scientific analysis of the amount of lead in Pompeian drinking water, and a thorough analysis of the water infrastructure around the forum that supported its architectural transformation in the last decades before the eruption of mount Vesuvius in AD 79","torrent":{"xt":"urn:btih:07a5845f22f480264f805e9dbfe2a3368c92b933","amp;dn":"Pompeii+-+Art%2C+Industry+and+Infrastructure+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07a5845f22f480264f805e9dbfe2a3368c92b933","infoHashBuffer":{"type":"Buffer","data":[7,165,132,95,34,244,128,38,79,128,94,157,191,226,163,54,140,146,185,51]},"announce":[],"urlList":[]}}