{"title":"Super Meat Boy[PC Multi12][Nautilus-bt]","uid":6433564,"size":191976202,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:07a935d73ee0c963587dbf689faf44229126952a&amp;dn=Super+Meat+Boy%5BPC+Multi12%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"someuser11","files":1,"time":1306749618,"description":"Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\n\nOur meaty hero will leap from walls, over seas of buzz saws, through crumbling caves and pools of old needles. Sacrificing his own well being to save his damsel in distress. Super Meat Boy brings the old school difficulty of classic NES titles like Mega Man 2, Ghost and Goblins and Super Mario Bros. 2 (The Japanese one) and stream lines them down to the essential no BS straight forward twitch reflex platforming.\n\nRamping up in difficulty from hard to soul crushing SMB will drag Meat boy though haunted hospitals, salt factories and even hell itself. And if 300+ single player levels weren't enough SMB also throws in epic boss fights, a level editor and tons of unlock able secrets, warp zones and hidden characters.\n\nClick here to read the complete review\n\nChe cos'ÃƒÂ¨ Super meat boy? E' un gioco apparso un po di tempo fa su consolle xbox360 che ha spopolato completamente, un gioco molto semplice ma allo stesso tempo complesso da portare a termine, ogni livello ci vedrÃƒÂ  impegnati ad arrivare dall'altro capo dello scenario per raggiungere la nostra amata che ÃƒÂ¨ stata rapita, ma non sarÃƒÂ  facile essendoci trappole, seghe rotanti, lame e quant'altro a cercare di bloccarci la strada. Solo i piÃƒÂ¹ abili riusciranno a portare a termine i vari livelli nel minor tempo possibile! Questo gioco ÃƒÂ¨ diventato famosissimo, basta fare una semplice ricerca per capire il calibro del gioco, beh, che dire, spero vi piaccia!\n\nClicca qui per leggere la recensione completa\n\n\n\nDate : 30/11/10\nGenre : Platformer\nLanguage : Multi12 (English, Japanese, French, Italian, German, Spanish, Polish, Russian, Korean, Traditional Chinese, Simple Chinese, Portoguese)\n\nRequirements:\nO.S: XP / Vista / 7\nCPU: 1.4GHz\nRam: 768 MB\nGPU:\nHDD: 100 MB\nDiretX: 9.0c\n\n\n\n\n\n\n\n\nMount or burn the ISO image\ninstall the game\nPlay!\n\nMonta o masterizza l'immagine ISO\nInstalla il gioco\nGioca!\n","torrent":{"xt":"urn:btih:07a935d73ee0c963587dbf689faf44229126952a","amp;dn":"Super+Meat+Boy%5BPC+Multi12%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07a935d73ee0c963587dbf689faf44229126952a","infoHashBuffer":{"type":"Buffer","data":[7,169,53,215,62,224,201,99,88,125,191,104,159,175,68,34,145,38,149,42]},"announce":[],"urlList":[]}}