{"title":"The Secret War Against The Jews - John Loftus, Mark Aarons","uid":11728004,"size":22099552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:087e8a1f5fecf85c6c9f128cd1b5cdfa70902aa8&amp;dn=The+Secret+War+Against+The+Jews+-+John+Loftus%2C+Mark+Aarons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"starxteel","files":1,"time":1425154160,"description":"\nA hugely controversial work that exposes a series of scandals from Oliver North to the British royal family, The Secret War Against the Jews reveals as much about political corruption inside Western intelligence as it does about Israel. Using thousands of previously top-secret documents and interviews with hundreds of current and former spies, Loftus and Aarons, both veteran investigators, Nazi-hunters, and authors, present a compelling narrative.\n\nThe authors demonstrate that numerous Western countries, especially the United States and Great Britain, have conducted repeated and willful spying missions on Palestine and later Israel over many decades. While on the surface these two countries and others profess to be ardent allies of Israel, they work, in fact, through their intelligence services to betray Israel's secrets to the Arabs. Their motive: oil and multinational profits, which must be attained at any price through international covert policies.\n\nThe pageant of characters appearing in this narrative is vast and shocking. This is not only a compelling work of history, but also a volume whose grave allegations will be debated for years to come.\n\n\nAbout the author:\nAttorney John Loftus is the author of four histories of intelligence operations and a consultant for CBS's 60 Minutes, ABC's Prime Time, and other programs. As a former prosecutor with the U.S. Justice Department's Nazi-hunting unit, he had unprecedented access to top-secret CIA and NATO archives. He wrote Unholy Trinity: The Vatican, the Nazis, and Soviet Intelligence with his coauthor, Mark Aarons. An internationally award-winning investigative reporter and author of several books on intelligence-related issues, Mr. Aarons exposed Nazi war criminals &quot;down under&quot; and prompted changes to Australian federal law. He lives in Sydney, Australia, where he formerly worked for the Australian Broadcasting Corporation","torrent":{"xt":"urn:btih:087e8a1f5fecf85c6c9f128cd1b5cdfa70902aa8","amp;dn":"The+Secret+War+Against+The+Jews+-+John+Loftus%2C+Mark+Aarons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087e8a1f5fecf85c6c9f128cd1b5cdfa70902aa8","infoHashBuffer":{"type":"Buffer","data":[8,126,138,31,95,236,248,92,108,159,18,140,209,181,205,250,112,144,42,168]},"announce":[],"urlList":[]}}