{"title":"Blame! Manga. 10 Volumes. Finished. Tsutomu Nihei.","uid":4175363,"size":328597284,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:08b13f7e4fc9952c9e8cc9a0f4335d913103ded6&amp;dn=Blame%21+Manga.+10+Volumes.+Finished.+Tsutomu+Nihei.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"shouzo","files":1,"time":1210097549,"description":"Blame! pronounced BLAM, like a gunshot. This is one of my favorite mangas, and you might read it a couple of times before understanding and/or put yourself fully into this masterpiece. This manga has also got a cultstatus cause of it dark and cybernetic atmosphere.\n\n\nGenre: Sci-Fi, dark, cybernetic, voilence, blood, gore and all that.\n\n\nMaybe on Earth, maybe in the future...\n\n\nThis is the first success and most well-known manga by Tsutomu Nihei. This manga got a main character named Killy, who got a Gravitational Beam Emitter, an extraordinary gun which can shoot through more than cardbords found in your backyard...\n\nKilly is searching for the Net Terminal Gene, any human that doesn&amp;#039;t have the NTG gets killed by Safeguards, and that&amp;#039;s most of the human. If Killy doesn&amp;#039;t find the NTG, all humanity will get extinct by the safeguards. Killy gets later a companion for his journey towards this fairly impossible mission...\n\nI could have written alot more, but I don&amp;#039;t wat to spoil the story for you guys;).\n\nNihei studied first architecture, and later it&amp;#039;s shown up in his manga works with drawing huge structures.\n\nEven though this was Niheis first manga, he got prequels(note:made after Blame!) and sequels to this magnificent work of art. He also got some oneshots, small stories and such, that I&amp;#039;ll be uploading them later on.\n\nRecommended listening while reading: Sybreed;)\n\n\nDISCLAIMER: If you like this, go and buy it to support the authors and their work. Your help makes the authors continue their work;)\n\nPlease leave a comment, and some requests of other mangas too:P\n\nThis is a link to my previous uploads:           &lt;a href=&quot;\nhttp://thepiratebay.se/user/shouzo/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/shouzo/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:08b13f7e4fc9952c9e8cc9a0f4335d913103ded6","amp;dn":"Blame%21+Manga.+10+Volumes.+Finished.+Tsutomu+Nihei.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08b13f7e4fc9952c9e8cc9a0f4335d913103ded6","infoHashBuffer":{"type":"Buffer","data":[8,177,63,126,79,201,149,44,158,140,201,160,244,51,93,145,49,3,222,214]},"announce":[],"urlList":[]}}