{"title":"Jeff Beck - Jeff Beck's Guitar Shop ... [1989][320 KBPS]","uid":8443251,"size":96113633,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0924e6f69d2e15f5b19fa5b2e8eb9663d2d32a12&amp;dn=Jeff+Beck+-+Jeff+Beck%27s+Guitar+Shop+...+%5B1989%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LameDuck69","files":12,"time":1367824740,"description":"Jeff Beck's Guitar Shop with Terry Bozzio and Tony Hymas [1989]\n\n\n\n\n\n1. Guitar Shop  \n2. Savoy  \n3. Behind The Veil  \n4. Big Block  \n5. Where Were You  \n6. Stand On It  \n7. A Day In The House  \n8. Two Rivers  \n9. Sling Shot  \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nGeoffrey Arnold &quot;Jeff&quot; Beck (born 24 June 1944) is an English rock guitarist. He is one of the three noted guitarists to have played with The Yardbirds (the other two being Eric Clapton and Jimmy Page). Beck also formed The Jeff Beck Group and Beck, Bogert &amp; Appice.\n\nMuch of Beck's recorded output has been instrumental, with a focus on innovative sound, and his releases have spanned genres ranging from blues-rock, heavy metal, jazz fusion and an additional blend of guitar-rock and electronica. Although he recorded two hit albums (in 1975 and 1976) as a solo act, Beck has not established or maintained the sustained commercial success of many of his contemporaries and bandmates. Beck appears on albums by Mick Jagger, Tina Turner, Jon Bon Jovi, Malcom McLaren, Kate Bush, Roger Waters, Donovan, Stevie Wonder, Les Paul, Zucchero, Cyndi Lauper, Brian May, Stanley Clarke and ZZ Top.\n\nHe was ranked 5th in Rolling Stone's list of the &quot;100 Greatest Guitarists of All Time&quot; and the magazine has described him as &quot;one of the most influential lead guitarists in rock&quot;.[4] MSNBC has called him a &quot;guitarist's guitarist&quot;. Beck has earned wide critical praise and received the Grammy Award for Best Rock Instrumental Performance six times and Best Pop Instrumental Performance once. He has been inducted into the Rock and Roll Hall of Fame twice: as a member of the Yardbirds (1992) and as a solo artist (2009).\n\n-----------------------------------------------------------------------------------\n\nJeff Beck's Guitar Shop is the fifth studio album by guitarist Jeff Beck, released in October 1989 through Epic Records. It reached #49 on that year's Billboard 200 chart, and later won an award for Best Rock Instrumental Performance at the 1990 Grammy Awards.[4] The album's single, &quot;Stand on It&quot;, charted at #35 on Billboard's Hot Mainstream Rock Tracks in 1989, whilst &quot;Sling Shot&quot; was featured in the 1990 horror comedy film Gremlins 2: The New Batch. Several tracks were also used as part of the soundtrack for the &quot;South Atlantic Raiders&quot; episodes of the British comedy series The Comic Strip Presents. In a further move from his previous jazz fusion stylings, Beck adopts a more straightforward instrumental rock approach on this album, save for two tracks on which drummer Terry Bozzio provides spoken vocals.\n\n\n\n\n","torrent":{"xt":"urn:btih:0924e6f69d2e15f5b19fa5b2e8eb9663d2d32a12","amp;dn":"Jeff+Beck+-+Jeff+Beck%27s+Guitar+Shop+...+%5B1989%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0924e6f69d2e15f5b19fa5b2e8eb9663d2d32a12","infoHashBuffer":{"type":"Buffer","data":[9,36,230,246,157,46,21,245,177,159,165,178,232,235,150,99,210,211,42,18]},"announce":[],"urlList":[]}}