{"title":"Instant Burp Suite Starter","uid":8209964,"size":7357425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:092ba72d6bdf318586c5c167ebbb40d58ef515af&amp;dn=Instant+Burp+Suite+Starter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1362219762,"description":"Instant Burp Suite Starter\n\nBOOK DETAILS:\n\nPublisher: Packt Publishing (January 2013) Language: English ISBN-10: 1849695180 ISBN-13: 978-1849695183 Format: PDF, EPUB\n\nBOOK DESCRIPTION:\n\nWeb security is more important than ever for protecting the confidentiality, integrity, and availability of web applications. Although there is no silver bullet tool, using the right instruments does play a critical role in any security initiative. Burp Suite is a well-known integrated platform for performing security testing and is considered the de-facto standard for testing web applications. Instant Burp Suite Starter is a practical, hands-on guide that can help you take advantage of the Burp Suite, a powerful web security tool. Thanks to its step-by-step examples, you will quickly learn how to efficiently discover web application vulnerabilities such as SQL Injection and Cross-site scripting. From intercepting your first web request, you will soon be able to inspect parameters, perform tampering, and eventually discover security flaws. You will also learn how to use the numerous tools available in Burp Suite in order to enumerate all web application entry points, perform scans, and automatically detect security flaws. Then test your sites with automated customized attacks, analyze the randomness of application data, decode data in multiple formats, and much more. Instant Burp Suite Starter will teach you everything you need to know to get started with testing your first application using Burp Suite. You will learn helpful tips and tricks on how to discover potentially destructive security flaws in your application. \n\nWhat you will learn from this book:\n\nSet up your browser and Burp Suite \nIntercepting, inspecting, and modifying web traffic between your client and the server \nUsing the Burp Target site map functionality \nCrawling a web application and discovering resources with Burp Spider \nLaunching a scan with Burp Scanner to automatically detect security vulnerabilities \nAutomating customized attacks with Burp Intruder \nManipulating and iterating web requests with Burp Repeater \nAnalyzing the randomness of application data with Burp Sequencer \nDecoding and encoding data in multiple formats with Burp Decoder \nComparing site maps in order to detect authorization bugs \n\nApproach:\n\nGet to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks. This starter guide will lead you through the field of application security with everyday examples explained. Build up your skills and your defenses with this hands-on tutorial. \n\nWho this book is written for:\n\nIf you are an application developer with a focus on security then this practical guide is for you. Even with basic knowledge of security you will be able to develop your expertise and make your applications bulletproof. \n","torrent":{"xt":"urn:btih:092ba72d6bdf318586c5c167ebbb40d58ef515af","amp;dn":"Instant+Burp+Suite+Starter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"092ba72d6bdf318586c5c167ebbb40d58ef515af","infoHashBuffer":{"type":"Buffer","data":[9,43,167,45,107,223,49,133,134,197,193,103,235,187,64,213,142,245,21,175]},"announce":[],"urlList":[]}}