{"title":"Anarchy Comics (Underground - Restored)","uid":7588874,"size":125375547,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:093d353a1631a2217045294b38603166aedd5e23&amp;dn=Anarchy+Comics+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346483876,"description":"Issues 1-4 of 'Anarchy Comics'\n\nLast Gasp, 1978, 1979, 1981 and 1987\n\nAnarchy Comics was a series of underground comic books published by Last Gasp between 1978 and 1987, as part of the underground comix subculture of the era.\n\nPublished in 1978, 1979, 1981, and 1987, each issue of Anarchy Comics was created by an international cast of anarchist or sympathetic contributors. Each anthology included a mixture of fiction, history, commentary, and artwork, with wide ranges in style and format.\n\nEach issue of Anarchy Comics showcased an international cast of artists who identified as anarchists, or non-sectarian socialists. An example of this is Spain Rodriguez, a Marxist, who was considered of &quot;sufficient libertarian bent&quot; to be included. Contributors including Rodriguez, Gilbert Shelton, Jay Kinney and Paul Mavrides were distinct for &quot;adding new dimensions to the political comic&quot; in the underground comix press of the 1970s and '80s.\n\nSee this page for a list of contributors...\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Anarchy_Comics&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Anarchy_Comics&lt;/a&gt;\n\n----------------------------------------------------------------------------\n\nI have almost 1500 Underground comic books in a digital format. I will be restoring and uploading many of my favorites over the coming months. Any requests, just say the word.\n\nSo what does 'Restored' mean? Well with all due respect to the great and wonderful Sir Real (if you know the name, you know his power!) and all the other scanners who have shared these books with the online world, the pages of these books were not yellow when first printed. Newsprint? Yes, often they were. Cheap paper? Yeah, that too. But not yellow. \n\nIn most cases, the changes make the books look better than they did when they were originally printed. By turning the newsprint or cheap paper they were printed on to a bright white, with crisp, clear greys and solid blacks on top, they look very much like a new b&amp;w comic you would buy right off the shelf today.\n\nThis is accomplished by running the b&amp;w pages through the PhotoScape Batch Editor. The Filters applied to the pages are; Grayscale (changes the image to greyscale); a 'Middle' of 'High' setting on Auto Level (greatly improves the blacks); a 'Low' or +1 Sharpen (barely noticeable, even if you watch the changes take place); 'Deepen' is used if there is bleed through from the image on the back of the page. Color covers, back or interior pages are 'Restored' on a page by page basis. \n\nAnd even though I'm not really into scanner tags, out of respect for the huge amount of work he's done (or did - who knows how one so mysterious works?!), if an original Sir Real front page existed I have moved it to the back of the book","torrent":{"xt":"urn:btih:093d353a1631a2217045294b38603166aedd5e23","amp;dn":"Anarchy+Comics+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093d353a1631a2217045294b38603166aedd5e23","infoHashBuffer":{"type":"Buffer","data":[9,61,53,58,22,49,162,33,112,69,41,75,56,96,49,102,174,221,94,35]},"announce":[],"urlList":[]}}