{"title":"The Theory of Everything: The Origin and Fate of the Universe","uid":9754883,"size":1252024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:098911806715891b953d398f61a462bcf6924dfb&amp;dn=The+Theory+of+Everything%3A+The+Origin+and+Fate+of+the+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"PirateBook","files":1,"time":1394669557,"description":"\nby Stephen Hawking\n\nWith a title inspired as much by Douglas Adams' Hitchhiker series as Einstein, The Theory of Everything delivers almost as much as it promises. Transcribed from Stephen Hawking's Cambridge Lectures, the slim volume may not present a single theory unifying gravity with the other fundamental forces, but it does carefully explain the state of late 20th-century physics with the great scientist's characteristic humility and charm. \n\nExplicitly shunning math, Hawking explains the fruits of 100 years of heavy thinking with metaphors that are simple but never condescending--he compares the settling of the newborn universe into symmetry to the formation of ice crystals in a glass of water, for example. While he explores his own work (especially when speaking about black holes), he also discusses the important milestones achieved by others like Richard Feynman. \n\nThough occasionally an impenetrably obscure phrase does slip by, the reader will find the bulk of the text enlightening and engaging. The material, from the nature of time to the possibility that the universe has no beginning or end, is rich and deep and inevitably ignites metaphysical thinking. After all, Hawking is famous for his &quot;we would know the mind of God&quot; remark, which ends the final lecture herein.\n\nGenre: Non-Fiction | Science, Physics","torrent":{"xt":"urn:btih:098911806715891b953d398f61a462bcf6924dfb","amp;dn":"The+Theory+of+Everything%3A+The+Origin+and+Fate+of+the+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098911806715891b953d398f61a462bcf6924dfb","infoHashBuffer":{"type":"Buffer","data":[9,137,17,128,103,21,137,27,149,61,57,143,97,164,98,188,246,146,77,251]},"announce":[],"urlList":[]}}