{"title":"An Episode in the Life of an Iron Picker 2013 DVDRip Sonata Prem","uid":9919581,"size":751444286,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0994be8e4bf39aaa30c45c70bae8b47f39b7759e&amp;dn=An+Episode+in+the+Life+of+an+Iron+Picker+2013+DVDRip+Sonata+Prem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"klinho","files":4,"time":1396988887,"description":"Nazif barely makes ends meet as an iron picker to support his family. He searches daily for scrap metal while his partner Senada tends to their home and their two young daughters. A third baby is on the way. After a long days work, Nazif finds Senada laid up in pain. The following day, he borrows a car to drive her to the nearest clinic. The diagnosis is that Senada has miscarried and is still carrying her dead five-month old fetus. The condition is critical and Senada needs immediate treatment at a faraway city hospital. Because she does not have a state-provided health insurance card, the hospital requests that Senada pay 980 Bosnian marks (500 euros), a fortune for a modest iron picker. Despite Nazifs begging, Senada is denied the crucial surgery and forced to return home to their Roma community in central Bosnia and Herzegovina. For the next 10 days, Nazif will do everything he can to try and save Senadas life desperately searching for more scrap metal, seeking help from state institutions For the next 10 days, Nazif and Senada will be fully exposed to the callousness of contemporary society.\n\n\nLanguages: Bosnian / Romany\n\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:0994be8e4bf39aaa30c45c70bae8b47f39b7759e","amp;dn":"An+Episode+in+the+Life+of+an+Iron+Picker+2013+DVDRip+Sonata+Prem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0994be8e4bf39aaa30c45c70bae8b47f39b7759e","infoHashBuffer":{"type":"Buffer","data":[9,148,190,142,75,243,154,170,48,196,92,112,186,232,180,127,57,183,117,158]},"announce":[],"urlList":[]}}