{"title":"Bandolero! (Western) {James Stewart, Dean Martin} [1968]","uid":7927720,"size":761919832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09ccbc706afe798c5aa24ea51d85275f2da9a736&amp;dn=Bandolero%21+%28Western%29+%7BJames+Stewart%2C+Dean+Martin%7D+%5B1968%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"alien99","files":-1,"time":1355623513,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0062708/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0062708/&lt;/a&gt;\n\nStoryline\n\nPosing as a hangman, Mace Bishop arrives in town with the intention of freeing a gang of outlaws, including his brother, from the gallows. Mace urges his younger brother to give up crime. The sheriff chases the brothers to Mexico. They join forces, however, against a group of Mexican bandits.\n\nUser Review\nBandolero starts out as an amiable western. Former Quantrill raider Dean Martin gets caught robbing a bank where Raquel Welch's husband was killed. He and his gang are sentenced to hang and the town of Valverde Texas even sends for a professional hangman to do it right. Of course Dean's brother James Stewart hears about it and waylays the hangman and takes his place.\n\nStewart helps effect an escape for the outlaws minutes before the hanging. And after Dean and his gang get away, Stewart goes and robs the bank that they were unsuccessful in robbing in the first place.\n\nUp to this point Bandolero is one of the funniest westerns I've ever seen and had the film stopped right there and been a television special it would have gotten rave reviews.\n\nBut Bandolero changes and becomes deadly serious as a posse led by Sheriff George Kennedy and Deputy Andrew Prine chase them across the border and into Bandolero (bandit) country. Mexican bandits who have no use for Americans. These are probably the ancestors of Alfonso Bedoya's bunch from Treasure of the Sierra Madre. Along the way Stewart and Martin connect and Martin takes Raquel Welch as a hostage.\n\nBandolero is a good film, but it's far better in the beginning when it is played for laughs than when it becomes serious. Still I would recommend it to western fans.","torrent":{"xt":"urn:btih:09ccbc706afe798c5aa24ea51d85275f2da9a736","amp;dn":"Bandolero%21+%28Western%29+%7BJames+Stewart%2C+Dean+Martin%7D+%5B1968%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ccbc706afe798c5aa24ea51d85275f2da9a736","infoHashBuffer":{"type":"Buffer","data":[9,204,188,112,106,254,121,140,90,162,78,165,29,133,39,95,45,169,167,54]},"announce":[],"urlList":[]}}