{"title":"Call Me Ted","uid":8502079,"size":4592017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09ef84bce3dcd51eecf42675bdc532ba526e1a6b&amp;dn=Call+Me+Ted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1369329451,"description":"\nBill Burke, Ted Turner, &quot;Call Me Ted&quot;\nEnglish | ISBN: 0446582034 | 2009 | EPUB | 448 pages | 4,3 MB\n\n&quot;Early to bed, early to rise, work like hell and advertise!&quot;\n\nThese words of fatherly advice helped shape Ted Turner's remarkable life, but they only begin to explain the colorful, energetic, and unique style that has made Ted into one of the most amazing business executives of our time. Along the way - among his numerous accomplishments -- Ted became one of the richest men in the world, the largest land owner in the United States, revolutionized the television business with the creation of TBS and CNN, became a champion sailor and winner of the America's Cup, and took home a World Series championship trophy in 1995 as owner of the Atlanta Braves.\nAn innovative entrepreneur, outspoken nonconformist, and groundbreaking philanthropist, Ted Turner is truly a living legend, and now, for the first time, he reveals his personal story. From his difficult childhood to the successful launch of his media empire to the catastrophic AOL/Time Warner deal, Turner spares no details or feelings and takes the reader along on a wild and sometimes bumpy ride.\nYou'll also hear Ted's personal take on how we can save the world...share his experiences in the dugout on the day when he appointed himself as manager of the Atlanta Braves....learn how he almost lost his life in the 1979 Fastnet sailing race (but came out the winner)...and discover surprising details about his dealings with Fidel Castro, Mikhail Gorbachev, Jimmy Carter, Bill Gates, Jack Welch, Warren Buffett, and many more of the most influential people of the past half century.","torrent":{"xt":"urn:btih:09ef84bce3dcd51eecf42675bdc532ba526e1a6b","amp;dn":"Call+Me+Ted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ef84bce3dcd51eecf42675bdc532ba526e1a6b","infoHashBuffer":{"type":"Buffer","data":[9,239,132,188,227,220,213,30,236,244,38,117,189,197,50,186,82,110,26,107]},"announce":[],"urlList":[]}}