{"title":"The Durutti Column - Vini Reilly [1989][EAC,log,cue. FLAC]","uid":8156021,"size":388912323,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0a09c4746078529471bdb5eb039c0a011e72e37f&amp;dn=The+Durutti+Column+-+Vini+Reilly+%5B1989%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":23,"time":1361170189,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Release: Vini Reilly\nMusicBrainz: 42c44fd1-bbde-4db4-baf4-ee34e35ca0e5\nReleased: 1989-03 / 1996-11\nLabel: Factory Once\nCatalog#: Facdo 244\nCountry: GB\n\nTracklisting:\n\n01. Love No More (02:47)\n02. Pol in G (03:00)\n03. Opera I (02:13)\n04. People's Pleasure Park (04:59)\n05. Red Square (03:12)\n06. Finding the Sea (09:48)\n07. Otis (04:17)\n08. William B (02:15)\n09. They Work Every Day (03:57)\n10. Opera II (02:58)\n11. Homage to Catalonea (02:04)\n12. Requiem Again (04:04)\n13. My Country (03:00)\n14. Paradise Passage Road (02:15)\n15. Les Preger's Tune (02:42)\n16. Buddhist Prayer (03:01)\n17. Misere (02:29)\n18. Real Drums - Real Drummer (02:42)\n19. Pathway (02:18)\n20. Rob Grey's Elegy (04:02)\n21. Shirt No. 7 (02:28)\n\nLess of an intentionally confusing title than might be thought, Reilly for all intents and purposes is Durutti no matter the changes through the years -- Vini Reilly does signal another new phase of the band's work, moving into a full embrace of technological possibilities via an Akai sampler. With Reilly and Mitchell joined by a slew of guests -- Swing Out Sister keyboardist Andy Connell; singers Pol, Rob Gray, and Liu Sola; and even former member John Metcalfe on the epic surge &quot;Finding the Sea&quot; -- Durutti this time around pursued the organic/machine combination to even more successful conclusions than on The Guitar. Reilly's singing has often come in for criticism (unwarranted, really, considering how his soft approach effortlessly suits the general atmosphere of Durutti's work), so the slew of sampled and borrowed snippets from other vocalists and musicians that pepper the album makes for an intriguing change. &quot;Love No More,&quot; the album opener, shows how the approach can work, with acoustic guitar to the fore and echoed, truly haunting snippets of what sound like soul and opera singers wafting through the mix. Another full-on highlight is &quot;Otis,&quot; with Pol's live singing and Connell's keyboards combining with a brisk synth loop, building Mitchell drums, an astonishing, uplifting Reilly guitar line, and the legendary singer Mr. Redding himself in a combination that needs to be heard. Mitchell's overall work on percussion is less prominent than before but still present, while Reilly's guitar efforts are again simply wonderful, further testing new approaches on both acoustic and electric that call to mind everyone from John Fahey to Bootsy Collins. If that last comparison seems strange, give the loud and funky &quot;People's Pleasure Park&quot; a listen, then marvel at how Sola's lovely singing and Reilly's further guitar runs transform it yet again. The 1996 reissue is one of the most comprehensive of the series, including not merely two more tracks recorded around that time but selections from Sporadic Recordings. Given by Reilly to a friend to release, as Factory otherwise couldn't easily fit it into its own schedule, it's a generally more stripped-down affair. The six numbers here include a variety of winners like the upbeat, appropriately titled &quot;Real Drums -- Real Drummer&quot; and the Pat Nevin/football tribute &quot;Shirt No. 7.&quot;\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:0a09c4746078529471bdb5eb039c0a011e72e37f","amp;dn":"The+Durutti+Column+-+Vini+Reilly+%5B1989%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a09c4746078529471bdb5eb039c0a011e72e37f","infoHashBuffer":{"type":"Buffer","data":[10,9,196,116,96,120,82,148,113,189,181,235,3,156,10,1,30,114,227,127]},"announce":[],"urlList":[]}}