{"title":"Global Underground 31- Dubfire- Taipei","uid":4753502,"size":145607431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a8eabee6389257d3583dfac7754d1125f6ba890&amp;dn=Global+Underground+31-+Dubfire-+Taipei&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"piratzee","files":29,"time":1236325300,"description":"Alright people I'm finally back posting up some more.  You know we techno freaks are supposed to be all about the love so what's up with the no love??  Yea I'm a hit n runner too but a little love here n there is always nice.  Plus I've been trying to get some good suggestions from my fellow tech-heads on some good mixes or other albums to check out n no one's hooking me up.  Share the wealth kids...upload your best albums and let me n everyone else know in the comments area about your suggestions.  I don't know bout u guys but I love this music and am always seeking out the best stuff i can find but haven't come across much so please share with everyone and myself your suggestions.  It would be much appreciated.  Okay now that I'm done bitching I hope all of you enjoy.\n\nHere's Dubfire's (AKA DEEP DISH) first solo release w/ GU.  It's got some pretty hot trax on it.  I think Sharam's release blew his away but it is a little different in style than Sharam's release.  Little harder and well, I guess, see for yourself.  And kids don't put up with your X-dealers trying to push bunk ass shit on u.  Next time he tries to pull a fast one on u...stick them so far up his ass that they come out the other dickhead's mouth that he bought them from... and finally support your local djs\n\nSeed for a while people please so I can keep posting up more and also so these torrents don't die.  It seems like all the ones I've put up so far are doing really well but if you find one that u can't finish let me know and I'll seed it.","torrent":{"xt":"urn:btih:0a8eabee6389257d3583dfac7754d1125f6ba890","amp;dn":"Global+Underground+31-+Dubfire-+Taipei","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a8eabee6389257d3583dfac7754d1125f6ba890","infoHashBuffer":{"type":"Buffer","data":[10,142,171,238,99,137,37,125,53,131,223,172,119,84,209,18,95,107,168,144]},"announce":[],"urlList":[]}}