{"title":"All In The Family - Season 5 (Classic TV Comedy)","uid":5638187,"size":6304817796,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b328265a2f95a0b5212c77946c3cccbdbe0a9e0&amp;dn=All+In+The+Family+-+Season+5+%28Classic+TV+Comedy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"rambam1776","files":-1,"time":1276975354,"description":"All In The Family - Typical Episode Stats\n\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1147kbps \nDuration.............: 25:55.536\nResolution...........: 624*478 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/All_in_the_family&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/All_in_the_family&lt;/a&gt;\n\n\nAll in the Family is an American situation comedy that was originally broadcast on the CBS television network from January 12, 1971 to April 8, 1979. In September 1979, the show was revamped, and given a new title, Archie Bunker's Place. This version of the sitcom lasted another four years, ending its run in 1983.\n\nProduced by Norman Lear, it was based on the British television comedy series Till Death Us Do Part. The show broke ground in its depiction of issues previously considered unsuitable for U.S. network television comedy, such as racism, homosexuality, women's liberation, rape, miscarriage, breast cancer, menopause and impotence.\n\nThe show ranked #1 in the yearly Nielsen ratings from 1971 to 1976. As of 2009 it has, along with The Cosby Show and American Idol, been one of the only shows to top the ratings for at least five consecutive seasons. TV Guide's 50 Greatest TV Shows of All Time ranked All in the Family as #4. Bravo also named the show's protagonist, Archie Bunker, TV's greatest character of all time.\n\nPremise\n\nThis long-running comedy revolved around Archie Bunker (Carroll O'Connor), a working-class World War II veteran. He was a very outspoken bigot, seemingly prejudiced against everyone who was not a U.S.-born, politically conservative, heterosexual White Anglo-Saxon Protestant, and dismissive of anyone not in agreement with his view of the world. His ignorance and stubbornness tend to cause his malapropism-filled arguments to self-destruct. He often responds to uncomfortable truths by blowing a raspberry. He longs for simpler times, when people sharing his viewpoint were in charge, as evidenced by the nostalgic theme song, &quot;Those Were the Days,&quot; the show's original title. (In the first pilot, the family name was Justice rather than Bunker.)\n\nBy contrast, his wife Edith (Jean Stapleton) is a sweet, understanding, if somewhat naive woman. She usually defers to her husband, but on the rare occasions when she takes a stand, she proves to be one of the wisest characters, for example in the episodes &quot;The Battle of the Month&quot; and &quot;The Games Bunkers Play&quot;. Archie often tells her to &quot;stifle&quot; herself and calls her a &quot;dingbat&quot;,[4] but despite their very different personalities, they love each other deeply.\n\nThey have one child, Gloria (Sally Struthers), who is married to college student Michael Stivic (Rob Reiner), who is referred to as &quot;Meathead&quot; by Archie, and &quot;Mike&quot; by nearly everyone else. Mike is part of the counterculture of the 1960s. He and Archie represent the real-life clash between the two generations: those who were born around World War I and those who were born around World War II. They constantly clash over religious, political, social, and personal issues. For much of the series, the Stivics live in the Bunkers' home to save money, providing even more opportunity for the two men to irritate each other. When Mike finally graduates college and the Stivics move out, it turns out to be to the house next door, offered to them by George Jefferson, the Bunkers' former neighbor, who knows it will irritate Archie. In addition to calling him &quot;Meathead&quot;, Archie also frequently cites Mike's Polish ancestry, referring to him as a &quot;dumb Polack&quot; (pronounced Polock).\n\nThe show is set in the Astoria section of Queens, one of New York City's five boroughs, with the vast majority of scenes taking place in the Bunkers' home (and later, frequently the Stivics' home), with occasional scenes taking place in other locations, most often (especially during later seasons), Kelcy's Bar, a neighborhood tavern, where Archie spends a good deal of time and which he eventually buys.\t\t\n\n\n\n    &lt;a href=&quot;\nhttp://bayimg.com/image/aanhoaacb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aanhoaacb.jpg&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066626/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066626/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:0b328265a2f95a0b5212c77946c3cccbdbe0a9e0","amp;dn":"All+In+The+Family+-+Season+5+%28Classic+TV+Comedy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b328265a2f95a0b5212c77946c3cccbdbe0a9e0","infoHashBuffer":{"type":"Buffer","data":[11,50,130,101,162,249,90,11,82,18,199,121,70,195,204,203,219,224,169,224]},"announce":[],"urlList":[]}}