{"title":"Metabolomics in Food and Nutrition","uid":15320342,"size":5944716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b6bb9faf33dd682b0b77f45838039a7a1ebc535&amp;dn=Metabolomics+in+Food+and+Nutrition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1468638460,"description":"Metabolomics in Food and Nutrition - Bart C. Weimer, Carolyn Slupsky (WP, 2013).pdf\r\n\r\nISBN 978-1-84569-512-5\r\n\r\nMetabolomics enables valuable information about the biochemical composition of foods to be rapidly obtained. Since the biochemical profile of food largely determines key food properties such as flavour and shelf life, the information gained using metabolomics-based methods will enable greater control of food quality and also help to determine the relationship between diet and health. Metabolomics in food and nutrition provides an overview of their current and potential use in the food industry.\r\n\r\nPart one reviews equipment, methods and data interpretation in metabolomics including the use of nuclear magnetic resonance (NMR), statistical methods in metabolomics, and metabolic reconstruction databases and their application to metabolomics research. Part two explores applications of metabolomics in humans, plants and food. Chapters discuss metabolomics in nutrition, human samples for health assessments, and current methods for the analysis of human milk oligosaccharides (HMOs) and their novel applications. Further chapters highlight metabolomic analysis of plants and crops, metabolomics for the safety assessment of genetically modified (GM) crops, and applications of metabolomics in food science including food composition and quality, sensory and nutritional attributes.\r\n\r\nWith its distinguished editors and team of expert contributors, Metabolomics in food and nutrition is a technical resource for industrial researchers in the food and nutrition sectors interested in the potential of metabolomics methods and academics and postgraduate students working in the area.\r\n\r\nProvides an overview of the current and potential future use of metabolomics in the food industry\r\nChapters focus on key applications and review the analytical methods used and the bioinformatics techniques involved in processing the results\r\nDiscusses metabolomics in nutrition, human samples for health assessments, and current methods for the analysis of human milk oligosaccharides (HMOs) and their novel applications","torrent":{"xt":"urn:btih:0b6bb9faf33dd682b0b77f45838039a7a1ebc535","amp;dn":"Metabolomics+in+Food+and+Nutrition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b6bb9faf33dd682b0b77f45838039a7a1ebc535","infoHashBuffer":{"type":"Buffer","data":[11,107,185,250,243,61,214,130,176,183,127,69,131,128,57,167,161,235,197,53]},"announce":[],"urlList":[]}}