{"title":"Top Dog: The Science of Winning and Losing","uid":8348566,"size":194724897,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b9ae16222c162b339acbf9c22047b23c32af701&amp;dn=Top+Dog%3A+The+Science+of+Winning+and+Losing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365269591,"description":"Top Dog: The Science of Winning and Losing by Po Bronson and Ashley Merryman\nAudiobook UNABRIDGED | English | 2013 | ISBN: 1611130123 | ASIN: B00B77J4Q6 | m4b | AAC 1 ch 48 Kbps | 9 hrs 6 min | 186 MB\n\nIt's a Dog Eat Dog World. Don't Be on the Menu.\nWhat are the differences between a winning and losing performance? Why are we able to rise to the challenge one day, but wilt from it the next? Can we in fact become better competitors? In TOP DOG, Po Bronson and Ashley Merryman use cutting edge science to tease out the hidden factors at the core of every great triumph - and every tragic failure. By enabling you to identify your own competitive style, TOP DOG will help you tip the odds of success in your favor. Integrating wisdom from politics, finance, genetics, neuroscience, psychology, military training, sports, economics, education and more, TOP DOG offers counterintuitive, game-changing insights into the nature of competition, such as:\n- Why the home field advantage in sports is just as relevant in diplomacy and deal-making\n- That women are better at judging risk, while men are better at ignoring it - and how this plays out on K Street and Wall Street\n- Why younger siblings are more competitive than first-borns, and how early-childhood influences shape competitive styles forever\n- That the shape of entrepreneurs' hands can be just as revealing as their business plans\n- How a single biochemical can predict a winner before an event has even begun\n- Why discord can be better than harmony, and why stars on a team do deserve special treatment.\n\nAs President Dwight Eisenhower said, &quot;What counts is not necessarily the size of the dog in the fight-it's the size of the fight in the dog.&quot; In TOP DOG, Po Bronson and Ashley Merryman reveal the size of the fight in all of us.\n","torrent":{"xt":"urn:btih:0b9ae16222c162b339acbf9c22047b23c32af701","amp;dn":"Top+Dog%3A+The+Science+of+Winning+and+Losing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b9ae16222c162b339acbf9c22047b23c32af701","infoHashBuffer":{"type":"Buffer","data":[11,154,225,98,34,193,98,179,57,172,191,156,34,4,123,35,195,42,247,1]},"announce":[],"urlList":[]}}