{"title":"Louie.S03E10.HDTV.x264.MP3-LOL.avi","uid":7585076,"size":135528448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0bbe3b0d0511ae2864e01d72ce93cc95c67ddb75&amp;dn=Louie.S03E10.HDTV.x264.MP3-LOL.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1346391812,"description":"This episode is 18:58, but seems all there.\n\nLouie CK - commedian\n\n-----------------\n\nIf there is someone out there who CANNOT play the recent wave of MP4 files\nand would Like an AVI version (no promises) - I read all comments.\n\nAnyone can do this - here's how:\n\nYou will need - MP4Cam2AVI\nYou may need - AtomicParsley\n\nMP4Cam2AVI is a completely LossLess conversion process.\nI call it CC2AVI - &quot;Container Conversion To AVI&quot;.\nIt allows you to &quot;pour&quot; X264 MP4 encodes into an AVI container.\nYou can keep the AAC audio in the conversion process.\nSince VLC doesn't recognize AAC audio in an AVI container,\nI convert the audio to MP3 for universal compatibility.\n\nConversion takes a minute or so, depending on file size.\nFor some MP4 files there's something in the header info that causes:\n&quot;floating point division by zero&quot; error.\n\nLooking high and low I found a way to rewrite the header.\nNow (almost) everything seems to work just fine.\nIt's a command line utility. The syntax to use is:\n\nAtomicParsley &lt;MP4 filename&gt; -f true\n\nUnless the file is already flagged as a podcast (in which case, choose 'false')\nthis rewrites the MP4 header so that it now thinks it's a podcast. Since the\nCC2AVI process does not carry this info to the AVI - this doesn't matter.\nWhat matters is that the header information is rewritten so you no longer\nget an error.\n\nThere is still a very minor remaining problem - if the MP4 is too large,\nMP4cam2AVI just sits there failing to read the header. Sigh ...\n\nHave all those MP4 files and an old tablet that can't play them?\nWant to use your favorite AVI editing tools?\nWish you could back up frame by frame in Media Player Classic?\nNow you too can turn any MP4 encode into your favorite AVI.\n\n--------------------\n\nI choose to remain (mostly) anonymous because we are being watched.\n... OK, because I'm paranoid ... that doesn't mean we're not being watched.\nI don't do movies (MPAA) or music (RIAA), but I'm still not sure if it's safe.\nYou don't need to know me - you only need to know my work.\n\nI NEVER claim an x264 encoding credit. I GIVE proper credit where due.\n\nMy offerings are clearly identifiable:\nuse search term &quot;x264.MP3*.avi&quot;\nWithout quotes for TPB.\nWith quotes for Google.\n\nSo, you've probably seen the last of MP4SUX XVID AVI encodes.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:0bbe3b0d0511ae2864e01d72ce93cc95c67ddb75","amp;dn":"Louie.S03E10.HDTV.x264.MP3-LOL.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bbe3b0d0511ae2864e01d72ce93cc95c67ddb75","infoHashBuffer":{"type":"Buffer","data":[11,190,59,13,5,17,174,40,100,224,29,114,206,147,204,149,198,125,219,117]},"announce":[],"urlList":[]}}