{"title":"The Pearl that Broke Its Shell - Nadia Hashimi","uid":11680129,"size":13702714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c5234e7dd5e6d722ad60de171633e9c2e641a23&amp;dn=The+Pearl+that+Broke+Its+Shell+-+Nadia+Hashimi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1423044223,"description":"Afghan-American Nadia Hashimi's literary debut novel is a searing tale of powerlessness, fate, and the freedom to control one's own fate that combines the cultural flavor and emotional resonance of the works of Khaled Hosseini, Jhumpa Lahiri, and Lisa See.\n\nIn Kabul, 2007, with a drug-addicted father and no brothers, Rahima and her sisters can only sporadically attend school, and can rarely leave the house. Their only hope lies in the ancient custom of bacha posh, which allows young Rahima to dress and be treated as a boy until she is of marriageable age. As a son, she can attend school, go to the market, and chaperone her older sisters.\n\nBut Rahima is not the first in her family to adopt this unusual custom. A century earlier, her great-great grandmother, Shekiba, left orphaned by an epidemic, saved herself and built a new life the same way.\n\nCrisscrossing in time, The Pearl the Broke Its Shell interweaves the tales of these two women separated by a century who share similar destinies. But what will happen once Rahima is of marriageable age? Will Shekiba always live as a man? And if Rahima cannot adapt to life as a bride, how will she survive?","torrent":{"xt":"urn:btih:0c5234e7dd5e6d722ad60de171633e9c2e641a23","amp;dn":"The+Pearl+that+Broke+Its+Shell+-+Nadia+Hashimi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5234e7dd5e6d722ad60de171633e9c2e641a23","infoHashBuffer":{"type":"Buffer","data":[12,82,52,231,221,94,109,114,42,214,13,225,113,99,62,156,46,100,26,35]},"announce":[],"urlList":[]}}