{"title":"Coast To Coast AM 02-08-2015 Nature of Reality","uid":11690293,"size":54556564,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0c7798f1d008c6ae51022d6eb46dddc9fdba57ab&amp;dn=Coast+To+Coast+AM+02-08-2015+Nature+of+Reality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mtPackets","files":6,"time":1423500730,"description":"Coast To Coast AM 02-08-2015 Nature of Reality\n\n    Date: 02-08-15\n    Host: Richard Syrett\nGuests: Jim Elvidge, Dr. Peter Breggin\n\nHost Richard Syrett was joined by engineer and researcher Jim Elvidge for a discussion on the nature of our reality and the possibility that we are living in a digital simulation. &quot;If we are in a digital world, it opens up all kinds of possibilities on how information gets sent back and forth,&quot; he posited, &quot;and it explains an awful lot of things.&quot; To that end, he argued that the concept of a digital universe allows for an explanation on the true nature of matter, which otherwise remains elusive to science, since attempts to find the core density of matter has resulted in the discovery of increasingly smaller particles and even more empty space between them. As such, Elvidge put forward that &quot;matter is data&quot; and &quot;forces are just the rules on how that data interacts.&quot;\n\nElvidge suggested that people are interacting with our digital universe via consciousness that exists outside of the body but is still part of a larger, organized system. He likened the human experience to a computer program aimed at helping consciousness evolve via a fabricated reality. Over one's lifetime, Elvidge theorized, they acquire both basic, superfluous data, which is necessary for navigating and existing in the virtual reality, as well as information that is more critical to the overall positive evolution of individual consciousness. Upon death, the temporary data is discarded while the &quot;soul data&quot; remains with the consciousness as it ventures on another journey into the &quot;reality learning lab&quot; that is the human experience.\n\nWhile traditional science has struggled to find the cause of paranormal activity, Elvidge contended that &quot;data and data leaks are the perfect explanation&quot; for such anomalies. For instance, remote viewing could be the result of one's non-local consciousness gaining access to a piece of information which is part of the proverbial 'source code' of our virtual reality. Additionally, since each consciousness collects its own data, the digital universe model allows for information to be exchanged between two individuals because they actually exist in the same realm outside of the simulated reality experience. &quot;If we want to break down that artificial barrier that was put up that makes us feel individuated, we could,&quot; he mused, &quot;and people who do that are called 'psychics.'&quot;\nCotard's Syndrome\n\nIn the first hour, Harvard-trained psychiatrist Peter Breggin talked about the case of a teenage girl who spent three years of her life convinced she was dead due to a rare medical condition known as 'Cotard's Syndrome.' Breggin asserted that such a condition is really rooted in basic human emotions rather than caused by a disease or brain disorder. As such, he lamented that psychiatrists and neurologists are often more interested in 'finding' a perceived disorder, sometimes for their own personal fame or academic standing, rather than examining these root emotional issues. Similarly, Breggin also noted that patients, themselves, frequently wish to be diagnosed with a disorder since it gives them a socially acceptable reason for their behavior beyond their own feelings.\n\nWebsite(s):\n    theuniversesolved.com\n    breggin.com\n\nBook(s):\n    The Universe - Solved!\n    Medication Madness\n    Guilt, Shame, and Anxiety: Understanding and Overcoming Negative Emotions","torrent":{"xt":"urn:btih:0c7798f1d008c6ae51022d6eb46dddc9fdba57ab","amp;dn":"Coast+To+Coast+AM+02-08-2015+Nature+of+Reality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c7798f1d008c6ae51022d6eb46dddc9fdba57ab","infoHashBuffer":{"type":"Buffer","data":[12,119,152,241,208,8,198,174,81,2,45,110,180,109,221,201,253,186,87,171]},"announce":[],"urlList":[]}}