{"title":"Artificial Intelligence in Chemical Engineering","uid":12124257,"size":29104769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cf10627a61c9e05cc8c119f064cb02b38771f4e&amp;dn=Artificial+Intelligence+in+Chemical+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"clouderone","files":1,"time":1436899609,"description":"Artificial Intelligence in Chemical Engineering - Thomas E. Quantrille, Y. A. Liu (Academic Press, 1991).pdf\n\nISBN: 0125695500\n\nArtificial intelligence (AI) is the part of computer science concerned with designing intelligent computer systems (systems that exhibit characteristics we associate with intelligence in human behavior). This book is the first published textbook of AI in chemical engineering, and provides broad and in-depth coverage of AI programming, AI principles, expert systems, and neural networks in chemical engineering. This book introduces the computational means and methodologies that are used to enable computers to perform intelligent engineering tasks. A key goal is to move beyond the principles of AI into its applications in chemical engineering. After reading this book, a chemical engineer will have a firm grounding in AI, know what chemical engineering applications of AI exist today, and understand the current challenges facing AI in engineering. \n\nKey Features\n* Allows the reader to learn AI quickly using inexpensive personal computers\n* Contains a large number of illustrative examples, simple exercises, and complex practice problems and solutions\n* Includes a computer diskette for an illustrated case study\n* Demonstrates an expert system for separation synthesis (EXSEP)\n* Presents a detailed review of published literature on expert systems and neural networks in chemical engineering","torrent":{"xt":"urn:btih:0cf10627a61c9e05cc8c119f064cb02b38771f4e","amp;dn":"Artificial+Intelligence+in+Chemical+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf10627a61c9e05cc8c119f064cb02b38771f4e","infoHashBuffer":{"type":"Buffer","data":[12,241,6,39,166,28,158,5,204,140,17,159,6,76,176,43,56,119,31,78]},"announce":[],"urlList":[]}}