{"title":"How to Cheat in Maya 2014 [PDF]","uid":9300280,"size":18619424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d0f0c5dc9d66ea0e186fdf0694a6ed0951899cd&amp;dn=How+to+Cheat+in+Maya+2014+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"F1restorm","files":-1,"time":1386229318,"description":"How to Cheat in Maya 2014: Tools and Techniques for Character Animation\nAuthor: Kenny Roy\nPublished: September 3, 2013\nPublisher: Focal Press\nISBN: 9780415826594\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nThis book has a companion website (link in book) with downloadable rigs and video tuts. No registration was required when I checked it.\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_________________________________________________________________________________\n\nAll professional animators know a handful of secrets that give them an edge in a production environment. &quot;How to Cheat in Maya&quot; puts these secrets in your hands! Learn time and energy-saving techniques tested in real Hollywood productions in this book, jam-packed with screenshots and scene files designed to get you up to speed quickly.\n\nFrom menus to modeling, lipsync to lighting, How to Cheat in Maya 2014 covers all of the methods available in the latest version of Maya. Get up to speed quickly and produce stellar results with these insider workflows. With new, updated cheats for the latest version of Maya, How to Cheat in Maya 2014 is an essential guide for amateur and professional 3D animators alike. Fully updated with gold-mine coverage including: expanded sections on production workflow, all new chapters covering rigging cheats and Maya's referencing tools, and brand new project files demonstrating production-proven techniques.\n\nThe companion website includes complete scene files for exercises and techniques, extra rigs, Quicktime movies of full projects, and video tutorials.","torrent":{"xt":"urn:btih:0d0f0c5dc9d66ea0e186fdf0694a6ed0951899cd","amp;dn":"How+to+Cheat+in+Maya+2014+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0f0c5dc9d66ea0e186fdf0694a6ed0951899cd","infoHashBuffer":{"type":"Buffer","data":[13,15,12,93,201,214,110,160,225,134,253,240,105,74,110,208,149,24,153,205]},"announce":[],"urlList":[]}}