{"title":"Janine Jansen (Violin),Riccardo Chailly-Mendelssohn,Bruch TQMP","uid":4901537,"size":336004630,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d8d98925832dd60798588f82360e00ea7e5000b&amp;dn=Janine+Jansen+%28Violin%29%2CRiccardo+Chailly-Mendelssohn%2CBruch+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Breezin","files":12,"time":1242660082,"description":"Splendid Performances of Mendelssohn and Bruch Pieces from Janine Jansen, Ricardo Chailly and the Leipzig Gewandhaus Orchestra.\n\nQuotes from amazon.com (avg 4.5 stars)\n\n&quot;The ONE for Mendelssohn concerto! This is an absolutely stunning performance! Although I love Mendelssohn's violin concerto so much I hesitated buying this CD at once. I just had hard time finding the ONE recording for my taste believe or not. However this beautiful young lady impressed me way much more than I expected! Wonderful feeling, power, technique are there with a great tonality. Orchestra/Chally is superb, really a great work all together. I guess this will stop me from hunting for another great recording of the Mendelssohn for a while. By the way, Bruch concerto is also quiet nice (Kyung Hwa Chung's is still my favorite) and the viola romance is just so beautiful! It is hard to get disappointed with this recording so try it!&quot;\n\n&quot;Absolutely refreshing and breathtaking! Janine Jansen first caught my ears when I heard her play the Introduction and Rondo Capriccioso on the radio. I remember thinking: &quot;Wow, who played this? I have to find out when I get home.&quot; Since then, I have acquired her Four Seasons recording which has completely redefined the old classic for me. Perhaps it's not as &quot;faithful&quot; as some of the other recordings out there, but it is Janine Jansen's fresh energy and lively interpretation that really gives her playing the uniqueness that words cannot describe. When I saw her new album featuring my favorite violin concerto, the Mendelssohn, I was immediately tempted to buy it. But as I already own more than 10 recordings of it, I decided to not waste my money on yet another contemporary artist. However, when I heard a high quality sample on iTunes of her Mendelssohn and Bruch, I just COULD NOT prevent myself from buying it. What makes her recording so attractive are the small but noticeable details in interpretation that truly sets these pieces apart from the hundreds of other recordings. I'm not saying that it's necessarily &quot;better&quot; or &quot;worse&quot; than recordings from Heifetz, Milstein, Oistrach, Menuhin, Perlman, and etc. but Janine Jansen has 100% captured my heart with these superb renditions. Her playing in the final movements of these two concertos are so good that I would not hesitate to make this CD my new first recommendation for those who do not own the Mendelssohn or Bruch violin concertos. This has by far been my most satisfying CD purchase in a year and will be at the top of my collection :)&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork.\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a5c7d7c0c0dfcccbe5c9ccd3c08bcbc9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:0d8d98925832dd60798588f82360e00ea7e5000b","amp;dn":"Janine+Jansen+%28Violin%29%2CRiccardo+Chailly-Mendelssohn%2CBruch+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8d98925832dd60798588f82360e00ea7e5000b","infoHashBuffer":{"type":"Buffer","data":[13,141,152,146,88,50,221,96,121,133,136,248,35,96,224,14,167,229,0,11]},"announce":[],"urlList":[]}}