{"title":"Risk Management and Shareholders' Value in Banking: From Risk Me","uid":9767071,"size":7374150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0de8b583ee2864784e0c3e89ee3879d0cb4fcfc4&amp;dn=Risk+Management+and+Shareholders%27+Value+in+Banking%3A+From+Risk+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394895971,"description":"2007-05-26 | ISBN: 0470029781 | PDF | 808 pages | 7.03 Mb\n\nThis book presents an integrated framework for risk measurement, capital management and value creation in banks. Moving from the measurement of the risks facing a bank, it defines criteria and rules to support a corporate policy aimed at maximizing shareholders' value.\nParts I - IV discuss different risk types (including interest rate, market, credit and operational risk) and how to assess the amount of capital they absorb by means of up-to-date, robust risk-measurement models. Part V surveys regulatory capital requirements: a special emphasis is given to the Basel II accord, discussing its economic foundations and managerial implications. Part VI presents models and techniques to calibrate the amount of economic capital at risk needed by the bank, to fine-tune its composition, to allocate it to risk-taking units, to estimate the &quot;fair&quot; return expected by shareholders, to monitor the value creation process. Risk Management and Shareholders' Value in Banking includes:\n* Value at Risk, Monte Carlo models, Creditrisk+, Creditmetrics and much more\n* formulae for risk-adjusted loan pricing and risk-adjusted performance measurement\n* extensive, hands-on Excel examples are provided on the companion website www.wiley.com/go/rmsv\n* a complete, up-to-date introduction to Basel II\n* focus on capital allocation, Raroc, EVA, cost of capital and other value-creation metrics","torrent":{"xt":"urn:btih:0de8b583ee2864784e0c3e89ee3879d0cb4fcfc4","amp;dn":"Risk+Management+and+Shareholders%27+Value+in+Banking%3A+From+Risk+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0de8b583ee2864784e0c3e89ee3879d0cb4fcfc4","infoHashBuffer":{"type":"Buffer","data":[13,232,181,131,238,40,100,120,78,12,62,137,238,56,121,208,203,79,207,196]},"announce":[],"urlList":[]}}