{"title":"Glory Hole Girlz #6 [DVDRip]","uid":10859075,"size":1462054912,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0e945497dd68dfe53bc7adbceb4ba2a4d9395bc9&amp;dn=Glory+Hole+Girlz+%236+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"chkm8te","files":2,"time":1408873107,"description":"Glory Hole Girlz #6 [DVDRip]\n\nKelli, Kim, Ally, Kristy, Shirley\n\nSHORT BLONDE SPINNER SUCKING STRANGER'S COCKS! Shirley is a cute short blonde spinner chick that Dirty D met in the grocery store. They had an interesting conversation about how much she likes to give head while waiting in line. Afterwards Dirty D brings Shirley to the Glory Hole to prove her oral skills. She may be short and sweet, but Shirley really knows how to suck cock!\n\nCOCK STARVED GREASE MONKEY! Kim is a cock starved little grease monkey. She has always been a tomboy, hanging around big burly mechanics. They cock block Kim at the bar and treat her like their little sister. She can never get any dick! Dirty D took this cock hungry little slut to the Glory Hole to get her freak on with all the cocks she could handle. Watch as Kim pumps and strokes these strangers pistons draining all of their fluids!\n\nBIKER CHICK BLOWING STRANGERS! Kelli is a bad ass biker babe. Dirty D met Kelli at a bike show, when she came over to check out his ride. Kelli said she likes to get wild and freaky. Dirty D had Kelli hop on the back of his bike and they rode over to the hole. Kelli was a little scared of the seedy adult bookstore, but she was not afraid of sucking dick! Watch Kelli as she slurps cum from total stranger's cocks!\n\nSUCKING OFF HORNY PERVERTS! Ally is an all natural petite sexy college girl. Dirty D met Ally in a bookstore coffee shop. She was thumbing through the Kama Sutra. Dirty D knew that was a sure sign she likes to get freaky. After Dirty D told her about the Glory Hole she was ready to roll. Watch Ally as she makes short work of these horny perverts with her oral skills. Ally gets herself so worked up she slips one guy's cock in her tight shaved pussy!\n\nBOOTY SHAKE AND SUCK! Dirty D met Kristy at a local night club right after she won the weekly booty shake contest. Kristy said she gets off from, the attention of all the guys staring at her juicy round ass. Dirty D said he would take her to a place where she could get all of the guys off. Watch Kristy prove that ass shaking is not her only talent as she makes short work of each horny stranger's cock!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rh5iyxluyv8q7hzp7yqd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rh5iyxluyv8q7hzp7yqd.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=lppu5c1pkxc7xsj6bdy3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=lppu5c1pkxc7xsj6bdy3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=uk51bommrb2y47pictrn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=uk51bommrb2y47pictrn.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0e945497dd68dfe53bc7adbceb4ba2a4d9395bc9","amp;dn":"Glory+Hole+Girlz+%236+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e945497dd68dfe53bc7adbceb4ba2a4d9395bc9","infoHashBuffer":{"type":"Buffer","data":[14,148,84,151,221,104,223,229,59,199,173,188,235,75,162,164,217,57,91,201]},"announce":[],"urlList":[]}}