{"title":"SweetScape 010 Editor v 4.01 + serial","uid":7468862,"size":13135447,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0ea165c885cc639267e5989f65458ecf6563078a&amp;dn=SweetScape+010+Editor+v+4.01+%2B+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mrriser007","files":-1,"time":1343085433,"description":"SweetScape 010 Editor is a professional-grade text editor and hex editor designed to quickly and easily edit any file or drive on your computer. Combining an easy-to-use interface with a whole range of editing tools, 010 Editor is a valuable tool for anyone working with text or binary files. One of the most powerful features of 010 Editor is the ability to parse virtually any binary file using a Binary Template. Instead of browsing through a long range of hex bytes as with traditional hex editors, Binary Templates allow a file to be understood. Templates are easy to write and can be used to completely parse any data format, such as BMP or ZIP files (Templates for reading these files are included with 010 Editor).\n\nA Binary Template looks similar to a C/C++ structure, but is actually run as a program. Every time a variable is declared in a Template, that variable is mapped to a set of hex bytes in a file. Data in the file can then be read or written by modifying the variable. Because the Template is run as a program, if, for, or while statements as well as functions or complex expressions can be used. When a Template is run, the defined variables can be edited using the Template Results, as shown on the left. New Templates can be added to 010 Editor and can even be configured to run automatically when a file is loaded.\n\nVersion 4.0.1 - June 6th, 2012\n\n    Fixed crash with a custom Auto-Inspector and certain long operations.\n    Fixed crash with wordwrap on very long lines.\n    Fixed Paste from Hex Text on Mac OS X.\n    Fixed clicking on a bookmark, variable, or find result will always select bytes in the editor.\n    Fixed editing bookmarks that contain arrays.\n    Fixed issues with the Find results when searching for text containing linefeeds.\n    Fixed enums and different numeric formats when displaying local variables.\n    Fixed adding or removing 010 Editor from the Windows Explorer right-click menu using the Options dialog.\n    Fixed the Output tab automatically scrolling down as text is added.\n    Fixed the FindNext function should not be selecting data.\n    Fixed the FindNext function when used with DeleteBytes in a loop.\n    Fixed crash with the HexOperation function on a new file.\n    Fixed the Short type specifier in the Goto Bar.\n    Fixed allowing hotkeys to be set for Mark Selection Start/End.\n    Fixed misplaced cursor when changing the endian of a Unicode file.\n    The Goto and Select Range Bars now accept extra whitespace. ","torrent":{"xt":"urn:btih:0ea165c885cc639267e5989f65458ecf6563078a","amp;dn":"SweetScape+010+Editor+v+4.01+%2B+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ea165c885cc639267e5989f65458ecf6563078a","infoHashBuffer":{"type":"Buffer","data":[14,161,101,200,133,204,99,146,103,229,152,159,101,69,142,207,101,99,7,138]},"announce":[],"urlList":[]}}