{"title":"Emma Donoghue - Kissing the Witch (pdf)","uid":10800242,"size":1453733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f06c90132f454aaa9ae490ff14e3ed2b7c67ba5&amp;dn=Emma+Donoghue+-+Kissing+the+Witch+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1408337779,"description":"Emma Donoghue - Kissing the Witch: Old Tales in New Skins (HarperCollins, 1997). 228 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate metadata and pagination, etc.\n\n\ndescription:\n\nThirteen tales are unspun from the deeply familiar, and woven anew into a collection of fairy tales that wind back through time. Acclaimed Irish author Emma Donoghue reveals heroines young and old in unexpected alliances - sometimes treacherous, sometimes erotic, but always courageous. Told with luminous voices that shimmer with sensuality and truth, these age-old characters shed their antiquated cloaks to travel a seductive new landscape, radiantly transformed. Cinderella forsakes the handsome prince and runs off with the fairy godmother; Beauty discovers the Beast behind the mask is not so very different from the face she sees in the mirror; Snow White is awakened from slumber by the bittersweet fruit of an unnamed desire. \n\nAcclaimed writer Emma Donoghue spins new tales out of old in a magical web of thirteen interconnected stories about power and transformation and choosing one's own path in the world. In these fairy tales, women young and old tell their own stories of love and hate, honor and revenge, passion and deception. Using the intricate patterns and oral rhythms of traditional fairy tales, Emma Donoghue wraps age-old characters in a dazzling new skin.\n\n\nAuthor Biography:\nEmma Donoghue has made a name for herself overseas as the host of a literary talk show on Irish TV, and is an established playwright whose work has been performed in Dublin and Cambridge. She is the editor of Poems Between Women: Four Centuries of Love, Romantic Friendship and Desire, and the author of novels Hood and Stir-Fry. She currently lives in Cambridge, England.\n\n","torrent":{"xt":"urn:btih:0f06c90132f454aaa9ae490ff14e3ed2b7c67ba5","amp;dn":"Emma+Donoghue+-+Kissing+the+Witch+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f06c90132f454aaa9ae490ff14e3ed2b7c67ba5","infoHashBuffer":{"type":"Buffer","data":[15,6,201,1,50,244,84,170,169,174,73,15,241,78,62,210,183,198,123,165]},"announce":[],"urlList":[]}}