{"title":"Trick Baby (1972) - DVDRip","uid":6147923,"size":739391535,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f21d4ce3ac2c09ce9cde2ac56aeb089d8438fca&amp;dn=Trick+Baby+%281972%29+-+DVDRip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jericho_cane","files":2,"time":1296761411,"description":"While this movie is set mostly in the Black neighborhoods of Philadelphia, many of the Whites are quite prejudiced and many of the actors are Black, this really isn't a blaxploitation film--though Netflix has categorized it that way on its web site. Instead, it's like a more modern version of THE STING with a multiracial cast.\n\nMel Stewart (&quot;Henry Jefferson&quot; from ALL IN THE FAMILY) and Kiel Martin star as con-men who swindle the wrong man. The old guy they cheat out of $10,000 suffers a fatal heart attack when he realizes he was swindled AND he's the uncle of a mob boss--who now has ordered the deaths of these cons. However, unlike THE STING, there is some rough language, nudity and a very, very downbeat ending. I enjoyed the film and appreciated seeing these two lesser name actors getting a chance to play leads, but hate seeing it branded with the label &quot;blaxploitation&quot; because many take this to mean that the film is cheap and formulaic--which it certainly isn't. Hardly a great film, it is still well worth a look for an interesting story.","torrent":{"xt":"urn:btih:0f21d4ce3ac2c09ce9cde2ac56aeb089d8438fca","amp;dn":"Trick+Baby+%281972%29+-+DVDRip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f21d4ce3ac2c09ce9cde2ac56aeb089d8438fca","infoHashBuffer":{"type":"Buffer","data":[15,33,212,206,58,194,192,156,233,205,226,172,86,174,176,137,216,67,143,202]},"announce":[],"urlList":[]}}