{"title":"Audiosurf 2 (October 6th Update)","uid":11301423,"size":320670947,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f32cccd86a7b2a2ad98730af7aef72fa20f53d9&amp;dn=Audiosurf+2+%28October+6th+Update%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mantazzo","files":1,"time":1414427318,"description":"As requested, I upload updated version of Audiosurf 2.\n\nVersion: October 6th.\n\nChangelog:\nPerformance and graphic changes:\n\n    Upgraded the game engine to run on DirectX 11 (was DirectX 9). The upgrade gives about a 20% performance boost!\n    However, some skins on workshop will now look wrong due to some of the game's older .shader files not being compiled in a dx11-compatible way. Please let me know about skins you find that no longer look right and I'll work with the skin's author to fix them.\n    Note: it's still possible to run the game in DX9 mode by adding the launch option &quot;-force-d3d9&quot; (without the quotes)\n    Added Ultra quality setting, so there's now 4 quality levels available in the game options. Most skins run with the exact same settings whether High or Ultra is selected.\n    The stadium skin on High quality now runs about twice as fast and looks a bit less detailed.\n    The stadium skin on Ultra quality now looks even better than it used to look on High quality and also runs faster.\n    Added ability for skins to use post-processing shader effects. See the updated Classic skin for an example.\n    Classic skin updated with new effects and promoted to a &quot;main&quot; skin. \n\n\n\nMode changes:\n\n    Vegas nerfed. The vegas mode is fun to play, but was scoring too many points. This change reduced all points earned evenly, so vegas still plays the same.\n    Pointman buffed. Pointman can now scoop powerups (except multipliers) to use later.\n    Pointman now has 7 puzzle rows (was 6).\n    Wakeboard grid mode now requires holding a trick button to enable jumping. It now also allows you to start tricks that don't have enough air time to finish - so you'll crash long tricks done at the wrong time unless you downgrade them with a quick trick before landing. \n\n\n\nMore:\n\n    URLs to popular video sites found in scoreboard comments are automatically turned into clickable links.\n    Added more transparency to the UI.\n    Song of the day art is now displayed on the title screen at startup.\n    Skin UI graphics are now loaded at game startup.\n    Skin selection screen now loads quickly with no stuttering.\n\nWarning: most skins are not working correctly ATM, so use the force d3d9 method or wait for mod updates. Use SteamWorkshopDownloader to download mods.\n\nAs always, if something does not work, leave a comment below.\n\nEnjoy, and Ride your music!","torrent":{"xt":"urn:btih:0f32cccd86a7b2a2ad98730af7aef72fa20f53d9","amp;dn":"Audiosurf+2+%28October+6th+Update%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f32cccd86a7b2a2ad98730af7aef72fa20f53d9","infoHashBuffer":{"type":"Buffer","data":[15,50,204,205,134,167,178,162,173,152,115,10,247,174,247,47,162,15,83,217]},"announce":[],"urlList":[]}}