{"title":"The Mammoth Book Of Science Fiction - Mike Ashley.epub","uid":9814414,"size":1019739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f7229bf061e2d3b18454b0cfc9ce351e7839d7e&amp;dn=The+Mammoth+Book+Of+Science+Fiction+-+Mike+Ashley.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1395603599,"description":"The art of writing great science fiction is that it challenges the imagination, pushing it to extreme limits and in this anthology, selecting some of the best modern science fiction from the last fifty years, twenty leading authors of the genre ask the question 'What if...?' and then give their own very personal views of the changes and surprises which may befall humanity in the centuries to come. In Ulla, Ulla Eric Brown recounts the first manned Martian expedition and discovers that H. G. Wells may have been right after all. In The Infinite Assassin Greg Egan polices the dimensions, seeking those who are taking over their alternate selves. Geoffrey A. Landis takes us into the depths of a black hole in Approaching Perimelasma. Is the ultimate Utopia heaven or hell? Robert Sheckley finds out in the classic A Ticket to Tranai. These and other stories by James White, Eric Frank Russell, Robert Reed, H. Beam Piper and H. Chandler Elliot make this one of the most entertaining and thought-provoking science fiction anthologies in lightyears.","torrent":{"xt":"urn:btih:0f7229bf061e2d3b18454b0cfc9ce351e7839d7e","amp;dn":"The+Mammoth+Book+Of+Science+Fiction+-+Mike+Ashley.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f7229bf061e2d3b18454b0cfc9ce351e7839d7e","infoHashBuffer":{"type":"Buffer","data":[15,114,41,191,6,30,45,59,24,69,75,12,252,156,227,81,231,131,157,126]},"announce":[],"urlList":[]}}