{"title":"MEDITATION - in the Perspective of Science, Health or Spirituali","uid":4570538,"size":4698603301,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0fb90dcf950494b44ef0e44bd231ec9be5fcaa3f&amp;dn=MEDITATION+-+in+the+Perspective+of+Science%2C+Health+or+Spirituali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Schopenhauer","files":-1,"time":1229038776,"description":"-------------------------------------------------\nPlz read the info about this torrent here:\nhttp://vuzit.com/view/d4c\n\n-------------------------------------------------\n\n(DVD) - MEDITATION - in the Perspective of Science, Health or Spirituality. Both Theory and Practice.(Compilation)\n\nWhat do we got here? Well,\n\n21 Videoclips (9 hours and 34 minutes)\n\n14 Audiobooks (299 audiofiles with a total duration of 65 hours and 53 minutes)\n\n1 Album and 1 E-book\n\n\n\nThere are many perspectives on meditation, and also people have different ideas about it;\n\nMeditation for some is a purely medical treatment founded on evidence based research. Sometimes it is connected with an interest to investigate neurological activity in relation to the study of consciousness.\n\nFor other people it is just something related to a sense of a healthy lifestyle and personal well-being.\n\nAnd for yet others it is a part of developing, or deepening their spiritual or religious life.  \n\nI did put a lot of effort into making a DVD that appeals to any of these three perspectives or categories that might be in your particularly, taste, interest or need, without compromising on either quantity/quality of material. Use what you find helpful for yourself, discard what you don't find any value in.\n\n\nAlmost every person on this DVD with very few exceptions has either a M.D or a PhD in something, that is related to what they offer to teach. It just turned out that way, and it gives a small guarantee that those persons didn't get into the field 2 months ago just to make a bit of quick and easy cash.I didn't put any of the typical new-age people or so on this DVD just because that was not the kind of compilation i had in mind this time. But there are both scientist and people representing different spiritual traditions on the DVD.\n\n                                    --------------\nFor more info read the entire info and description of all the material included on the DVD, Here: &lt;a href=&quot;\nhttp://vuzit.com/view/d4c&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vuzit.com/view/d4c&lt;/a&gt;\n\n-------------------------------------------------\n\nmeditation, science, psychology, neurology, spirituality, self-help, Buddhism, mindfulness, philosophy, practice, theory, yoga, contemplation","torrent":{"xt":"urn:btih:0fb90dcf950494b44ef0e44bd231ec9be5fcaa3f","amp;dn":"MEDITATION+-+in+the+Perspective+of+Science%2C+Health+or+Spirituali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb90dcf950494b44ef0e44bd231ec9be5fcaa3f","infoHashBuffer":{"type":"Buffer","data":[15,185,13,207,149,4,148,180,78,240,228,75,210,49,236,155,229,252,170,63]},"announce":[],"urlList":[]}}