{"title":"Mysteries.at.the.Castle.Series.2.02of13.Henry.8th.Mechanical.Tur","uid":11892893,"size":1012998258,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:0feee0168c9c37adf2ee498374a1642ed3314369&amp;dn=Mysteries.at.the.Castle.Series.2.02of13.Henry.8th.Mechanical.Tur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"artistharry","files":1,"time":1431039638,"description":"Mysteries at the Castle: Series 2\n\nHistory Documentary hosted by Ted Stewart, published by Travel Channel UK in 2015 - English narration\n &lt;a href=&quot;\nhttp://docuwiki.net/images/e/ee/Mysteries-at-the-Castle-Series-2-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/e/ee/Mysteries-at-the-Castle-Series-2-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nMysteries at the Castle\nBehind the gates of the world's most impressive castles, manor houses and mansions are secrets waiting to be revealed. Mysteries at the Castle reveals these amazing structures in all their glory and tells the remarkable, mysterious and bizarre tales tied to the rich and powerful who once resided there. From a German castle where a real life Dr. Frankenstein tried to breathe life into the dead to the magnificent Highclere Castle, which is now the setting for Downton Abbey, but was once the home of an English lord who unearthed King Tut's tomb, these stories will captivate and amaze in equal measure.\n\n\n1)  Dracula, Queen and the Mistress, King Arthur \nA Transylvanian castle provides the inspiration for an infamous literary villain; a French chateau incites a bitter rivalry between two powerful women; and a mythical monarch steps-into the real world at an English Abbey.\n\n2)  Henry 8th, Bannerman's Castle Curse, Mechanical Turk Hoax \nAn English palace that was the setting for a royal tale of lust and power is toured. Also: an ornate New York arsenal that supposedly fell victim to a curse; and the story of the Mechanical Turk's debut in the late 18th century.\n\n3)  Faust, Pirate Queen, First Versailles \nAn infamous pact with the devil plays out at an ominous castle in the Netherlands; a strategic Irish stronghold is at the center of a pirate queen's battle for supremacy; and the construction of a stunning French chateau spells disaster for its ambitious creator.\n\n4)  Green Lady, Count of Monte Cristo, Robin Hood \nA haunting tale of jealousy and murder plays out in an enchanting French castle; a brazen act of treachery leads to bloody revenge at an ominous Italian fort; and an English castle provides the inspiration for one of the most legendary heroes of all time.\n\n5)  House that Saved a King, Joan of Arc, Hamilton Sex Scandal \nA secret chamber in a British manor saves a fugitive king from execution; a powerful hilltop fortress is the launching ground for Joan of Arc's mission to save France; and one of America's first political sex scandals ends at an idyllic New York estate.\n\n6)  Royal Baccarat Scandal, Soleste and Moroello, Franz Ferdinand \nAn illegal card game at a stately British manor leads to a scandal that threatens a prince; a stunning Italian fortress provides the setting for a haunting tale of ill-fated love; and the shocking murder of an Austrian castle's owner sparks one of the biggest global disasters of all time.\n\n7)  Book Chest; Miracle on Anne Greene; Hemingway's Last Cent \nA daring prison break plays-out at a forbidding stronghold in Holland; a miraculous story of life after death centers on an imposing British citadel; and an idyllic tropical mansion becomes the battleground in a matrimonial war.\n\n8)  Book thief, Bigamist Duchess, Patent-ly absurd \nA mountaintop abbey in France is the setting of an audacious robbery that baffles investigators; a shocking tale of marital double-dealing unfolds at an English estate; and the owner of an opulent Kansas mansion concocts a supposed wonder drug.\n\n9)  Martin Luther Kidnapping; Witches of Belvoir; Secret Queen \nA German castle provides unlikely refuge for one of Christianity's most controversial figures; a palatial British estate is the site of a bewitching tale of murders; and a secret romance that threatened the monarchy envelops the owner of a stunning French chateau.\n\n10)  The Real Beauty and the Beast; Birdman of Scotland; Master of Disguise \nA French chateau plays host to one of the most beloved and well-known romances ever told; a Scottish castle is the setting for a scientist's experiment; and a desperate manhunt leads to a close encounter at a Southern mansion.\n\n11)  Irish Heist; Dickens Affair; Prince of Porcelain \nAn Irish manor is ransacked in one of the largest art heists the world has ever seen; a French chateau plays host to the illicit affair of a literary superstar; and a hilltop German castle is at the center of a tale of fraud.\n\n12)  Making an Artist \nA chateau in southwestern France is home to an ailing boy who seeks artistic acceptance; a Canadian castle serves as a secret location for a wartime project; and a Scottish stronghold is at the heart of a fabled love story.\n\n13)  Battle to Cross the Channel; Royal Matchmaker; Boettcher Kidnapping \nA beautiful French castle launches the career of a fearless aviator; an opulent English retreat is home to a provocative royal matchmaker; and a secluded Colorado estate is at the center of a brutal kidnapping.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d991b0beb19995edf7e8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3233 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 44mins\n * Framerate: 29.971 fps\n * Number of Parts: 13\n * Container Mp4\n * Part Size: 982 MB average\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:0feee0168c9c37adf2ee498374a1642ed3314369","amp;dn":"Mysteries.at.the.Castle.Series.2.02of13.Henry.8th.Mechanical.Tur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0feee0168c9c37adf2ee498374a1642ed3314369","infoHashBuffer":{"type":"Buffer","data":[15,238,224,22,140,156,55,173,242,238,73,131,116,161,100,46,211,49,67,105]},"announce":[],"urlList":[]}}