{"title":"Theory of International Politics [blackatk]","uid":8640097,"size":13577143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:101705bc13a78228d59af0d4a931ad62bbf095ec&amp;dn=Theory+of+International+Politics+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"blackatk","files":-1,"time":1372867099,"description":"This is the 1979 release, the text and link below is for the 2010 release (the 1979 release info is not available) \n\n\nThe seminal text on neorealist analysis! From Theory of International Politics: National politics is the realm of authority, of administration, and of law. International politics is the realm of power, of struggle, and of accommodation. . . . States, like people, are insecure in proportion to the extent of their freedom. If freedom is wanted, insecurity must be accepted. Organizations that establish relations of authority and control may increase security as they decrease freedom. If might does not make right, whether among people or states, then some institution or agency has intervened to lift them out of nature s realm. The more influential the agency, the stronger the desire to control it becomes. In contrast, units in an anarchic order act for their own sakes and not for the sake of preserving an organization and furthering their fortunes within it. Force is used for one s own interest. In the absence of organization, people or states are free to leave one another alone. Even when they do not do so, they are better able, in the absence of the politics of the organization, to concentrate on the politics of the problem and to aim for a minimum agreement that will permit their separate existence rather than a maximum agreement for the sake of maintaining unity. If might decides, then bloody struggles over right can more easily be avoided.\n\nTABLE OF CONTENTS: 1. Laws and Theories 2. Reductionist Theories 3. Systemic Approaches and Theories 4. Reductionist and Systemic Theories 5. Political Structures 6. Anarchic Orders and Balances of Power 7. Structural Causes and Economic Effects 8. Structural Causes and Military Effects 9. The Management of International Affairs\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Theory-International-Politics-Kenneth-Waltz/dp/1577666704/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372859465&amp;sr=1-1&amp;keywords=theory+of+international+politics+1979&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Theory-International-Politics-Kenneth-Waltz/dp/1577666704/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372859465&amp;sr=1-1&amp;keywords=theory+of+international+politics+1979&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:101705bc13a78228d59af0d4a931ad62bbf095ec","amp;dn":"Theory+of+International+Politics+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"101705bc13a78228d59af0d4a931ad62bbf095ec","infoHashBuffer":{"type":"Buffer","data":[16,23,5,188,19,167,130,40,213,154,240,212,169,49,173,98,187,240,149,236]},"announce":[],"urlList":[]}}