{"title":"The Physics of Semiconductors - An Introduction Including Device","uid":15536733,"size":17469583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1042c89b88c2ef95ac33b4f398826f1326422f91&amp;dn=The+Physics+of+Semiconductors+-+An+Introduction+Including+Device&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"clouderone","files":1,"time":1470880603,"description":"The Physics of Semiconductors - An Introduction Including Devices and Nanophysics - Marius Grundmann (Springer, 2006).pdf\r\n\r\nThe Physics of Semiconductors provides material for a comprehensive upper-level-undergraduate and graduate course on the subject, guiding readers to the point where they can choose a special topic and begin supervised research. The textbook provides a balance between essential aspects of solid-state and semiconductor physics, on the one hand, and the principles of various semiconductor devices and their applications in electronic and photonic devices, on the other. It highlights many practical aspects of semiconductors such as alloys, strain, heterostructures, nanostructures, that are necessary in modern semiconductor research but typically omitted in textbooks. For the interested reader some additional advanced topics are included, such as Bragg mirrors, resonators, polarized and magnetic semiconductors are included. Also supplied are explicit formulas for many results, to support better understanding. The Physics of Semiconductors requires little or no prior knowledge of solid-state physics and evolved from a highy regarded two-semester course at the University of Leipzig","torrent":{"xt":"urn:btih:1042c89b88c2ef95ac33b4f398826f1326422f91","amp;dn":"The+Physics+of+Semiconductors+-+An+Introduction+Including+Device","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1042c89b88c2ef95ac33b4f398826f1326422f91","infoHashBuffer":{"type":"Buffer","data":[16,66,200,155,136,194,239,149,172,51,180,243,152,130,111,19,38,66,47,145]},"announce":[],"urlList":[]}}