{"title":"[E. L. Wolf]Graphene A New Paradigm in Condensed Matter and Devi","uid":11228074,"size":6965953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10ef8469b1984f3372e5d50d4b3f6067c50ba129&amp;dn=%5BE.+L.+Wolf%5DGraphene+A+New+Paradigm+in+Condensed+Matter+and+Devi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413479384,"description":"The book is an introduction to the science and possible applications of Graphene, the first one-atom-thick crystalline form of matter. Discovered in 2004 by now Nobelists Geim and Novoselov, the single layer of graphite, a hexagonal network of carbon atoms, has astonishing electrical and mechanical properties. It supports the highest electrical current density of any material, far exceeding metals copper and silver. Its absolute minimum thickness, 0.34 nanometers, provides an inherent advantage in possible forms of digital electronics past the era of Moore's Law.\n\nThe book describes the unusual physics of the material, that it offers linear rather than parabolic energy bands. The Dirac-like electron energy bands lead to high constant carrier speed, similar to light photons. The lattice symmetry further implies a two-component wave-function, which has a practical effect of cancelling direct backscattering of carriers. The resulting high carrier mobility allows observation of the Quantum Hall Effect at room temperature, unique to Graphene. The material is two-dimensional, but in sizes micrometers nearly to meters displays great tensile strength but vanishing resistance to bending.\n\nThe book reviews theoretical predictions of excessive atomic vibrational motion, tied to the dimensionality. As explained, these predictions seem not of practical consequence, and such effects are unobservable in samples up to nearly one meter size. The disintegration temperature of this refractory material is estimated as 4900K, certainly higher than the measured sublimation temperature of graphite, 3900K. As explained, applications of Graphene come in classes that range from additives to composite materials to field effect transistor elements capable of extremely high frequency operation. The classes of applications correlate with differing methods of fabrication, from inexpensive chemical exfoliations of graphite, to chemical vapour deposition on catalytic substrates as Cu and Ni, at temperatures around 1300K. The book reviews potential applications within existing electronics, to include interconnect wires, flash-memory elements, and high frequency field effect transistors. The chance to supplant the dominant CMOS family of silicon logic devices is assessed.\n\nReview\nThis book on graphene gives an up-to-date account of this academically interesting but technologically useful material. It covers nearly every aspect of the subject. While the book has a broad coverage, the discussion is deep and thorough. Only basic knowledge in quantum mechanics is needed in reading the book. It can be used as a textbook for advanced undergraduate and graduate students, or as a general reference for researchers in this field. Researchers will find the bibliography at the end of the book very useful. I highly recommend this book to any person who is interested in graphene. (Kwok-Wai Ng, University of Kentucky)\nAbout the Author\nE. L. Wolf is a Fellow of the American Physical Society. His research in the area of condensed matter physics contributed strongly to understanding of superconductive tunnelling junctions and the superconducting proximity effect. Dr. Wolf is author of more than 100 refereed research papers and, more recently, of five monographs in areas related to nanotechnology as well as to superconductive electron tunnelling spectroscopy. Dr. Wolf has held positions in industry, two years as Program Director at the National Science Foundation, and academic appointments at the Ames Laboratory of the US Dept. of Energy as well as at Polytechnic Institute of New York University. \n\nPublisher: OUP Oxford (7 November 2013)\nLanguage: English\nISBN-10: 0199645868\nISBN-13: 978-0199645862","torrent":{"xt":"urn:btih:10ef8469b1984f3372e5d50d4b3f6067c50ba129","amp;dn":"%5BE.+L.+Wolf%5DGraphene+A+New+Paradigm+in+Condensed+Matter+and+Devi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ef8469b1984f3372e5d50d4b3f6067c50ba129","infoHashBuffer":{"type":"Buffer","data":[16,239,132,105,177,152,79,51,114,229,213,13,75,63,96,103,197,11,161,41]},"announce":[],"urlList":[]}}