{"title":"The Sarah Jane Adventures - Season 02 (2008) - 12 Episodes","uid":10815614,"size":2841298321,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:113d04962132cdd7c466179b1b1aa910a206e46d&amp;dn=The+Sarah+Jane+Adventures+-+Season+02+%282008%29+-+12+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"bnaron","files":-1,"time":1408460186,"description":"The Sarah Jane Adventures - Season 02 (2008) - 12 Episodes\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/The_Sarah_Jane_Adventures\n\n\nNOTE: Episode Spoilers Below.  Do not read the synopses if it might ruin your viewing experience. You HAVE been warned!\n\n\nThe Sarah Jane Adventures was first seen by its original British audience in the form of a 60-minute New Year's Day special in 2007, titled &quot;Invasion of the Bane&quot;, which was co-written by Russell T Davies and Gareth Roberts. &quot;Bane&quot; was not a pilot, as may have been suspected by the atypical broadcast order, holiday specials in Britain typically air after the regular run of the series to which they're attached. The story also contains many conventional introductory elements common to pilots. Creator Russell T Davies has commented upon the exceptional broadcast situation, saying &quot;Sarah Jane Adventures is slightly unusual in that it was commissioned before we'd written the script. If we'd written a load of rubbish, they'd still have had to make it.&quot; He refers to &quot;Invasion of the Bane&quot; simply as the &quot;first episode&quot;. The story focused on Sarah Jane's investigation of a popular and addictive soft drink called Bubble Shock!.\n\nThe second season started in September 2008 consisting of six two-part half-hour stories, ending the season in December 2008.\n\nThis was the last series to feature Yasmin Paige as Maria Jackson and her family who made their final regular appearance in The Last Sontaran although she and her dad, Alan (Joseph Millson) did make a final appearance in the second episode of The Mark of the Berserker.\n\nAnjli Mohindra joined that cast as Rani Chandra in the second serial The Day of the Clown along with her parents, Gita (Mina Anwar) and Haresh (Ace Bhatti).\n\nNicholas Courtney made his final appearance as Brigadier Lethbridge-Stewart in the series finale Enemy of the Bane which also featured the return of Samantha Bond as Mrs. Wormwood. Jocelyn Jee Esien made her first appearance as Clyde's mother, Carla.\n\n\nEpisode Synopses Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/List_of_The_Sarah_Jane_Adventures_serials\n\n\n2008-09-29 - The Last Sontaran (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nAlan has a dilemma as he has been offered a job in America and feels guilty about taking Maria away from her mother and friends. Maria, however, is busy helping Sarah Jane, Luke and Clyde investigate strange lights coming from the Tycho radio tower. They discover that Kaagh, the last survivor of an invasion of Earth by the Sontaran race, is planning his revenge and has taken over Professor Skinner and his computer,the plan being to bring down Earth's satellites onto nuclear power stations worldwide and cause an explosion. The professor's daughter helps them to escape ...\n\n\n2008-09-29 - The Last Sontaran (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nSarah Jane and the youngsters are saved by the arrival of Alan and Chrissie, the latter saving the day by wedging the high heel of her shoe into the sensitive vent in the back of Kaagh's neck. However, she is knocked temporarily unconscious and Maria and Alan hope she can be persuaded it was all a dream when she comes to. Luke deactivates the computer, completely immobilising Kaagh's weaponry and he returns to Sontar. Maria and her father leave for America and Chrissie later tells Sarah Jane that she remembers the entire incident. \n\n\n2008-10-06 - The Day of the Clown (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nRani Chandra, a would-be journalist, moves into the Jackson's old house with her mother and father, who is the new school head. Children have been disappearing and Rani suspects the appearance of a clown at the school is significant. In fact the last two to go missing had tickets to the Museum of the Circus, which Sarah Jane, Rani and the boys investigate. It is run by Elijah Spellman, a smilingly sinister figure, who sets clown robots on the group, though Sarah Jane uses her sonic lipstick to immobilise them. The group escape after Spellman has turned first into the Pied Piper and then into Odd Bob the clown. \n\n\n2008-10-13 - The Day of the Clown (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nAfter Sarah Jane has told Luke she has a fear of clowns dating from a childhood incident, balloons rain from the sky into the school playground. Children who touch them fall under Odd Bob's spell but Clyde, using his mobile phone, breaks the contact, releasing the children. Odd Bob captures Luke, forcing Sarah Jane to overcome her phobia as she sets out to rescue him but ultimately Clyde tricks Odd Bob and puts him into an impenetrable box.\n\n\n2008-10-20 - Secrets of the Stars (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nAstrologer Martin Trueman, previously a charlatan, is hit by the light from a shooting star and, at his next show, attended by Sarah Jane, Rani and the boys, gives out cards on which everyone has to write down their birth date and sign. Rani is surprised when Martin gives accurate details about her recent life. Sarah Jane is initially cynical but then Martin tells her of her travels with Doctor Who and predicts bad things for her.\n\n\n2008-10-27 - Secrets of the Stars (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nMartin explains that the Ancient Lights, the beings in the shooting star, have selected him as their chosen one to create a new world run by them. Using a radio broadcast he starts to control people all over the world by their star signs to make them compliant. Luke, however, does not have a star sign as he was created, rather than born, can withstand and eventually destroys Martin's control, freeing everybody. Rather than go back to his old life Martin opts to be transformed into a star while Sarah Jane declares the date to be Luke's birthday.\n\n\n2008-11-03 - The Mark of the Berserker (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nRani finds a pendant which can be used to control people and takes it to Sarah Jane's attic for Mr. Smith to analyse, but there is noone there and she leaves it. Clyde's estranged father Paul comes to see him, though he has never been much good to his son. Clyde takes him to Sarah Jane's house to prove to his father his accounts of his adventures, but Paul sees and pockets the pendant. When Rani's father challenges him and explains its powers Paul forces him to do press-ups in the street and tells Clyde to forget his mother and his friends in favour of his father.\n\n\n2008-11-03 - The Mark of the Berserker (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nPaul uses the pendant to buy his son's love with material goods, but it starts to take him over, entering his skin as he and Clyde approach a harbour. Sarah Jane finds them and, primed with knowledge about the pendant that Alan Jackson has found by hacking into UNIT's computer,takes advantage of the fact that Clyde still recognises her.The possessed Paul declares that he is the Berserker and Clyde is his soldier, but Sarah Jane breaks the pendant's hold by showing Paul himself in a mirror and, helped by his mother Carla, talking Clyde through his past life. Clyde, after throwing the pendant into the sea, rejects his father, but Sarah Jane, orphaned as a baby, becomes wistful, thinking about her parents.\n\n\n2008-11-17 - The Temptation of Sarah Jane Smith (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nA little boy from the early 1950s wanders through a time gap into the present and Sarah Jane returns him, finding herself and Luke in Foxgrove the village where she was born. It is the day that her parents, who left her by the roadside as a baby,will be killed in a car crash. She meets them at a village fair and, to prevent their deaths, tampers with the car. When she and Luke return to the present, a ruined London is in the grip of the Trickster, who appears to thank her. the little boy was the Graske, sent to force her to change time. The village was built on a time fault and her tampering with it enabled him to come through a time fissure and take over the capital.\n\n\n2008-11-17 - The Temptation of Sarah Jane Smith (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nHelp comes from an unexpected source when Rani and Clyde discover that the Graske is an unwilling slave of the Trickster and, in return for their setting him free, he re-opens the time warp back to Foxgrove in the 1950s. Sarah Jane's parents come to realise her true identity but their deaths are inevitable if she is to grow up to be the person she is and to thwart the Trickster, so they repair the car and, having left the baby by the road, drive off to their fate. Their deaths however cause the Trickster to fade away and harmony is restored.\n\n\n2008-12-01 - Enemy of the Bane (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nMrs. Wormwood returns and forces Sarah Jane to meet her in an old warehouse, having abducted Rani's mother as bait. Mrs. Wormwood says that the Bane are after her blood for her failure on her last mission and needs Sarah Jane's help. The two women survive a Bane attack and go to Sarah Jane's house. Mrs. Wormwood explains that the Bane are anxious to locate a scroll divulging the whereabouts of an ancient immortal, Horath.If he is re-animated they could take over the galaxy and she aims to stop them. Sarah Jane contacts old ally the Brigadier and retrieves the scroll from the UNIT archive but back at her house the Sontaran Kaagh suddenly appears and he too wants the scroll.\n\n\n2008-12-01 - Enemy of the Bane (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nKaagh obtains the scroll after threatening Luke and it becomes apparent that he and Mrs. Wormwood are an alliance working to use the scroll to obtain galactic domination. The pair take Luke to a stone circle at Whitehaven, which contains a portal. If the scroll is inserted it will reactivate Horath. Mrs. Wormwood tries to persuade Luke to do this, promising him the galaxy, with him as her son, but he refuses, claiming that he only has one mother. Kaagh attempts to double-cross and kill Mrs.Wormwood and both are sucked into the portal. Sarah Jane uses her sonic lipstick to destroy the scroll.\n\n\n\n\n","torrent":{"xt":"urn:btih:113d04962132cdd7c466179b1b1aa910a206e46d","amp;dn":"The+Sarah+Jane+Adventures+-+Season+02+%282008%29+-+12+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"113d04962132cdd7c466179b1b1aa910a206e46d","infoHashBuffer":{"type":"Buffer","data":[17,61,4,150,33,50,205,215,196,102,23,155,27,26,169,16,162,6,228,109]},"announce":[],"urlList":[]}}