{"title":"William Sims Bainbridge - Personality Capture and Emulation [201","uid":10427042,"size":3992189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:115997e89828a1d93e970164729236485e93c83d&amp;dn=William+Sims+Bainbridge+-+Personality+Capture+and+Emulation+%5B201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1403717736,"description":"Description\nProduct Details\nBook Title: Personality Capture and Emulation (Human-Computer Interaction Series)\t\nBook Author: William Sims Bainbridge (Author)\nSeries: Human-Computer Interaction Series\nHardcover: 213 pages\nPublisher: Springer; 2014 edition (November 27, 2013)\nLanguage: English\nISBN-10: 144715603X\nISBN-13: 978-1447156031\n\n===================================================================================\nBook Description\nPublication Date: November 27, 2013 | ISBN-10: 144715603X | ISBN-13: 978-1447156031 | Edition: 2014\nPersonality Capture and Emulation is the gateway to an amazing future that actually may be achieved, enabling the preservation and simulation of human personalities at progressively higher levels of fidelity. This challenge is no longer the province merely of uninhibited visionaries, but has become a solid field of research, drawing upon a wide range of information technologies in human-centered computing and cyber-human systems. Even at modest levels of accomplishment, research in this emerging area requires convergence of cognitive, social, and cultural sciences, in cooperation with information engineering and artificial intelligence, thus stimulating new multidisciplinary perspectives. Therefore this book will inspire many specific research and development projects that will produce their own valuable outcomes, even as the totality of the work moves us closer to a major revolution in human life. Will it ever really be possible to transfer a human personality at death to a technology that permits continued life? Or will people come to see themselves as elements in a larger socio-cultural system, for which a societal information system can provide collective immortality even after the demise of individuals? A large number and variety of pilot studies and programming projects are offered as prototypes for research that innovators in many fields may exploit for the achievement of their own goals. Together, they provide an empirical basis to strengthen the intellectual quality of several current debates at the frontiers of the human and information sciences.\n===================================================================================","torrent":{"xt":"urn:btih:115997e89828a1d93e970164729236485e93c83d","amp;dn":"William+Sims+Bainbridge+-+Personality+Capture+and+Emulation+%5B201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115997e89828a1d93e970164729236485e93c83d","infoHashBuffer":{"type":"Buffer","data":[17,89,151,232,152,40,161,217,62,151,1,100,114,146,54,72,94,147,200,61]},"announce":[],"urlList":[]}}