{"title":"tinyCam Monitor PRO v4.0.3 Final By bobiras2009","uid":7616100,"size":2640843,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1180c87613045fbdab58aa44c014bcc96ed7dab9&amp;dn=tinyCam+Monitor+PRO+v4.0.3+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347205239,"description":"For make Requests go here: https://forum.suprbay.org/showthread.php?tid=129845\n\nI will not upload requests that post in the comments in my torrents.           \n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 1.6 and up\nOverview: Mobile surveillance from any IP cameras for Android phones, tablets, Google TV.\n\nOne of the best app available for Android for remote surveillance, control and video recording for your private/public network or IP cameras, video encoders and DVRs with CCTV cams (#1 rated surveillance app, 4.6 average rating with 10,000+ active users). Monitor your baby, pet, home, business, traffic, and weather remotely and securely (no data being sent to 3rd parties). tinyCam Monitor provides best value to customers. Buy now to get more features in future updates for free! More than 25 major updates per year with new features!\n\nListed as a featured app on Google TV in Android Market. View your security cams right from the sofa!\n\nLoaded with tons of features:\n- Very intuitive custom made interface. See the screenshots to appreciate the quality of the app.\n- Support for M-JPEG based devices of all major vendors (100+)\n- 1-way audio (listening) for D-Link, Edimax, Gadspot, SONY, Sharx Security, LogiLink, TRENDnet, Y-cam (selective models), Panasonic\n- 2-way audio (talking and listening) for Axis, FOSCAM, Loftek, Tenvis, Wansview, INSTAR, and more on the way!\n- SSL support (https) for secured monitoring and encrypting credentials\n- 10 different layouts with unlimited number of cameras support\n- Control pan-tilt-zoom (PTZ) enabled devices, i.e. Pixord, Vivotek\n- Relay, LED control for some models\n- Cyclic 24/7 video recording (sequence of JPEG images) on SD card, FTP server, or Dropbox. Video playback is under development.\n- Easy to use pinch to zoom for digital zooming and swipes for camera selection\n- Sequence mode for automatic cameras switching\n- Import/export settings to SD card or Dropbox service\n- Support for any USB/laptop cams through 3d party software for PC/Mac (see FAQ)\n- Native interface for Honeycomb tablets and Google TV\n- Very CPU efficient\n\nStill not amazed? How about these UNIQUE features:\n- The only app in the market which supports ON CAMERA MOTION DETECTION (selective models). Make automatic snapshots or play alert sound on motion!\n- LAN SCANNER for automatic cams detection. Have a camera IP address suddenly changed? It takes only couple minutes to fully rescan your home network\n- Audio real-time processing (SQUELCH &amp; ALARM) for using it as a baby monitor\n- BACKGROUND AUDIO\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:1180c87613045fbdab58aa44c014bcc96ed7dab9","amp;dn":"tinyCam+Monitor+PRO+v4.0.3+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1180c87613045fbdab58aa44c014bcc96ed7dab9","infoHashBuffer":{"type":"Buffer","data":[17,128,200,118,19,4,95,189,171,88,170,68,192,20,188,201,110,215,218,185]},"announce":[],"urlList":[]}}