{"title":"The Caine Mutiny by Herman Wouk (ePub)","uid":8841124,"size":640356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11a2837f17ff5e001bc85ea6c25e1d48f0a731ca&amp;dn=The+Caine+Mutiny+by+Herman+Wouk+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1377247744,"description":"THE CAINE MUTINY, by Herman Wouk (ePub)\n\nThe Caine Mutiny is a 1952 Pulitzer Prize winning novel by Herman Wouk. The novel grew out of Wouk's personal experiences aboard a destroyer-minesweeper in the Pacific in World War II and deals with, among other things, the moral and ethical decisions made at sea by the captains of ships. The mutiny of the title is legalistic, not violent, and takes place during an historic typhoon in December 1944. The court-martial that results provides the dramatic climax to the plot.\n\nEDIT HISTORY\nThis is an improved edit of the previous standard copy floating around on-line.  The previous version was good quality text, but had no Table of Contents to speak of.  After several hours of fine-tuning with Calibre and EditPad Pro, this version now has a complete, well layed-out hierarchical TOC.  The body of the text has excellent layout and smart punctuation.  I have not noted any typographical errors.  I believe that this version may be considered the definitive version of this e-book currently available.\n\nEnjoy","torrent":{"xt":"urn:btih:11a2837f17ff5e001bc85ea6c25e1d48f0a731ca","amp;dn":"The+Caine+Mutiny+by+Herman+Wouk+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11a2837f17ff5e001bc85ea6c25e1d48f0a731ca","infoHashBuffer":{"type":"Buffer","data":[17,162,131,127,23,255,94,0,27,200,94,166,194,94,29,72,240,167,49,202]},"announce":[],"urlList":[]}}