{"title":"The Memory Painter - Gwendolyn Womack","uid":11920949,"size":555180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11bdad5be078f6823f14b55d8d076fa0cfc188dd&amp;dn=The+Memory+Painter+-+Gwendolyn+Womack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1431632279,"description":"Two lovers who have traveled across time. A team of scientists at the cutting edge of memory research. A miracle drug that unlocks an ancient mystery.\n\n****Bryan Pierce is an internationally famous artist whose paintings have dazzled the world. But there's a secret to his success: Every canvas is inspired by an unusually vivid dream. When Bryan awakes, he possesses extraordinary new skills...like the ability to speak obscure languages and an inexplicable genius for chess. All his life, he has wondered if his dreams are recollections, if he is re-experiencing other people's lives.\n\nLinz Jacobs is a brilliant neurogeneticist, absorbed in decoding the genes that help the brain make memories, until she is confronted with an exact rendering of a recurring nightmare at one of Bryan's shows. She tracks down the elusive artist, and their meeting triggers Bryan's most powerful dream yet: visions of a team of scientists who, on the verge of discovering a cure for Alzheimer's, died in a lab explosion decades ago.\n\nAs Bryan becomes obsessed with the mysterious circumstances surrounding the scientists' deaths, his dreams begin to reveal what happened at the lab, as well as a deeper mystery that may lead all the way to ancient Egypt. Together, Bryan and Linz start to discern a pattern. But a deadly enemy watches their every move, and he will stop at nothing to ensure that the past stays buried.\n\nA taut thriller and a timeless love story spanning six continents and 10,000 years of history, The Memory Painter by Gwendolyn Womack is a riveting debut novel unlike any you've ever read","torrent":{"xt":"urn:btih:11bdad5be078f6823f14b55d8d076fa0cfc188dd","amp;dn":"The+Memory+Painter+-+Gwendolyn+Womack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11bdad5be078f6823f14b55d8d076fa0cfc188dd","infoHashBuffer":{"type":"Buffer","data":[17,189,173,91,224,120,246,130,63,20,181,93,141,7,111,160,207,193,136,221]},"announce":[],"urlList":[]}}