{"title":"101 Places to Get Fcked Up Before You Die (2014) Gooner","uid":13895030,"size":6083238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11c235364d2038efaee67555117a627d5e9a8fdc&amp;dn=101+Places+to+Get+Fcked+Up+Before+You+Die+%282014%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1458241260,"description":"101 Places to Get Fcked Up Before You Die - The Ultimate Travel Guide to Partying Around the World - Reprint Edition (2014) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: St. Martin's Griffin; Reprint edition (January 7, 2014)\r\nLanguage: English\r\nISBN-10: 1250035589\r\nISBN-13: 978-1250035585\r\n\r\nWhat Are You Waiting For?\r\n\r\nLooking for a guidebook that isn't full of tired, lame, or even BS travel information? 101 Places to Get Fucked Up Before You Die brings together the most irreverent and legit accounts of drinking, nightlife and travel culture around the world. Part guide, part social commentary, part party invitation, 101 Places gives you all the info and inspiration you'll need to:\r\n\r\n* Blowout one (or several) of the year's biggest festivals \r\n* MacGyver your way into underground clubs and backcountry raves\r\n* Throw down with people from the Himalayas to the salt flats to Antarctica\r\n* Travel in every conceivable style―from baller to dirtbag―to some of the most epic spots on earth\r\n\r\nDo you really know where to go out in San Francisco or Tel Aviv? How about preparing for Burning Man or Oktoberfest? The award-winning journalists and photographers at Matador Network let you know what's up at each spot, whether it's drug policies, how to keep safe, special options for LGBT travelers, or simply where to find the kind of music you like to dance to. No matter if you want to rage at Ibiza or just chill on some dunes smoking shisha, 101 Places has something for you.\r\n\r\nSo, hop a flight, raise a glass, and join us as we breach security, ride ill-recommended ferries, and hike miles into the wilderness all in search of the parties and places going off right now","torrent":{"xt":"urn:btih:11c235364d2038efaee67555117a627d5e9a8fdc","amp;dn":"101+Places+to+Get+Fcked+Up+Before+You+Die+%282014%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11c235364d2038efaee67555117a627d5e9a8fdc","infoHashBuffer":{"type":"Buffer","data":[17,194,53,54,77,32,56,239,174,230,117,85,17,122,98,125,94,154,143,220]},"announce":[],"urlList":[]}}