{"title":"Hum - Downward is Heavenward","uid":3931939,"size":74866600,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11d82736406b5d5353ea45f71a8ccb53cbfecf8c&amp;dn=Hum+-+Downward+is+Heavenward&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"grim276","files":14,"time":1197532071,"description":"Hum: Matt Talbott, Tim Lash (vocals, guitar, sound effects); Jeff Dimpsey (bass, background vocals); Bryan St. Pere (drums, sound effects, background vocals).\n\nRecorded at Pogo Studios, Champaign, Illinois and the Great Hall of the Krannert Center for the Performing Arts, Urbana, Illinois.\n\nAll tracks have been digitally mastered using HDCD technology.\n\nChampaign, Illinois&amp;#039; Hum kicked around the underground throughout the &amp;#039;90s, perfecting their brand of forceful-but-unassuming indie guitar-rock. Rather than gloss up their sound after their inevitable leap to the majors, the band has instead refined its vision. On DOWNWARD IS HEAVENWARD, Hum pulls off a neat trick; laying down sheets of thick, post-grunge guitar a la Smashing Pumpkins without any of the affectations that usually accompany such musical brawn.\n\nComing off more like a sped-up Codeine or a non-metallic Helmet, the band marries their intelligent lyrical and compositional tendencies and friendly math-rock attitude to pounding rhythms and riffs that Crazy Horse could envy. On such tracks as &quot;If You Are To Bloom&quot; and &quot;Dreamboat,&quot; hum eschews the nihilistic lyrical approach that is de rigeur among their peers, in favor of a cautiously optimistic view of the world. World-wise guys with nothing to prove, Hum could be Marcy Playground&amp;#039;s older, smarter brothers, likely to attract commensurate attention.\n\n","torrent":{"xt":"urn:btih:11d82736406b5d5353ea45f71a8ccb53cbfecf8c","amp;dn":"Hum+-+Downward+is+Heavenward","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d82736406b5d5353ea45f71a8ccb53cbfecf8c","infoHashBuffer":{"type":"Buffer","data":[17,216,39,54,64,107,93,83,83,234,69,247,26,140,203,83,203,254,207,140]},"announce":[],"urlList":[]}}