{"title":"ROBOCOP [TRILOGY][DVDRIP][ENG]","uid":4276520,"size":2960464600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:130e98c5c4c4f0693b96fc9692fa06fde041eaa3&amp;dn=ROBOCOP+%5BTRILOGY%5D%5BDVDRIP%5D%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"circlensess","files":8,"time":1215208992,"description":"Robocop tells the story of a young cop named Murphy, played with deadpan charm by Peter Weller. He transfers to Detroit, where criminals run the city, the rich live in pampered sky scrapers, and the homicide rate is obscene (Only in the giddy world of fantasy). Murphy is killed brutally on his first day of work in an execution that probably holds a record for number of bullets entered into a single human body. Enter slimy yuppie guy who wants to use Murphy?s dead body parts to build a cyborg police officer, after all nothing could go wrong there, could it? So Robocop is born, and begins to kill criminals in wonderfully over-the-top ways. That is until some of his memories start to return, then for a change of pace he starts to kill the people who wronged him in wonderfully over-the-top ways, this time with the aid of his old partner.\n\nRobocop works so wonderfully well because it charges so far from reality that it borders on parody for most of its running time, but never quite crosses. To put it simply: Verhoneven, who was once upon a time an art house film maker whom people actually respected, didn?t so much embrace his inner hack as he did pin it to the couch and make passionate passionate love to it.\n\nThe joys are all in the moment. From the opening car chase which used cadavers as an obstacle long before Bad Boys II was a glimmer in Michael Bay?s eye, to the wonderfully delirious corporate board meeting where an unsuspecting toady gets liquidated by a demonstration gone awry, to the utterly surreal sight of seeing Don Cheadle play a stereotypical black thug, to a yuppie getting blown up as he snorts coke from a hooker?s boobs, to the wonderful grotesque scene where a thug who was immersed in toxic waste is literally liquidated by a wayward car. Over-the-top doesn?t even begin to cover it.\n\nEven stranger though are the passages of film that are impossible to deny as genuine quality cinema. As hard as it is to fathom, this movie was made by people who honestly cared about and took Robotic cops killing thugs seriously. The passages where Murphy witnesses his own reconstruction in pieces through a video monitor, as his brain is shut down and turned back on at random, are truly and un-ironicly resonant. The same is true of the great scene where Murphy walks through his empty home reliving moments from his past life as they intrude on the present.\n\nSo what you have here is a film with great a action, great satiric wit, a cool future world, and actual characters instead of just blank faced mannequins. I?d buy that for a dollar. (Sidenote, the version on this disc is the ?Directors Cut?, there is some more gore, and it literally runs a minute longer then the original cut. That?s it)\n\nROBOCOP 2 ? 3/5\nRobocop II is bad, make no mistake about that. But it is a very interesting and enjoyable bad. When you see it you?ll sit back and wonder ?Didn?t anybody think this might not be the best of screenplays?? Did no executive step in and go, ?Jeez this is really really awful, let?s not give this thing tens of millions of dollars to get made with..? What about Irvin Kershner? He had just finished making Empire Strikes Back, arguably one of the top 5 sci-fi films of all time, and Never Say Never Again, the return of Connery to Bond. Did he truly think that this was a great script, or even any sort of script at all? What the hell happened to Frank Miller? He?s one of the few comic book people who I can hear referred to as artists without snickering and yet he has somehow crafted one of the single dumbest scripts I?ve ever seen on screen. It makes Armageddon sound like Long Day?s Journey Into Night. It bares so little resemblance to Miller?s tight, smart, imaginative work that one has to wonder if the studio did not just hire a bum off the street named Frank Miller, and then pretend that they had the real one.\n\nStill as I said this is an interesting bad and possibly the closest to a mega budget ?Mystery Science Theater 3000? film that we are ever going to see.\n\nWhen the story begins Detroit has once again gone straight to hell. A new drug called Nuke is being distributed by a crime lord named Kane who looks and sounds suspiciously like an evil Hari-Krishna. In the meantime the Detroit cops are getting ready to strike, and only Robocop can single handedly wipe out everybody.\n\nThe ridiculousness just keeps piling up. What about the twelve year old who inherits Kane?s entire gang without problem, or the sequences where Robocop is given hundreds of commands to make him user friendly, and he erases them all in a way that defines cop out. Or consider the magnificent crazed finale where Robocop fights a drug addicted robot intended to replace him. I?ll repeat that: A drug addicted robot. No points for guessing who he was in his former life.\n\nRobocop II is one of those movies where you just stare at the screen and go ?Am I watching this? This can?t be real. I have to be hallucinating.? I kept expecting Graham Chapman to come out and scold Peter Weller for being ?SILLY SILLY SILLY.? The frightening thing is that if it did happen, it probably would have fit.\n\nBy the time you watch Robocop and the drug addicted Robot jump off a skyscraper screaming ?NNNNNUUUUUUUUKKKKKKKKKKKKEEEE!!!?, you?ll know it?s no hallucination. Whether you choose to have fun with the cheese or be smothered in Velveeta is up to you.\n\nROBOCOP 3 ? 1/5\nRobocop 3 is about as enjoyable as having a living, leprosy infected rat sown into your body and then feeling it as it slowly eats its way out of you, gradually bursting through your spine. The first warning is the rating is PG-13. PG-13 is not the rating of excess, and excess is what Robocop survived on. No, you won?t watch giant drug addicted robots smash up a white-collar meeting, nor will you see a goon liquidized by toxic waste. In fact you won?t see anything interesting in Robocop 3. The film is simply cut off at the knees.\n\nPeter Weller isn?t back either, choosing instead to fade into oblivion. Upon watching the movie you will realize, with some horror, that he made the correct choice. He is replaced incompetently by Robert Burke, who you know from, well nothing at all. Peter Weller was the deadpan heart and soul of these movies and it is a loss that the film simply cannot bear.\n\nThe plot is gobbeldy gook. The corporation gets even eviler and is led by Rip Torn, who appears to be in an all out attempt to destroy his reputation. It starts to bulldoze ghettos, and shoot Nancy Allen. Robocop ponders this for awhile (A looooooonnnnggggg while) before deciding that this simply will not do and bands together with some plucky freedom fighters from the hood. The corporation doesn?t like this and sends out cheap Japanese Cyborgs, named Otomo for some damn reason or another, to kill Robocop, and hire a gang of thugs called the Splatterpunks (who are easily the least intimidating film gang since The Jets). The metal man seems embarrassed to show himself. He doesn?t make an appearance till a good half hour in the movie and when he does it seems that he just wants to get the hell out there. The acting?s bad, the plot?s beyond bad, the future cheap, but worst of all is the action. Unlike Verhonven and Kershner who had precision instincts with action, Fred Decker has nothing, and I do mean nothing. Expect many many close ups of guns followed by many many close ups of people falling over. Once again Frank Miller?s evil retarded clone comes around to mess up his good name. Jesus is it any wonder that the man didn?t want to give away Sin City? So if you like bad acting, horrid action, insipid plots, and the shoddiest future world this side of Logan?s Run, then by all means Robocop 3 is for you\t","torrent":{"xt":"urn:btih:130e98c5c4c4f0693b96fc9692fa06fde041eaa3","amp;dn":"ROBOCOP+%5BTRILOGY%5D%5BDVDRIP%5D%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"130e98c5c4c4f0693b96fc9692fa06fde041eaa3","infoHashBuffer":{"type":"Buffer","data":[19,14,152,197,196,196,240,105,59,150,252,150,146,250,6,253,224,65,234,163]},"announce":[],"urlList":[]}}