{"title":"Walt Disney's Classic Cartoon Favorites - Volume 01 [DVDRip.Xvi","uid":5707678,"size":734147085,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:131ba2fde4574457c4b3532e7e04463faeb21337&amp;dn=Walt+Disney%5C%27s+Classic+Cartoon+Favorites+-+Volume+01+%5BDVDRip.Xvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"MmmManPie","files":2,"time":1279759753,"description":"An hour-long collection of Disney cartoons. Mickey's Circus, 1936, Circus for orphans: Donald and trained seals. Mickey as M.C. Seals steal show, enrage Donald, chase. Gag with cannon. Result: Donald on high wire, falls in seal tank, audience and seals razz. Mickey's Garden, 1935, Mickey and Pluto as pest exterminators. Mickey gets whiff of potent mixture; dreams of battle with gigantic insects. The Little Whirlwind, 1941, A baby whirlwind plays havoc with Mickey's attempts to clean up Minnie's yard of fallen leaves. He succeeds in driving the little whirlwind away, but it returns with its mama (a big whirlwind), who completely ruins Mickey's handiwork. On Ice, 1935, Mickey teaches Minnie to ice-skate on a frozen river, while Goofy tries ice-fishing. Donald puts skates on a sleeping Pluto and skates teasingly around the bewildered and wobbly dog. Suddenly a gust of wind catches Donald and carries him down the river toward the falls. Mickey heroically goes to the rescue. Hawaiian Holiday, 1937, Mickey and the gang are vacationing in Hawaii, but Pluto encounters a troublesome starfish and Goofy discovers that surfing is harder than it looks. Moving Day, 1936, Pete evicts Mickey and Donald. Goofy, ice man, attempts to move furniture. House blows up when Pete lights match in gas-filled house. Orphan's Picnic, 1936, Mickey and Donald takes orphans on a picnic; they tease and torment. Trouble with beehive; Donald swallow bee; fast action.","torrent":{"xt":"urn:btih:131ba2fde4574457c4b3532e7e04463faeb21337","amp;dn":"Walt+Disney%5C%27s+Classic+Cartoon+Favorites+-+Volume+01+%5BDVDRip.Xvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131ba2fde4574457c4b3532e7e04463faeb21337","infoHashBuffer":{"type":"Buffer","data":[19,27,162,253,228,87,68,87,196,179,83,46,126,4,70,63,174,178,19,55]},"announce":[],"urlList":[]}}