{"title":"The Art of Fixing Things, principles of machines, repair them","uid":8341591,"size":5763109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:131b201156a828027a8bc44948a0daad1a5158bc&amp;dn=The+Art+of+Fixing+Things%2C+principles+of+machines%2C+repair+them&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365105164,"description":"The Art of Fixing Things, principles of machines, and how to repair them: 150 tips and tricks to make things last longer, and save you money By Lawrence E. Pierce, Margit Lieder, Adrian Horvath\n2011 | 168 Pages | ISBN: 146629633X | EPUB | 6 MB\n\n\n\nThis is the book you MUST READ before you read any other 'how-to' guide to repairing cars, household appliances, garden machines, and farm equipment, or doing home improvements. It is a resource for smart people who have never had the opportunity to learn the basics of tool use, maintenance and repairs. It contains useful information not found in any other publication, and is the first new book in many years on this subject.\n\nWritten by the third generation, in a family of self reliant do-it-yourself people, many of these 150 Tips and Tricks come to you from a time when we repaired our possessions, rather than throwing them away. For the complete beginner, and the more experienced home repairer, it contains 185 crisp black and white photo illustrations, direct, and simple explanations, and easy to follow directions, for doing repairs, and making things last longer.\n","torrent":{"xt":"urn:btih:131b201156a828027a8bc44948a0daad1a5158bc","amp;dn":"The+Art+of+Fixing+Things%2C+principles+of+machines%2C+repair+them","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131b201156a828027a8bc44948a0daad1a5158bc","infoHashBuffer":{"type":"Buffer","data":[19,27,32,17,86,168,40,2,122,139,196,73,72,160,218,173,26,81,88,188]},"announce":[],"urlList":[]}}