{"title":"The Swerve: How the World Became Modern (Audiobook)","uid":10080428,"size":280070902,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:132a6c613c1cd9fb5ff5ab1d9d313e4da117d578&amp;dn=The+Swerve%3A+How+the+World+Became+Modern+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sidmal","files":-1,"time":1398994025,"description":"\n\nThe Swerve: How the World Became Modern (Audiobook) By Stephen Greenblatt, read by Edoardo Ballerini\n Unabridged edition 2011 | 9 hours and 43 minutes | ISBN: n/a , ASIN: B005QPONF2 | MP3 64 kbps | 280 MB\n\n\n\n\n Renowned historian Stephen Greenblatt's works shoot to the top of the New York Times best-seller list. With The Swerve, Greenblatt transports listeners to the dawn of the Renaissance and chronicles the life of an intrepid book lover who rescued the Roman philosophical text On the Nature of Things from certain oblivion.\n\n Nearly six hundred years ago, a short, genial, cannily alert man in his late 30s took a very old manuscript off a library shelf, saw with excitement what he had discovered, and ordered that it be copied. That book was the last surviving manuscript of an ancient Roman philosophical epic by Lucretius - a beautiful poem containing the most dangerous ideas: that the universe functioned without the aid of gods, that religious fear was damaging to human life, and that matter was made up of very small particles in eternal motion, colliding and swerving in new directions.\n\n The copying and translation of this ancient book - the greatest discovery of the greatest book-hunter of his age - fueled the Renaissance, inspiring artists such as Botticelli and thinkers such as Giordano Bruno; shaped the thought of Galileo and Freud, Darwin and Einstein; and had a revolutionary influence on writers such as Montaigne and Shakespeare, and even Thomas Jefferson.\n\n","torrent":{"xt":"urn:btih:132a6c613c1cd9fb5ff5ab1d9d313e4da117d578","amp;dn":"The+Swerve%3A+How+the+World+Became+Modern+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132a6c613c1cd9fb5ff5ab1d9d313e4da117d578","infoHashBuffer":{"type":"Buffer","data":[19,42,108,97,60,28,217,251,95,245,171,29,157,49,62,77,161,23,213,120]},"announce":[],"urlList":[]}}