{"title":"Warm Knits Cool Gifts","uid":11029572,"size":9730789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:135153293ee3251a93eeb27d8de471da63050ec8&amp;dn=Warm+Knits+Cool+Gifts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KnitLady","files":-1,"time":1410705969,"description":"Warm hearts this winter with handcrafted gifts designed by knittingï¿½s favorite mother-daughter duo. With shawls to wrap up in, hats to pull over our ears, wool sweaters to keep us warm, and ornaments for the tree, autumn and winter lend themselves to knitting in a way like no other time of the yearï¿½and no one knows that better than knitting superstars Sally Melville and Caddy Melville Ledbetter. In Warm Knits, Cool Gifts, Sally and Caddy share 30 of their most inspired patterns for the seasons that are perfect for gifting. Filled with patterns from modern designs to heirloom pieces, Warm Knits, Cool Gifts offers gift inspiration for everyone on your list. The luminous photography and clear and thorough instructions make each project an irresistible must-knit, and the options for adding personal touches are endless. As you read delightful stories from Sally and Caddyï¿½s own knitting experience and their expert gifting advice, youï¿½ll feel as if they are knitting right beside you. Plus their signature Fit &amp; Flatter tips and special Techniques callouts break down instructions step-by-step, making you a more informed, thoughtful, and intuitive knitter year-round.","torrent":{"xt":"urn:btih:135153293ee3251a93eeb27d8de471da63050ec8","amp;dn":"Warm+Knits+Cool+Gifts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135153293ee3251a93eeb27d8de471da63050ec8","infoHashBuffer":{"type":"Buffer","data":[19,81,83,41,62,227,37,26,147,238,178,125,141,228,113,218,99,5,14,200]},"announce":[],"urlList":[]}}