{"title":"[Thund3r3mp3ror] Fate Stay Night - Unlimited Blade Works - 00 [7","uid":11187043,"size":235000904,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:135b3ef056d8cca9aded805a442c910528cc9571&amp;dn=%5BThund3r3mp3ror%5D+Fate+Stay+Night+-+Unlimited+Blade+Works+-+00+%5B7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"thud3r3mp3r0r","files":-1,"time":1412938864,"description":"Plot:\n\nHigh school junior student Emiya Shirou is twice an orphan. Once, a great fire that destroyed more than a hundred homes took the lives of his biological parents. He was then adopted by the man who saved him from that inferno, a man who called himself a magus; however, after a few years, that man, too, died. Shirou was left with a home, the dream to become a superhero, and some extremely limited knowledge of magecraft, the art practised in secret by magi all over the world. Now, unbeknownst to him, the city he lives in, Fuyuki City, is to become the place where a great war will be fought in secret by magi like the man who adopted him.\n\nFor this great war, seven magi shall gather together in Fuyuki. Each magus becomes a Master, and each Master summons a Servant, a spirit of a mighty hero of the past that, due to their almost almighty powers in life and to the faith people have put in them through the times, ascend to a higher level of existence, outside of time. Together, Master and Servant fight against the other teams for the possession of the Holy Grail, a relic said to be almighty and grant any wish, no matter how great. However, in order to allow the winning Master and Servant to be granted one wish each, all other teams must be defeated, and the enemy Servants annihilated. That war is thus called the Holy Grail War. The Holy Grail War has happened four times so far, and the fifth one is about to take place.\n\nThe hero each Servant was in life has fame, and as such their lives are well-known. By knowing the true name of a Servant, one clearly also knows its strengths and weaknesses; thus, it is the custom for each team to hide the identity of their Servant and try to find out those of the other ones. To better hide the identity, the Servants are usually referred to by their classes, Saber, Archer, Lancer, Rider, Berserker, Caster, and Assassin.\n\nOne night, Shirou witnesses a fight between two servants, Archer and Lancer. To preserve the secrecy of the War, Lancer mortally wounds him. However, a girl who up until now was just a classmate of his and the school idol, Toosaka Rin, saves his life by pouring all the magical energy from a pendant into fixing his heart. However, he gets attacked by Lancer again, and this time Rin will not be able to save him. Just as he's about to die for good, he unwittingly summons Saber, who promptly drives Lancer off. The powerful sword user turns to Shirou and asks whether he is her Master, much to his bewilderment. In spite of being just a rank amateur, he now has to fight a war between powerful and experienced magi, and has people he knows turned into enemies.","torrent":{"xt":"urn:btih:135b3ef056d8cca9aded805a442c910528cc9571","amp;dn":"%5BThund3r3mp3ror%5D+Fate+Stay+Night+-+Unlimited+Blade+Works+-+00+%5B7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135b3ef056d8cca9aded805a442c910528cc9571","infoHashBuffer":{"type":"Buffer","data":[19,91,62,240,86,216,204,169,173,237,128,90,68,44,145,5,40,204,149,113]},"announce":[],"urlList":[]}}