{"title":"inAudible v 1.666","uid":12625974,"size":103096320,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:13dadc3399f02e051e73f2f8ce5650a0b4e0346d&amp;dn=inAudible+v+1.666&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":1,"time":1445772595,"description":"inAudible\r\n\r\nPrerequisites:\r\n- None. Current versions of inAudible DO NOT require Audible Manager, iTunes, Virtual CD or any additional software. It will support these applications if they are installed, but AA and AAX files are decrypted natively using the inAudible-NG engine.\r\n\r\nFeatures:\r\n- Click once / one step conversion process\r\n- Extremely fast. Over 1000x decryption speed, and 100x - 900x conversion speed\r\n- Decrypts Audible M4P, AA, AAX and AAX+ files\r\n- Losslessly decrypts AAC's from .AAX and MP3's from .AA files\r\n- Transcodes / splits M4B files to MP3 and other supported formats\r\n- Supports MP3, M4B/AAC, Ogg, Opus &amp; FLAC transcoding\r\n- Supports batch conversion of AAX and M4B files\r\n- Reads Audible metadata and names and tags the output files appropriately\r\n- Will cut files using Audible chapter marks or split using silence detection\r\n- Creates CUE files for external splitting if no splitting options are selected\r\n- Allows removal of &quot;This is Audible&quot;, etc.\r\n- Will decrypt files over 2 gigs, which even cause iTunes and Audible's own software to crash\r\n- Supports XP, Win 7, 8 &amp; 8.1 and Linux WINE\r\n\r\nv1.666\r\n- Fixed an issue that would prevent the use of CD-ripped WAVs.\r\n- Fixed a UI threading issue that prevented the loading or saving of CUE files in certain circumstances.\r\n\r\nv1.66\r\n- AA mode for format 4 files was not working on 32-bit systems. Fixed.\r\n- Added MP3 Processing mode (under the Tools menu). If multiple MP3 files are selected, they are merged together with each file being treated as a chapter.\r\n- Fixed some UI blocking issues.\r\n\r\nv1.65\r\n- Fixed some internationalization issues. Things should work better on some non-US systems, now.\r\n- Fixed a crash when using Helix to encode WAV files.\r\n- Fixed a bug that prevented WAV encodes from being processed twice.\r\n- Right-clicking on a row in the chapter list will allow you to automatically renumber the remaining chapters.\r\n\r\nv1.64\r\n- Miscellaneous refactoring.\r\n- Sped up AAX metadata parsing.\r\n- Added support for some user-defined tags in MP3 mode.\r\n- Added narrator tag for LAME encodes.\r\n- Sped up Helix encoding by roughly 10-20%.\r\n\r\nv1.63\r\n- Fixed a bug that could cause the Overdrive chapterizer to crash on certain systems.\r\n- Added ability to adjust chapter points in the Overdrive chapterizer.\r\n- Added function to show the chapter layout embedded within the Overdrive files.\r\n\r\nv1.62\r\n- Fixed a bug in the Overdrive chapterizer that could cause some chapters to get lost.\r\n- AAX's with very high chapter counts (1000+) could cause improper tag retreival and config corruption. Fixed.\r\n- Files split with Overdrive chapterizer now have their title metadata set to their file name.\r\n\r\nv1.61\r\n- Added option to begin conversion to the File menu\r\n- Tweaked &quot;Allow for resize&quot; to hopefully work around a .NET bug on low-res systems.\r\n\r\nv1.60\r\n- Added an option to change the size of the window for low-res systems (Tools-&gt;Allow form resize)\r\n- Fixed a bug in the Overdrive chapterizer that could cause crashes in certain situations.\r\n- Overdrive Sub-chapters are now automatically removed.\r\n\r\nv1.59\r\n- Downloading cover art on Windows 10 was broken. Fixed.\r\n- Added Overdrive chapterizing tool.\r\n- When AAX decryption fails due to problems with your Audible Manager installation, NG mode is automatically enabled.\r\n- Added &quot;Toggle resize&quot; option under tools menu for smaller displays.\r\n\r\nv1.58\r\n- Fixed a bug when using the Advanced Splitter to split a file by CUE points with chapter descriptions.\r\n- Fixed a bug that would cause the first book in a batch to be skipped when processing a batch for the second time.\r\n- Audible Manager is no longer required for AA decryption\r\n- AA chapter splitting is now much more accurate\r\n- Added the ability to edit chapter descriptions\r\n- Splitting by fixed duration in the advanced splitter could often cause splits to fall in the middle of words. Fixed.\r\n- Added ability to split by fixed duration during the encoding process. Check &quot;Fixed duration splits&quot; and &quot;Split by Chapter Markers&quot; and set the number of minutes that you would like to split by. Splits are aligned to the nearest half second of silence.\r\n- Some M4B players would show a garbage character at the end of chapter names. Fixed.\r\n- Sped-up chapterization of non-True Decrypted M4B's.\r\n- Added the ability to read and write chapter names.\r\n- You can now load the renaming session into inAudible.\r\n\r\nDOWNLOAD LINK","torrent":{"xt":"urn:btih:13dadc3399f02e051e73f2f8ce5650a0b4e0346d","amp;dn":"inAudible+v+1.666","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13dadc3399f02e051e73f2f8ce5650a0b4e0346d","infoHashBuffer":{"type":"Buffer","data":[19,218,220,51,153,240,46,5,30,115,242,248,206,86,80,160,180,224,52,109]},"announce":[],"urlList":[]}}