{"title":"Fallen Angel (1945) Alice Faye Eng","uid":5494349,"size":1114155838,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1412a42186e2b6edf41a285907d490e811707586&amp;dn=Fallen+Angel+%281945%29+Alice+Faye+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"johnefp","files":-1,"time":1271176833,"description":"Otto Preminger directed this stylish film noir exercise, intended as a follow-up to his surprise hit Laura. Kicked off a bus traveling cross-country for not being able to come up with the fare, down-and-out press agent Eric Stanton (Dana Andrews) ends up in Walton, a small coastal town in California. Stanton fast-talks Joe Ellis (Olin Howland) into giving him a place to stay for the night in exchange for promoting Professor Madley (John Carradine), a &quot;mentalist&quot; whose show Ellis manages. While in Walton, Stanton makes the acquaintance of June Mills (Alice Faye), a wealthy but reclusive young woman, and has his eye on Stella (Linda Darnell), a good-looking waitress working at the local diner. Thanks to Madley, Stanton learns a few things about June, and when Ellis and the professor pull up stakes after a successful engagement, Stanton opts to stay behind, hoping to win Stella's heart. Gold digger Stella makes it known that she has no interest in Stanton unless he comes into a lot of money, but June has made her interest in Stanton quite clear. Stanton hatches a plan: he'll marry June, take her money, divorce her, and then take up with Stella. Stanton and June do in fact marry, but just as he's about to give her the brush-off, Stella turns up dead. Mark Judd (Charles Bickford), a retired cop-turned-detective, is investigating the murder, and while the initial suspect is Dave Atkins (Bruce Cabot), Stella's ne'er-do-well ex-boyfriend, Judd's focus eventually falls on Stanton. Stanton flees Walton for San Francisco, with ever-loyal June at his side; he quickly abandons her after taking her money, but he returns to her side when word reaches him that June has been charged with Stella's murder. Fallen Angel marked a dramatic change of pace for Alice Faye; however, she was very unhappy with how Preminger  edited her performance, convinced that much of her best work ended up on the cutting-room floor. Faye was so angry that she quit the movie business altogether and didn't appear in another film until State Fair in 1962.  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0037691/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0037691/&lt;/a&gt;\n\nSubs &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-14903&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-14903&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:33:08\nMovie complete : Yes\n\n[Video]\nResolution : 640x480 4:3\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 1468 Kbps\nQuality Factor : 0,20 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 1\nSample Rate : 48000 Hz\nBitRate : 127 Kbps\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks \n\nJohn\n","torrent":{"xt":"urn:btih:1412a42186e2b6edf41a285907d490e811707586","amp;dn":"Fallen+Angel+%281945%29+Alice+Faye+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1412a42186e2b6edf41a285907d490e811707586","infoHashBuffer":{"type":"Buffer","data":[20,18,164,33,134,226,182,237,244,26,40,89,7,212,144,232,17,112,117,134]},"announce":[],"urlList":[]}}