{"title":"Adolf Hitler - Mein Kampf Ford Translation - 2012 (96kbps)","uid":14398247,"size":1150508557,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:14cd667168962d019c0a6ef44579fc7b413d0c23&amp;dn=Adolf+Hitler+-+Mein+Kampf+Ford+Translation+-+2012+%2896kbps%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"d-a-a","files":33,"time":1461364159,"description":"Mein Kampf: The Ford Translation\r\n\r\nLanguage: English\r\nGenre: History/Biography\r\nPublishing House: Elite Minds Inc\r\nISBN or ASIN: B009C3ZWV8\r\nDuration: ~28hrs\r\nAudio codec: MP3\r\nAudio Bitrate: 64 kbps\r\n\r\nFor the first time in 65 years, a modern, easy to understand, truly complete, and uncensored edition of Mein Kampf has been released, which reveals more than any past translation. This is also the first translation available in an English language audio format.\r\n\r\nOlder translations altered passages, omitted passages, mistranslated Hitler's words and made some parts more sensational while concealing the true meaning of other parts of the book. If you have read one of those older translations of Mein Kampf, then you have not read the real Mein Kampf, which is found only in the Ford Translation.\r\n\r\nMein Kampf is often portrayed as nothing more than an anti-Semitic work; however, only six percent of it references the Jews. The rest contains Hitler's ideas and beliefs about a greater nation and his plan for accomplishing that goal. He outlines his plans for not only world conquest, but the conquest of the universe. The majority of the work involves Hitler's discussion of the German people's difficult times after the First World War, his political theories, and his organization of the Nazi Party, as well as many attacks against his enemies.\r\n\r\nMein Kampf offers an interesting interpretation of politics, people, and foreign-policy matters. To characterize it as only a racist work is to oversimplify.\r\n\r\nThe Ford Translation offers:\r\n\r\nThe most accurate translation ever produced\r\nPhrases that are translated with precision and without translator bias\r\nUncommon words replaced with more common and meaningful terms\r\nReferences to unfamiliar people or places explained in the text\r\nAll original passages and references restored, including passages omitted from other common translations\r\nThis translation has corrected over 1,000 errors present in past translations and is the only edition so thoroughly researched and verified that it required a separate book (Mein Kampf: A Translation Controversy) to document the changes and corrections made","torrent":{"xt":"urn:btih:14cd667168962d019c0a6ef44579fc7b413d0c23","amp;dn":"Adolf+Hitler+-+Mein+Kampf+Ford+Translation+-+2012+%2896kbps%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14cd667168962d019c0a6ef44579fc7b413d0c23","infoHashBuffer":{"type":"Buffer","data":[20,205,102,113,104,150,45,1,156,10,110,244,69,121,252,123,65,61,12,35]},"announce":[],"urlList":[]}}