{"title":"Ancient Religions, Modern Politics (2014) [5 Formats]","uid":10593798,"size":10885624,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:14d8cafafa681f56a1875b76c35a6977b206acd3&amp;dn=Ancient+Religions%2C+Modern+Politics+%282014%29+%5B5+Formats%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1405836906,"description":"\nTitle: Ancient Religions, Modern Politics - The Islamic Case in Comparative Perspective \nAuthor: Michael Cook\nCategory: Academic/Religion/Politics \nPublisher: Princeton University Press (March 23, 2014)\nLanguage: English\nISBN-10: 0691144907\nISBN-13: 978-0691144900\n\nPromotional info/Publisher's summary - &quot;Why does Islam play a larger role in contemporary politics than other religions? Is there something about the Islamic heritage that makes Muslims more likely than adherents of other faiths to invoke it in their political life? If so, what is it? Ancient Religions, Modern Politics seeks to answer these questions by examining the roles of Islam, Hinduism, and Christianity in modern political life, placing special emphasis on the relevance--or irrelevance--of their heritages to today's social and political concerns.\n\nMichael Cook takes an in-depth, comparative look at political identity, social values, attitudes to warfare, views about the role of religion in various cultural domains, and conceptions of the polity. In all these fields he finds that the Islamic heritage offers richer resources for those engaged in current politics than either the Hindu or the Christian heritages. He uses this finding to explain the fact that, despite the existence of Hindu and Christian counterparts to some aspects of Islamism, the phenomenon as a whole is unique in the world today. The book also shows that fundamentalism--in the sense of a determination to return to the original sources of the religion--is politically more adaptive for Muslims than it is for Hindus or Christians.\n\nA sweeping comparative analysis by one of the world's leading scholars of premodern Islam, Ancient Religions, Modern Politics sheds important light on the relationship between the foundational texts of these three great religious traditions and the politics of their followers today.&quot;\n\nReviews:\n&quot;Ancient Religions, Modern Politics is at once painstaking and panoramic. It draws on a lifetime of learning and erudition, yet is audacious in its willingness to pose--and answer--bold questions. Rich in its use of sources and convincing in its arguments, this book will be widely read and very influential.&quot; -Andrew F. March, author of Islam and Liberal Citizenship\n\n&quot;[Cook] presents a panoramic and nuanced overview of political Islam with regard to identity, social values and culture over time.&quot; -Sundeep Khanna, Mint\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image, the original hardcover front (pictured) and generated metadata.opf file are also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:14d8cafafa681f56a1875b76c35a6977b206acd3","amp;dn":"Ancient+Religions%2C+Modern+Politics+%282014%29+%5B5+Formats%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d8cafafa681f56a1875b76c35a6977b206acd3","infoHashBuffer":{"type":"Buffer","data":[20,216,202,250,250,104,31,86,161,135,91,118,195,90,105,119,178,6,172,211]},"announce":[],"urlList":[]}}