{"title":"[DivX ac3 Ita Eng] The Matrix - 1999 (nautilus-bt.org)","uid":6802950,"size":1839368192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1533173ec7db3e23ca23e43d04dadb51f1f641c0&amp;dn=%5BDivX+ac3+Ita+Eng%5D+The+Matrix+-+1999+%28nautilus-bt.org%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Collerom","files":-1,"time":1320713247,"description":" &lt;a href=&quot;http://img689.imageshack.us/img689/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img689.imageshack.us/img689/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img207.imageshack.us/img207/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img207.imageshack.us/img207/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img153.imageshack.us/img153/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img153.imageshack.us/img153/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img195.imageshack.us/img195/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img195.imageshack.us/img195/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img641.imageshack.us/img641/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img641.imageshack.us/img641/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img100.imageshack.us/img100/4482/matrix1itaengavisnapsho.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img100.imageshack.us/img100/4482/matrix1itaengavisnapsho.jpg&lt;/a&gt;\n\n\n\nThe Matrix\n\nThe Matrix is a 1999 science fiction-action film written and directed by Larry and Andy Wachowski, starring Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Joe Pantoliano, and Hugo Weaving. It was first released in North America on March 31, 1999, and in Australia on April 8, 1999, and is the first installment in the Matrix series of films, comic books, video games, and animation.\n\nThe film depicts a future in which reality as perceived by most humans is actually a simulated reality created by sentient machines to pacify and subdue the human population, while their bodies\\' heat and electrical activity are used as an energy source. Upon learning this, computer programmer \\&quot;Neo\\&quot; is drawn into a rebellion against the machines, involving other people who have been freed from the \\&quot;dream world\\&quot; and into reality.\n\nThe film contains many references to the cyberpunk and hacker subcultures; philosophical and religious ideas such as RenÃƒÂ© Descartes\\' evil genius, the Allegory of the Cave, the brain in a vat thought experiment; and homages to Alice\\'s Adventures in Wonderland, Hong Kong action cinema, spaghetti westerns, dystopian fiction, and Japanese animation.\n\n\nPlot\n\nComputer programmer Thomas A. Anderson (Keanu Reeves) is secretly a hacker known by the alias \\&quot;Neo.\\&quot; He is restless, and driven to learn the meaning of cryptic references to \\&quot;the Matrix\\&quot; appearing on his computer. An infamous female hacker named Trinity (Carrie-Anne Moss), confirms that a man named Morpheus (Laurence Fishburne), knows the answers he seeks; however, three sinister Agents, led by Agent Smith (Hugo Weaving), arrest Neo and attempt to discourage him from having any contact with Morpheus. Undeterred, Neo attends a secret meeting with Morpheus, who offers him a choice of two pills: A blue one that would allow him to continue his ordinary life, and a red pill that would allow him to learn the truth about the Matrix. Neo swallows the red pill, and he abruptly finds himself in a liquid-filled pod, his body connected by tubes and cables to a vast mechanical tower covered with identical pods. The connections are severed, and he is rescued by Morpheus and taken aboard his ship, the Nebuchadnezzar. Neo\\'s atrophied physical body is restored, and Morpheus explains the situation.\n\nMorpheus tells Neo that it is not 1999, but closer to 2199, and that humanity is fighting a war against intelligent machines created in the early 21st century. The sky is covered by thick black clouds created by the humans in an attempt to cut off the machines\\' supply of solar power. The machines responded by using human beings as their energy source in conjunction with nuclear fusion, later growing countless people in pods and harvesting their bioelectrical energy and body heat. The world in which Neo grew up was actually the Matrix, a simulated reality of the world set in 1999, developed by the machines in order to keep the human captives docile. Morpheus and his crew belong to a group of free humans who \\&quot;unplug\\&quot; others from the Matrix and recruit them to their resistance against the machines. They are able to use their understanding of the Matrix\\'s nature to bend the simulation\\'s laws of physics, giving them superhuman abilities within the virtual world. Morpheus believes that Neo is \\&quot;the One,\\&quot; a man prophesied to end the war through his limitless control over the Matrix.\n\nNeo is trained as a member of the rebellion. A socket in Neo\\'s skull, formerly used by the machines to connect him to the Matrix, allows knowledge to be uploaded directly into his mind. In this way, he is able to quickly learn numerous martial arts styles, and impresses the crew with his speed when sparring in the rebels\\' virtual reality \\&quot;construct\\&quot; environment. Further training introduces Neo to the key dangers in the Matrix itself. He learns that fatal injuries suffered within the simulation will also kill one\\'s physical body in the real world. He is warned that the Agents he previously met are powerful sentient computer programs with the ability to possess the virtual body of anyone still directly connected to the Matrix, whose purpose is to seek out and eliminate any threats to the simulation. Morpheus is confident that once Neo fully understands his own abilities as \\&quot;the One\\&quot;, the Agents will be no match for him.\n\nThe group enters the Matrix and takes Neo to meet the Oracle (Gloria Foster), the woman who has predicted the eventual emergence of the One. From her comments, Neo infers that he is not the One. The Oracle adds that Morpheus believes in Neo so blindly that he will sacrifice his life to save him.\n\nReturning to the hacked telephone line which serves as a safe \\&quot;exit\\&quot; from the Matrix, the group is surrounded by Agents and SWAT teams. One of the members of the group, Mouse (Matt Doran), is killed in the initial ambush. Morpheus stays behind to delay the agents, allowing Neo and the others to escape. They learn that they were betrayed by their fellow crew-member Cypher (Joe Pantoliano), who preferred his old life in the Matrix over the real world, and who had made a deal with the machines to have himself reinserted into the Matrix in exchange for giving them Morpheus. Cypher is killed, but his betrayal leads to the deaths of all crew-members except Neo, Trinity, Tank (Marcus Chong), and Morpheus.\n\nMorpheus is held in a government building in the Matrix. The Agents try to coerce him into revealing the access codes to the mainframe of Zion, the humans\\' subterranean refuge in the real world. Neo and Trinity storm the building to rescue their leader. Neo becomes more confident in his ability to manipulate the Matrix, ultimately dodging bullets fired at him. Escaping to a subway station, Morpheus and Trinity use a pay phone to exit the Matrix, but before Neo can leave he is ambushed by Agent Smith. Neo stands his ground and eventually causes Smith to get hit by a train, but flees when the Agent possesses another body.\n\n\nProduction\n\nDirected by Andy Wachowski\nLarry Wachowski\nProduced by Joel Silver\nWritten by Andy Wachowski\nLarry Wachowski\nStarring Keanu Reeves\nLaurence Fishburne\nCarrie-Anne Moss\nHugo Weaving\nJoe Pantoliano\nMusic by Don Davis\nCinematography Bill Pope\nEditing by Zach Staenberg\nStudio Village Roadshow Pictures\nSilver Pictures\nDistributed by Warner Bros. Pictures\nRelease date(s) March 31, 1999 (United States)\nApril 8, 1999 (Australia)\nRunning time 136 minutes\nCountry Australia\nUnited States\n\n\n\nCast\n\nKeanu Reeves as Thomas A. Anderson/Neo: A computer programmer in Metacortex corporation who moonlights as a hacker. Recruited by Morpheus to fight the machines.\nLaurence Fishburne as Morpheus: A human freed from the Matrix, captain of the Nebuchadnezzar. He finds Neo and helps him learn the truth.\nCarrie-Anne Moss as Trinity: Freed by Morpheus, crewmember of the Nebuchadnezzar and Neo\\'s romantic interest.\nHugo Weaving as Agent Smith: A sentient \\&quot;Agent\\&quot; program of the Matrix whose purpose is to destroy Zion and stop humans from getting out of the Matrix. Unlike other agents, he has ambitions to free himself from his duties.\nJoe Pantoliano as Cypher: Another human freed by Morpheus, who betrays Morpheus to the Agents to ensure his return to the Matrix.\nJulian Arahanga as Apoc: A freed human and crew member on the Nebuchadnezzar.\nAnthony Ray Parker as Dozer: A \\&quot;natural\\&quot; human born outside of the Matrix, and pilot of the Nebuchadnezzar.\nMarcus Chong as Tank: the \\&quot;operator\\&quot; of the Nebuchadnezzar, he is Dozer\\'s brother, and like him was born outside of the Matrix.\nMatt Doran as Mouse: A freed human and programmer on the Nebuchadnezzar.\nGloria Foster as the Oracle: Exiled sentient computer program who still resides in the Matrix, helping the freed humans with her foresight and wisdom.\nBelinda McClory as Switch: A human freed by Morpheus and crew member of the Nebuchadnezzar.\nPaul Goddard as Agent Brown: One of two sentient \\&quot;Agent\\&quot; programs in the Matrix who work with Agent Smith to destroy Zion and stop humans escaping the system.\nRobert Taylor as Agent Jones: Second sentient \\&quot;Agent\\&quot; program working with Agent Smith.\nAda Nicodemou as DuJour (The White Rabbit Girl): a reference to the White Rabbit in Alice\\'s Adventures in Wonderland\n\n\n\n\n\n\n\n\n\n\n\n[ Info sul file ]\n\nNome: matrix.avi\nData: 18/10/2011 16:05:04\nDimensione: 1,839,368,192 bytes (1754.158 MB)\n\n[ Info generiche ]\n\nDurata: 02:10:43 (7842.92 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 3\nTipo stream n. 0: video\nTipo stream n. 1: audio\nTipo stream n. 2: audio\nAudio streams: 2\nISFT: VirtualDubMod 1.4.13\nJUNK: VirtualDub build 14328/release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: MEDIA (672 x 288)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (4.083234)\nQualitÃƒÂ  deviazione standard: MEDIA (1.177385)\nMedia pesata dev. std.: MEDIA (0.924374)\n\n[ Traccia video ]\n\nFourCC: divx/DX50\nRisoluzione: 672 x 288\nDisplay aspect ratio: 7:3 = 2.333333 (~2.35:1)\nFramerate: 25 fps\nFrames totali: 196073\nBitrate: 1349.727648 kbps\nQf: 0.278961\nMax key int: 250\n\n[ Traccia audio n. 1 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 256 kbps CBR\nCanali: 5\nFrequenza: 48000 Hz\nStream size: 250,973,440 bytes\nRitardo: 0 ms\n\n[ Traccia audio n. 2 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 256 kbps CBR\nCanali: 5\nFrequenza: 48000 Hz\nStream size: 250,973,440 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b2816p\nPacked bitstream: SÃƒÂ¬\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 196073\nFrames corrotti: 0\n\nI-VOPs: 6050 ( 3.086 %) #\nP-VOPs: 118453 ( 60.413 %) ###############\nB-VOPs: 71570 ( 36.502 %) #########\n\nMax consecutive B-VOPs: 1\n\n[ Analisi DRF ]\n\nDRF medio: 4.083234\nDeviazione standard: 1.177385\nDRF max: 20\n\nDRF9: 529 ( 0.270 %)\n\nRapporto generato da AVInaptic (26-05-2007) in data 4 nov 2011, h 11:01:13","torrent":{"xt":"urn:btih:1533173ec7db3e23ca23e43d04dadb51f1f641c0","amp;dn":"%5BDivX+ac3+Ita+Eng%5D+The+Matrix+-+1999+%28nautilus-bt.org%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1533173ec7db3e23ca23e43d04dadb51f1f641c0","infoHashBuffer":{"type":"Buffer","data":[21,51,23,62,199,219,62,35,202,35,228,61,4,218,219,81,241,246,65,192]},"announce":[],"urlList":[]}}