{"title":"David Einhorn: Fooling Some of the People All of the Time A Long","uid":8115994,"size":3251874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:153b8ba4c2f1cffd8a50b86c173a145674b6cea4&amp;dn=David+Einhorn%3A+Fooling+Some+of+the+People+All+of+the+Time+A+Long&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"FrancoHarris","files":1,"time":1360299577,"description":"A revealing look at Wall Street, the financial media, and financial regulators by David Einhorn, the President of Greenlight Capital\nCould 2008's credit crisis have been minimized or even avoided? In 2002, David Einhorn-one of the country's top investors-was asked at a charity investment conference to share his best investment advice. Short sell Allied Capital. At the time, Allied was a leader in the private financing industry. Einhorn claimed Allied was using questionable accounting practices to prop itself up. Sound familiar? At the time of the original version of Fooling Some of the People All of the Time: A Long Short Story the outcome of his advice was unknown. Now, the story is complete and we know Einhorn was right. In 2008, Einhorn advised the same conference to short sell Lehman Brothers. And had the market been more open to his warnings, yes, the market meltdown might have been avoided, or at least minimized.\n\nDetails the gripping battle between Allied Capital and Einhorn's Greenlight Capital\nIlluminates how questionable company practices are maintained and, at times, even protected by Wall Street\nDescribes the failings of investment banks, analysts, journalists, and government regulators\nDescribes how many parts of the Allied Capital story were replayed in the debate over Lehman Brothers\nFooling Some of the People All of the Time is an important call for effective government regulation, free speech, and fair play.\n\n\nTHIS ONE HAS NO PESKY WATERMARK. A BIG FUUUUCK YOU TO THE OTHER GUY.","torrent":{"xt":"urn:btih:153b8ba4c2f1cffd8a50b86c173a145674b6cea4","amp;dn":"David+Einhorn%3A+Fooling+Some+of+the+People+All+of+the+Time+A+Long","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"153b8ba4c2f1cffd8a50b86c173a145674b6cea4","infoHashBuffer":{"type":"Buffer","data":[21,59,139,164,194,241,207,253,138,80,184,108,23,58,20,86,116,182,206,164]},"announce":[],"urlList":[]}}