{"title":"Encyclopedia of African History &amp; Culture - 3 Volumes","uid":5492530,"size":67912147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1568c6e2cd2b930b99c3e023d55c523e77195f09&amp;dn=Encyclopedia+of+African+History+%26+Culture+-+3+Volumes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"artpepper","files":-1,"time":1271091092,"description":"Willie F. Page Encyclopedia of African History and Culture, 3 vol.\n\n\nFacts on File | 2005 | ISBN: 0816052697 | 1780 pages | PDF | 60 MB\n\n\n\nAuthoritative and Illuminating; This comprehensive set covers the entire expanse of African history as never before. It treats Africa - its geography, art, cultures, peoples, personalities, and even its wildlife - in three volumes, each devoted to a major period in the continent's development. \n\nEach volume's in-depth, heavily cross-referenced, and alphabetical entries draw students, researchers, and general readers into the histories of ancient cities, powerful kingdoms, and charismatic leaders, many of whom are little known. \n\nFilled with fascinating sidebars, unusual illustrations, and above all wonderful stories, these accessible, attractive, and very readable encyclopedias are authoriative information sources as well as enteratining and illuminating guides to the world's most diverse continent. \n\n\n\nAncient Africa - This volume covers the earliest stages of Africa's history, from civilization's beginnings through the Metallic Age, the kingdoms of Egypt and Nubia, Africa's interaction with ancient Greece and Rome, and the rise of Kush and Aksum. \n\nAfrican Kingdoms - The focus of this volume is on the period from approximately 500 through 1500, encompassing the powerful kingdoms of Ghana, Mali, and Songhai along with the wealthy city-states of the west and south. \n\nAfrican Conquest and Colonization - Covering the period from approximately 1500 to 1850, this volume examines the Grain, Gold, and Slave Coasts; the rise of the slave trade; the partitioning of West Africa; and the traditional governments, religions, and arts of the regions.","torrent":{"xt":"urn:btih:1568c6e2cd2b930b99c3e023d55c523e77195f09","amp;dn":"Encyclopedia+of+African+History+%26+Culture+-+3+Volumes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1568c6e2cd2b930b99c3e023d55c523e77195f09","infoHashBuffer":{"type":"Buffer","data":[21,104,198,226,205,43,147,11,153,195,224,35,213,92,82,62,119,25,95,9]},"announce":[],"urlList":[]}}