{"title":"Raspberry Pi Hacks (Dec  2013)","uid":9474951,"size":93410944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:166dce0eeb5037a2a46b388ee0ebae7846227022&amp;dn=Raspberry+Pi+Hacks+%28Dec++2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1389669269,"description":"Raspberry Pi Hacks: Tips &amp; Tools for Making Things with the Inexpensive Linux Computer\n\nBook Details:\nPages: 400\nPublisher: Maker Media, Inc (December 2013) \nISBN-10: 1449362346 \nISBN-13: 978-1449362348\nFormat: PDF, EPUB\n\nBook Description:\n\nWith more than 60 practical and creative hacks, this book helps you turn Raspberry Pi into the centerpiece of some cool electronics projects. Want to create a controller for a camera or a robot? Set up Linux distributions for media centers or PBX phone systems? That is just the beginning of what you will find inside Raspberry Pi Hacks. If you are looking to build either a software or hardware project with more computing power than Arduino alone can provide, Raspberry Pi is just the ticket. And the hacks in this book will give you lots of great ideas. Use configuration hacks to get more out of your Pi Build your own web server or remote print server Take the Pi outdoors to monitor your garden or control holiday lights Connect with SETI or construct an awesome Halloween costume Hack the Pis Linux OS to support more complex projects Decode audio/video formats or make your own music player Achieve a low-weight payload for aerial photography Build a Pi computer cluster or a solar-powered lab \n\nTable of Contents Chapter 1. Configuration Hacks Chapter 2. Hacking Linux for the Raspberry Pi Chapter 3. Raspberry Pi Around the House Chapter 4. Hacking the Outdoors Chapter 5. Multimedia Hacks Chapter 6. Extend Your Pi \n\n","torrent":{"xt":"urn:btih:166dce0eeb5037a2a46b388ee0ebae7846227022","amp;dn":"Raspberry+Pi+Hacks+%28Dec++2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166dce0eeb5037a2a46b388ee0ebae7846227022","infoHashBuffer":{"type":"Buffer","data":[22,109,206,14,235,80,55,162,164,107,56,142,224,235,174,120,70,34,112,34]},"announce":[],"urlList":[]}}