{"title":"The Bioarchaeology of Individuals [PDF] [StormRG]","uid":9735524,"size":176763049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16cb987d21c3379299c560b517bd3aa79026a2f6&amp;dn=The+Bioarchaeology+of+Individuals+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394438027,"description":"Author: Ann L. W. Stodder , Ann M. Palkovich\nSeries: Bioarchaeological Interpretations of the Human Past: Local, Regional, and Global\nHardcover: 256 pages\nPublisher: University Press of Florida (April 22, 2012)\nLanguage: English\nISBN-10: 0813038073\nISBN-13: 978-0813038070 \nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\n&quot;Harnessing the concept of 'the power of one,' this book guides the reader into the past using carefully woven biographies rich in detail and scope.&quot;--Anne L. Grauer, Loyola University, Chicago\n\n&quot;The populational approach to bioarchaeology tends to be monochrome in its efforts to answer broader research-oriented questions. This volume splashes the past with color through a select group of individuals who actually experienced it.&quot;--Margaret A. Judd, University of Pittsburgh\n\nFrom Bronze Age Thailand to Viking Iceland, from an Egyptian oasis to a family farm in Canada, The Bioarchaeology of Individuals invites readers to unearth the daily lives of people throughout history. Covering a span of more than four thousand years of human history and focusing on individuals who lived between 3200 BC and the nineteenth century, the essays in this book examine the lives of nomads, warriors, artisans, farmers, and healers.\nThe contributors employ a wide range of tools, including traditional macroscopic skeletal analysis, bone chemistry, ancient DNA, grave contexts, and local legends, sagas, and other historical information. The collection as a whole presents a series of osteobiographies--profiles of the lives of specific individuals whose remains were excavated from archaeological sites. The result offers a more &quot;personal&quot; approach to mortuary archaeology; this is a book about people--not just bones.","torrent":{"xt":"urn:btih:16cb987d21c3379299c560b517bd3aa79026a2f6","amp;dn":"The+Bioarchaeology+of+Individuals+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16cb987d21c3379299c560b517bd3aa79026a2f6","infoHashBuffer":{"type":"Buffer","data":[22,203,152,125,33,195,55,146,153,197,96,181,23,189,58,167,144,38,162,246]},"announce":[],"urlList":[]}}