{"title":"[PSX] Klonoa: Door to Phantomile","uid":4591441,"size":440540225,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:17961872c94a523076832572d82fd85eb345cd23&amp;dn=%5BPSX%5D+Klonoa%3A+Door+to+Phantomile&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"NinjaOni","files":1,"time":1229853145,"description":"The original Klonoa for the playstation. Downloaded from http://romhustler.net/\n\n---------------------\nReview from gamespot\n---------------------\n\nScore: 9.2\n\nTo begin with an explanation, Klonoa, the character, is a catlike creature with a Pac-Man hat and appendages (arms? wings?) jutting out of his ears. Klonoa, the game, is a pretty inventive side-scroller that brings the fun of old-school Mario Bros. and Sonic games to the PlayStation. And while many games have tried to do this (Pandemonium, Hercules, SkullMonkeys) with varying degrees of success, Klonoa manages to do so without resorting to gimmicks.\n\nKlonoa is a little different than your average side-scroller in that you don't just run around jumping on enemies' heads. Instead, you have the ability to grab them and then throw them at other baddies - or throw them downward, which in turn propels you upward and gives you a little extra oomph in the jumping department. With larger enemies, you can pump them up, Dig Dug-style, then dispose of them or jump on their heads. What makes Klonoa great is that it uses these two play mechanics in almost every imaginable way - levels never get repetitive because you must continually think of new ways to use the few abilities you have.\n\nThe game isn't just a continual trek from left-to-right. Like Pandemonium, Klonoa uses a sort of pseudo-3D approach in which the environment moves in three-dimensions around you, though you are always limited to a single path. Fortunately, this isn't just a neat effect, and the game does a good job of making you notice things going on in the background, even manipulating objects on the Z-plane by throwing projectiles at them. The only problem with this is the one or two moments in the game when it's hard to judge the distance of a moving platform because of perspective issues, but these are very few and far between.\n\nApart from this minor problem, the game looks great. The levels are visually diverse, the enemies interesting, and the cutscenes (both computer generated and in-engine) are excellent. The music is occasionally annoying (imagine Yanni doing the underwater music for Super Mario 64), but for the most part, it fits the mood. The only foreseeable problem is that the artistic design, while technically great, is incredibly surreal, combining psychedelic colors and environments like a waterfall that flows backward. It's also really cute, with characters that look like Fisher-Price toys and talk in helium-induced baby voices, saying things like, &quot;Be boo beep be boo boop!&quot;\n\nBut those who have a problem with the artistic design will easily overlook it once they get into the game. The levels are diverse and continually interesting, and the bosses are excellent. The difficulty ramps up nicely, beginning with the incredibly easy first level and climaxes with an incredibly challenging - and satisfying - end game sequence.\n\nThere are only two real problems with Klonoa: It may be a bit too cute for its own good, and it's a little short (it'll probably only take you a few days to complete). Still, the game is so good, these problems are easily overlooked - it's simply one of the best side-scrollers in years.\n\n-----------\n\nP.S., Please seed when you're done.","torrent":{"xt":"urn:btih:17961872c94a523076832572d82fd85eb345cd23","amp;dn":"%5BPSX%5D+Klonoa%3A+Door+to+Phantomile","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17961872c94a523076832572d82fd85eb345cd23","infoHashBuffer":{"type":"Buffer","data":[23,150,24,114,201,74,82,48,118,131,37,114,216,47,216,94,179,69,205,35]},"announce":[],"urlList":[]}}