{"title":"David Paulides - Missing 411 Interviews","uid":9490312,"size":330455608,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:17c55ea7a7f76cc21292ba75062780a9df4f7e9f&amp;dn=David+Paulides+-+Missing+411+Interviews&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"wardance","files":14,"time":1389984246,"description":"Missing 411 is a book by David Paulides that need not be over looked or ever forgotten. The book is about missing people in North America and Canada that have been unsolved and unexplained. The book goes into each individual case and describes the scenario and facts of what happened. Some people vanish and then are found later with strange facts surrounding the circumstances. Others are never found and the book highlights on the events in honor of these missing people, a lot who are taken from National Parks. The National Parks cover it up and do not maintain lists of these missing people or let it be known to the public. When David Paulides and company tried to get them to compile a list they wanted over a million dollars to do so.\n\nThe book tries not to offer reasons or how these people vanished but evidence putting together a peculiar puzzle of how it happened. No one knows what happened to these people. Some would speculate common facts like kidnappers etc but as you read more and more into the book you begin to wonder if its something supernatural or even weird. But David never goes into this on his radio appearances or in the book in honor of the families who are having to go through these tragedies.\n\nBecause this is about the missing people and to turn into a circus side show of speculation of strange stories would be a dishonor to the people missing and the emotions of their loved ones and families. After speaking to David myself on the phone and asking him what he thought happened. He explained this to me and I found it honorable that he would not divulge that information publicly in respect of those going through the ordeals of losing loved ones in such peculiar unexplained ways.","torrent":{"xt":"urn:btih:17c55ea7a7f76cc21292ba75062780a9df4f7e9f","amp;dn":"David+Paulides+-+Missing+411+Interviews","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17c55ea7a7f76cc21292ba75062780a9df4f7e9f","infoHashBuffer":{"type":"Buffer","data":[23,197,94,167,167,247,108,194,18,146,186,117,6,39,128,169,223,79,126,159]},"announce":[],"urlList":[]}}