{"title":"Xtreme Counter-Strike","uid":3907660,"size":357107906,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:17f0a4d74bc99c0961e1bea20148bb89c73331fd&amp;dn=Xtreme+Counter-Strike&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ricsi{hun}","files":1,"time":1195934754,"description":"Half-Life\nVersion 1.1.1.1\nReadme File\n12/2/02\n\n********************************************************************\nAbout This Document: \n\nThis document contains last-minute information about Half-Life, including questions you may have concerning the game or your computer. If you have a question, check to see if it is addressed here first: you may save yourself a call to Technical Support. \n********************************************************************\n\nI.\tMINIMUM REQUIREMENTS\nII.\tGENERAL TECHNICAL ISSUES\nIII.\tGENERAL GAME ISSUES\nIV.\t3D HARDWARE ISSUES\nV.\tCONTACTING SIERRA\n\nI. MINIMUM REQUIREMENTS\nWindows(r) 95, Windows 98 or Windows NT 4.0\nPentium 133+, 24 MB RAM\nSVGA, high color (16-bit)\n2x CD-ROM drive\nWindows-compatible sound card\nMouse, keyboard\n\nII. GENERAL TECHNICAL ISSUES\n\nDRIVER ISSUES\n\nIf you are using a nVidia based GeForce video card, download the latest reference drivers from www.nvidia.com.  This will fix the problem with models showing up as all white.\n\nWhen running Half-Life in OpenGL, you must select &amp;#039;3Dfx Mini Driver&amp;#039; from the drivers list in the Video Options menu if you have a 3Dfx card (Voodoo, Voodoo2, Rush or Banshee).  Choosing the &amp;#039;Default&amp;#039; driver may severely impact Half-Life&amp;#039;s performance.\n\nThe Diamond Viper 550 drivers older than 4/2/99 cause the game menus to be drawn incorrectly. Use the drivers from the Nvidia home page (http://www.nvidia.com) dated 2/17/99 or later.\n\nMake sure the most current version of DirectX is installed on your computer. DirectX 6 is the most current version (as of 10/31/98), and it is included on the Half-Life CD in the &amp;#039;DirectX&amp;#039; folder. \n\nIf you are running a pre-OSR2 release of Windows95, get the OpenGL 1.1 fix in order to run Half-Life in OpenGL mode.  The fix can be found at ftp://ftp.microsoft.com/softlib/mslfiles/opengl95.exe\n\nMake sure you have installed the most recent drivers for all your hardware before playing Half-Life.\n\nThere is only one CD-Key allowed per client for Internet play.  If you are getting a &quot;CD-Key in use error&quot; make sure that there are no other clients connected to any game server using your CD-Key.\n\nIII. GENERAL GAME ISSUES\n\nLAN HEARTBEATS\nBy default, the Half-Life game engine now reports the current status of IP LAN (e.g., sv_lan 1 or unable to authenticate) games to the master servers.  This reporting is for general statistical information to Valve only and these IP LAN servers will not be visible to Internet players.  If you would like to opt out of having your IP lan server report to the master servers, you must run the engine or dedicated server with the &quot;-nomaster&quot; command line option.\n\nCUSTOM RESOURCE DOWNLOADING\nSomething that has always limited the propagation of custom maps has been the lack of support for custom map resources.  Running a custom map that has it&amp;#039;s own .wad file, custom sprites, or precached sounds has been something of a burden to server operators. So, we&amp;#039;ve added a new feature/function to help simplify the process.\n\nFor this example let&amp;#039;s assume we have a Team Fortress map called &quot;mymap.bsp&quot;.  This map uses a few different custom resources.  It has it&amp;#039;s own .wad file called &quot;mytextures.wad&quot;, a new model called &quot;mymodel.mdl&quot;, and a new sprite called &quot;mysprite.spr&quot;.  As a server operator you will need to go through these steps to allow these resources to be downloaded:\n\n\t1.  Create a file called &quot;mymap.res&quot; and place it into the tfcmaps directory.  The .res file must be the same as the .bsp name.\n\t2.  Add the resource names relative to the game directory in this file.  The file should look like this:\n\t\tmywad.wad\n\t\tmodelsmymodel.mdl\n\t\tspritesmysprite.spr\n\t3.  Run your server with sv_allowdownload set to 1.\n\nWhen a client connects they will start downloading these files.  The client&amp;#039;s download speed/bandwidth is throttled according to their rate.  This will not replace any files that are currently on the client&amp;#039;s machine.\n\nThere are seven valid file types for this:\n\tMaps (.bsp)\n\tTextures (.wad)\n\tModels (.mdl)\n\tSprites (.spr)\n\tBitmaps (.bmp)\n\tSound files (.wav)\n\tTargas (.tga)\n\nTEAM FORTRESS\nFor information on playing Team Fortress, refer to the Team Fortress manual located at half-lifetfcmanualtfccontents.htm.\n\nSOUND PROBLEMS\nIf you don&amp;#039;t hear any sounds while playing Half-Life or if you only hear music, another application you are running may have control of the sound hardware.  Exit Half-Life, close the other application, and restart Half-Life.\n\nA3D 1.0 versus 2.0\nHalf-Life requires version 2.0 of A3D.  You can upgrade your A3D from 1.0 to 2.0 by downloading the latest drivers from Aureal&amp;#039;s website at www.a3d.com.  If you try to enable A3D support in Half-Life without upgrading to 2.0, you will get an error message when starting Half-Life.\n\nCAN&amp;#039;T HEAR CD MUSIC\nIf you don&amp;#039;t hear any music while playing Half-Life, the problem is likely to have one of three causes:\n\n1) The Half-Life CD needs to be in the first CD-ROM drive (only an issue if you have more than one CD-ROM drive).\n2) Another application is actively using the CD Audio when Half-Life starts up.\n3) CD Audio isn&amp;#039;t enabled for the CD-ROM drive.\n\nTo fix the first problem, make sure the Half-Life CD is in your first CD-ROM drive.  To fix the second, close other applications which may be accessing your CD-ROM drive, such as CD music players.  If you still can&amp;#039;t hear the Half-Life music, run the application &quot;CD Player&quot; that comes standard with Windows located on your Start Menu Programs,  Accessories, Multimedia.  If the CD Player doesn&amp;#039;t play the music tracks on the Half-Life CD, then check Control Panel, Multimedia, CD Music, CD ROM Selection, and make sure it&amp;#039;s set to your first CD-ROM drive.  If you&amp;#039;re under NT, you may also want to check Control Panel, Devices, Cdaudio, and make sure it&amp;#039;s not disabled.  Once the first two requirements are met, and the &quot;CD Player&quot; application works, then Half-Life should be able to play the CD music without any problems.\n\n&quot;YOUR HALF-LIFE EXECUTABLE HAS BEEN MODIFIED.  PLEASE CHECK YOUR SYSTEM FOR VIRUSES AND THEN RE-INSTALL HALF-LIFE.&quot; ERROR MESSAGE\nAs soon as you run Half-Life ( or the Half-Life dedicated server -- HLDS.exe ), Half-Life checks itself to determine if the Half-Life executable you are running has been damaged or altered in any way.  The most likely causes of such damage are 1) computer viruses and 2) corrupt portions of a user&amp;#039;s hard disk drive.  The section entitled &quot;YOUR HALF-LIFE INSTALLATION HAS BECOME CORRUPT OR OUT OF DATE&quot; ERROR MESSAGE provides instructions on how to proceed.\n\n&quot;YOUR HALF-LIFE INSTALLATION HAS BECOME CORRUPT OR OUT OF DATE&quot; ERROR MESSAGE\nOne cause for this error message is computer viruses.  If your system has a virus, the virus will modify hl.exe as well as any other programs you run.  When you try to play a multiplayer game, this modification will be detected and your system won&amp;#039;t be authenticated.  Upgrading to the latest version of Half-Life won&amp;#039;t solve the problem, as the virus will infect that version as well.  The work around is simple - download an appropriate virus scanner, remove the virus from your system using the virus scanner, uninstall and then reinstall Half-Life.  The reason you must uninstall and reinstall Half-Life is because many virus scanner programs, while capable of fixing damaged executables, must modify the executable in order to work.  Thus, though the virus scanner has &quot;cleaned&quot; the Half-Life executable, Half-Life will detect the changes and refuse to authenticate the executable. By far the most common virus that our users have encountered has been the CIH virus, and unfortunately some antivirus programs don&amp;#039;t currently detect this virus. We recommend Norton AntiVirus which is available on Symantec&amp;#039;s website at www.symantec.com. We also suggest updating to the latest version.\n\nSETTING UP A LISTEN SERVER IN THE LAUNCHER OR THE CONSOLE\nIf you are setting up your listen server variables in the launcher then all settings are stored in a file called &amp;#039;game.cfg&amp;#039; which is located in the &amp;#039;valve&amp;#039; directory of your installation.  If you would like to modify settings at the console, you must either edit this file directly using notepad, or delete this file and modify all server settings at the console.\n\nSWITCHING BETWEEN OPENGL AND D3D ON THE NVIDIA TNT\nIf you run OpenGL on the nVidia Riva TNT and switch to Direct3D, decals may not appear.  To fix this, type gl_polyoffset 4 at the console.\n\nUSING KEYBOARD SHORTCUTS\nHotkeys can be activated by using the ALT key in combination with the highlighted letter. For example, you can use ALT+R to perform a &amp;#039;Refresh&amp;#039; within the Multiplayer/Internet Games menu.  \n\nJUMP KEY NOT ALLOWING YOU TO SWIM UP\nIf you are having trouble swimming up when you are standing on the ground underwater, try setting fps_lan to a number less than it is currently set to at the console.\n\nCD MUSIC VOLUME\nYou cannot control the CD music volume within Half-Life. To adjust your CD music volume, go to the Windows Start Menu, Programs, Accessories, Multimedia, and select the Volume Control applet. \n\nCD AUDIO SLOWDOWNS\nSome CD-ROM drives take a few seconds to spin up to their playing speed.  You may notice some parts of the game that will momentarily slow down before the CD audio will play.\n\nPLAYING ON THE SAME MACHINE AS A DEDICATED SERVER\nIf you are going to be playing Half-Life multiplayer on the same machine that you are running a dedicated server on, make sure you not using the same port for both.  Run the Half-Life client with -port 27016 (or any other port not in use) in the target line of the shortcut.\n\nVIEW OPENING AVI SEQUENCES\nHalf-Life begins with two short AVI sequences.  If you are having trouble viewing the AVIs, check to see that you have video compression installed. Go to the Control Panel and select Add/Remove programs.  From there, select Windows Setup and scroll down to Multimedia.  Select Multimedia and make sure that Video Compression is checked. \n\nCUSTOM KEYBOARD CONFIGURATION\nIf you plan to customize your keyboard configuration, note that the &amp;#039;jump&amp;#039; and &amp;#039;crouch&amp;#039; commands need to be controlled by different fingers. You will need to use both keys simultaneously when performing a &amp;#039;longjump.&amp;#039;\n\nDESKTOP RESOLUTION AND HALF-LIFE\nHalf-Life should be run in a resolution that is lower than or equal to your desktop resolution.  Running Half-Life in a full-screen or windowed mode that is greater than your desktop resolution can cause problems.\n\nSOUND QUALITY PROBLEMS\nIf your sound is skipping or cracking, you may need to adjust your direct sound configuration in Half-Life.  There are two common adjustments you can make:\n\n1) Adjust _snd_mixahead.  If you have access to the Half-Life console, type &quot;_snd_mixahead 0.2&quot; at the console.  If not, create a file with notepad that contains the line:\n_snd_mixahead 0.2\nAnd save it in your Half-LifeValve directory.  Name the file &quot;autoexec.cfg&quot;.\n\n2) Disable direct sound.  Run Half-Life with the command line argument &quot;-wavonly&quot;.  Edit the Half-Life shortcut.  The &amp;#039;target&amp;#039; field should say: &quot;HL.EXE -wavonly&quot;.\n\nGETTING STUCK ON LADDERS IN MULTIPLAYER\nIf you are getting stuck on the tops of ladders in a multiplayer game, make sure that the server you are running on does not have the variable sv_airaccelerate set to zero.  Any value other than zero will work properly.\n\nMULTIPLAYER FRAMERATE ISSUE\nIf you are experiencing low framerate in long multiplayer games, it may be caused by too many decals.  Decals are used to display spray paint, bulletholes, and blood effects in multiplayer.  You can adjust the console variable &quot;r_decals&quot; to set a lower limit.  The default value is 4096.  For better performance, try setting &quot;r_decals 500&quot;.  Bring down the console (using the ~ key) and type &quot;r_decals 500&quot;.  You can set r_decals to any value between 0 (completely disables these effects) and 4096 (normal value for single player).\n\nTURNING OFF DATA COMPRESSION\nWhen playing Half-Life online turning off data compression can significantly improve your latency.  To turn off data compression go to your dial up connection in the Dial-Up networking area of your computer.  Right click on your dial up connection and go to &amp;#039;Properties&amp;#039;, click on the Server Types tab at the top and uncheck the software compression box.\n\nNEW COMMAND LINE SWITCHES IN THIS UPDATE\n&quot;-w #&quot;   sets the video mode width where # is the width in pixels of desired video mode.\n\n&quot;-d3d&quot;  selects the Direct3D engine\n&quot;-soft&quot;  selects the Software engine\n&quot;-gl&quot;     selects the OpenGL engine\n&quot;-gldrv &lt;driver name&gt; &quot; selects the GL Driver. The two choices are &quot;Default&quot; and &quot;3dfxgl.dll&quot;. \n\n&quot;-win&quot;  selects windowed mode\n&quot;-full&quot;   selects full screen mode\n\n&quot;-gamegauge &lt;demo name&gt;&quot; runs the demo in Game Gauge mode. This is a benchmark utility that runs through a demo as fast as possible and stores the framerate in the file fps.txt in the Half-Life directory.\n\nJOYSTICK AND GAMEPAD CONFIGURATION\nEnable use of joysticks or gamepads by checking the joystick box in the Configuration/Controls/Advanced controls menu. Joystick and gamepad buttons can then be configured through the Configuration/Controls menu.\n\nValve thanks James Barnes at First-Person Gaming, Inc. for permission to use his excellent documentation on joystick support.  Information on their products are available on the Internet at http://www.fpgaming.com/.\n\nHalf-Life supports standard joysticks, digital joysticks and advanced controllers like the FPgaming Assassin 3D, the Logitech WingMan Warrior and the SpaceTec IMC SpaceOrb.\n\nTo enable Half-Life joystick support, verify that your joystick or game controller is selected in the Joystick control panel applet and has been calibrated and tested, then launch Half-Life. Check the joystick box in the Configuration/Controls/Advanced controls menu of Half-Life.\n\nFor advanced controllers, you will also need to have a configuration file called joystick.cfg.  Typically this configuration file should be obtained from your game controller company.  However you can create your own and place this file in the Valve subdirectory of your Half-Life directory.  Half-Life will automatically execute this configuration file each time you start the game. \n\nThe configuration files for common game controllers are included below.\n\nHalf-Life Joystick functionality\n\n1. Proportional movement (the farther you move the stick, the faster you move) \n2. Support for up to 32 buttons (JOY1-JOY4 and AUX5-AUX32)\n3. Sensitivity setting for each control (allows tuning and inverting the control direction)\n4. Dead-zone setting for each control\n5. Support for all 6 axes (X, Y, Z, R, U, V)\n6. Mapping of any axis to any control (Forward, Look, Side, Turn)\n7. Support for absolute controls (like joysticks) and relative controls (like trackballs and spinners)\n\nThe default joystick setting is for joystick left/right movement to control turning and for joystick forward/backward movement to control moving forward/backward.  To control strafing, assign the &amp;#039;strafe modifier&amp;#039; to one of your joystick buttons (via the Configuration/Controls menu).  To control joystick looking, assign the  &amp;#039;Joystick look modifier&amp;#039; to one of your joystick buttons (also via the Configuration/Controls menu).  \n\n&amp;#039;Reverse mouse&amp;#039; in the Configuration/Controls/Advanced controls menu also changes the direction the joystick has to move when looking up and down.\n\nThe following variables can be set in your joystick.cfg.\n\nThese variables control your sensitivity settings:\nCommand Name\tCommand Action\tDefault\tNOTES:\t\nVariable:  Joyforwardsensitivity\nFunction:  Controls the ramp-up speed or how much joystick movement is required for moving &quot;full speed&quot; forward and backward\nDefault:  -1.0\nComments:  If your joystick is not as fast as you think it should be try a setting of -1.5, you will reach full speed with only half of the movement.\t\n\nVariable:  Joysidesensitivity\nFunction:  Controls the ramp-up speed or how much joystick movement is required for moving &quot;full speed&quot; side to side\nDefault:  1.0\nComments:  If your joystick is not as fast as you think it should be try a setting of 1.5, you will reach full speed with only half of the movement.\t\n\nVariable:  Joypitchsensitivity\nFunction:  Controls the speed or ratio used when you look up and down using the Assassin 3D\nDefault:  -0.25\nComments:  This setting will allow you to look Up and Down at a 45 degree angle without repositioning your hand.\t\n\nVariable:  Joyyawsensitivity\nFunction:  Controls the speed that or ratio used when you look left to right using the Assassin 3D\nDefault:  -0.5\nComments:  This setting will allow you to look left and right at a 90 degree angle without repositioning your hand.\t\n\nYou can set the sensitivity settings to negative numbers.  This inverts the direction of movement for the control.  The default sensitivity settings are 1 (or -1). \n\nThese variables control your threshold settings:\nCommand Name\tCommand Action\tDefault\tNOTES:\t\nVariable:  Joyforwardthreshold\nFunction:  Controls the dead-zone for moving forward and backward\nDefault:  0.15\nComments:  If you have problems with your character moving forward or back when trying to stop or strafe, increase this number to .20\t\n\nVariable:  Joysidethreshold\nFunction:  Controls the dead-zone for moving side to side\nDefault:  0.15\nComments:  If you have problems with your character moving left or right when trying to stop or walk a ledge, increase this number to .20\n\nVariable:  Joypitchthreshold\nFunction:  Controls the dead-zone for looking up and down\nDefault:  0.15\n\nVariable:  Joyyawthreshold\nFunction:  Controls the dead-zone for looking left and right\nDefault:  0.15\t\t\n\nThe threshold settings allow you to control your dead-zone (or no-movement zone).  The default threshold settings are .15 (meaning 15% of the full-range).  The range of the threshold settings is from 0 to 1.  Troublesome analog joysticks may need a larger number (like .2).  Premium joysticks can use a smaller number (like .1).\n\nIf your joystick has a POV hat, the buttons are mapped to AUX29-AUX32.  So, you get 8 buttons with the Logitech WingMan Extreme, 12 buttons with the Microsoft SideWinder 3D Pro, etc.\n\nThese six variables control axis mapping:\nCommand Name\tCommand Action\tDefault\tNOTES:\t\nVariable:  Joyadvaxisx\nFunction:  Controls mapping of DirectInput axis X (typically joystick left and right)\nDefault:  3\nComments:  Allows the joystick to turn. \t\n\nVariable:  Joyadvaxisy\nFunction:  Controls mapping of DirectInput axis Y (typically joystick forward and backward)\nDefault:  1\nComments:  Allows the joystick to move forward and backward.\t\n\nVariable:  Joyadvaxisz\nFunction:  Controls mapping of DirectInput axis Z (typically joystick throttle)\nDefault:  0\nComments:  Not used.\t\n\nVariable:  Joyadvaxisr\nFunction:  Controls mapping of DirectInput axis R (typically joystick rudder)\nDefault:  0\nComments:  Not used.\t\n\nVariable:  Joyadvaxisu\nFunction:  Controls mapping of DirectInput axis U (custom axis - Assassin 3D trackball left and right, WingMan Warrior SpinControl and SpaceOrb roll)\nDefault:  20\nComments:  Sets the Assassin 3D to relative turning left and right. (Not self centering)\t\n\nVariable:  Joyadvaxisv\nFunction:  Controls mapping of DirectInput axis V (custom axis - Assassin 3D trackball forward and backward and SpaceOrb yaw)\nDefault:  18\nComments:  Sets the Assassin 3D to relative free-look up and down. (Not self centering)\t\n\nEach joyadvaxis variable can be set to the following controls:\n\n\t0 = Axis not used\n\t1 = Axis is for forward and backward movement\n\t2 = Axis is for looking up and down (pitch)\n\t3 = Axis is for side to side movement\n\t4 = Axis is for turning left and right (yaw)\n\nAdditionally, each axis can be designated as an absolute axis (like a joystick) or a relative axis (like the FPgaming trackball or the WingMan Warrior SpinControl).  Absolute axes are defined as having a stopping position whereas relative axes don&amp;#039;t have a stopping position and just go around and around.  To designate an axis as a relative axis, add 16 to the above control number.  For example, to set the Assassin 3D&amp;#039;s axis U to be looking left and right, type &amp;#039;joyadvaxisu 20&amp;#039;.  As another example, to make your rudder pedals control turning left and right, type &amp;#039;joyadvaxisr 4&amp;#039;.  It&amp;#039;s a bit complicated, but only needs to be done once.\n\nThe advanced axes variables will not have any effect until joyadvanced is set to 1.0.  Additionally, any changes to the axes will not take effect until the joyadvancedupdate command is executed.  So, the procedure for creating an advanced mapping is:\n\n1.  Set &amp;#039;joyadvanced 1&amp;#039;\n2.  Make any desired mapping changes\n3.  Make any desired sensitivity changes\n4.  Make any desired threshold changes\n5.  Call &amp;#039;joyadvancedupdate&amp;#039;\n\nHere is the configuration file for the FPgaming Assassin 3D:\n// Revision 1.0 -- refer to www.fpgaming.com for updates\njoyname &quot;FPgaming Assassin 3D&quot;\njoyadvanced 1\njoyadvaxisx 3\njoyadvaxisy 1\njoyadvaxisz 0\njoyadvaxisr 0\njoyadvaxisu 20\njoyadvaxisv 18\njoyforwardsensitivity -1.0\njoysidesensitivity 1.0\njoypitchsensitivity -0.25\njoyyawsensitivity -0.5\njoyforwardthreshold 0.15\njoysidethreshold 0.15\njoyyawthreshold 0.0\njoypitchthreshold 0.0\n+mlook\njoyadvancedupdate\n\nHere is a configuration file for the Logitech WingMan Warrior:\n// Revision 0.1 -- refer to www.logitech.com for updates\njoyname &quot;Logitech WingMan Warrior&quot;\njoyadvanced 1.0\njoywwhack1 1.0\njoywwhack2 1.0\njoyadvaxisx 3\njoyadvaxisy 1\njoyadvaxisz 0\njoyadvaxisr 0\njoyadvaxisu 20\njoyadvaxisv 0\njoyforwardsensitivity -1.0\njoysidesensitivity 1.0\njoypitchsensitivity 0.0\njoyyawsensitivity -0.6\njoyforwardthreshold 0.15\njoysidethreshold 0.15\njoypitchthreshold 0.0\njoyyawthreshold 0.0\njoyadvancedupdate\n\nHere is a config file for the SpaceTec IMC SpaceOrb:\n// Revision 0.1 -- refer to www.spacetec.com for updates\njoyname &quot;SpaceTec IMC SpaceOrb&quot;\njoyadvanced 1.0\njoyadvaxisx 3\njoyadvaxisy 1\njoyadvaxisz 0\njoyadvaxisr 2\njoyadvaxisu 0\njoyadvaxisv 4\njoyforwardsensitivity -1.0\njoysidesensitivity 1.0\njoypitchsensitivity -0.5\njoyyawsensitivity 1\njoyforwardthreshold 0.1\njoysidethreshold 0.1\njoypitchthreshold 0.1\njoyyawthreshold 0.1\n+mlook\njoyadvancedupdate\n\nHere is a config file for making your joystick operate looking around and strafing, your rudder pedals control turning left and right and throttle control moving forward and backward:\njoyname &quot;Joystick, Rudder &amp; Throttle&quot;\njoyadvanced 1.0\njoyadvaxisx 3\njoyadvaxisy 2\njoyadvaxisz 1\njoyadvaxisr 4\njoyadvaxisu 0\njoyadvaxisv 0\njoyforwardsensitivity -1.0\njoysidesensitivity -1.0\njoypitchsensitivity 1.0\njoyyawsensitivity -1.0\njoyforwardthreshold 0.15\njoysidethreshold 0.15\njoyyawthreshold 0.15\njoypitchthreshold 0.15\njoyadvancedupdate\n\nTwo additional values you can set specifically for the Wingman Warrior:\nThere are two variables which enable special response curves tuned for the Logitech Wingman Warrior joystick.  &quot;joywwhack1&quot; fixes a centering problem.  &quot;joywwhack2&quot; fixes an &quot;out of control&quot; spin problem when using the joystick to turn or look left/right.  See the Wingman Warrior configuration above for an example of how to use these in your joystick.cfg.\n\nCONSOLE COMMANDS AND CONTROLS\nFor a complete listing of Half-Life&amp;#039;s console commands, visit http://pcgame.com/randy/console.htm\n\nTEAM PLAY\nStarting a teamplay game:\n- Listen server: Start Half-Life. Select the options Multiplayer-&gt;Lan Game-&gt;Create Game-&gt;Advanced Options and select the &amp;#039;Team Play&amp;#039; check box. Hit Done then Start Game.\n- Dedicated server: in the valve/autoexec.cfg add the line: mp_teamplay 1 then whenever you start the server it will be in teamplay mode.\nJoining a teamplay game:\nIn the server browser, you can see teamplay games are called &quot;HL Teamplay&quot;.  Select one of these and hit Join Game&amp;#039;\nPlaying a teamplay game:\nHolding down the TAB key will show you the teams.  Teams are assigned\naccording to the player model you are using.  To change teams,\nhit ESCAPE to go back to the launcher, then select the Customize option and change your model to the team you wish to be on.\n\nCREATE A CUSTOM DECAL\n\nMaking a custom decal is a simple process.  All you need is an image, and a paint program capable of simple palette manipulation and image scaling.  Paint Shop Pro is ideal, and is available as shareware from http://www.jasc.com.  The steps for creating a decal are: 1.  Paint or scan an image.  Make it 64 by 64 pixels in size, either by painting the image to that size, or by scaling your scanned image (or larger painted image.) ). Painting in black and white is recommended, because the final decal will be displayed as one color only.  You can choose the color of your decal and you can change that color at any time\nbetween games using the game interface.  Save your source decal as a black and white image, however.\n\n2.  Use your paint program to make the image a &quot;grayscale&quot; image:  that is, the palette (the colors that the image uses) should be a ramp from white to black.  If you are painting the image yourself using Paint Shop Pro, Photoshop, or some similar program, you can specify that you want the image to be grayscale before you start.  With the palette going from black to white, any white in the image will be totally opaque, and any black in the image will be totally transparent (invisible).  Any gray in the image will be translucent: very translucent if it is near-black, and close to opaque if it is near white.  Some applications will ramp the palette from black to white when you select &quot;grayscale.&quot;  That is, if you look at the color palette, the first color (usually the upper left-hand corner color) will be black, and the last color (usually the lower right-hand corner color) will be white.  In this case, you want to invert your image, such that the black portions of your image are the parts that will be opaque, and the white portions are the parts that will be transparent.  Be sure you check what the palette looks like after you save your file, and adjust it if necessary. Think of it this way: if your decal looks like a chalk drawing on a blackboard, you want the first color in your palette to be black (which will come through as completely transparent), ramping to the last color which is white (which will come through as opaque).  If your drawing looks like a pen drawing on white paper, the first color should be white, ramping to the last color which should be black.\n\n3.  Save this image in your half-lifelogos directory as a Windows bitmap (.bmp) file, and it will automatically show up in the list of decals you see in the launcher interface.  There you can choose the decal&amp;#039;s color. Changing the color of your decal during a game will not take effect for that game.  Only after you restart your game will the new color appear.\n\nIf you would like to view pre-made decals, several are shipped with Half-Life and can be found in the Half-Lifelogos directory.  These will give you a good idea about the file format and appearance of a decal, before it appears in the game.\n\nIV. 3D HARDWARE ISSUES\n\nHalf-Life has the ability to use both OpenGL and Direct3D.   Many cards with support for 3D acceleration will provide both OpenGL and Direct3D drivers.  Which one is better depends upon the quality and performance of the drivers themselves, and will vary from card to card.\n\nThe latest release of DirectX, version 6.0, is included on the Half-Life CD.  It should be automatically installed as part of the Half-Life installation process.  If you need to reinstall at a later time, open the DirectX folder on your Half-Life installation CD and run dxsetup.exe.\n\nIn general, make sure you have the latest versions of the device drivers for your display hardware.  Most graphics card vendors make them freely available on the Internet, and a collection of links to sites of many popular cards is installed on your hard drive along with Half-Life.  The default location for this file is:\n\n\tC:SIERRAHalf-LifemediaDrvPagedefault.htm\n\nVideo configuration is set in the ConfigurationVideoVideo modes menu in Half-Life.\n\nThe following section explains the known driver and compatibility issues for specific chipsets at the time of Half-Life&amp;#039;s shipping.  If you have any questions about which chipset is incorporated in your graphics card, consult the documentation that accompanied your card, or contact the card manufacturer.\n\n3DFX Banshee, Voodoo 1, Voodoo 2, Voodoo 2 SLI\n\nGet the latest drivers from your card manufacturer or get the latest drivers directly from the 3DFX site. Half-Life ships with the current, tested GL mini-driver. Make sure that you have Glide version 2.54 or above. Half-Life does not support Direct3D on Voodoo cards.\n\nThe Voodoo 2 running in SLI mode on Windows/NT is prone to crashing.   The solution to this instability is to either get an updated driver from 3DFX, disable SLI mode, or run under Windows 95/98.\n\n3DFX Rush\n\nWith the current drivers, Half-Life supports the Voodoo rush in software mode only. Check with 3DFX for an updated driver that offers support for Half-Life\n\nNVIDIA Riva 128\n\nYou must have Windows 95 OSR 2 or later, Windows 98 or Windows NT. As of shipping, Half-Life Riva 128 OpenGL support requires the latest reference driver from NVIDIA. Get this driver off of their site, www.nvidia.com.  Direct3D support is currently unavailable. Contact NVIDIA for a Direct3D driver that supports Half-Life.\n\nNVIDIA TNT\n\nHalf-Life supports the TNT in software, OpenGL and Direct3D modes. Get the latest driver off of NVIDIA&amp;#039;s site.\n\nMatrox G200\n\nHalf-Life supports the G200 in software and Direct3D. Get the latest driver from Matrox&amp;#039;s site, www.matrox.com. Matrox will also be providing a GL mini-driver that will support OpenGL in Half-Life. Check with Matrox for details.\n\nS3 Virge\n\nHalf-Life supports the Virge in software mode only.\n\nS3 Savage\n\nHalf-Life support the Savage in software and Direct3D. You can get the latest drivers from S3&amp;#039;s site, www.s3.com. S3 will also be providing a GL driver that will support Half-Life. Check with S3 for details.\n\nGeneral Issues:\n\nMissing Decals (i.e. Bullet holes)\nHalf-Life uses a feature of OpenGL and Direct3D that some video card drivers do not support correctly.  To over ride the default settings for this feature, put this line in your opengl.cfg or d3d.cfg file:\n\n \tgl_polyoffset 0.1\n\nIf this doesn&amp;#039;t work, try -0.1, 1 or 20. This tells the driver how far to offset the decal from the surface of the polygon that the decal is being applied to.\n\nDirect3D or OpenGL are running very slow\nOn some cards that don&amp;#039;t fully support Direct3D or OpenGL, Half-Life will fall back to a software emulation mode. These modes are very slow. If your Direct3D support is slow, try selecting OpenGL, and vice versa.  If neither work, change your settings to use Half-Life&amp;#039;s software video modes instead and the speed will improve.\n\nDirect3D Input seems lagged.\nIf your input seems to lag behind the visual display on occasion, add this line to your d3d.cfg file:\n\n\tgl_d3dflip 1\n\nParts of the screen are flashing (in Direct3D or OpenGL)\nSome older, non-3DFX cards have a problem with clearing the z buffer and this can cause parts of the screen to flash. If you are seeing this, put this line in your opengl.cfg or d3d.cfg file:\n\n \tgl_ztrick 0\n\nNetwork instability\nIf you have a connection to the Internet that is unstable, or prone to packet loss, try typing &amp;#039;cl_nodelta 1&amp;#039; at the console (bring down the console with the ~ key).  This will improve your overall network stability, but will sacrifice your overall latency.\n\nCOMMON QUESTIONS\nWhat can I do if the game is too dark?.\nSome monitors are darker than others, but Half-Life provides controls to correct this problem. You will need to adjust the Gamma and Glare Reduction settings in the ConfigurationVideoVideo options menu in Half-Life. These are used to adjust for different kinds of monitors and room brightness. Adjust the two sliders so that the Soldiers camouflage pattern is dark but visible.  If this still doesn&amp;#039;t work, you then may need to adjust the actual brightness and contrast of your monitor.  This is usually done by adjusting buttons or knobs on the front of your monitor, but all monitors are a bit different so you may want to look through your monitors documentation to be sure.  Some places in the game are intentionally dark, and you&amp;#039;ll need to use your flashlight, but you should be able to see everything without difficulty in the opening train ride and throughout the first part of the game.  Some graphics cards also have support for controlling how bright the display is.  If your card&amp;#039;s device driver supports this, you can find it by going to the Windows control panel, and selecting the Display applet.\n\nWhat can I do if the game looks washed out?\nThe most likely cause is that your monitor is slightly brighter than average and the default game settings are for a darker monitor. You will need to adjust the Gamma and Glare Reduction settings in the ConfigurationVideoVideo options menu in Half-Life. These are used to adjust for different kinds of monitors and room brightness. Adjust the two sliders so that the Soldiers camouflage pattern is dark but visible.  If this still doesn&amp;#039;t work, you then may need to adjust the actual brightness and contrast of your monitor.  This is usually done by adjusting buttons or knobs on the front of your monitor, but all monitors are a bit different so you may want to look through your monitors documentation to be sure.  The most common problem, especially on new computers, is that &quot;black&quot; isn&amp;#039;t showing up as black, but more of a dark gray.  Turn the Contrast down until the border around the edges of the picture are totally black, then slowly turn it back up until it just before it starts getting visibly lighter.  You may need to adjust your monitors Brightness back up after you do this. .  Some graphics cards also have support for controlling how bright the display is.  If your card&amp;#039;s device driver supports this, you can find it by going to the Windows control panel, and selecting the Display applet.\n\n\n\nV.CONTACTING SIERRA\n=======================\nA) Customer Service, Support, and Sales\nB) Technical Support\nC) Legal Information\n\n\nA) Customer Service, Support, and Sales\n----------------------------------\nUnited States\t\n\nU.S.A. Sales Phone: (800) 757-7707\nHours: 24 hours a day, 7 days a week\n\nInternational Sales:  (425) 746-5771 \nHours: Monday-Friday 8 AM to 4 PM PST\nFAX: (916) 939-1010\t\n\t\nSierra Direct\t\t\t\t\nP O Box 629001\nEl Dorado Hills, CA 95762-9972\t\t\n\t\t\nEmail: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2b485e585f44464e5905585e5b5b44595f6b58424e59594a05484446&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; &lt;a href=&quot;\nhttp://www.sierra.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sierra.com&lt;/a&gt;\n\n\nUnited Kingdom\n\nVivendi Universal Interactive Publishing UK Ltd.\nMain: (0118) 920-9111\nMonday-Friday, 9:00 a.m. - 5:00 p.m.\nFax:   (0118) 987-5603\nDisk/CD replacements in the U.K. are Â£6.00, or Â£7.00 outside the UK. Add &quot;ATTN.: Returns.&quot;\n2 Beacontree Plaza,\nGillette Way,\nReading, Berkshire\t\t\t\nRG2 0BS United Kingdom\t\t\n\n\nFrance\n\nVivendi Universal Interactive Publishing France\n32, Av de l&amp;#039;Europe \nBÃ¢t Energy 1 (2e Ã©tage) \n78 140 VELIZY-Villacoubaly\nFrance\n\nTÃ©lÃ©phone: 01-30-67-90-50\nLundi au Jeudi de 10h Ã  19h\nVendredi de 10h Ã  18h\nFax: 01-30-67-90-65\n\n\nGermany\n\nVivendi Universal Interactive Publishing Deutschland Gmbh.\t\nTel: (0) 6103-99-40-40\nMontag bis Freitag von 10h - 19Uhr\nFax: (0) 6103-99-40-35\n\nPaul-Ehrlich-StraÃŸe l\n63225 Langen \nDeutschland\n\n\n\nOn-Line Sales\nCompuServe United Kingdom:GO UKSIERRA\nCompuServe France:\t  GO FRSIERRA\nInternet USA:\t\t &lt;a href=&quot; http://www.sierra.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sierra.com&lt;/a&gt;\nInternet United Kingdom: &lt;a href=&quot; http://www.sierra-online.co.uk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sierra-online.co.uk&lt;/a&gt;\nInternet France:  \t &lt;a href=&quot; http://www.sierra.fr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sierra.fr&lt;/a&gt;\nInternet Germany:\t &lt;a href=&quot; http://www.sierra.de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sierra.de&lt;/a&gt;\n\nDisk and or Manual Replacement:\t\t\n\nProduct Returns*:\nVivendi Universal Interactive Publishing International\nSierra On-Line Returns\n4247 S. Minnewawa Ave.\nFresno, CA  93725\n\nVivendi Universal Interactive Publishing International\nSierra On-Line CD/Doco Replacement\n4247 S. Minnewawa Ave.\nFresno, CA  93725\t\t\t\t\n\t\t\nNOTE: To replace your cd(s) please send only the damaged cd and copy of your dated Receipt, if less then 90 days.  After 90 days please include a $10.00 handling fee along with the cd(s).  For Documentation replacement, please include a $5.00 handling fee and a photocopy ONLY of either your disk or cd.  Payment should be made at the time of your request.  Sorry, no credit cards.\t\n\n* Returns to this address valid in North America only.\n\n\nB) TECHNICAL SUPPORT\n-------------------------\nNorth America\n\nSierra On-Line offers a 24-hour automated technical support line with recorded answers to the most frequently asked technical questions. To access this service, call (425) 644-4343, and follow the recorded instructions to find your specific topic and resolve the issue. If this fails to solve your problem, you may still write, or fax us with your questions, or contact us via our Web site.\n\nSierra On-Line\t\t\nTechnical Support\n4247 South Minnewawa Avenue\nFresno, CA 93725\n\nMain: (425) 644-4343\nMonday-Friday  8:00 a.m. - 5:00 p.m. PST\nFax:  (310) 258-0755\n\t &lt;a href=&quot;\nhttp://www.sierra.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sierra.com&lt;/a&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0a797f7a7a65787e4a79636f78786b24696567&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\nUnited Kingdom\n\nVivendi Universal Interactive Publishing UK Ltd. offers a 24-hour Automated Technical Support line with recorded answers to the most frequently asked technical questions. To access this service, call (0118) 920-9111, and follow the recorded instructions to find your specific topic and resolve the issue. If this fails to solve your problem, you may still write, or fax us with your questions or contact us via our Internet or CompuServe sites.\n\n\n\nVivendi Universal Interactive Publishing UK Ltd.\t\n2 Beacontree Plaza,\t\t\t\nGillette Way,\t\t\t\nReading, Berkshire\t\t\t\nRG2 0BS United Kingdom\nMain: (0118) 920-9111\nMonday-Friday, 9:00 a.m. - 5:00 p.m.\nFax:   (0118) 987-5603 &lt;a href=&quot;\nhttp://www.sierra-online.co.uk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sierra-online.co.uk&lt;/a&gt;\n\n\nFrance\n\nVivendi Universal Interactive Publishing France\n32, Av de l&amp;#039;Europe \nBÃ¢t Energy 1 (2e Ã©tage) \n78 140 VELIZY-Villacoublay\nFrance\n\nTÃ©lÃ©phone: 01-30-67-90-50\nLundi au Jeudi de 10h Ã  19h\nVendredi de 10h Ã  18h\nFax: 01 30 67 90 65\n &lt;a href=&quot;\nhttp://www.sierra.fr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sierra.fr&lt;/a&gt;\n\n\nGermany\n\nVivendi Universal Interactive Publishing Deutschland Gmbh.\nTechnischer Kundendienst\nPaul-Ehrlich-StraÃŸe la\n63225 Langen \nDeutschland\t\t\t\nTel: (0) 6103-99-40-40\nMontag bis Freitag von 10 - 19Uhr\nFax: (0) 6103-99-40-35\nMailbox: (0) 6103-99-40-35\n &lt;a href=&quot;\nhttp://www.sierra.de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sierra.de&lt;/a&gt;\n\n\nSpain\n\nVivendi Universal Interactive Publishing EspaÃ±a \nNUESTRA SEÃ‘ORA DE VALVERDE NÂº 23 \n28034 MADRID \nSpain\n\nTech Support TelÃ©fono: 91 735 24 37\n\nSoporte tÃ©cnico de lunes a Viernes \nde 09:30 a 15:00 y de 16:00 a 18:30\n \n\nwww.havasinteractive.es\nSoporte Tecnico: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c1b2aeb1aeb3b5a481a9a0b7a0b2a8afb5a4b3a0a2b5a8b7a4efa4b2&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nComercial: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fd9e9290988f9e949c91bd959c8b9c8e949389988f9c9e89948b98d3988e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nItaly\n\nVivendi Universal Interactive Publishing Italia spa\nContattare il vostro distributore.\t\n\n\nC) Sierra Warranty &amp; Legal Information\n-----------------------------------\nSierra&amp;#039;s end user license agreement, limited warranty and return policy is set forth in the EULA.txt, found on the CD, and is also available during the install of the product.\n\nCopyright (2002 Valve LLC.) \n\n\nHalf-Life Uses Miles Sound System. Copyright Â© 1991-2001 by RAD Game Tools, Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:17f0a4d74bc99c0961e1bea20148bb89c73331fd","amp;dn":"Xtreme+Counter-Strike","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f0a4d74bc99c0961e1bea20148bb89c73331fd","infoHashBuffer":{"type":"Buffer","data":[23,240,164,215,75,201,156,9,97,225,190,162,1,72,187,137,199,51,49,253]},"announce":[],"urlList":[]}}