{"title":"Aqua Teen Hunger Force S10E01-S10E10 x264 AAC Season 10 COMPLETE","uid":9090144,"size":733001564,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:17f25c35cab7b0b05057985806a15fb12eb88f8f&amp;dn=Aqua+Teen+Hunger+Force+S10E01-S10E10+x264+AAC+Season+10+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ProphetZarquon","files":-1,"time":1382579631,"description":"The misadventures of a milkshake, an order of fries, a meatball, and their retired next door neighbor in the suburbs of New Jersey.\n\nSeason 10:\n\ns10e01 &quot;Muscles&quot; August 11, 2013\nAfter experiencing a stroke, Master Shake decides to turn his life around by getting in shape. However, Shake's muscles become sentient and commit crimes while he sleeps. \n\ns10e02 &quot;The Dudies&quot; August 18, 2013\nMaster Shake competes with Meatwad and Carl to win a &quot;Dudie Award&quot;, which turns out to be a scam to sell condos. \n\ns10e03 &quot;Merlo Sauvignon Blanco&quot; August 25, 2013\nMaster Shake's addiction to shellfish begins to take a severe toll on his health, so Frylock convinces him to seek professional (and inexpensive) help from a therapist-cum-magician whose unconventional treatments belie questionable motives. \n\ns10e04 &quot;Banana Planet&quot; September 8, 2013\nThe Teens answer a distress signal from the mysterious Banana Planet. Meanwhile, Master Shake is preoccupied with a honeybaked ham. \n\ns10e05 &quot;Working Stiffs&quot; September 15, 2013\nThe Teens seek employment after Master Shake neglects to pay their cable bill. Frylock gets a job at a fast food restaurant while Meatwad and Shake join the mafia. \n\ns10e06 &quot;Skins&quot; September 22, 2013\nMaster Shake buys bongos from a hippie in order to join a drum circle. When played, the bongos summon a strange skinless creature with a tragic past. \n\ns10e07 &quot;Freda&quot; September 29, 2013\nWhile trying to explode ducks at the local park, Master Shake meets Freda, the woman of his dreams. However, he soon begins to feel the pangs of love, and ultimately, inevitable heartbreak as the woman is not exactly what she seems. \n\ns10e08 &quot;Storage Zeebles&quot; October 6, 2013\nCarl acquires a storage unit and discovers the mystical kingdom of the Zeebles. Despite Frylock's ethical concerns about Carl's imperialist attitudes, Carl promptly exploits the fantasy world of its natural resources. \n\ns10e09 &quot;Piranha Germs&quot; October 13, 2013\nMaster Shake gains employment at a shady company that literally practices viral marketing. Shake has second thoughts when he experiences limb loss. \n\ns10e10 &quot;Spacecadeuce&quot; October 20, 2013\nEmory and Oglethorpe emerge from hypersleep only to learn that the duplicitous Mooninites have enslaved their entire race, the Plutonians. In order ease their boredom, the capricious Ignignokt and Err instruct Emory and Oglethorpe to investigate a living spaceship that is said to be carnivorous. \n\n=====\n\nSeason 10, episodes 01 through 10.\n\n*Episode 7 was only available as a Web-DL (higher quality anyway), so I grabbed the 1080p 6ch AC3 as a source and pulled it down to 480p 2ch AAC, using double-pass encoding &quot;Insane&quot; max quality settings and no CABAC. I did my best to match the playback quality, resolution and file stats to those of the HDTV releases.\n\nAs far as I can tell, this is the most complete collection of Aqua Teen season 10 available right now. Please comment and rate the quality, etc.\n\nThis torrent can be easily shared with this handy shortened magnet link!\nmgnet.me/.athf10","torrent":{"xt":"urn:btih:17f25c35cab7b0b05057985806a15fb12eb88f8f","amp;dn":"Aqua+Teen+Hunger+Force+S10E01-S10E10+x264+AAC+Season+10+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f25c35cab7b0b05057985806a15fb12eb88f8f","infoHashBuffer":{"type":"Buffer","data":[23,242,92,53,202,183,176,176,80,87,152,88,6,161,95,177,46,184,143,143]},"announce":[],"urlList":[]}}