{"title":"Treasure Island Media - DAWSON 50-LOAD WEEKEND - Part 2 - GAY","uid":5225265,"size":2051794942,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:17f78c1725cce571681bcea0ecd62343318c94fb&amp;dn=Treasure+Island+Media+-+DAWSON+50-LOAD+WEEKEND+-+Part+2+-+GAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jinorumo","files":-1,"time":1261091005,"description":"Treasure Island Media - DAWSON 50-LOAD WEEKEND - Part 2 - Bareback\n\n\nPART 2 of the landmark two-part video from Treasure Island Media ...\n\nThe response has been OVERWHELMING. Since the release of DAWSON'S 50-LOAD WEEKEND PART 1, we've been flooded with demands for the concluding half of this already world-infamous porn saga.\n\nWell gents, DAWSON'S 50-LOAD WEEKEND PART 2 (DIRECTOR'S CUT) has now arrived. And you're gonna be fuckin' blown away. If you think he stops at 50 loads you just don't know DAWSON!\n\nDAWSON, the handsomest and most innocent-looking cumwhore of our time, has completely given in to his lust for manjuice - his hunger for taking load after load up his fine little ass. And he's never shown off his total hunger like he does in this vid, with his fine little welcome-home nympho-hole twitchin' with anticipation whenever a loaded cock wanders into fucking distance.\n\nSome of the sperm-donating cocksmen that the insatiable DAWSON takes on in D50-LW PART 2 include Matt Walker, Kurt Kaiser, Seth Scott, Marc Short, Joe Sarge, Tom Finn, Pat Jackson, Mark Sergeant, Kevin Slater, Jace Hawk, Tony Rocco, Antonio Montez, Jack Forest and many more!\n\n------------------------\n\nNOTE:\n\nA lot of this stuff on eMule, using their client to connect to a server and search for those videos. Most of their videos are there. to get eMule client go here:\n\n------------------------\n\nNOTE:\nBy viewing this torrent page I agree that I am of legal age and not with any local, state, or federal law enforcement agencies whatsoever and that I am not a reporter, writer, or agent for any news or media organization. I am viewing this material at my sole discretion on my own behalf and will not report/disclose my findings and/or comments regarding this material. I subscribe to the principles of the First Amendment of the Constitution of the United States of America which holds that free adult Americans have the right to decide for themselves what they will read and view without governmental interference. ADULT XXX CONTENT FOR ADULT VIEWING ONLY.","torrent":{"xt":"urn:btih:17f78c1725cce571681bcea0ecd62343318c94fb","amp;dn":"Treasure+Island+Media+-+DAWSON+50-LOAD+WEEKEND+-+Part+2+-+GAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f78c1725cce571681bcea0ecd62343318c94fb","infoHashBuffer":{"type":"Buffer","data":[23,247,140,23,37,204,229,113,104,27,206,160,236,214,35,67,49,140,148,251]},"announce":[],"urlList":[]}}