{"title":"The Magic of Shetland Lace Knitting: Stitches, Techniques, and P","uid":10705771,"size":53033327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:189031ff5ca965af84f96858a95bd9657d615f3d&amp;dn=The+Magic+of+Shetland+Lace+Knitting%3A+Stitches%2C+Techniques%2C+and+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"KnitLady","files":-1,"time":1407288612,"description":"The ethereal beauty and intricacy of Shetland lace knitting might seem beyond the powers of the everyday knitter, but the skills needed are within the reach of everyone who can knit, purl, cast on, and bind off. The Magic of Shetland Lace Knitting is designed to take the novice knitter from their first &quot;yarn over&quot; through the steps needed to master the more complex patterns. The techniques are introduced with clear step-by-step instructions, charts, and detailed photographs of knitted samples. Aimed primarily at beginners, more experienced knitters will also appreciate the way the book organizes the stitches, allowing for easy substitution of patterns. Those interested in different lace traditions will be excited by the collection of specifically-Shetland stitches. And as more knitters want to stretch themselves and learn new techniques, this book will be a useful guide aimed at helping these knitters take their first steps in making a Shetland lace project. Included are all the traditional Shetland motifs, patterns, and insertions including Cat's Paw, Candlelight, Horse Shoe, and many more. With suggestions for how to work the different stitches into elegant and traditional Shetland Lace accessories such as scarves, hats, and shawls. Atmospheric photographs taken in the wild Scottish landscape and historical information about the development of Shetland lace are sure to delight all knitters and textile lovers.","torrent":{"xt":"urn:btih:189031ff5ca965af84f96858a95bd9657d615f3d","amp;dn":"The+Magic+of+Shetland+Lace+Knitting%3A+Stitches%2C+Techniques%2C+and+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"189031ff5ca965af84f96858a95bd9657d615f3d","infoHashBuffer":{"type":"Buffer","data":[24,144,49,255,92,169,101,175,132,249,104,88,169,91,217,101,125,97,95,61]},"announce":[],"urlList":[]}}