{"title":"Beach Head 2002","uid":4962948,"size":53578352,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18f8b5620cef0ebc1a20cfa42e4fabc7d675336b&amp;dn=Beach+Head+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"torrentguiden","files":1,"time":1245404162,"description":" &lt;a href=&quot;\nhttp://www.download-free-games.com/war_game_download/beach_head_2002.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.download-free-games.com/war_game_download/beach_head_2002.htm&lt;/a&gt;\n\n\n\n\n\nBeach Head 2002 Review\n\n\n\nBeach Head 2002 delivers arcade-style shooting in its most basic--and repetitive--form.\n\nBeach Head 2002 is an updated version of Beach Head 2000, a repetitive arcade-style shooter that lets you assume the role of a lone gunner trying to fend off a beach invasion. The new game takes the same approach, but replaces the beach environment with some rolling hills. The few improvements it includes do little to address the flaws of the original game, and since the new game is just more of the same endless waves of enemies, it can't really be recommended even to those who might have enjoyed Beach Head 2000 in some way. \n\n\nThe game consists of stage after stage of stationary shooting action.\nBeach Head 2002 gets old quickly, primarily due to its premise--you're stuck in a bunker with a few guns and limited ammunition, and there's an army of infinite size on the way to kill you. It might make a good plot for an action film, but it's not much fun as a game. In this situation, there is no hope of retreat, since you can only rotate about a fixed position and shoot at moving targets. There is also no hope of victory, since the game will just continually throw more enemies at you in the form of tanks, armored personnel carriers, helicopters, airplanes, and soldiers. There is very little rhyme or reason to how these targets appear and move--the units have no obvious objective other than to destroy your bunker, and they come from all directions, giving the impression that the invasion has already taken place long ago, and you're the only survivor. Since you can't move and you can't win, your only goal is to do better than you did the game before and maybe gain access to a new weapon or enemy unit to shoot at. \n\nAt times, the game is visually pleasing. The weapon and explosion effects are fairly realistic, and the enemy units and environments look fine. The game's animation is repetitive but otherwise acceptable. Unfortunately, some parts of the game's graphics don't add up--your suspension of disbelief will falter when a jet flies into a nearby hill and out the other side. And like its predecessor, Beach Head 2002 has the habit of making units pop up out of nowhere, but whether this is a graphics problem or a cheap way to keep you on your toes is unclear. \n\nThe weapon, vehicle, and explosion graphics are supplemented with decent sound effects, although like the rest of the game, they quickly get repetitive. Shells hitting your bunker cause an appropriate explosive rumble, and small-arms fire ricochets off armor with a metallic patter. Helicopters will buzz the bunker with a distinctive chopper sound, and fighters will fly past your base with their jet engine whine. Soldiers will catch on fire from nearby explosions and cry out in horror, but there's very little variation in their screams. \n\nThe game would have benefited tremendously from more variation in weapons, enemies, and environments. The few differences that you come across in the game are a welcome relief from tedium--all of a sudden, it might be nighttime and you only have a flashlight and a few flares to see your targets. Or perhaps instead of the usual combined-forces raid on your bunker, the enemy has decided to send a squad of fighter jets to attack you, and you have to replenish your ammunition by shooting at air-dropped crates. \n\nYour weapon choices also vary slightly from level to level--one time you might just have a few missiles, a machine gun, and an antitank cannon, while the next level will require you to rely only on your handgun. While these changes make the level look different on the surface, it quickly becomes clear that the underlying game plays like a broken record. And indeed, breaking your record is the only reason you would continue to play the game after your first few tries. It almost seems as if the publisher knows that nobody will play the game more than once, since the game tries to install itself on your computer each time you put it in your CD drive, even if it is already installed. \n\n\nDespite a few variations to the theme, Beach Head 2002 gets old fast.\nTo its credit, Beach Head 2002 is tough. Its combination of realistic particle effects, explosive sounds, and endless waves of enemies can create some tense moments, especially when you are running out of ammunition. While the game does not include adjustable difficulty settings, it does feature built-in cheats that will give you unlimited ammunition or unlimited armor or let you skip to the next level without having to complete the present level. This minimizes any frustration that might arise from the game's relentless onslaught. \n\nBeach Head 2002 delivers arcade-style shooting in its most basic--and repetitive--form. If the idea of endlessly shooting wave after wave of the same few enemies with the same few guns in the same exact environment appeals to you, you're better off buying Beach Head 2000 from the bargain bin. If you've played and enjoyed the previous game, Beach Head 2002 is more of the same with some minor tweaks, but those few tweaks are not worth the game's $20 retail price. \n\n","torrent":{"xt":"urn:btih:18f8b5620cef0ebc1a20cfa42e4fabc7d675336b","amp;dn":"Beach+Head+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18f8b5620cef0ebc1a20cfa42e4fabc7d675336b","infoHashBuffer":{"type":"Buffer","data":[24,248,181,98,12,239,14,188,26,32,207,164,46,79,171,199,214,117,51,107]},"announce":[],"urlList":[]}}