{"title":"Dr. Dre - The Chronic (1992) - (CDRip 256kbps)","uid":9987194,"size":166440653,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1906c88bcf311b5d8f98b844b315685a9375c348&amp;dn=Dr.+Dre+-+The+Chronic+%281992%29+-+%28CDRip+256kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"A7XmattA7X","files":16,"time":1397805812,"description":"The Chronic is the debut solo studio album by American hip hop recording artist Dr. Dre, released December 15, 1992, on his own record label Death Row Records, and distributed by Priority Records. Recording sessions for the album took place in June 1992 at Death Row Studios in Los Angeles and at Bernie Grundman Mastering in Hollywood.[1] The album is named after a slang term for high-grade marijuana, and its cover is a homage to Zig-Zag rolling papers. It was recorded by Dr. Dre following his departure from hip hop group N.W.A and its label Ruthless Records over a financial dispute, and consequently features both subtle and direct insults at Ruthless and its owner, former N.W.A-member Eazy-E. Although a solo album, it features many appearances by Snoop Dogg, who used the album as a launch pad for his own solo career.\n\nUpon its release, The Chronic received positive reviews from most music critics and earned considerable sales success. The album peaked at number three on the Billboard 200 and had been certified triple platinum by the Recording Industry Association of America with sales of over three million copies in the United States,[2][3] which led to Dr. Dre becoming one of the top ten best-selling American performing artists of 1993.[4] Dr. Dre's production has been noted for founding and popularizing the G-funk sub-genre within gangsta rap. The Chronic has been widely regarded as one of the most important and influential albums of the 1990s and regarded by many fans and peers to be one of the most well-produced hip hop albums of all time.[5][6][7] In 2003, the album was ranked number 138 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nBitrate: 256kbps\n\nTracklisting:\n\n1. The Chronic (Intro)\n2. Fuck Wit Dre Day (And Everybody's Celebratin')\n3. Let Me Ride\n4. The Day the Niggaz Took Over\n5. Nuthin' But a G Thang\n6. Deez Nuuuts\n7. Lil' Ghetto Boy\n8. A Nigga Witta Gun\n9. Rat-Tat-Tat-Tat\n10. The $20 Sack Pyramid\n11. Lyrical Gangbang\n12. High Powered\n13. The Doctor's Office\n14. Stranded on Death Row\n15. The Roach (The Chronic Outro)\n16. Bitches Ain't Shit","torrent":{"xt":"urn:btih:1906c88bcf311b5d8f98b844b315685a9375c348","amp;dn":"Dr.+Dre+-+The+Chronic+%281992%29+-+%28CDRip+256kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1906c88bcf311b5d8f98b844b315685a9375c348","infoHashBuffer":{"type":"Buffer","data":[25,6,200,139,207,49,27,93,143,152,184,68,179,21,104,90,147,117,195,72]},"announce":[],"urlList":[]}}