{"title":"Roger Zelazny - Sign of the Unicorn (The Chronicles of Amber #3)","uid":12312951,"size":160941023,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:190ef73265217f200a45eb51332cbe14a61a5888&amp;dn=Roger+Zelazny+-+Sign+of+the+Unicorn+%28The+Chronicles+of+Amber+%233%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Cybotage","files":1,"time":1440940020,"description":"Accepting the responsibilities as ruler to the world of Amber, Corwin finds himself the target of sibling treachery, and must seek guidance in a land of visions, where a sinister prediction foretells his doom.\n\nThe Chronicles of Amber is a series of fantasy novels written by Roger Zelazny. The main series consists of two story arcs, The Cory Cycle and The Merlin Cycle, each five novels in length.\n\nThe Amber stories take place in two &quot;true&quot; worlds: Amber, and the Courts of Chaos, as well as the shadows that lie between them. These shadows, including our Earth, are parallel worlds that exist in the tension between the two true worlds of Amber and the Courts. The Courts of Chaos is situated in Shadow at the very edge of the pit of Chaos itself, a seething cauldron from which all that is or ever will be comes. Royals of Amber who have negotiated the Pattern can travel freely through the shadows. By shifting between shadows, one can alter or create a new reality by choosing which elements of which shadows to keep, and which to subtract. Members of the Courts of Chaos who have traversed the Logrus are also able to travel through shadow.\n\n\nRead by Alessandro Juliani\nFormat: MP3","torrent":{"xt":"urn:btih:190ef73265217f200a45eb51332cbe14a61a5888","amp;dn":"Roger+Zelazny+-+Sign+of+the+Unicorn+%28The+Chronicles+of+Amber+%233%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"190ef73265217f200a45eb51332cbe14a61a5888","infoHashBuffer":{"type":"Buffer","data":[25,14,247,50,101,33,127,32,10,69,235,81,51,44,190,20,166,26,88,136]},"announce":[],"urlList":[]}}