{"title":"Dime quie soy - Julia Navarro [Ebook][pdf][epub][Spanish]","uid":6667046,"size":8325372,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:19201b93022775ac7eae6acaf8315b84b306b941&amp;dn=Dime+quie+soy+-+Julia+Navarro+%5BEbook%5D%5Bpdf%5D%5Bepub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"virana","files":-1,"time":1315729144,"description":"Julia Navarro- Dime quien soy\n\nUn periodista recibe una propuesta para investigar la azarosa vida de su bisabuela, una mujer de la que sÃƒÂ³lo se sabe que huyÃƒÂ³ de EspaÃƒÂ±a abandonando a su marido y a su hijo poco antes de que estallara la Guerra Civil. Para rescatarla del olvido deberÃƒÂ¡ reconstruir su historia desde los cimientos, siguiendo los pasos de su biografÃƒÂ­a y encajando, una a una, todas las piezas del inmenso y extraordinario puzzle de su existencia.\n\nMarcada por los hombres que pasaron por su vida -el empresario Santiago Carranza, el revolucionario Pierre Comte, el periodista estadounidense Albert James y el mÃƒÂ©dico militar vinculado al nazismo Max von Schumann-, la vida de Amelia Garayoa es la de una mujer que aprendiÃƒÂ³ que en la vida no se puede volver sobre el pasado para deshacerlo. Desde la EspaÃƒÂ±a republicana hasta la caÃƒÂ­da del Muro de BerlÃƒÂ­n, pasando por la Segunda Guerra mundial y los oscuros aÃƒÂ±os de la Guerra frÃƒÂ­a, esta burguesa y revolucionaria, esposa y amante, espÃƒÂ­a y asesina, actuarÃƒÂ¡ siempre de acuerdo a sus principios, enfrentÃƒÂ¡ndose a todo y cometiendo errores que no terminarÃƒÂ¡ nunca de pagar.\n\nMemoria de un siglo convulso, caracterizado por la barbarie de los totalitarismos, esta obra es una vuelta de tuerca en la trayectoria de una de nuestras novelistas mÃƒÂ¡s internacionales. Dime quiÃƒÂ©n soy sorprende por su dramatismo e instrospecciÃƒÂ³n, por su intriga y por sus emociones a flor de piel. Una aventura desgarradora y cautivadora que tiene unos personajes excepcionalmente perfilados y literariamente inolvidables.\n\nLa esperada nueva novela de Julia Navarro es el magnÃƒÂ­fico retrato de quienes vivieron intensa y apasionadamente un siglo turbulento. IdeologÃƒÂ­a y compromiso en estado puro, amores y desamores desgarrados, aventura e historia de un siglo hecho pedazos, esta novela no sÃƒÂ³lo hechizarÃƒÂ¡ a los lectores de Julia Navarro sino que fascinarÃƒÂ¡ a todos aquellos interesados en nuestra propia historia.\n\npdf epup","torrent":{"xt":"urn:btih:19201b93022775ac7eae6acaf8315b84b306b941","amp;dn":"Dime+quie+soy+-+Julia+Navarro+%5BEbook%5D%5Bpdf%5D%5Bepub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19201b93022775ac7eae6acaf8315b84b306b941","infoHashBuffer":{"type":"Buffer","data":[25,32,27,147,2,39,117,172,126,174,106,202,248,49,91,132,179,6,185,65]},"announce":[],"urlList":[]}}