{"title":"Nelson DeMille - The Quest","uid":9630587,"size":786730208,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1a1d8cd4b2581f559ecb01217b4121260d4c03e2&amp;dn=Nelson+DeMille+-+The+Quest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1392781254,"description":"Nelson DeMille is at the absolute peak of his powers in &quot;The Quest&quot; (Center Street, 464 pages, $26) an epic tale that's broad in both scope and vision, harkening back to his earlier masterworks such as &quot;The Charm School&quot; and &quot;By the Rivers of Babylon&quot; as it brings the action in Africa of the mid-1970s. That's where an old priest named Father Armando emerges from a bombed-out prison after decades in captivity with the location of nothing less than the Holy Grail tucked in his mind.\n\nFrom there, staged against the backdrop of the endless Ethiopian civil war, the quest of the title begins in search of it, undertaken by a trio of intrepid journalists (well, two plus a photographer), including the hard-bitten and hard-driving Frank Purcell, who's standing in for DeMille's redoubtable John Corey this time out. Purcell becomes our Robert Langdon as the book takes on the texture and feel of Dan Brown at his level best, chock full of mysticism, murderous monks, deadly assassins, and vengeful natives all on a quest to either find the Grail or make sure its secrets remain hidden forever.\n\nThis is adventure on the grandest of scales and richest of tapestries, Wilbur Smith and Fredrick Forsythe rolled into one with some Indian Jones tossed in for good measure. A masterpiece fashioned by a storyteller who simply has no rival.\n\n\nThis is a big audiobook - 16 discs.","torrent":{"xt":"urn:btih:1a1d8cd4b2581f559ecb01217b4121260d4c03e2","amp;dn":"Nelson+DeMille+-+The+Quest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1d8cd4b2581f559ecb01217b4121260d4c03e2","infoHashBuffer":{"type":"Buffer","data":[26,29,140,212,178,88,31,85,158,203,1,33,123,65,33,38,13,76,3,226]},"announce":[],"urlList":[]}}