{"title":"Oil Overload 1 (2008,xvid) - anal/DP,Teagan,Gianna,Britney Steve","uid":4677749,"size":2929545216,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a920e7234ee8d45e8e77c506477cd41ddd7b2cf&amp;dn=Oil+Overload+1+%282008%2Cxvid%29+-+anal%2FDP%2CTeagan%2CGianna%2CBritney+Steve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"corfitez","files":4,"time":1232962572,"description":"Oil Overload 1\n\n\n\n\n\n\nall 7 screens (+ large DVD-covers):\n  &lt;a href=&quot;\nhttp://aaa.blogbugs.org/6125590/Oil-Overload-1---all-7-screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aaa.blogbugs.org/6125590/Oil-Overload-1---all-7-screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nActresses\n\n    * Alexis Texas                [Facial Swallow]\n    * Angelina Valentine          [Facial]\n    * August Night (as August)    [Facial Bald]\n    * Britney Stevens             [Anal Facial DP Squirt Bald A2M]\n    * Gianna Michaels (as Gianna) [Facial]\n    * Gina Lynn                   [Bald]\n    * Jenna Haze                  [Anal Facial]\n    * Savannah Gold               [Facial Bald]\n    * Teagan Presley              [Anal Facial Squirt Bald A2M]\n    * Velicity Von                [Facial]\n\n   \nScene Breakdowns\n\n    * Scene 1. David Perry, Gina Lynn\n    * Scene 2. Gianna Michaels, Mark Ashley\n    * Scene 3. Britney Stevens, John Strong, Steve Holmes\n    * Scene 4. Mr. Pete, Teagan Presley\n    * Scene 5. Alexis Texas, Erik Everhard\n    * Scene 6. Jenna Haze, Mr. Pete\n    * Scene 7. Angelina Valentine, August Night, Manuel Ferrara, Savannah Gold, Velicity Von\n\n\n\t\nLanguage: \tEnglish \nStudio: \tJules Jordan\nRelease Date: \t12/31/2008\n\nVideo: Video: XVID 576x320 29.97fps 983Kbps.\nAudio: MPEG Audio Layer 3 48000Hz stereo 182Kbps.\n\n\n\nREVIEW:\n\n\nChris Streams has been on something of a winning streak during his admittedly brief stay at Jules Jordan Video; each movie seeming to be better than the last. It's interesting to see how much more effort and clarity of vision a director provides when he is working for himself, unencumbered by producers limiting what he can do and hampering the creative process. His latest fuck flick is the double disc Oil Overload: Special Edition Set, a title reminiscent of Elegant Angel's Big Wet Ass series but even better in most ways for the amounts of fuck for the buck it provided. The idea here was clearly to offer up some of the absolute best talent available in porn getting doused in oil and getting off. With names like Gianna, Teagan Presley, Jenna Haze, Gina Lynn, and bodacious Alexis Texas, I was expecting this to be a really solid effort too; each of them considered top talent by a great deal of the porn consuming public. The quick version of the review is that you simply cannot go wrong here but check out the full review if you want the details. \n\nHere's a brief look at the scenes by cast and action, noting that no condoms were used for those still interested:\n\n\nScene One: \n\nGina Lynn, the well liked blond on the middle of the right side of the front cover, was up first as she teased the camera extensively; oiling up her body in a manner that proved to be far more erotic (and strokable) than anything I've seen from the infamous Big Wet Ass series to date. Gina played it just right with a delightful sense of appreciation and perky energy, convincing me she was just as turned on as I was with the action. That led to moper David Perry joining in on the fun, Gina showing him a fantastic time with a sweet blowjob followed by a handjob (soaked with oil) and titty fuck. Gina actively rode his cock in several positions too, bouncing on the rod as though she owned it, before getting off with some PTM as she sucked him clean of her own juices. They continued this dynamic for the rest of the scene, taking time out for some foot fetish action, and that was too much for him to handle so he shot his wad of semen soon after. Gina licked the spew off her feet and finished up with some post coital head as David doused her with more oral. Nice!\n\n\nScene Two: \n\nGianna, the busty babe seen on the lower left hand corner of the cover, was up next as she teased with her curvy body in front of the picture window until Mark Ashley came up to help her. Unlike the last scene, this tease lasted a few minutes and they were screwing like happy rabbits, the chemistry between them a lot higher than the previous pair. Gianna was an even more active partner too, working Mark up so much that her dirty talk had him sucking her perfect pucker even before the face sitting began. She inhaled his cock in her mouth during the 69, consuming some oil to give an even more exotic blowjob that relied on more than just her spitting. Gianna is built for comfort over speed but she was speedily humping his cock in various positions before offering some wonderful titty fuck action though the emphasis was always on the vaginal riding. The lengthy scene might have been better if it started with a longer tease (Gianna is a world class teaser, I know from first hand experience) but the way these two went at it, even getting slightly rough with each other, was fantastic. The load went to her face at the end, Mark rubbing out a sizable amount of population pudding any performer would be proud of. Whew!\n\n\nScene Three: \n\nBritney Stevens, the curvy brunette seen on the upper left hand corner of the cover, was next as she teased on the balcony in her sexy lingerie to slow music, shaking her ample ass ever so slowly. She might have to polish up her moves a touch but I can't deny her appeal based on seeing so many of her movies in the past. She continued to tease as she oiled herself up too, applying ample amounts of baby oil to all parts of her body that I'd like to use for a few weeks, though I would have removed the camisole first. Eventually, she went inside to continue the act, crawling over to the bed where she met both muscular John Strong and gentleman Steve Holmes (the scene shot on 2/25/2008). She was on her knees as she sucked them off in turns, the horned up men having watched her masturbation act longer enough to have an elevated sense of need for her. She spit, went balls deep, and even tried to stick both of them in her mouth at once as they &quot;fucked her mouth&quot;. She also used the oil swallowing trick but Steve was more interested in going straight to her asshole, Britney sitting on it before stretching enough for an active ride. The guys were soon giving her a DP with taste testing (she sucked them clean out of her ass and pussy) but she was always more active when taking one of them on at a time. This continued in numerous positions as she demanded they &quot;fuck my little cunt&quot; or told them to &quot;fuck my ass&quot;, the stream of dirty talk rarely ceasing for long. The scene ended when the guys unloaded their semen into her mouth and she looked sloppy taking it; earning her place as one of the best performers of the day thanks to her performance full of energy and passion. Sweet!\n\n\nScene Four: \n\nTeagan Presley, the beauty seen on the middle of the left hand side of the front cover in white lingerie, was up next as the youthful hotty followed the loose formula in the house. Chris commented on how she kept her ass away from him for so long and she retorted she was &quot;in the butt protection program&quot;, this scene being the first of the lot where he verbally participated more than a little. Teagan was still a few cheeseburgers short of her optimal porn weight as far as I was concerned but she had the same attractive face as ever, moving into the tease effortlessly with some olive oil and an anal plug on the glass table. She took her own sweet time before she started using the plug though, the glass table coming in handy to lube her up in the back. This must have been around where the layer change took place because the DVD locked up repeatedly while playing, neither Windows Media or PowerDVD able to compensate for it (perhaps Teagan was simply too hot for them to handle). The disc played on my DVD player when I initially watched it but as I take screen captures and write my reviews, I like to have access to the movie's scenes to keep the details fresh in mind so your mileage may well vary. The solo anal (which was shot in close up, providing too intimate a look at the action since I wanted to see Teagan's expressions as she plundered her perfect pucker) was then followed by Mr. Pete coming into the picture, relishing his chance to work with newly available Teagan. He felt her up and led her to the railing of the staircase where she slobbed the top few inches of his knob as he poured more oil on her ass. That led to him boning her like he owned her, drilling her pussy deeply before eventually moving to her anal antics. Teagan started off the screwing somewhat passively and without much dirty talk but as she gained confidence in her control of the situation, she seemed to encourage Pete to get rougher; the man slapping her ass and face as well as choking her (to facial discoloration) and pulling her hair as she liked. Teagan's well worn ass became more active as she got used to the action too, the gal actively riding his rod and cleaning it orally before the ending load of population pudding flew all about; Pete rubbing it out without assistance (not my favorite way of doing it) with a single drop landing on Teagan's tongue before she gave him some post coital sucking after he diddled her to a very wet orgasm.\n\n\nScene Five:\n \nAlexis Texas, the bountiful butt babe shown on the upper right hand corner of the cover with her blue dress around her thighs, was up next as the first scene on the second disc. She walked into the room and turned around to give a look at her wonderfully fleshy ass, applying baby oil to her titties before anywhere else. Using ample amounts, perhaps even overkill, Alexis lubed herself up really well during the exquisite tease session, lucking out to work with studly Erik Everhard on the floor. He helped apply some oil too but was more interested in using her ass cheeks to masturbate with, slipping his cock inside of her tight cookie while she shook her ass for all she was worth. The rippling ass cheeks served to elevate the dynamic and Alexis came across as wanting Erik a lot more than usual, showing nearly as much chemistry as she does with Pete (her boyfriend) and just as much passion. They screwed in various positions and while she is still not inclined to do anal, she doesn't have to considering how well she uses her biscuit in her scenes. Erik took a break to eat her out to the point where she begged to suck his cock, Erik accommodating her request as she showed how much she truly wanted to please him orally. Erik throatfucked Alexis too, Alexis gyrating her ass to provide more of the show she was so good at offering up. They went back to fucking and when she was bent over the chair, it accentuated her booty even more, the gal on par with Gianna for curviest ass of the flick. The scene ended when he rubbed out a wad of sperm to her mouth, some of it swallowed as she looked into the camera knowingly with her freckled face; perhaps acknowledging the many loads she was responsible for launching in the privacy of her fans' homes. Yum!\n\n\nScene Six: \n\nJenna Haze, the extremely cute young lady showcased on the lower right hand corner of the cover, was up next with her hair all dolled up to add some class to the picture. Jenna applied a slower, far more seductive method of teasing the camera, slowly rubbing herself along a pillar as she as grinding her hips to make the most of her curvy but petite body. No stranger to keeping fans interested in the eye candy she offers up, Jenna knew she had a captive audience as her lingerie was left on to enhance the moment, the baby oil finally going onto her body to make her &quot;all slippery&quot;. The inside half stairs provided a nice spot for the initial oiling up too as the steps enhanced her ass to the point where Mr. Pete could not hold off any longer, running over with a fully turgid cock for her to suck so aggressively. She did not deepthroat him either but it was still a refreshing hummer, Pete playing with her titties and ass before adding more oil. They began fucking after that, Jenna always an active participant in the action even when the move to anal occurred. Granted, she took a few moments to bounce on cock anally, but that was when her dirty talk kicked into full gear, Jenna telling Pete to &quot;take it every way you can&quot; until he rubbed out the facial that she took in stride. Yes!\n\n\nScene Seven: \n\nAugust, Velicity Von, Savanah Gold, and Angelina Valentine, the gals featured on the dead center of the cover, were up last as August played an offended woman calling the sex police over to masturbating Manuel Ferrara. Velicity, Savanah, and Angelina played the police role really well, rushing over in no time to pour oil all over the naked Manuel and jumping his bones. The ladies took turns sitting on his face and rubbing his body, oiling each other up along the way. The ladies were just as oral as he was so everyone seemed to get some loving before the vaginal penetration, August walking in on them to complain that she didn't call them to fuck him but to stop him. This being a porno, the irate citizen act was dropped in seconds, August joining in to get some attention herself (first from the ladies and then by Manuel himself). There was a lot of fucking taking place and the face smothering dynamic was taken to a new height, the ladies using their ass cheeks and titties to place him in heaven. The ladies even gave him an &quot;eight hand handjob&quot; that struck me as a great deal of fun (my personal version would be an eight tweezer handjob) with this draining his balls to the point he sprayed semen all over their lined up faces. Yowza!\n\n\nSummary: \nOil Overload by director Chris Streams for Jules Jordan Video had some minor technical areas in need of polishing up and a few of the gals were not at their very best but in terms of quality extras, strokability, replay value, and sheer amount of top notch oily fuck for the buck, this was worth a rating of Xcritic Pick. There was more quality material than most gonzo companies put in two full movies, even the very heated BTS longer than many movies you will find being sold for full price. In short, Oil Overload: Special Edition Set had so many great gals doing a fine job that it almost seems to set Chris up for a very difficult situation of trying to outdo himself in future efforts. It was a solid effort all around! \n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:1a920e7234ee8d45e8e77c506477cd41ddd7b2cf","amp;dn":"Oil+Overload+1+%282008%2Cxvid%29+-+anal%2FDP%2CTeagan%2CGianna%2CBritney+Steve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a920e7234ee8d45e8e77c506477cd41ddd7b2cf","infoHashBuffer":{"type":"Buffer","data":[26,146,14,114,52,238,141,69,232,231,124,80,100,119,205,65,221,215,178,207]},"announce":[],"urlList":[]}}