{"title":"Ch4 Grand Designs Collection 11 06of12 The Underground House PDT","uid":8917419,"size":720179194,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1acf2e354cc2161173920909e8b595609df40d76&amp;dn=Ch4+Grand+Designs+Collection+11+06of12+The+Underground+House+PDT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1379174732,"description":"Grand Designs: Collection 11\n\nArts Documentary hosted by Kevin McCloud, published by Channel 4 broadcasted as part of CH4 Grand Designs series in 2012 - English narration\n\n\nInformation\n------------------------------\n\nGrand Designs: Collection 11\nGrand Designs celebrates 100 episodes in this 11th Collection. Designer and writer Kevin McCloud follows the structural, financial and emotional voyage of ambitious couples as they bravely embark on the adventure of a lifetime - building their own homes.\nAfter 100 episodes and 100 individual projects, these extreme homemakers are still risking it all to experiment with technology, architecture and their own lifestyles. There are volatile neighbours, tight budgets, romantic restorations, the rotting corpses of 2000 pigeons, and of course, the ubiquitous battle with the elements; yet presenter Kevin is there through it all, to offer words of encouragement and wisdom, and to raise the occasional eyebrow...\nThis series features 8 unique and extraordinary builds including a 99ft water tower, a minimalist glass box and the world s first computer cut home.\n\n\n1)  Cloontykilla Castle \nThe story of one man's heroic attempt to fulfill his childhood dream and bring back from the ruins an incredible castle set in one of the most beautiful landscapes in Ireland.\nKevin McCloud meets more people trying to build dream homes, beginning with Sean Simons, who bought the ruins of Cloontykilla Castle in the Irish county of Roscommon with a view to using them to create a spectacular mock-16th-century home. However, the outlandish plans - including jacuzzis in the battlements and water-spouting gargoyles - have Kevin worried the project could become a garish nightmare, and his scepticism increases when he realises Sean has not consulted an architect. Disaster seems to be looming as the contractors get frustrated and planning regulations are ignored, but somehow things begin to slowly take shape - until a national economic crisis plunges everything into chaos.\n\n2)  The Computer Cut House \nKevin McCloud meets a pair of civil partnered university professors who have decided to build their first home from scratch. In addition to all the complications this usually entails, they have also enlisted the services of industrial designers who have developed a new computer-assisted method for cutting precision-engineered building blocks from scratch. However, though the technique may be clever, its creators have never created a building before - meaning everyone involved with the project is taking a giant leap into the unknown.\n\n3)  The Glass Cubes House \nMary Martin and Carl Turner want to build a home that resembles a giant stack of glass cubes in Brixton, south London. The couple are hoping the structure will become an instant landmark, while on the inside they are planning a Zen retreat. But to succeed, their finances must be pushed to their limit, so Carl takes on as many of the specialist jobs as he can to save money. Kevin McCloud follows their progress.\n\n4)  The Thames Boathouse \nKevin McCloud follows Lysette and Nigel Offley, who are knocking down an old Thames boathouse and constructing a cutting-edge home in its place. Taking inspiration from the river itself, they have designed a building of waves and curves with a huge glass porthole for a roof light. But problems begin almost from the start, as they can't find a contractor willing to build over the water, their architect leaves unexpectedly and the costs turn out much higher than expected. To make matters worse, the neighbours aren't happy about such a radical sight in their traditional community. As they begin to compromise, Kevin wonders if the couple's dreams will ever be realised.\n\n5)  The Derelict Water Tower \nKevin McCloud marks the 100th episode with one of the programme's most ambitious projects to date. Leigh Osborne and Graham Voce want to convert and extend a landmark 150-year-old water tower in central London into a luxury home. Grade II-listed, derelict and with 6ft-thick walls, it's a huge challenge for the pair, who also plan to build two structures at the base - a lift shaft connected by a series of glass tunnels, and a modern living space. The result will be a four-bedroom property over nine floors, complete with a room at the top offering spectacular 360 degree views across the capital. The tower, which is located directly above London Underground's Northern Line, was originally built for Lambeth Workhouse in 1877 and became a Grade II listed building in 2008.\n\n6)  The Underground House \nKevin McCloud meets Audrey and Jeff, who dream of living in one of west London's most exclusive areas. However, the way they can afford it is to go underground. Their plan is to transform a listed Edwardian artist's studio - along with 5,000 sq ft of derelict basement - into a bespoke subterranean home, complete with supersize kitchen, mezzanine sitting room, four en-suite bedrooms, a gym, cinema, steam room and wine cellar. As if the task weren't tricky enough, they are doing it without proper architect's drawings and Audrey is project managing - and the difficulties begin almost from the start.\n\n7)  The Larch Clad House \nKevin McCloud meets artists Indi and Rebecca, who are planning to build a modern, larch-clad home on the Isle of Skye, with a second hand-crafted building alongside to use as their studio, all on a tight budget of Â£150,000. They have been saving for years, but making it happen will mean taking on the savage weather, not to mention the sceptical locals - and as if that weren't enough, most of the work is being done by one man, local builder Donald.\n\n8)  The Joinery Workshop \nArchitect Henning Stummel and his partner Alice Dawson plan to convert a dilapidated joinery workshop in north London into a contemporary family home and office. They want to preserve the building's original steel frame, but to restore it they will have to take it down, which means carefully extracting it from the neighbours' walls without causing damage to their property - and that's just the start of the couple's problems. Kevin McCloud follows their progress.\n\n9)  The Tree House Revisited \nTwo years ago, architectural designer Lincoln Miles and his wife, artist Lisa Traxler, found an uninspiring 1970s bungalow on a plot on the Isle of Wight surrounded by ancient woodland. As part of their renovation project, they added a three-storey &quot;tower&quot; extension and used a range of unconventional techniques and alternative materials. Kevin McCloud returns to find out whether the couple's methods led to success.\n\n10)  The Disco Home Revisited \nIn 2010, Claire Farrow and Ian Hogarth built a home containing a sauna, spa, dance floor and DJ booth on a small patch of land in London. It was a notorious project, with several setbacks - including their digger smashing into a neighbour's wall and the re-emergence of the old river under the building, which threatened to prevent them completing the project. Kevin McCloud revisits the couple to see how they are getting on two years later.\n\n11)  The Large Timber framed Barn Revisited \nKevin catches up with Freddie Robins and Ben Coode-Adams who left their two bedroom London flat and took on the conversion of a huge Grade II listed timber framed barn in the Essex countryside.\n\n12)  The Co Op 2nd Revisited \nKevin McCloud revisits a group of people in a Brighton co-operative who are building their own homes and the homes of their neighbours.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img827.imageshack.us/img827/7513/4xzv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img827.imageshack.us/img827/7513/4xzv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img827.imageshack.us/img827/5307/pbmt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img827.imageshack.us/img827/5307/pbmt.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img547.imageshack.us/img547/9229/vtcf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img547.imageshack.us/img547/9229/vtcf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img15.imageshack.us/img15/9955/ujcv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img15.imageshack.us/img15/9955/ujcv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img19.imageshack.us/img19/8315/5bf1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img19.imageshack.us/img19/8315/5bf1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/3888/llru.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/3888/llru.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img853.imageshack.us/img853/7707/7exq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img853.imageshack.us/img853/7707/7exq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img29.imageshack.us/img29/3779/tpu6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img29.imageshack.us/img29/3779/tpu6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img585.imageshack.us/img585/5820/n3a9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img585.imageshack.us/img585/5820/n3a9.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d59dbcb2bd9599e6fbe5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1921 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 48mins\n * Framerate: 25fps\n * Number of Parts: 12\n * Part Size: 691 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n * Release Notes\n * Merged subtitles\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.dailymail.co.uk/femail/article-2219697/As-celebrates-100th-episode-Grand-Designs-Kevin-McCloud-explains-s-taken-toll--turned-grumpy-old-Victor-Meldrew.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dailymail.co.uk/femail/article-2219697/As-celebrates-100th-episode-Grand-Designs-Kevin-McCloud-explains-s-taken-toll--turned-grumpy-old-Victor-Meldrew.html&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:1acf2e354cc2161173920909e8b595609df40d76","amp;dn":"Ch4+Grand+Designs+Collection+11+06of12+The+Underground+House+PDT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1acf2e354cc2161173920909e8b595609df40d76","infoHashBuffer":{"type":"Buffer","data":[26,207,46,53,76,194,22,17,115,146,9,9,232,181,149,96,157,244,13,118]},"announce":[],"urlList":[]}}