{"title":"Illustrated Atlas of the Himalaya (Geography Photography Ebook).","uid":8968308,"size":45985724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b0299d0c559d1e19d0063e6db7812d051efcfe0&amp;dn=Illustrated+Atlas+of+the+Himalaya+%28Geography+Photography+Ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1380241956,"description":"David Zurick, Julsun Pacheco, &quot;Illustrated Atlas of the Himalaya&quot;\nEnglish | 2006-08-04 | ISBN: 0813123887 | 229 pages | PDF | 43.86 mb\n\nThe Himalaya are world-renowned for their exquisite mountain scenery, ancient traditions, and diverse ethnic groups that tenaciously inhabit this harsh yet sublime landscape. Home to the world's highest peaks, including Mount Everest, and some of its deepest gorges, the region is a trove of biological and cultural diversity. Providing a panoramic overview of contemporary land and life in the Earth's highest mountains, the Illustrated Atlas of the Himalaya is the first full-color, comprehensive atlas of the geography, economics, politics, and culture of this spectacular area. Drawing from the authors' twenty-five years of scholarship and field experience in the region, the volume contains a stunning and unique collection of maps utilizing state-of-the-art cartography, exquisite photography, and engagingly-written text to give accurate coverage of the Himalaya. The volume covers the entire 2,700-kilometer length of the mountain range, from the Indus Valley in northern Pakistan and India, across Nepal and Bhutan, to the hidden realms of northeast India. The Illustrated Atlas of the Himalaya not only offers detailed explanations of geological formations, climate, vegetation, and natural resources but also explores the human dimension of the region's culture and economy. The authors devote special attention to discovery and travel, including exploration, mountaineering, and trekking. Packed with over 300 easy-to-read, custom designed full color maps and photographs and detailed text and map indexes, the Illustrated Atlas of the Himalaya is a superb collector's volume and an essential reference to this vast and complex mountain region.","torrent":{"xt":"urn:btih:1b0299d0c559d1e19d0063e6db7812d051efcfe0","amp;dn":"Illustrated+Atlas+of+the+Himalaya+%28Geography+Photography+Ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b0299d0c559d1e19d0063e6db7812d051efcfe0","infoHashBuffer":{"type":"Buffer","data":[27,2,153,208,197,89,209,225,157,0,99,230,219,120,18,208,81,239,207,224]},"announce":[],"urlList":[]}}