{"title":"Faith No More - Why People Reject Religion (PDF 2011)","uid":6957327,"size":1392458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b127922cd018e62285a3e2aabbd8ae5d43fce10&amp;dn=Faith+No+More+-+Why+People+Reject+Religion+%28PDF+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rosie1966","files":2,"time":1326635928,"description":"During his 2009 inaugural speech, President Obama described the United States as a nation of &quot;Christians and Muslims, Jews and Hindus--and nonbelievers.&quot; It was the first time an American president had acknowledged the existence of this rapidly growing segment of the population in such a public forum. And yet the reasons why more and more people are turning away from religion are still poorly understood. In Faith No More, Phil Zuckerman draws on in-depth interviews with people who have left religion to find out what's really behind the process of losing one's faith. According to a 2008 study, so many Americans claim no religion (15%, up from 8% in 1990) that this category now outranks every other religious group except Catholics and Baptists. Exploring the deeper stories within such survey data, Zuckerman shows that leaving one's faith is a highly personal, complex, and drawn-out process. And he finds that, rather than the cliche of the angry, nihilistic atheist, apostates are life-affirming, courageous, highly intelligent and inquisitive, and deeply moral. Zuckerman predicts that this trend toward nonbelief will likely continue and argues that the sooner we recognize that religion is frequently and freely rejected by all sorts of men and women, the sooner our understanding of the human condition will improve. The first book of its kind, Faith No More will appeal to anyone interested in the &quot;New Atheism&quot; and indeed to anyone wishing to more fully understand our changing relationship to religious faith.\n\nOxford UP 2011\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1b127922cd018e62285a3e2aabbd8ae5d43fce10","amp;dn":"Faith+No+More+-+Why+People+Reject+Religion+%28PDF+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b127922cd018e62285a3e2aabbd8ae5d43fce10","infoHashBuffer":{"type":"Buffer","data":[27,18,121,34,205,1,142,98,40,90,62,42,171,189,138,229,212,63,206,16]},"announce":[],"urlList":[]}}