{"title":"Bette Midler - Cool Yule 320cbr (Big Papi) 2006 Christmas Music","uid":9387910,"size":90480936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b36746654592d98c35f792c518a89e2e252d8a2&amp;dn=Bette+Midler+-+Cool+Yule+320cbr+%28Big+Papi%29+2006+Christmas+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1387830806,"description":"Source: 2006 CD\n\n\n\nBy Matthew G. Sherwin VINE VOICE\nThis is one incredible Christmas CD from Bette Midler. Bette's first Christmas album is full of great renditions of the standards of this time of year including &quot;Have Yourself A Merry Little Christmas;&quot; &quot;Ill Be Home For Christmas;&quot; &quot;What Are You Doing New Year's Eve?;&quot; &quot;O Come, O Come, Emmanuel&quot; and &quot;White Christmas.&quot; Bette throws in a lot of her own pizzazz and wonderful eggnog with a new song &quot;Cool Yule&quot; and she does a wonderful duet with Johnny Mathis as they perform &quot;Winter Wonderland/Let It Snow! Let It Snow! Let It Snow!&quot; Terrific!\n\nThe CD opens strong with &quot;Merry Christmas.&quot; This song boasts a great musical arrangement and Bette's voice is in excellent form--as it is throughout this album! Then the CD shifts gears and revs up the motors a little bit with &quot;Cool Yule.&quot; This song, written by Steve Allen with additional lyrics by Eric Kornfeld, is a lot of fun and you'll be eager to listen to it again and again!\n\nAnother fun song on this CD is &quot;Mele Kalikimaka.&quot; This is how to say &quot;Merry Christmas&quot; in Hawaiian; this adds a very personal touch to the CD because Bette was born in the state of Hawaii. It offers a great musical composition that starts off with a brief romantic flavor and then twists into a very catchy tune! Could this be a new classic in the making? I think this song will become increasingly popular with time as it is very well written and Bette does a great job with it. The numerous background vocalists are wonderful as well.\n\nBette Midler fans will recognize the special Christmas version of &quot;From A Distance.&quot; It is touching as it was when it was first released and it remains just as relevant today as it was when it was first released in 1990. Newcomers will enjoy this special song as well.\n\nI especially like how Bette masterfully handles the romantic, sentimental lyrics of &quot;I'll Be Home For Christmas&quot; as well as &quot;What Are You Doing New Year's Eve?&quot; Bette breathes new life into these standards with her beautiful voice, energy and passion.\n\nThe quality of the sound is excellent even on a portable CD player. The liner notes are wonderful, too. There are nice photos of Bette both in the liner notes and on the back of the CD artwork, too. You get the song credits and there's a well written essay by Jay Landers. Nice!\n\nOverall, I would recommend this CD for Bette Midler fans and anyone who appreciates beautifully arranged Christmas music. Bette's voice has never sounded better and I applaud her fine efforts to make her first Christmas CD a splendid reality. &quot;Mele Kalikimaka&quot; to you! SMILES","torrent":{"xt":"urn:btih:1b36746654592d98c35f792c518a89e2e252d8a2","amp;dn":"Bette+Midler+-+Cool+Yule+320cbr+%28Big+Papi%29+2006+Christmas+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b36746654592d98c35f792c518a89e2e252d8a2","infoHashBuffer":{"type":"Buffer","data":[27,54,116,102,84,89,45,152,195,95,121,44,81,138,137,226,226,82,216,162]},"announce":[],"urlList":[]}}