{"title":"The Quantum Activist [2009 DVD Rip]","uid":5164689,"size":938776576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1baaf201d10c50f40a2f3030c58644f6efaa1556&amp;dn=The+Quantum+Activist+%5B2009+DVD+Rip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"r_bloodworth","files":2,"time":1258337175,"description":"There is a revolution going on in science. A genuine paradigm shift. While mainstream science remains materialist, a substantial number of scientists are supporting and developing a new paradigm based on the primacy of consciousness.\n\nAmit Goswami, Ph.D., a pioneer of this revolutionary new perspective shares with us his vision of the unlimited potential of consciousness as the ground of all being, and how this revelation helps us to live better. It tells the story of a man who challenges us to rethink our very notions of existence and reality, with a force and scope not felt since Einstein.\n\nThe work of Goswami reveals the overarching unity inherent in the world's major religions and mystical traditions. At times humorous and avoiding the complexity of mathematics, this film bridges the gap between God and science.\n\nMeet the man behind the message as Dr. Goswami tells us how he moved away from the religious teachings of his childhood, to seek his path in nuclear and theoretical quantum physics, and how he has come full circle, through quantum insight, back to the very religious axioms offered as a youth.\n\nWith a poignant relevance, Dr. Goswami demonstrates how our views of reality have led to our current environmental, social, economic and spiritual crisis; and presents a course of action. At stake is nothing less than our survival upon the planet.\n\nIncludes a 20 minute special feature &quot;Creative Evolution&quot;.\n\n\nEnglish\n77 minutes\nwww.quantumactivist.com","torrent":{"xt":"urn:btih:1baaf201d10c50f40a2f3030c58644f6efaa1556","amp;dn":"The+Quantum+Activist+%5B2009+DVD+Rip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1baaf201d10c50f40a2f3030c58644f6efaa1556","infoHashBuffer":{"type":"Buffer","data":[27,170,242,1,209,12,80,244,10,47,48,48,197,134,68,246,239,170,21,86]},"announce":[],"urlList":[]}}