{"title":"Quake 1 Remake and HD texture mods","uid":10563431,"size":599068690,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1bc2389bf82f241b75b341dca459d547437af8ab&amp;dn=Quake+1+Remake+and+HD+texture+mods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Chicoinc","files":-1,"time":1405486278,"description":"FROM: http://www.moddb.com/games/quake-remake\n\nHi guys!\n\nWe are glad to introduce you a remake of the legendary game &quot;Quake&quot; by id Software. Quake Remake has been recreated by a team of Quake fans led by main Xash3D Engine developer, Uncle Mike. It's not that kind of ambitious projects like Darkplaces etc, it's more like project of porting a game to a different engine, just for fun and interests of modding community. Quake Remake not only allows you to play a great game using new Xash3D engine, but also to create a Quake-styled mods (and even games) using GoldSource and XashXT tools, map model and texture formats, new gameplay posibilities, unsupported by original Quake.\n\nHere is a list of GoldSource features you can see in Quake Remake already:\n- skeletal animation\n- sprite muzzleflashes\n- blood decals\n- transparent water\n- screen shake during explosions\n- MP3 music\n\n- Quake Remake is based on Xash3D engine.\nIt allows you to use HD models and textures, so existing model and texture packs for Quake could be adapted for Quake Remake. Xash3D engine also gives you a posibility to implement new renders into the game, and even to use third-party physics engines.\n\n- Quake Remake is open-source, so feel free to experiment!\nIf you wish, just download the devkit.\n\n- Quake Remake contains full Quake storyline.\nFour episodes, epic ending, three difficulty settings, original monsters, bosses, weapons, items and secret places.\nMultiplayer is also avaliable.\n\n- as a Xash3D engine game, Quake Remake supports recording and playing of gameplay demos. Use console command &quot;record demo_name&quot;, or just &quot;record&quot; to start recording, &quot;stop&quot; to finish and &quot;playdemo demo_name&quot; to view recorded demo.\n\n- specially for Quake Remake we implemented into Xash3D some Quake-specific features like luma textures and Quake map format, so it's very close to it's old famous origin.\n\n We hope you enjoy it!\n\n P. S. If you're interested in HD content for Quake Remake, check a Mods section. There is already a project of porting some of existing fan works from Quake to Quake Remake-compatible format.\n\nAlso avaliable on: http://www.moddb.com/games/quake-remake","torrent":{"xt":"urn:btih:1bc2389bf82f241b75b341dca459d547437af8ab","amp;dn":"Quake+1+Remake+and+HD+texture+mods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bc2389bf82f241b75b341dca459d547437af8ab","infoHashBuffer":{"type":"Buffer","data":[27,194,56,155,248,47,36,27,117,179,65,220,164,89,213,71,67,122,248,171]},"announce":[],"urlList":[]}}