{"title":"Bloodlines Series by Richelle Mead","uid":8219926,"size":1798721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1be667834dfcc195ce4b83ef15f2aa25e318d3d3&amp;dn=Bloodlines+Series+by+Richelle+Mead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"NewSky000","files":4,"time":1362449430,"description":"Title: Bloodlines Series\n\nAuthor: Richelle Mead\n\nBook(s): Bloodlines, The Golden Lily, The Indigo Spell\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Sci-Fi, Fantasy, Romance, Paranormal\n\nSummary:\n\nBlood doesn't lie...\n\nSydney is an alchemist, one of a group of humans who dabble in magic and serve to bridge the worlds of human and vampires. They protect vampire secrets - and human lives. When Sydney is torn from her bed in the middle of the night, at first she thinks she's still being punished for her complicated alliance with dhampir Rose Hathaway. But what unfolds is far worse. Jill Dragomir - the sister of Moroi Queen Lissa Dragomir - is in mortal danger, and the Moroi must send her into hiding. To avoid a civil war, Sydney is called upon to act as Jill's guardian and protector, posing as her roommate in the last place anyone would think to look for vampire royalty - a human boarding school in Palm Springs, California. But instead of finding safety at Amberwood Prep, Sydney discovers the drama is only just beginning...  - Goodreads Summary of Bloodlines (Bloodlines #1)\n\nNote: Mainly for a young adult audience. This book is recommendable to those who enjoyed the Vampire Academy series, and enjoy fantasy-type books. The fourth book, The Fiery Heart, won't come out till November 2013, so I will reload this torrent with the newer complete series. This series is different from Mead's other books, as people rushed in expecting another Vampire Academy but came out with something completely different, but just as entertaining!\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:1be667834dfcc195ce4b83ef15f2aa25e318d3d3","amp;dn":"Bloodlines+Series+by+Richelle+Mead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be667834dfcc195ce4b83ef15f2aa25e318d3d3","infoHashBuffer":{"type":"Buffer","data":[27,230,103,131,77,252,193,149,206,75,131,239,21,242,170,37,227,24,211,211]},"announce":[],"urlList":[]}}