{"title":"Borderlands.2-SKIDROW","uid":7698238,"size":7666152923,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c26555dee1523793353fdb234facb58fb545a98&amp;dn=Borderlands.2-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ireleases","files":8,"time":1349425689,"description":"Borderlands 2-SKIDROW\nBorderlands 2 (c) 2K Games\n\n18-09-2012......Release Date - Protection.............SteamCEG\nFPSRPG............Game Type - Disk(s)....................1 DVD\n\n\nRELEASE NOTES\n\nA new era of shoot and loot is about to begin. Play as one of four new\nvault hunters facing off against a massive new world of creatures,\npsychos and the evil mastermind, Handsome Jack. Make new friends, arm\nthem with a bazillion weapons and fight alongside them in 4 player\nco-op on a relentless quest for revenge and redemption across the\nundiscovered and unpredictable living planet.\n\nFeatures:\n\nAll-New Characters and All-New Classes: Four all new playable classes\nincluding the Siren, the Commando, the Gunzerker and the Assassin.\nStep into the role of the Gunzerker, whose highly deadly skills allow\nhim to dual-wield any two weapons found in the game. Not only that,\nyou will build on that skill to do more things with two guns than you\never imagined possible. Dual machine guns? Cool. Dual rocket launchers?\nOf course Dual Sniper Rifles? Sure, if thats your thing Want to try\nother styles? More tactical perhaps? There are multiple classes to\nchoose from\n\nDynamic Co-op online, and LAN: Share your adventures with friends both\nonline and via LAN. Borderlands 2 features a seamless system enabling\nyou to drop in and drop out of a campaign without ever having to\nrestart the game. On top of that you can even take your new gear from\nany game to any other\n\nWorld Connected Story: Find yourself left for dead in the frozen tundra\nof Pandora as you begin your quest of revenge and redemption. Expose\nthe evil surrounding the Hyperion Corporation and take on the\nperpetrator of a universe-wide grand deception -- the nefarious\nHyperion CEO, Handsome Jack. (Oh, also: he's stolen credit for the\nopening of the Vault.)\n\n87 Bazillion...Everything: In addition to the new gun system, you will\nlust after procedurally generated shields, grenades, Relics, class mods\nand much, much more. And you thought the original Borderlands had a ton\nof loot\n\nBrand new environments on Pandora: Hunt through entirely brand new\nareas of Pandora that are more alive than ever From the arctic tundra,\nthrough the dangerous grasslands, past the mysterious corrosive caverns\nto beyond, you'll be surprised by the unpredictable world of Pandora at\nevery turn\n\nBrand new enemies: A whole slew of new enemies are out there to kill\nyou in Borderlands 2. Hulking, gorilla-like Bullymongs, vicious\npredatory Stalkers and the Hyperion mechanical army, run by Handsome\nJack, are just some of the new enemies in Borderlands 2.\n\n\nINSTALL NOTES\n\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:1c26555dee1523793353fdb234facb58fb545a98","amp;dn":"Borderlands.2-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c26555dee1523793353fdb234facb58fb545a98","infoHashBuffer":{"type":"Buffer","data":[28,38,85,93,238,21,35,121,51,83,253,178,52,250,203,88,251,84,90,152]},"announce":[],"urlList":[]}}