{"title":"Edgar Degas - Waiting (Art Painting).pdf","uid":15380354,"size":7481482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c2ae38db0dadb3f52f29090df1d669c5b678e34&amp;dn=Edgar+Degas+-+Waiting+%28Art+Painting%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1469225332,"description":"Getty | 1995 | 0892362855 | English | PDF | 110 pages | 7.1 Mb\r\n\r\nEdgar Degas was one of the great pioneers of modern art, and the J. Paul Getty and Norton Simon museums are fortunate to own jointly one of his finest pastels, Waiting (L’Attente), which he made sometime between 1880 and 1882, about midway in his career.\r\n\r\nIn this fascinating monograph, author Richard Thomson explores this brilliant work in detail, revealing both the intricacies of its composition and the source of the emotional pull it immediately exerts upon the viewer. For Waiting is, indeed, an extraordinary object both in its craftsmanship and color and, perhaps most especially, in its aura of ambiguity and even mystery.\r\n\r\nThe aesthetic qualities and the deeper questions Waiting arouses are the subjects of this definitive study, which also offers a detailed analysis of the cultural milieu in which the work was created and the place it occupies in Degas’s œuvre.\r\n\r\nContaining some seventy-five comparative illustrations—twenty-five of which are reproduced in color—and a foldout color reproduction of the work itself, this study serves both as an introduction to the work of a great modern master and an in-depth study of one of his most intriguing creations.\r\n\r\nEdgar Degas: Waiting is part of the Getty Museum Studies on Art series, designed to introduce individual works of note or small groups of related works to a broad public with an interest in the history of art.\r\n\r\nEach monograph is written by a leading scholar and features a close discussion of its subject as well as a detailed analysis of the broader historical and cultural context in which the work was created","torrent":{"xt":"urn:btih:1c2ae38db0dadb3f52f29090df1d669c5b678e34","amp;dn":"Edgar+Degas+-+Waiting+%28Art+Painting%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c2ae38db0dadb3f52f29090df1d669c5b678e34","infoHashBuffer":{"type":"Buffer","data":[28,42,227,141,176,218,219,63,82,242,144,144,223,29,102,156,91,103,142,52]},"announce":[],"urlList":[]}}