{"title":"S01E02-Pretty Guardian Sailor Moon Crystal [ENGLISH SUB]","uid":10596014,"size":315938833,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:1c36917cff8f506746c1c462819e0a702abfac4e&amp;dn=S01E02-Pretty+Guardian+Sailor+Moon+Crystal+%5BENGLISH+SUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ligre","files":-1,"time":1405863794,"description":"WATCH IT LEGALLY FOR FREE ON http://www.crunchyroll.com/sailor-moon-crystal SUPPORT THE SHOW. This torrent is intended for fans in countries that do not have legal access and for people wanting an offline copy. Enjoy!\n\n\n*SPOILER ALERT*\n\nEN\nAmi Mizuno, a particularly gifted student at Usagi's school who often scores top marks, is jealous of Usagi's ability to make friends. Meanwhile, Jadeite, the shadowy man from before, is ordered by his leader, Queen Beryl, to create a new monster, while Luna feels that Ami has the potential to become a Sailor Guardian. The next day, Luna makes an opportunity for Usagi and Ami to befriend each other after school, and together they go to Game Center Crown where they win two pens from a machine. Afterwards, Ami goes to the Crystal Seminar, where students use computers to study, unaware that it is another one of Jadeite's plans. Discovering Ami's strange behavior the next day, Usagi and Luna look into the disk she received from the seminar, discovering it to be a brainwashing program tricking people into finding information on the Legendary Crystal. Using the pen she received from the arcade machine, Usagi disguises herself as a doctor and sneak into the Crystal Seminar to rescue Ami, where she transforms to fight against the monster, who is impervious to Usagi's supersonic waves. Ami snaps out of her trance upon seeing Usagi in danger, allowing her to use the pen she received to transform into a new Sailor Guardian, Sailor Mercury. Ami hurls her Mercury Aqua Mist attack to disable the monster, who is then killed by Usagi's Moon Tiara Boomerang.","torrent":{"xt":"urn:btih:1c36917cff8f506746c1c462819e0a702abfac4e","amp;dn":"S01E02-Pretty+Guardian+Sailor+Moon+Crystal+%5BENGLISH+SUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c36917cff8f506746c1c462819e0a702abfac4e","infoHashBuffer":{"type":"Buffer","data":[28,54,145,124,255,143,80,103,70,193,196,98,129,158,10,112,42,191,172,78]},"announce":[],"urlList":[]}}