{"title":"eScan AntiVirus Toolkit (MWAV) v12.0.8 [ML]","uid":6109575,"size":86222759,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c590dc7b90cd65585eeb11a9fcfaf8c3fff53a4&amp;dn=eScan+AntiVirus+Toolkit+%28MWAV%29+v12.0.8+%5BML%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"webchella","files":2,"time":1295297257,"description":"eScan AntiVirus Toolkit (MWAV) v12.0.8 [ML]\n\n===========\n::English::\n===========\nLanguage: Multi\nPlatform: Windows All\nLicense: Freeware\n\neScan Antivirus Toolkit - a free utility that allows you to scan and remove viruses, spyware, adware and other malicious programs that could be infected computer. eScan Antivirus Toolkit does not require installation and can be run directly from anywhere: on your computer, USB media or CD. It can be started, even if your computer is already running another antivirus program.\n\neScan Antivirus Toolkit weekly updates to the latest version, for that would detect newly released spyware and adware in addition to this mechanism is constantly &quot;improvises&quot; a fast and smart detection.\n\nOptions eScan Antivirus Toolkit 12.x:\n* Full Scan and clean your computer, as well as reporting on any detected viruses.\n* Check and remove all programs, dialers from your computer.\n* Checking and cleaning of any illegal traffic analyzer, or spyware, adware, keyloggers etc. running in the memory of your computer.\n* You can add the program to the Startup list computer in order that she could scan and clean your computer with each new startup.\n* When you download this program, you will get it together with the latest updated list of viruses that will scan and clean your computer from all known viruses.\n* No installation required. Just download and run the eScan Antivirus Toolkit to scan your computer.\n* EScan Antivirus Toolkit runs on Microsoft Windows 2000, XP, Vista, Windows 7 and Windows 2008 (Operating System 32 and 64 bit), and also supports multiple languages. \n\n===========\n::Spanish::\n===========\n\nIdiomas: Multilenguaje\nPlataforma: Windows Todos\nLicencia: Freeware\n\neScan Antivirus Toolkit - una utilidad gratuita que te permite detectar y eliminar virus, spyware, adware y ot\nros programas maliciosos que podrÃƒÂ­an equipo infectado. eScan Antivirus Toolkit no requiere instalaciÃƒÂ³n y se puede ejecutar directamente desde cualquier lugar: en el equipo, dispositivo USB o CD. Puede ser comenzado, aunque el equipo ya se estÃƒÂ¡ ejecutando otro programa antivirus.\n\n\neScan Antivirus Toolkit actualizaciones semanales a la ÃƒÂºltima versiÃƒÂ³n, para que pueda detectar reciÃƒÂ©n lanzado software espÃƒÂ­a y adware, ademÃƒÂ¡s de este mecanismo estÃƒÂ¡ constantemente &quot;improvisa&quot; una detecciÃƒÂ³n rÃƒÂ¡pida y elegante.\n\nOpciones de eScan Antivirus Toolkit 12.x:\n* AnÃƒÂ¡lisis completo y limpie su equipo, asÃƒÂ­ como informar sobre cualquier tipo de virus detectado.\n* Controlar y eliminar todos los programas, marcadores de su equipo.\n* RevisiÃƒÂ³n y limpieza de cualquier analizador de trÃƒÂ¡fico ilÃƒÂ­cito, o spyware, adware, keyloggers etc corriendo en la memoria de su ordenador.\n* Usted puede agregar el programa a la computadora la lista de inicio con el fin de que podÃƒÂ­a escanear y limpiar su equipo con cada nuevo arranque.\n* Al descargar este programa, usted lo recibirÃƒÂ¡ junto con la ÃƒÂºltima lista actualizada de los virus que escanear y limpiar tu ordenador de todos los virus conocidos.\n* No requiere instalaciÃƒÂ³n. SÃƒÂ³lo tienes que descargar y ejecutar el eScan Antivirus Toolkit para escanear su ordenador.\n* EScan Antivirus Toolkit se ejecuta en Microsoft Windows 2000, XP, Vista, Windows 7 y Windows 2008 (sistema operativo de 32 y 64 bits), y tambiÃƒÂ©n soporta mÃƒÂºltiples idiomas.\n","torrent":{"xt":"urn:btih:1c590dc7b90cd65585eeb11a9fcfaf8c3fff53a4","amp;dn":"eScan+AntiVirus+Toolkit+%28MWAV%29+v12.0.8+%5BML%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c590dc7b90cd65585eeb11a9fcfaf8c3fff53a4","infoHashBuffer":{"type":"Buffer","data":[28,89,13,199,185,12,214,85,133,238,177,26,159,207,175,140,63,255,83,164]},"announce":[],"urlList":[]}}