{"title":"Tool 24bit Vinyl Pack","uid":10887768,"size":9195531755,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1c6334ad92ebfd31c49fb5d62ff5437ba9729484&amp;dn=Tool+24bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"politux","files":-1,"time":1409083353,"description":"\n  Tool 24bit Vinyl Pack\n\n  Genre: Rock\n  Styles: Alternative, Metal\n  Source: vinyl\n  Codec: FLAC\n  Bit rate: ~ 2,900 kbps\n  Bit dpeth: 24\n  Sample rate: 96 kHz\n\n  1992 Opiate \n\n  Shure V15 Type III cartridge \n  Audio-Technica AT-PL120 turntable \n  ATI P100 phono preamp\n  Echo MiaMidi 24/96 balanced in \n  Adobe Audition 1.5\n\n  1993 Undertow - 180g Vinyl US pressing\n\n  Hitachi HT-466\n  Pre-Amp - PC \n  Adobe Audition 2.0\n  FLAC Frontend Level 8 \n\n  1996 Ã†nima - 180g Vinyl US pressing\n\n  Hitachi HT-466\n  Pre-Amp - PC  \n  Adobe Audition 2.0 \n  FLAC Frontend Level 8\n\n  2001 Lateralus - PD Vinyl\n\n  Hitachi HT-466 \n  Pre-Amp - PC \n  Adobe Audition 2.0\n  FLAC Frontend Level 8\n\n  2003 Lateralus - Volcano Entertainment US pressing\n\n  Thorens TD190  \n  Audio Note IQ 1 \n  Rega &quot;Luna&quot; ADC \n  Apogee duet Program-digitizer \n  Logic Pro 8 Processing\n\n  2005 Lateralus - Volcano Entertainment - Zomba Recordings \n  61422-31160-1 Original U.S. Pressing 2xLP Picture Disc 180g\n\n  TT: Clearaudio Emotion\n  Cartridge: Clearaudio Maestro Wood MM\n  Interconnects: Original Clearaudio\n  Phonopreamplifier: Clearaudio Smart Phono\n  Interconnects: Oehlbach NF 1 Y-Adapter\n\n  Tool's greatest breakthrough was to meld dark underground metal with the ambition of art rock. Although Metallica wrote their multi-sectioned, layered songs as if they were composers, they kept their musical attack ferociously at street level. Tool didn't. They embraced the artsy, bohemian preoccupations of Jane's Addiction while they simultaneously paid musical homage to the relentlessly bleak visions of grindcore, death metal, and thrash. Even with their post-punk influences, they executed their music with the aesthetic of prog rock, alternating between long, detailed instrumental interludes and lyrical rants in their songs.\n\n  Tool had a knack for conveying the strangled, oppressive angst that the alternative nation of the early '90s claimed as its own. So, Tool were able to slip into the definition of alternative rock during the post-Nirvana era, landing a slot on the third Lollapalooza tour in 1993, which helped their first full-length debut album, Undertow, rocket to platinum status. By the time the band delivered its belated follow-up, Ã†nima, in 1996, alternative rock had lost its grip on the mainstream of America, and Tool's audience had shaped up as essentially metal-oriented, which meant that the group and the record didn't capture as big an audience as their first album, despite debuting at number two on the charts. After a co-headlining slot with Korn on Lollapalooza '97 wrapped up, Tool remained on the road, supporting Ã†nima until well into the next year.\n\n  During the band's usual extended hiatus between albums, Maynard James Keenan decided to use his downtime productively by forming a side project, dubbed A Perfect Circle. The band's 2000 debut, Mer de Noms, was a surprise hit, while the ensuing tour was a sold-out success as well. With Tool breakup rumors swirling, the band put the speculation to rest by re-entering the recording studio and issuing the stopgap B-sides/DVD set Salival late the same year. Finally, May 2001 saw the release of Tool's third full-length release, Lateralus, which debuted at the number one position on the Billboard album chart and became the band's biggest hit. After the obligatory several-year sabbatical to pursue other projects, the group returned with another chart-topper, 10,000 Days, in 2006.\n\n  Thanks to all the original rippers and uploaders. :)","torrent":{"xt":"urn:btih:1c6334ad92ebfd31c49fb5d62ff5437ba9729484","amp;dn":"Tool+24bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c6334ad92ebfd31c49fb5d62ff5437ba9729484","infoHashBuffer":{"type":"Buffer","data":[28,99,52,173,146,235,253,49,196,159,181,214,47,245,67,123,169,114,148,132]},"announce":[],"urlList":[]}}