{"title":"Final Fantasy VII (PSX)","uid":4497985,"size":2167410208,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:1ce70fae885c1410de58cd8b2339a79aa01dd297&amp;dn=Final+Fantasy+VII+%28PSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"ashamael","files":6,"time":1226276209,"description":"Final Fantasy VII  is a console role-playing game developed by Square (now Square Enix) and published by Sony Computer Entertainment as the seventh installment in the Final Fantasy series. It was released in 1997 for Sony's PlayStation and in 1998 for Microsoft's Windows-based personal computers. The game is the first in the series to use 3D computer graphics, featuring fully rendered characters on pre-rendered backgrounds.\n\nSet in a dystopian world, Final Fantasy VII's story centers on the powerful megacorporation Shinra, which is draining the life of the planet to use as an energy source. Players follow a young mercenary named Cloud Strife, who joins with several others to stop Shinra. Later in the story, the main antagonist, Sephiroth, develops a plan to summon a meteor with the intention of injuring the planet to a point where it would gather massive amounts of its life force in one spot. This would allow Sephiroth to collect all the life force and gain control of all living beings.\n\nDevelopment of Final Fantasy VII began in 1994 and the game was originally only intended for the SNES, but it was later moved to the Nintendo 64. As the system's cartridges lacked space, Square decided to release the game for Sony's PlayStation instead. The music was scored by Final Fantasy veteran Nobuo Uematsu, while the series' long-time character designer, Yoshitaka Amano, was replaced by Tetsuya Nomura.\n\nThe game was a major critical and commercial success, and remains arguably the most popular title in the series. As of December 2005, Final Fantasy VII has sold more than 9.8 million copies worldwide, earning it the position of the best-selling Final Fantasy title and the second-best-selling PlayStation game of all-time. The ongoing popularity of the title led Square Enix to produce a series of sequels and prequels under the collective title Compilation of Final Fantasy VII.\n\n\nDeveloper(s)\n\nSquare \n\nPublisher(s)\n\nPlayStation\n\nJP Square\nNA SCE America\nPAL SCE Europe\nINT Square\n\nWindows\n\nEidos Interactive\n\n \nDesigner(s)\n\nHironobu Sakaguchi\nYoshinori Kitase\n\n \nWriter(s)\n\nYoshinori Kitase\nKazushige Nojima\n\n \nArtist(s)\n\nTetsuya Nomura\nYusuke Naora\n\n \nComposer(s)\n\nNobuo Uematsu\n\n \nSeries\n\nFinal Fantasy \n\n\nPlatform(s)\n\nPlayStation,\nWindows\n\n\nRelease date(s) \n\nPlayStation\nJP January 31, 1997\nNA September 7, 1997\nEU November 17, 1997\nAUS November 1997\nINT October 2, 1997\n\nWindows\nNA June 24, 1998\nPAL 1998\n \nGenre(s)\n\nConsole role-playing game \nMode(s)\n\nSingle-player\n\n \nRating(s)\n ELSPA: 11+\nESRB: T\nOFLC: G8+\nPEGI: 12+\nUSK: 12+\n \nMedia\n\n3 CD-ROMs (PS)\n4 CD-ROMs (Windows) \n\n\nIdeal to play on PC using emulator (possible using files directly for HD). It is possible to also burn it and play on PSX. \n\nThis torrent also contains FFVII Walkthrough guide by A I e x.\n","torrent":{"xt":"urn:btih:1ce70fae885c1410de58cd8b2339a79aa01dd297","amp;dn":"Final+Fantasy+VII+%28PSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ce70fae885c1410de58cd8b2339a79aa01dd297","infoHashBuffer":{"type":"Buffer","data":[28,231,15,174,136,92,20,16,222,88,205,139,35,57,167,154,160,29,210,151]},"announce":[],"urlList":[]}}