{"title":"Joe Cocker-1969-1990","uid":4882199,"size":1461163124,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1cf7e606a701c0be3b04f270505e4e1afd32b770&amp;dn=Joe+Cocker-1969-1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"SecondOpinion","files":-1,"time":1241452311,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nJohn Robert &quot;Joe&quot; Cocker OBE (born 20 May 1944) is an English rock/blues singer who came to popularity in the 1960s, and is most known for his gritty voice and his cover versions of popular songs, particularly those of The Beatles.\nCocker was born on 20 May 1944 at 38 Tasker Road, Crookes, Sheffield. He is the youngest son of a civil servant, Harold Cocker, and Madge Cocker. According to different family stories, Cocker received his nickname of Joe either from playing a childhood game called &quot;Cowboy Joe&quot; or from a neighborhood window cleaner named Joe. Cocker's main musical influences growing up were Ray Charles and Lonnie Donegan. Cocker's first experience singing in public was at age 12 when his older brother Victor invited him on stage to sing during a gig of his skiffle band. In 1960, along with three friends, Cocker formed his first band, the Cavaliers. For the band's first performance at a youth club, they were required to pay the price of admission before entering. The Cavaliers eventually broke up after a year and Cocker left school to become an apprentice gas fitter while he pursued a career in music.\n\nIn 1961, under the stage name Vance Arnold, Cocker continued his career with a new band, Vance Arnold and the Avengers. The name was a combination of Vince Everett, Elvis Presley's character in Jailhouse Rock, (which Cocker misheard as Vance) and country singer Eddy Arnold. The band mostly played in the pubs of Sheffield, performing covers of Chuck Berry and Ray Charles songs. In 1963 they booked their first significant gig when they supported The Rolling Stones at Sheffield City Hall. In 1964 Cocker signed a recording contract as a solo act with Decca Records and released his first single, a cover of The Beatles' &quot;I'll Cry Instead&quot; with Jimmy Page playing backup guitar. Despite extensive promotion from Decca lauding his youth and working class roots, the record was a flop and his recording contract with Decca lapsed at the end of 1964. After Cocker recorded the single, he dropped his stage name and formed a new band, Joe Cocker's Big Blues. The band toured in France, where they played on American air bases and Cocker gained the nickname of &quot;Le Petit Ray Charles&quot;. Although the band appeared on the ITV variety show Star and Garters, they were unable to secure enough bookings and had to disband due to lack of funds.\n\n\n","torrent":{"xt":"urn:btih:1cf7e606a701c0be3b04f270505e4e1afd32b770","amp;dn":"Joe+Cocker-1969-1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf7e606a701c0be3b04f270505e4e1afd32b770","infoHashBuffer":{"type":"Buffer","data":[28,247,230,6,167,1,192,190,59,4,242,112,80,94,78,26,253,50,183,112]},"announce":[],"urlList":[]}}