{"title":"Zone Of The Enders: The 2nd Runner Special Edition [PS2] [PAL]","uid":5747296,"size":2242845915,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:1d568d8d20a5e30b49cf89ef33d5677e475de468&amp;dn=Zone+Of+The+Enders%3A+The+2nd+Runner+Special+Edition+%5BPS2%5D+%5BPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"thenoobish","files":-1,"time":1281267508,"description":"Languages: Multi5\n\n\nIn ZOE2, players are once again thrown into an interplanetary conflict, but this time the stakes are even higher, as the fate of Jupiter and Mars are held in the balance. Players will find a host of new gameplay features to help balance the odds. Exhilarating new maneuvers enable players to swing around enemies, target and destroy swarms of enemy fighters, tear down walls to use as shields or as a weapon, and even teleport out of danger. There are also more sub-weapons that support basic attacks and enhance strategic play during combat.\n\nThe game's setting expands greatly beyond that of the first ZOE: battles will be fought in canyons, cityscapes, enemy fortresses and even in the depths of space. A new cast of characters populates these diverse settings, promising to infuse this epic saga with a human element.\n\n\nAccording to an article on Wikipedia the Special Edition includes:\n\n&quot;The &quot;Special Edition&quot; PAL and NTSC-J  versions of the game featured a variety of additions and extras to the game, including new VR Training options, added scenarios, more difficulties, a music video featuring a remixed &quot;Beyond the Bounds&quot; theme, improved anti-aliasing and graphical optimizations, and new Orbital Frames for Versus Mode, among other improvements to the game.&quot;\n\n\nDo you missing a game? Write a comment with the game you want and I will try to upload that game.","torrent":{"xt":"urn:btih:1d568d8d20a5e30b49cf89ef33d5677e475de468","amp;dn":"Zone+Of+The+Enders%3A+The+2nd+Runner+Special+Edition+%5BPS2%5D+%5BPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d568d8d20a5e30b49cf89ef33d5677e475de468","infoHashBuffer":{"type":"Buffer","data":[29,86,141,141,32,165,227,11,73,207,137,239,51,213,103,126,71,93,228,104]},"announce":[],"urlList":[]}}