{"title":"Electromagnetic Fields in Biology and Medicine - Marko S. Markov","uid":11766375,"size":14196064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d9df3a53f457dffc1323774b960d8d266081767&amp;dn=Electromagnetic+Fields+in+Biology+and+Medicine+-+Marko+S.+Markov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1426865442,"description":"Through a biophysical approach, Electromagnetic Fields in Biology and Medicine provides state-of-the-art knowledge on both the biological and therapeutic effects of Electromagnetic Fields (EMFs). The reader is guided through explanations of general problems related to the benefits and hazards of EMFs, step-by-step engineering processes, and basic results obtained from laboratory and clinical trials.\n\nBasic biological mechanisms reviewed by several authors lead to an understanding of the effects of EMFs on microcirculation as well as on immune and anti-inflammatory responses. Based upon investigational mechanisms for achieving potential health benefits, various EMF medical applications used around the world are presented. These include the frequent use of EMFs in wound healing and cartilage/bone repair as well as use of EMFs in pain control and inhibition of cancer growth.\n\nFinal chapters cover the potential of using the novel biophysical methods of electroporation and nanoelectroporation in electrochemotherapy, gene therapy, and nonthermal ablation. Also covered is the treatment of tendon injuries in animals and humans. This book is an invaluable tool for scientists, clinicians, and medical and engineering students","torrent":{"xt":"urn:btih:1d9df3a53f457dffc1323774b960d8d266081767","amp;dn":"Electromagnetic+Fields+in+Biology+and+Medicine+-+Marko+S.+Markov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9df3a53f457dffc1323774b960d8d266081767","infoHashBuffer":{"type":"Buffer","data":[29,157,243,165,63,69,125,255,193,50,55,116,185,96,216,210,102,8,23,103]},"announce":[],"urlList":[]}}