{"title":"Bert Haanstra - De fanfare (1958) - TV-rip - 720x576.avi","uid":4554296,"size":831934208,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1e1dac6932ad11b8b8fdcb461da6db7b412d301b&amp;dn=Bert+Haanstra+-+De+fanfare+%281958%29+-+TV-rip+-+720x576.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Sandhopper","files":1,"time":1228422165,"description":"Fanfare is het verhaal van het muziekkorps van Lagerwiede, dat door een ruzie tussen de cafÃƒÂ©houders Geursen en Krijns, in twee kampen uiteen valt. Na veel komische verwikkelingen komt het toch nog tot een wonderbaarlijke verzoening. Het land was te klein toen met Fanfare Bert Haanstra&amp;#039;s eerste speelfilm uitkwam. De bioscoopvoorstellingen ervan werden onderbroken door applaus en binnen de kortste keren waren er 2,6 miljoen Nederlanders naartoe geweest. Zo&amp;#039;n dorpsruzie kwam menigeen bekend voor: in Nederland waren wel meer fanfares of verenigingen van kleiduivenschieters te vinden die heibel hadden. Giethoorn, waar de film was opgenomen, vertegenwoordigde met zijn watertjes en zijn boerderijen tussen de bomen een romantisch Nederland waar de toeschouwers in die naoorlogse wederopbouwtijd graag even vertoefden. En er viel wat te lachen. Nog altijd vermaakt de kijker zich uitstekend met de humor in Fanfare. Bijzonder was dat het grote publiek en de filmbesprekers het dit keer eens waren. Degenen die op zoek waren naar filmkunst waardeerden Haanstra&amp;#039;s originele vondsten, zijn beeldgrappen en zijn virtuoze montages. De koeien die door het gras lijken te glijden kent bijna iedereen. De eenden die hun veren schudden, gevolgd door een meisje dat haar haren goed doet, of de snaterende eenden die met ruziÃƒÂ«nde mensen worden gecombineerd, zijn typische Haanstra effecten, waarvan er vele in Fanfare zitten. Het scenario werd geschreven door de regisseur en (toen) filmjournalist Jan Blokker samen, waarbij ze werden geadviseerd door de fameuze maker van Britse filmkomedies Alexander Mackendrick.","torrent":{"xt":"urn:btih:1e1dac6932ad11b8b8fdcb461da6db7b412d301b","amp;dn":"Bert+Haanstra+-+De+fanfare+%281958%29+-+TV-rip+-+720x576.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1dac6932ad11b8b8fdcb461da6db7b412d301b","infoHashBuffer":{"type":"Buffer","data":[30,29,172,105,50,173,17,184,184,253,203,70,29,166,219,123,65,45,48,27]},"announce":[],"urlList":[]}}