{"title":"Don't Starve Along Pack (GOG)","uid":14125973,"size":732926062,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e50dcb11c84215bf37f77ebc1385c0f05294d62&amp;dn=Don%27t+Starve+Along+Pack+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mercs215","files":8,"time":1459499801,"description":"Install instructions:\r\n- Run &quot;setup_dont_starve_2.10.0.20.exe&quot;\r\n- Run &quot;setup_dont_starve_reign_of_giants_2.10.0.20&quot;\r\n- Run &quot;setup_dont_starve_shipwrecked_2.0.0.20&quot;\r\n- Play\r\nCredits: this release was made possible by Swapware Games Network!\r\nIf you like this game, support the developers and BUY IT!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\n\r\nTitle: DON'T STARVE ALONE PACK\r\nGenre: Action - Adventure - Survival\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.7.0+) and Linux (Ubuntu 14.04, Mint 17)\r\nLanguages: Audio and text: English\r\nFeatures: single-player\r\nReleased: March 31, 2016\r\nCompany: Klei Entertainment / Klei Entertainment\r\nStore page: https://www.gog.com/game/dont_starve_alone_pack\r\n\r\nAbout:\r\nThe Don't Starve Alone Pack includes Don't Starve and its DLC: Don't Starve: Reign of Giants and Don't Starve: Shipwrecked.\r\n\r\nDON'T STARVE\r\nDon’t Starve is an uncompromising wilderness survival game full of science and magic.\r\nYou play as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants if he ever hopes to escape and find his way back home.\r\nEnter a strange and unexplored world full of strange creatures, dangers, and surprises. Gather resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land, in this challenging and unnerving wilderness survival sandbox game.\r\n\r\nDON'T STARVE: REIGN OF GIANTS\r\nDon’t Starve: Reign of Giants is an expansion pack that adds new characters, seasons, creatures, biomes, and other challenges to Don’t Starve.\r\nThe entire world of Don’t Starve has been expanded and is now even more uncompromising! New mysteries, challenges and scientific innovations await your discovery. Manage your resources well, because the wilderness of Don’t Starve has learned some new tricks.\r\n\r\nDON'T STARVE: SHIPWRECKED\r\nKlei Entertainment has partnered with our friends at CAPY, creators of Superbrothers: Sword and Sworcery, Super Time Force and Below; to bring fans of Don’t Starve the latest single-player expansion: Don’t Starve: Shipwrecked!\r\nIn Don't Starve: Shipwrecked, Wilson finds himself stranded in a tropical archipelago. He must learn to survive all over again in this new environment filled with new biomes, seasons, and creatures.\r\nDon’t let the tropical breeze lull you into a false sense of security - the world might be different, but it is still equal parts unforgiving and uncompromising. You will quickly find these islands are full to the brim with things that want to kill you.\r\n\r\nMinimum system requirements - Windows: XP / Vista / 7 / 8 \r\nProcessor:1.7+ GHz or better \r\nMemory:1+ gigs of RAM GB RAM \r\nGraphics:Radeon HD5450 or better; 256 MB or higher \r\nMouse &amp; Keyboard","torrent":{"xt":"urn:btih:1e50dcb11c84215bf37f77ebc1385c0f05294d62","amp;dn":"Don%27t+Starve+Along+Pack+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e50dcb11c84215bf37f77ebc1385c0f05294d62","infoHashBuffer":{"type":"Buffer","data":[30,80,220,177,28,132,33,91,243,127,119,235,193,56,92,15,5,41,77,98]},"announce":[],"urlList":[]}}