{"title":"Dropping the Gloves (2012).epub Gooner","uid":13694601,"size":4001584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e54e156e83c70610c8d59f35e0bb9e251da5b5c&amp;dn=Dropping+the+Gloves+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1456664121,"description":"Dropping the Gloves - Inside the Fiercely Combative World of Professional Hockey (2012).epub Gooner\r\n\r\nPublisher: McClelland &amp; Stewart; Reprint edition (29 Oct. 2013)\r\nLanguage: English\r\nISBN-10: 0771056966\r\nISBN-13: 978-0771056963\r\n\r\nDropping the Gloves candidly tracks Barry Melrose's career in hockey - a road that has not changed substantially for today's aspiring players. Not many have Melrose's credentials or his breadth of experience in professional hockey. He's played and coached in Junior Hockey, the American Hockey League, and the NHL. As he says, he's been hired and fired, and had his share of disappointments and failures. He's also had successes at every level. Now an ESPN broadcaster and one of the most respected NHL analysts on television. With his trademark hair, custom suits and energetic style, Melrose is applauded for offering fans his honest - tell it like it is opinion. \r\n    Written in Barry's voice and style, the narrative follows his career in hockey, from its start in Kelvington, Saskatchewan, through his years in Junior, the WHA, and finally, the NHL. Along the way, Barry muses on the state of the game, what makes some teams work and other fail, and how he worked to instill a winning attitude in all the teams he coached. \r\n     Filled with behind-the-scene stories of all the legendary players Barry played with or coached - Gretzky, Yzerman, Messier, Bobby Hull, and Brad Park - Dropping the Gloves is a true to life, insiders account of the world of professional hockey and an absolute must read for fans of the game","torrent":{"xt":"urn:btih:1e54e156e83c70610c8d59f35e0bb9e251da5b5c","amp;dn":"Dropping+the+Gloves+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e54e156e83c70610c8d59f35e0bb9e251da5b5c","infoHashBuffer":{"type":"Buffer","data":[30,84,225,86,232,60,112,97,12,141,89,243,94,11,185,226,81,218,91,92]},"announce":[],"urlList":[]}}