{"title":"Principles of Echocardiography and Intracardiac Ecocardiography ","uid":10574475,"size":57560840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1edc7902988e42f39c68d0ae5e0bcc3d193348e2&amp;dn=Principles+of+Echocardiography+and+Intracardiac+Ecocardiography+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tahir99","files":-1,"time":1405625100,"description":"Principles of Echocardiography and Intracardiac Echocardiography: Expert Consult - Online and Print, 1e (Principles of Cardiovascular Imaging)\n\nStuart J. Hutchison MD FRCPC FACC FAHA FASE FSCMR FSCCT (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nPublication Date: June 28, 2012 | ISBN-10: 1437704034 | ISBN-13: 978-1437704037 | Edition: 1\n\nPrinciples of Echocardiography and Intracardiac Echocardiography has everything you need to successfully obtain and interpret cardiac echo images. Stuart J. Hutchison-a premier cardiac diagnostic specialist-explains the dos and don'ts of echocardiography so that you get the best images and avoid artifacts. Get only the coverage you need with clinically-oriented, practical information presented in a consistent format that makes finding everything quick and easy. High-quality images, tables of useful values and settings, and access to the full text and more online at expertconsult.com make this the one echo handbook that has it all.\n\nFeatures access to the full text, an image library, and moving images online at expertconsult.com where you can browse, download, and learn from additional content.\n\nFocuses on clinically-oriented and practical information so that you get only the coverage that you need.\n\nPresents material in a consistent format that makes it easy for you find information.\n\nExplains how to obtain the best image quality and avoid artifacts through instructions on how to and how not to perform echocardiography.\n\nProvides excellent visual guidance through high-quality images-many in color-that reinforce the quality of information in the text.\n\nIncludes numerous tables with useful values and settings to help you master probe settings and measurements.\n\nYour purchase entitles you to access the web site until the next edition is published, or until the current edition is no longer offered for sale by Elsevier, whichever occurs first. Elsevier reserves the right to offer a suitable replacement product (such as a downloadable or CD-ROM-based electronic version) should access to the web site be discontinued.","torrent":{"xt":"urn:btih:1edc7902988e42f39c68d0ae5e0bcc3d193348e2","amp;dn":"Principles+of+Echocardiography+and+Intracardiac+Ecocardiography+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1edc7902988e42f39c68d0ae5e0bcc3d193348e2","infoHashBuffer":{"type":"Buffer","data":[30,220,121,2,152,142,66,243,156,104,208,174,94,11,204,61,25,51,72,226]},"announce":[],"urlList":[]}}