{"title":"Person of Interest - Season 3 - DVD","uid":9657768,"size":9787539946,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1eeae42f0001c109079fed965e86c25b3243b1f5&amp;dn=Person+of+Interest+-+Season+3+-+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"POtHS11","files":-1,"time":1393222920,"description":"Person of Interest - Season 3\n\n\n\n\nPerson of Interest - John Reese (Jim Caviezel): a former member of the U.S. Army Special Forces and later a CIA field officer who is presumed dead following a mission in China. Little is known about Reese's background and his name is one of several aliases he uses. He lost his lover, Jessica Arndt, prior to meeting Finch, which appears to have marked him deeply. Reese demonstrates skill in the use of a range of weapons, hand-to-hand combat, and surveillance tactics. He knows very little about Finch and often is rebuffed when he attempts to learn more about him.\n\nIn the beginning, John Reese, a former Green Beret and CIA field officer, is living as a vagrant in New York City after the death of the woman he loves, and is presumed dead. He is approached by Harold Finch, a reclusive billionaire software genius who is living under an assumed identity. Finch explains that after September 11, 2001, he built a computer system for the government that uses information gleaned from omnipresent surveillance to predict future terrorist attacks. However, Finch discovered that the computer was predicting ordinary crimes as well. The government is not interested in these results, but Finch is determined to stop the predicted crimes. He hires Reese to conduct surveillance and intervene as needed, using his repertoire of skills gained in the military and the CIA. Through a backdoor built into the system, Finch receives the Social Security number of someone who will be involved in an imminent crime, at which point he contacts Reese. Without knowing what the crime will be, when it will occur, or even if the person they were alerted to is a victim or perpetrator, Reese and Finch must try to stop the crime from occurring.\n\nThey are helped by NYPD detectives Lionel Fusco, a corrupt officer whom Reese coerces into helping them, and Joss Carter, who in early episodes investigates Reese for his vigilante activities. Although Reese arranges for Carter and Fusco to be partners in the NYPD early in the series, for the entirety of the show's first season, neither is aware that the other is also working with Finch and Reese. Periodically, the team also enlists the aid of Zoe Morgan, a professional &quot;fixer&quot; who applies her skills to particularly difficult tasks. The series features several subplots. One significant story arc involves &quot;HR&quot;, an organization of corrupt NYPD officers who are initially in league with budding mob boss Carl Elias and later with the Russian mafia; in earlier parts of this arc, Fusco is forced to go undercover. Another important storyline revolves around Root, a psychopathic hacker who is determined to gain access to the Machine. During season two, another organization of powerful business figures, Decima Technologies, is revealed to be attempting to gain access to the Machine. In season three, Reese and Finch come into contact with the hacking group Vigilance, as well as the addition of Agent Shaw, a former spy whose deceased partner got too close to finding out about &quot;Control&quot;, leading him and Shaw to be eliminated by &quot;Control&quot; (see below). After Shaw's &quot;death&quot; and her subsequent learning about The Machine in the season two finale, she joins Finch and Reese.\nThe Machine\n\nThe Machine is a mass surveillance computer system programmed to monitor and analyze data from surveillance cameras, electronic communications, and audio input throughout the world, built in two unoccupied floors at Ingram's company, IFT. From this data, the Machine accurately predicts violent acts. Under control of the U.S. government, its stated purpose is to foresee terrorist attacks, allowing the government to forestall terrorist activity. However, the Machine detects future violent acts of all kinds, not just terrorism. Originally unknown to Finch, his partner, Nathan Ingram, created a routine called &quot;Contingency&quot;, on the eve of the government handover, to access the non-relevant data. Ingram and Finch are seen accessing this program in the episode &quot;Zero Day&quot;. In the episode, Finch is appalled that Ingram has the data sent directly to him and shuts down the routine, reactivating it after Ingram's death. He presumably modified and updated the Contingency routine as well, as the Machine then begins to pass on the &quot;irrelevant&quot; non-terrorism data to him in the form of Social Security numbers, via coded messages over nearby public telephones.\n\nOver the course of each episode, the viewer periodically sees events as a Machine-generated on-screen display of data about a character or characters: identification, activities, records, and more may be displayed. The viewer also sees a Machine-generated perspective as it monitors New York. Commercial flights are outlined by green triangles, red concentric circles indicate no-fly zones around tall buildings such as Congress, and dashed boxes mark individual people. The Machine classifies the people it watches by color-coding the boxes: white for no threat or an irrelevant threat, red for perceived threats to the Machine, red-and-white for individuals predicted to be or currently violent, and yellow for people who know about the Machine, including Finch, Reese, Ingram, Corwin, and Root. The white-boxed &quot;irrelevant threat&quot; targets include the persons of interest that Reese and Finch assist.\n\nAs the series progresses, a wider governmental conspiracy emerges. Known as &quot;The Program&quot;, it revolves around the development and utilization of the Machine. It is apparently led by a mysterious figure known only as &quot;Control&quot;, an unnamed official who deploys teams of Intelligence Support Activity (ISA) operatives who are identified by the Machine using a blue box; classified as &quot;assets&quot;, they have no knowledge of the Machine, but work within its own parameters. They are used to eliminate perceived terrorist threats on the recommendation of a department known as &quot;Research&quot;. &quot;Control&quot; also used the team to eliminate key personnel who are aware of the Machine's existence.","torrent":{"xt":"urn:btih:1eeae42f0001c109079fed965e86c25b3243b1f5","amp;dn":"Person+of+Interest+-+Season+3+-+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eeae42f0001c109079fed965e86c25b3243b1f5","infoHashBuffer":{"type":"Buffer","data":[30,234,228,47,0,1,193,9,7,159,237,150,94,134,194,91,50,67,177,245]},"announce":[],"urlList":[]}}