{"title":"The Last Prospecting Guide You'll Ever Need by Bob Burg","uid":9720196,"size":2615872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f485a667a7334032ce8d617d700291d9771ccd4&amp;dn=The+Last+Prospecting+Guide+You%27ll+Ever+Need+by+Bob+Burg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"PirateBook","files":1,"time":1394221789,"description":"\nDo you have all of the prospects you need? Few of us do! Bob Burg has learned the secrets of effective prospecting, and now he offers his proven, time-tested techniques to you! In this powerful guide, he shows beginners and pros alike how to gather qualified candidates efficiently and painlessly. With the Only prospecting Guide You'll Ever Need by your side, you'll learn exactly how to cultivate all of the business prospects you could ever want. \n\nBob Burg's national bestseller, The Go-Giver has been heralded as a new business classic. It's been translated into 19 languages and has already soared past the 200,000 copies sold mark. His critically acclaimed book, Endless Referrals: Network Your Everyday Contacts Into Sales has also sold over 200,000 copies and continues to be used as a training manual for top sales organizations throughout the world. \n\nBob is an advocate, supporter and defender of the Free Enterprise system, believing that the amount of money one makes is directly proportional to how many people they serve and how well they serve them. Other previously published books include: The Art of Persuasion and It's Not About You.\n\nGenre: Non Fiction , Business","torrent":{"xt":"urn:btih:1f485a667a7334032ce8d617d700291d9771ccd4","amp;dn":"The+Last+Prospecting+Guide+You%27ll+Ever+Need+by+Bob+Burg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f485a667a7334032ce8d617d700291d9771ccd4","infoHashBuffer":{"type":"Buffer","data":[31,72,90,102,122,115,52,3,44,232,214,23,215,0,41,29,151,113,204,212]},"announce":[],"urlList":[]}}