{"title":"The Unknown Assassin Series - Allen Zadoff","uid":12009555,"size":5505103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f6826920bdc7b7d38fa0d5affa86e8a0dcbe7e7&amp;dn=The+Unknown+Assassin+Series+-+Allen+Zadoff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1434066099,"description":"01. Boy Nobody - Allen Zadoff\n\nimage\n\nThey needed the perfect assassin.\n\nBoy Nobody is the perennial new kid in school, the one few notice and nobody thinks much about. He shows up in a new high school in a new town under a new name, makes a few friends, and doesn't stay long. Just long enough for someone in his new friend's family to die -- of &quot;natural causes.&quot; Mission accomplished, Boy Nobody disappears, moving on to the next target.\n\nBut when he's assigned to the mayor of New York City, things change. The daughter is unlike anyone he has encountered before; the mayor reminds him of his father. And when memories and questions surface, his handlers at The Program are watching. Because somewhere deep inside, Boy Nobody is somebody: the kid he once was; the teen who wants normal things, like a real home and parents; a young man who wants out. And who just might want those things badly enough to sabotage The Program's mission.\n\nIn this action-packed series debut, author Allen Zadoff pens a page-turning thriller that is as thought-provoking as it is gripping, introducing an utterly original and unforgettable antihero.\n\n02. I Am The Mission - Allen Zadoff\n\nimage\n\nHe was the perfect assassin.\n\nBoy Nobody: No name. No past. No remorse. At least until he began to ask questions and challenge his orders -- until he fell in love with his target. Now The Program is worried that its valuable soldier has become a liability.\n\nBoy Nobody, haunted by the outcome of his last assignment, is given a new mission. A test of sorts. A chance to show his loyalty.\n\nHis objective: Take out Eugene Moore, the owner of a military training and indoctrination camp for teenagers. One target. Limited time frame. Public place. It sounds simple, but a previous operative couldn't do it. He lost the mission and is presumed dead. Boy Nobody is confident he can finish the job. Quickly.\n\nBut when things go awry, Boy Nobody finds himself lost in a mission where nothing is as it seems: not The Program, his allegiances, or the truth.\n\nThe riveting second book in The Unknown Assassin series by Allen Zadoff delivers heart-pounding action and thought-provoking characters, as well as a new, exotic setting; a new mission; and new secrets to be revealed.\n\n03. I Am The Traitor - Allen Zadoff\n\nimage\n\nThe Program has sent Boy Nobody on countless missions, instructed to kill whichever target he was given. But now, after going rogue, he is on his own mission to rescue his friend Howard, who was captured by The Program.\n\nBoy Nobody manages to free Howard as well as Tanya, a mysterious girl who was being held with him. Putting their skills to the test, Howard and Tanya help Boy Nobody collect information about his father, eventually revealing a dangerous secret that teaches Boy Nobody a valuable lesson -- he can't trust anyone.\n\nOn the run from The Program, Boy Nobody must face his past, as he's forced to decide where his loyalties lie.\n\nAllen Zadoff packs the final installment in the Unknown Assassin trilogy with even more action, higher stakes, and mind-blowing reveals that will leave readers riveted","torrent":{"xt":"urn:btih:1f6826920bdc7b7d38fa0d5affa86e8a0dcbe7e7","amp;dn":"The+Unknown+Assassin+Series+-+Allen+Zadoff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6826920bdc7b7d38fa0d5affa86e8a0dcbe7e7","infoHashBuffer":{"type":"Buffer","data":[31,104,38,146,11,220,123,125,56,250,13,90,255,168,110,138,13,203,231,231]},"announce":[],"urlList":[]}}