{"title":"David and Goliath: Underdogs, Misfits and the Art of Battling Gi","uid":9106302,"size":964393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fa79e3eec0f0753a4bc12563b739eedb56d48f1&amp;dn=David+and+Goliath%3A+Underdogs%2C+Misfits+and+the+Art+of+Battling+Gi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bookzilla","files":1,"time":1382883585,"description":"David and Goliath: Underdogs, Misfits and the Art of Battling Giants\n\nMalcolm Gladwell, the #1 bestselling author of The Tipping Point, Blink, Outliers, and What the Dog Saw, offers his most provocative---and dazzling---book yet.\n\n Three thousand years ago on a battlefield in ancient Palestine, a shepherd boy felled a mighty warrior with nothing more than a stone and a sling, and ever since then the names of David and Goliath have stood for battles between underdogs and giants. David's victory was improbable and miraculous. He shouldn't have won.\n\n Or should he have?\n\n In David and Goliath, Malcolm Gladwell challenges how we think about obstacles and disadvantages, offering a new interpretation of what it means to be discriminated against, or cope with a disability, or lose a parent, or attend a mediocre school, or suffer from any number of other apparent setbacks.\n\n Gladwell begins with the real story of what happened between the giant and the shepherd boy those many years ago. From there, David and Goliath examines Northern Ireland's Troubles, the minds of cancer researchers and civil rights leaders, murder and the high costs of revenge, and the dynamics of successful and unsuccessful classrooms---all to demonstrate how much of what is beautiful and important in the world arises from what looks like suffering and adversity.\n\n2013 epub","torrent":{"xt":"urn:btih:1fa79e3eec0f0753a4bc12563b739eedb56d48f1","amp;dn":"David+and+Goliath%3A+Underdogs%2C+Misfits+and+the+Art+of+Battling+Gi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fa79e3eec0f0753a4bc12563b739eedb56d48f1","infoHashBuffer":{"type":"Buffer","data":[31,167,158,62,236,15,7,83,164,188,18,86,59,115,158,237,181,109,72,241]},"announce":[],"urlList":[]}}