{"title":"Loopmasters - Minimal Tech Vox 3 (WAV)","uid":6851097,"size":301114536,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1fe79e9b648bd5ae0059c71d7a0b665a0ba00d73&amp;dn=Loopmasters+-+Minimal+Tech+Vox+3+%28WAV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"War10ck578","files":1,"time":1322525912,"description":"Minimal Tech Vox 3, contains a huge 550Mb of content featuring over 725 24 bit samples, with 150 loops at 128 Bpm, and 575 Single Hit Vocal samples. You also get 8 ready to play vocal patches for Reason NNXT, Halion, Kontakt, EXS and SFZ compatible Soft Samplers. Apple Loops and Reason Refill versions are available, the latter with 10 Kong patches.\n\nDescription:\nLoopmasters are proud to present the next instalment to our best selling Minimal Tech Vox sample series - a fantastic collection of snipped, glitched, processed and tweaked minimal vocal samples, produced specifically for the dance music producer.\n\nWhether you are making Tech, Electro, Deep or Mainroom Dance Music - these samples recorded by pro session singers have been mangled, chopped and edited to provide you with the building blocks for some awesome grooves.\n\nMinimal Tech Vox 2 features a killer selection of one word single shot samples, glitched vox sounds, , vox stabs, Fx Processed Loops, vocal hooks and re-sequenced parts which together form a formidable collection of samples for any producer looking to introduce the human element to loops and sections of their productions.\n\nAdd FX, re-program, chop, cut and paste to form entirely new dynamics and reprocess the parts infinitely and on the fly to form new combinations which will add dynamics and interest to your productions!\n\nIn detail Minimal Tech Voices includes 150 Vocal Grooves, 78 One Shot Vox, 147 Phrases, 50 Vocal FX and no less than 300 Processed Vocal Glitches.\n\n","torrent":{"xt":"urn:btih:1fe79e9b648bd5ae0059c71d7a0b665a0ba00d73","amp;dn":"Loopmasters+-+Minimal+Tech+Vox+3+%28WAV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fe79e9b648bd5ae0059c71d7a0b665a0ba00d73","infoHashBuffer":{"type":"Buffer","data":[31,231,158,155,100,139,213,174,0,89,199,29,122,11,102,90,11,160,13,115]},"announce":[],"urlList":[]}}