{"title":"The Twilight Zone  -  The Complete Collector's Edition","uid":6716777,"size":46144807412,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2051fb86928ec10ab45c1ea6b5861ebca87444ac&amp;dn=The+Twilight+Zone++-++The+Complete+Collector%5C%27s+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":8,"uploader":"rosie1966","files":159,"time":1317588047,"description":"The Twilight Zone is an American anthology television series created by Rod Serling, which ran for five seasons on CBS from 1959 to 1964. The series consisted of unrelated episodes depicting paranormal, futuristic, dystopian, or simply disturbing events; each show typically featured a surprising plot twist and was usually brought to closure with some sort of message. The series was also notable for featuring both established stars (e.g., Cliff Robertson, Ann Blyth, Jack Klugman) and younger actors who would later became famous (e.g., Robert Redford, William Shatner, Burt Reynolds, Mariette Hartley, Shelley Fabares). Rod Serling served as executive producer and head writer; he wrote or co-wrote 92 of the show's 156 episodes. He was also the show's host, delivering on- or off-screen monologues at the beginning and end of each episode. During the first season, except for the season's final episode, Serling's narrations were off-camera voiceovers; he only appeared on-camera at the end of each show to promote the next episode (footage that was removed from syndicated versions but restored for DVD release, although some of these promotions exist today only in audio format).\n\nThe &quot;twilight zone&quot; itself is not presented as being a tangible plane, but rather a metaphor for the strange circumstances befalling the protagonists. Serling's opening and closing narrations usually summarized the episode's events in tones ranging from cryptic to pithy to eloquent to unsympathetic, encapsulating how and why the main character(s) had &quot;entered the Twilight Zone&quot;.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2051fb86928ec10ab45c1ea6b5861ebca87444ac","amp;dn":"The+Twilight+Zone++-++The+Complete+Collector%5C%27s+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2051fb86928ec10ab45c1ea6b5861ebca87444ac","infoHashBuffer":{"type":"Buffer","data":[32,81,251,134,146,142,193,10,180,92,30,166,181,134,30,188,168,116,68,172]},"announce":[],"urlList":[]}}