{"title":"Angel Sword V1.0.0 Android","uid":12278389,"size":360119242,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:205a8bb675601c9c7323d0436284b562e2a5c961&amp;dn=Angel+Sword+V1.0.0+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":".BONE.","files":1,"time":1440383482,"description":"Prepare to adventure in the most epic full scale multiplayer 3D RPG for mobile! Experience amazing detailed graphics in full HD. The battle of immortals has begun. Choose your side.\n\nFEATURES:\nChoose single or multiplayer mode. Team up with a friend and experience co-op multiplayer. Tag team creatures and fight alongside each other while solving quests or PvP duel to the death\n100% open world. Complete free roaming. Go anywhere at anytime. Full 3D freedom of movement including 360 degree swimming and flight. Fight on land or battle in the air\nFully customize your character in with unique detail\nOwn pets that fight by your side in battle\nA variety of weapons, armor and items to choose from\nDetailed side quests and challenging bosses to defeat\nAdvanced combat system featuring deadly melee combos, multiple ranged weapons and powerful magic attacks\nReal day and night. true in-game cycle of night and day on a 24 hour based time system. For every 24 minutes that the game is played, a full night and day cycle of 24 hours passes in the game world\nAdvanced weather systems including heavy rainfall, snow, thunder and lighting\nBalanced economy system. Visit shops. Buy and sell items\nCustomizable hot keys. Arrange skills in any order\n3 slots for multiple saved games and multiple characters\nMultiple language support: English, French, German, Spanish, Russian, Portuguese, Japanese, Simplified Chinese, Korean\nRequired Android O/S : 4.3+","torrent":{"xt":"urn:btih:205a8bb675601c9c7323d0436284b562e2a5c961","amp;dn":"Angel+Sword+V1.0.0+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205a8bb675601c9c7323d0436284b562e2a5c961","infoHashBuffer":{"type":"Buffer","data":[32,90,139,182,117,96,28,156,115,35,208,67,98,132,181,98,226,165,201,97]},"announce":[],"urlList":[]}}