{"title":"HBO - Paradise Lost, The Child Murders At Robin Hood Hills + Rev","uid":5181589,"size":1473755214,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:205c9523c50211dbff8181d37f26b002df19ea2f&amp;dn=HBO+-+Paradise+Lost%2C+The+Child+Murders+At+Robin+Hood+Hills+%2B+Rev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Jazzdancer","files":-1,"time":1259266783,"description":"On May 6, 1993, the mutilated bodies of three 8-year-old boys were found in a shallow creek in West Memphis, Arkansas. A short time later police arrested three local teenagers, linking the boys' killings to a satanic ritual. One of the boys confessed. The intriguing court case was about to unfold as filmmakers Joe Berlinger and Bruce Sinofsky ventured forth to make this documentary. They captured footage of not only courtroom proceedings but also interviews with the major players in trial--parents, suspects, lawyers. The documentary filmmakers, whose previous film, Brother's Keeper, is as intriguing of a crime story you'll ever see, tells this story without re-creations or flashbacks.\n\nThe film makes a clear argument that the court trial may not be about witchcraft but a witch hunt. As with any great drama, the faces and situations are etched upon the viewer; however, we are dealing with real lives and real crimes (told gruesomely and necessarily by police photographs and videotape), and the impact is far greater. And so is the maddening ambivalence of the trial. Like the O.J. Simpson fiasco, a verdict is reached but the truth is questioned. Did police make fatal errors the night of the crime? Do last-minute clues lead to justice? Who's lying on the stand? As with Roger and Me and Hoop Dreams, we have a provocative single incident that holds a mirror to many of society's problems. The results are just more horrifying. The Emmy-winning film was followed four years later by Paradise Lost 2: Revelations\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nMAY BE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Getting The Message Out, Openly!\n* Please Keep Seeded To Pass On The Message!!!\n","torrent":{"xt":"urn:btih:205c9523c50211dbff8181d37f26b002df19ea2f","amp;dn":"HBO+-+Paradise+Lost%2C+The+Child+Murders+At+Robin+Hood+Hills+%2B+Rev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205c9523c50211dbff8181d37f26b002df19ea2f","infoHashBuffer":{"type":"Buffer","data":[32,92,149,35,197,2,17,219,255,129,129,211,127,38,176,2,223,25,234,47]},"announce":[],"urlList":[]}}