{"title":"Saint Peter: Flawed, Forgiven, and Faithful - Walking with Peter","uid":15617597,"size":14406390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2096ccf9e0ae9705886bb4da127cd1ca4bc846c7&amp;dn=Saint+Peter%3A+Flawed%2C+Forgiven%2C+and+Faithful+-+Walking+with+Peter&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"catholicstuff","files":4,"time":1471845018,"description":"Saint Peter: Flawed, Forgiven, and Faithful - Walking with Peter from Galilee to Rome (EPUB, MOBI, PDF)\r\n\r\nIf St. Peter had moved in business or political circles, he would have been forgotten millennia ago. In most areas of life, those who make major mistakes are cast out, left to languish in their failure. But Peter, who made more than one major mistake while following Jesus, has been highly revered within the Church since the days when Jesus walked with the disciples. In fact, in holding Peter up so high, we can easily miss the essential lesson his life teaches us: that when flawed people experience forgiveness through Jesus, they are freed and empowered to be faithful followers of Christ.\r\n\r\nIn Saint Peter: Flawed, Forgiven, and Faithful, biblical scholar Stephen Binz takes readers on a pilgrimage from Galilee to Rome—from the spot where Peter first dropped his nets to follow Jesus to the place where he gave his life out of love for his Lord. Through sound scholarship, first-hand experiences at places of pilgrimage, and spiritual reflection, Binz helps us embrace the reality that God works through broken human beings to accomplish truly beautiful things.\r\n\r\nUltimately, Saint Peter: Flawed, Forgiven, and Faithful reminds us that the papacy—from Peter to the present day—has always been filled by imperfect people and, mysteriously and wonderfully, that’s exactly the type of person through whom God advances the Church!\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:2096ccf9e0ae9705886bb4da127cd1ca4bc846c7","amp;dn":"Saint+Peter%3A+Flawed%2C+Forgiven%2C+and+Faithful+-+Walking+with+Peter","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2096ccf9e0ae9705886bb4da127cd1ca4bc846c7","infoHashBuffer":{"type":"Buffer","data":[32,150,204,249,224,174,151,5,136,107,180,218,18,124,209,202,75,200,70,199]},"announce":[],"urlList":[]}}