{"title":"Finders Keepers audiobook by Stephen King EarReaders","uid":13208476,"size":445870603,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:20bec5923ec9aac5d698edf3f718d26db28c52aa&amp;dn=Finders+Keepers+audiobook+by+Stephen+King+EarReaders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"jsk123","files":2,"time":1452620482,"description":"Written by Stephen King \r\nRead by Will Patton \r\nFormat: MP3 \r\nBitrate: 64 Kbps \r\nUnabridged \r\n\r\nA masterful, intensely suspenseful novel about a reader whose obsession with a reclusive writer goes far too far - a book about the power of storytelling, starring the same trio of unlikely and winning heroes King introduced in Mr. Mercedes.\r\n&quot;Wake up, genius.&quot; So begins King's instantly riveting story about a vengeful reader. The genius is John Rothstein, an iconic author who created a famous character, Jimmy Gold, but who hasn't published a book for decades. Morris Bellamy is livid, not just because Rothstein has stopped providing books but because the nonconformist Jimmy Gold has sold out for a career in advertising. Morris kills Rothstein and empties his safe of cash, yes, but the real treasure is a trove of notebooks containing at least one more Gold novel.\r\nMorris hides the money and the notebooks, and then he is locked away for another crime. Decades later a boy named Pete Saubers finds the treasure, and now it is Pete and his family that Bill Hodges, Holly Gibney, and Jerome Robinson must rescue from the ever-more deranged and vengeful Morris when he's released from prison after 35 years.\r\nNot since Misery has King played with the notion of a reader whose obsession with a writer gets dangerous. Finders Keepers is spectacular, heart-pounding suspense, but it is also King writing about how literature shapes a life - for good, for bad, forever.\r\n\r\nLength: 13 hrs and 5 mins \r\nSeries: Bill Hodges Trilogy, Book 2\r\nUnabridged Audiobook\r\nRelease Date:06-02-15","torrent":{"xt":"urn:btih:20bec5923ec9aac5d698edf3f718d26db28c52aa","amp;dn":"Finders+Keepers+audiobook+by+Stephen+King+EarReaders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20bec5923ec9aac5d698edf3f718d26db28c52aa","infoHashBuffer":{"type":"Buffer","data":[32,190,197,146,62,201,170,197,214,152,237,243,247,24,210,109,178,140,82,170]},"announce":[],"urlList":[]}}