{"title":"Pirates of the Caribbean 1 (nl subs) Nlt Release By Zero Yuy","uid":4801405,"size":1694660554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:215ba93a300e224c3726c9ed9607c56ad2edfba4&amp;dn=Pirates+of+the+Caribbean+1+%28nl+subs%29+Nlt+Release+By+Zero+Yuy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"zeroyuy","files":-1,"time":1238053737,"description":"Plot summary for\nPirates of the Caribbean: The Curse of the Black Pearl (2003)\n\nThis swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made. Written by the lexster\n\nWhen Captain Barbossa sends his pirate crew to kidnap Elizabeth Swan and the last remaining piece of Aztec gold. A blacksmith called Will Turner joins a recently captured pirate named Jack Sparrow and goes off searching for Elizabeth. It's isn't until they all meet up, that they discover the real terrifying truth behind the Aztec gold, and why they need Will Turner and not Elizabeth Swan. Written by Film_Fan\n\nPirates of the Caribbean is a sweeping action-adventure story set in an era when villainous pirates scavenged the Caribbean seas. This roller coaster tale teams a young man, Will Turner, with an unlikely ally in rogue pirate Jack Sparrow. Together, they must battle a band of the world's most treacherous pirates, led by the cursed Captain Barbossa, in order to save Elizabeth, the love of Will's life, as well as recover the lost treasure that Jack seeks. Against improbable odds, they race towards a climactic confrontation on the mysterious Isla de Muerta. Clashing their swords in fierce mortal combat, Will and Jack attempt to recapture The Black Pearl ship, save the British navy, and relinquish a fortune in forbidden treasure thereby lifting the curse of the Pirates of the Caribbean. Written by Anonymous\n\nAfter Elizabeth Swann is kidnapped by the evil Captain Barbossa and his crew, the blacksmith Will Turner and the pirate Jack Sparrow, who used to be captain of Barbossa's ship, team up to rescue Ms. Swann. But they soon discover that the pirates have their own secret, sinister purpose with Ms. Swann, and that there's much more going on that a simple kidnapping. Written by moviefreak_4\n\nContainer: AVI\nCodec: Xvid\nAudio Codec: Mp3\nLanguage: English\nSubtitle: Dutch (hardcoded)\n\nBrought to you by Nlt Release @ &lt;a href=&quot;\nhttp://nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nlt.ons-forum.nl&lt;/a&gt;\n","torrent":{"xt":"urn:btih:215ba93a300e224c3726c9ed9607c56ad2edfba4","amp;dn":"Pirates+of+the+Caribbean+1+%28nl+subs%29+Nlt+Release+By+Zero+Yuy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"215ba93a300e224c3726c9ed9607c56ad2edfba4","infoHashBuffer":{"type":"Buffer","data":[33,91,169,58,48,14,34,76,55,38,201,237,150,7,197,106,210,237,251,164]},"announce":[],"urlList":[]}}