{"title":"The Acme Novelty Library (Restored)","uid":7588673,"size":984912550,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:219569607255b91824b85baf926df30a9a78b0dd&amp;dn=The+Acme+Novelty+Library+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346479991,"description":"Issues 1-18.5 of 'The Acme Novelty Library'\n\nFantagraphics Books, Self-Published, Drawn and Quarterly, 1993-2007\n\nBy Chris Ware\n\nIssues 19-20 have been released but I do not yet have scans of them.\n\n------------------------------------------------------------------------------\n\nGoing by the way these books were scanned there is 818 pages, images or files - whichever way you want to look at it is fine. All 818 of these pages have been lovingly and painstakingly 'Restored'. The color in these books is beautiful and deserved to be treated that way. As such, each page was individually 'Leveled' (often making a dramatically positive difference), then checked for Sharpness and Contrast (if the changes made the page look better - they were left, if not - they were removed). Next, all of the b&amp;w pages received the 'Underground' restoration settings. Lastly, every page was re-sized so that it can be clicked two to three times past full-screen within the comic book reader (this is important because many of the pages have a lot of very small text). To me, the difference from old to new is stunning. For you I hope it's unnoticeable. And I hope you enjoy.\n\n------------------------------------------------------------------------------\n\nAcme Novelty Library is a comic book series created by Chicago cartoonist Chris Ware. Its first issue appeared in 1993. Published from 1994 by Fantagraphics Books and later self-published, it is considered a significant work in alternative comics, selling over 20,000 copies per issue.\n\nThe series has been widely recognized in the industry. It won the Harvey Award for Best New Series of 1995, Best Continuing or Limited Series of 2000, and Best Continuing Series of 2001. Issues 7 and 13 won the Harvey Award for Best Single Issue or Story of 1997 and 2000, respectively. Furthermore, Acme Novelty Library won the Harvey Special Award for Excellence in Presentation every year from 1995 to 1999, followed by wins in the same category for issue 13 in 2000, Jimmy Corrigan in 2001, and the Acme Novelty Datebook in 2004.\n\nAcme Novelty Library also won the Eisner Award for Best Continuing Series of 1996 and 2000; Best New Graphic Album of 2000 (issue 13); and Best Publication Design of 1995, 1996, 1997 (issue 7), and 2002 (issue 15). Also, an Acme Novelty Library display stand won the Eisner Award for Best Comics-Related Product of 1998.\n\nThe series also won Ignatz Awards for Outstanding Series of 1997, 1998; Outstanding Comic of 1998 (issue 9) and 2000 (issue 13); and Outstanding Story of 2000 (Jimmy Corrigan).\n\nOther awards won by Acme Novelty Library include Good Taste Awards for Best New Series of 1994; Best Continuing Series of 1995, 1996 (issue 7), 1997, 1999 (issues 11 to 13), and 2000; Best Single Issue of 1996 (issue 7), 1999 (issue 13), and 2000; Best Ongoing Serialized Story of 1999 (Jimmy Corrigan); and Best Production Design of 1998, 1999, and 2000.\n\nRead more about The Acme Novelty Library right here...\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Acme_Novelty_Library&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Acme_Novelty_Library&lt;/a&gt;","torrent":{"xt":"urn:btih:219569607255b91824b85baf926df30a9a78b0dd","amp;dn":"The+Acme+Novelty+Library+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219569607255b91824b85baf926df30a9a78b0dd","infoHashBuffer":{"type":"Buffer","data":[33,149,105,96,114,85,185,24,36,184,91,175,146,109,243,10,154,120,176,221]},"announce":[],"urlList":[]}}