{"title":"POtHS - Conspiracy - 051 - GeoEngineering and SHADE the Motion P","uid":10325406,"size":6845756276,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21a1847c4f0e0f9987370676afeed0cbadcde9c8&amp;dn=POtHS+-+Conspiracy+-+051+-+GeoEngineering+and+SHADE+the+Motion+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"POtHS11","files":102,"time":1402352799,"description":"\nVote a &quot;LIKE&quot; for Little NEO here:\n\nHe is in 3rd place right now, lets get him into 1st place.\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\nand here\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\n\nHelp them Produce their New Album Here:\n &lt;a href=&quot;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&lt;/a&gt;\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 051 - GeoEngineering and SHADE the Motion Picture\n\n\n\n\nDescription:\n\nSHADE the Motion Picture:\nThis download contains very disturbing evidence about the world-wide agenda to geo-engineer our planet which is intentionally poisoning the population.  The facts are empirically validated and well-documented.  The only remaining question is why?\n\nShade exposes the true power structure embedded in our global reality, showing the real controllers and their plans to Geo-engineer our planet and control the populace.\n\nEx-military Whistleblower Blows the Lid on Chemtrail Conspiracy:\nKristen Meghan, former Air Force Bio-Environmental Engineer, gave a ground breaking presentation of what she had discovered about Chemtrails while serving her Country. This BRAVE young lady has put her livelihood / life on the line for presentation was produced, filmed and edited by John F. Meghan.\n-----------------------------------------------------------------------------------------------------------------\n\nChemtrails, Geoengineering, Solar Radiation Management and Weather Modification:\nLearn more at http://geoengineeringwatch.org\n-----------------------------------------------------------------------------------------------------------------\n\nScientific Proof of ChemTrail Composition or Payload:\nACHTUNG ATTENTION!  ChemTrail seminar documentary by Sofia Smallstorm.  This Video Explains What a ChemTrail is - the why, what, who, when and where. Scientific Proof that ChemTrails are BAD for all Living things on this earth! Get a hot beverage and hunker down to WATCH this entire Video and then Watch it again! Be sure to SHARE it with EVERYONE you know that's interested in ChemTrails or wants to learn more!\n\nChemTrails are being Sprayed OVER your home! Get involved in what is getting Sprayed Right on YOU, your friends and loved ones! Contact your State Governor and Senators through their Websites. We need MORE people to record whats Going on Above your Heads! How about you? Look Up People! Get involved in what is getting DUMMPED in the SKY, Video Whats going on, Create your OWN YouTube Channel and UPLOAD and make Public what they are doing to us! Also I encourage Everyone to search for and WATCH the Documentary &quot; What In the World Are they Spraying? &quot; It has SCIENTIFIC FACTS and many statements from REAL SCIENTISTS with PhD's that will TELL you that ChemTrails ARE REAL and that they are DANGEROUS and BAD for Humans, Animals Plants and Trees!\n-----------------------------------------------------------------------------------------------------------------\n\nSkywatcher - The Incredible True Story Of Artificial Clouds And Weather Modification:\nWEATHER MODIFICATION CAUSES CLIMATE MODIFICATION. Climatologists vastly underestimate the amount of deliberate weather modification programs, erroneously believing them to be occasional &quot;experiments,&quot; and unaware that THOUSANDS of planned weather modification events occur every year in the U.S. and worldwide. So let's get our facts straight: Weather modification programs are not isolated, low-altitude events; they are prolific, ongoing high-altitude programs in an industry that has been growing since the 1960s. It is NOT solar radiation management (SRM) that we are witnessing when we see &quot;chemtrails&quot; and artificial clouds created by aircraft; it is PRECIPITATION ENHANCEMENT, designed to thicken clouds to produce more rain and snow through cloud seeding. (But we cannot change the weather significantly without changing the &quot;climate&quot; too. Climate Change = weather change over time.)\n\nCONTRAILS persist and form clouds when enough cloud-condensation nuclei (CCN) are present at the right altitude. Most people are unaware that CCNs are deliberately dispersed via cloud-seeding flares ABOVE AND IN FRONT OF incoming storm clouds, regularly, in most developed counties and in at least 68 US counties. The flares are burned right at the altitude where contrails are formed, ~20,000 feet (cloud seeding pilots interviewed stated 5,000 to 40,000 feet, most commonly 16-22,000 feet.) Contrails do not usually form at low altitudes or very high altitudes, and they almost always have a starting and stopping point-- the range in which sufficiently abundant CCNs are present. This range is also where aircraft accelerate the most as they climb to cruising altitude, creating the most water vapor. The vapor instantly freezes to form ice crystals which expand in the low-pressure environment and bond with other CCNs present, which can form thick clouds and sometimes even create total cloud cover IN FRONT OF STORMS-- before the storm clouds even arrive. This effect causes the formation of artificial clouds in perfectly blue skies, and the appearance that jet aircraft are &quot;spraying something&quot; when, actually, they are spraying super-heated water vapor, which becomes expanding frozen water particles. The invisible, cloud nuclei containing metallic aerosols were dispersed previously, bonding with the ice crystals and thus facilitating the cloud formation process. In other words, SMALL AIRCRAFT disperse cloud seeding material into the sky, and then LARGE JETS pass through it, and their condensation vapor (C02 + H2O) bonds with with those materials to form the thick, persistent contrails. (See the time-lapse sequences starting halfway through the video.) *** FACT: Cloud seeding flares contain metallic aerosols known to be toxic to humans, including silver iodide, aluminum, strontium, and magnesium. These aerosols do not simply &quot;fall&quot;... the invisible clouds of CCNs expand and go WHEREVER THE WIND GOES before eventually bonding with ice crystals or drifting slowly down into our soil, water, and lungs. . . .\n\nThis video shows exactly HOW we make clouds with aircraft, why the jet contrails persist now (when they used to disappear much more quickly), and why we're finding high levels of metals in our water and soil, including aluminum and strontium. ...you sure you want the truth? [See http://www.ArtificialClouds.com for documentation related to this video.]\n------------------------------------------------------------------------------------------------------------------\n\nOther featured videos included in this download...\nNASA Expert says Chemtrails are Real and Rogue Geoengineers Could Blackmail the Earth\nEx-military Whistleblower Blows The Lid Off The Chemtrail Conspiracy\nFracking Facts with Geologists Ingraffea and Wahl\nCar Runs For 100 Years Without Refueling - The Thorium Car\nThe Conspiracy To Mutate And Attack The Biology Of Humanity\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:21a1847c4f0e0f9987370676afeed0cbadcde9c8","amp;dn":"POtHS+-+Conspiracy+-+051+-+GeoEngineering+and+SHADE+the+Motion+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21a1847c4f0e0f9987370676afeed0cbadcde9c8","infoHashBuffer":{"type":"Buffer","data":[33,161,132,124,79,14,15,153,135,55,6,118,175,238,208,203,173,205,233,200]},"announce":[],"urlList":[]}}