{"title":"Isochronic Tones - Achieve Different States of Mind","uid":7090001,"size":3124978122,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:21b30a2689d0790340eb525e9b3a80508ac12d0f&amp;dn=Isochronic+Tones+-+Achieve+Different+States+of+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"FuryHero","files":99,"time":1331336918,"description":"These are all the isochronic tones from http://iso-tones.com\n\nISOCHRONIC TONES ARE SPECIALLY GENERATED SOUNDS, DESIGNED TO ALTER YOUR BRAINWAVES - BRINGING ABOUT DIFFERENT STATES OF MIND, SUCH AS HAPPINESS, CREATIVITY, OR RELAXATION. THEY'RE PERFECTLY SAFE, NON-ADDICTIVE, AND CAN BE USED AS OFTEN AS YOU LIKE. HEADPHONES ARE NOT REQUIRED.\n\nRecreational Tones\n\nThese recreational tones are designed to provide an enjoyable user-experience. Consider each specially-crafted tone as a mini-vacation, perfect for unwinding after a long day at work, relaxing outside on a sunny day or journeying to new states of consciousness. For best results choose an environment that will be free of distractions both during and immediately after the tones. Breathing exercises, meditation and yoga are all great ways to precede a session, they will help with the relaxation and detached awareness that will promote a better entrainment experience.\n\nSpiritual Tones\n\nThese spiritual tones are carefully designed to help you with meditation, chakra work and aid in other spiritual practices.\n\nLucid Dreaming Tones\n\nLucid dreaming sessions are primarily designed for use in conjunction with the &quot;Wake Back to Bed&quot; technique. They are not designed to be played repeatedly throughout the night.\n\nMiscellaneous Tones\n\nHere you can find tones that do not fit into any of the other three categories. This section includes sessions designed to help with sleep, alertness, mental performance, pain relief and much more.\n\nDISCLAIMER: DO NOT USE ANY OF THESE TONES WHILE DRIVING OR OPERATING HEAVY MACHINERY. I AM NOT RESPONSIBLE FOR ANY SIDE-EFFECTS CAUSED BY THE USE OF THESE TONES. THEY ARE INTENDED FOR RESEARCH PURPOSES ONLY AND YOU ARE ASSUMING THE RISK IF YOU CHOOSE TO LISTEN TO THEM. THE TONES ON THIS WEBSITE ALTER YOUR BRAINWAVES AND THE SHORT- AND LONG-TERM EFFECTS OF THIS ARE STILL NOT COMPLETELY UNDERSTOOD. THESE TONES SHOULD NOT BE USED IN A SETTING WHERE THEY WILL AFFECT ANYONE UNDER THE AGE OF 18 YEARS OLD/BY DOWNLOADING AND/OR LISTENING THEM YOU AGREE THAT YOU ARE 18 YEARS OF AGE OR OLDER. THE END-USER TAKES FULL RESPONSIBILITY FOR ANY EFFECTS EXPERIENCED FROM THE TONES.","torrent":{"xt":"urn:btih:21b30a2689d0790340eb525e9b3a80508ac12d0f","amp;dn":"Isochronic+Tones+-+Achieve+Different+States+of+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b30a2689d0790340eb525e9b3a80508ac12d0f","infoHashBuffer":{"type":"Buffer","data":[33,179,10,38,137,208,121,3,64,235,82,94,155,58,128,80,138,193,45,15]},"announce":[],"urlList":[]}}