{"title":"Surviving the Swastika: Scientific Research in Nazi Germany","uid":11822500,"size":25414439,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21faacb233c37045c24c7a1b16695983eb7fc57d&amp;dn=Surviving+the+Swastika%3A+Scientific+Research+in+Nazi+Germany&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429325211,"description":"Surviving the Swastika examines scientific research under National Socialism through the prism of the Kaiser Wilhelm Society for the Advancement of the Sciences, a semi-private umbrella organization which founded and maintained institutes for basic scientific research. Home to over twenty Nobel-prize winning scientists, the prestigious forerunner of the Max Planck Society was at the forefront of scientific advance in the first half of the twentieth century. Surprisingly, the Society not only survived National Socialism, but often thrived. Kristie Macrakis provides a full-scale analysis of the Society's development within the context of the phases of a polycratic National Socialist state. A spectrum of responses to National Socialism existed there from moral probity to accommodation and opportunism. Macrakis uncovers this differentiated scientific and social landscape by covering topics ranging from Max Planck's failed negotiations with recalcitrant government officials regarding the expulsion of Jews and Communists to his success in securing a thriving community for basic biological research in Berlin-Dahlem, from the practice of nuclear power research to institutional growth","torrent":{"xt":"urn:btih:21faacb233c37045c24c7a1b16695983eb7fc57d","amp;dn":"Surviving+the+Swastika%3A+Scientific+Research+in+Nazi+Germany","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21faacb233c37045c24c7a1b16695983eb7fc57d","infoHashBuffer":{"type":"Buffer","data":[33,250,172,178,51,195,112,69,194,76,122,27,22,105,89,131,235,127,197,125]},"announce":[],"urlList":[]}}