{"title":"The Lost Child of Philomena Lee - Martin Sixsmith.epub","uid":9336985,"size":1194591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:231df14c615228513eae795590693e928e6aa2e4&amp;dn=The+Lost+Child+of+Philomena+Lee+-+Martin+Sixsmith.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386870043,"description":" When she fell pregnant as a teenager in Ireland in 1952, Philomena Lee was sent to the convent of Roscrea, Co. Limerick, to be looked after as a 'fallen woman' and at the age of three her baby was whisked away and 'sold' to America for adoption. Coerced into signing a document promising 'Never to Seek to Know' what the Church did with him, she never saw him again. She would spend the next fifty years searching for her son, unaware that he spent his life searching for her.\n\nPhilomena's son, renamed Michael Hess, grew up to be a top lawyer and then a Republican politician in the first Bush administration. But he was also gay and in 1980s Washington being out and proud was not an option. He not only had to conceal not only his sexuality, but, eventually, the fact that he had AIDs. With little time left, he returned to Ireland and the convent in which he was born to plead with the nuns to tell him who his mother was, so that he might see her before he died. They refused.\n\n&quot;The Lost Child of Philomena Lee&quot; is the story of a mother and a son, whose lives were blighted by the forces of hypocrisy on both sides of the Atlantic and of the secrets they were forced to keep. A compelling narrative of human love and loss, Martin Sixsmith's moving account is both heartbreaking yet ultimately redemptive. ","torrent":{"xt":"urn:btih:231df14c615228513eae795590693e928e6aa2e4","amp;dn":"The+Lost+Child+of+Philomena+Lee+-+Martin+Sixsmith.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"231df14c615228513eae795590693e928e6aa2e4","infoHashBuffer":{"type":"Buffer","data":[35,29,241,76,97,82,40,81,62,174,121,85,144,105,62,146,142,106,162,228]},"announce":[],"urlList":[]}}