{"title":"CRC Handbook of Medicinal Spices 1st Edition","uid":7183964,"size":4469846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:231e39d9c2ea53a63b08a092fba04a7d18e5f003&amp;dn=CRC+Handbook+of+Medicinal+Spices+1st+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"fr09n","files":-1,"time":1334362834,"description":"Book Description\nPublication Date: September 27, 2002 | ISBN-10: 0849312795 | ISBN-13: 978-0849312793 | Edition: 1\n\n&quot;Let food be your medicine, medicine your food.&quot;\n-Hippocrates, 2400 B.C.\n\nWhen the &quot;Father of Medicine&quot; uttered those famous words, spices were as important for medicine, embalming, preserving food, and masking bad odors as they were for more mundane culinary matters. Author James A. Duke predicts that spices such as capsicum, cinnamon, garlic, ginger, onion, and turmeric will assume relatively more medicinal importance again, as the economic costs and knowledge of the side-effects of prescription pharmaceuticals increase. After all, each spice contains thousands of useful phytochemicals. Pharmaceuticals usually contain only one or two.\n\nDiscover the Science behind the Folklore\n\nSpices are important medicines that have withstood the empirical tests of millennia. Nearly 5,000 years ago Charak, the father of Ayurvedic medicine, claimed that garlic lightens the blood, reduces tumors, and is an aphrodisiac tonic. Today scientists say it thins the blood, prevents cancer, and increases libido. For centuries people worldwide have used spices to cure a myriad of ailments and to preserve foods. Now science is proving that these spices may preserve us with their antioxidant and antiseptic activities. Organized by scientific name, the CRC Handbook of Medicinal Spices provides the science behind the folklore of over 60 popular spices. For each spice, it lists:\n\nScientific name\nCommon name\nMedicinal activities and indications\nMultiple activities\nOther uses, especially culinary\nCultivation\nChemistry\nImportant phytochemical constituents and their activities\n\nThe handbook also includes market and import data, culinary uses, ecology and cultural information, and discusses at length the use of spices as antiseptics and antioxidants.","torrent":{"xt":"urn:btih:231e39d9c2ea53a63b08a092fba04a7d18e5f003","amp;dn":"CRC+Handbook+of+Medicinal+Spices+1st+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"231e39d9c2ea53a63b08a092fba04a7d18e5f003","infoHashBuffer":{"type":"Buffer","data":[35,30,57,217,194,234,83,166,59,8,160,146,251,160,74,125,24,229,240,3]},"announce":[],"urlList":[]}}