{"title":"Erich Fromm - The Fear of Freedom (Escape From Freedom)","uid":8984613,"size":760737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:233d20cf4667333573f373c176bfa6d7603ea34e&amp;dn=Erich+Fromm+-+The+Fear+of+Freedom+%28Escape+From+Freedom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"iprento","files":-1,"time":1380642364,"description":"&quot;The Fear of Freedom&quot;, a.k.a. &quot;Escape from Freedom&quot; in North America, is a seminal book on the ever important notion of freedom in human society. The book was first published more than 70 years ago, during the zenith of Nazism. Its author Erich Fromm goes beyond the understanding of why and how fascism was able to take hold in Germany, and successfully tackles the core issues of diminishing freedom for the individual throughout human history.\n\nIn the early 21st century, so-called &quot;democracy&quot; has replaced real freedom; governments are increasingly authoritarian and civil liberties are eroding worldwide; cities and entire countries are financially collapsing; and to add insult to injury, we are being served the mantra that there is no alternative to this failed worldview - all of the above makes the message of this book now more important than ever.\n\nThere are many sources online when one can download this book for free. Yet all of them feature the same copy, full of OCR errors, garbled text with mixed up headers/footers/footnotes, which makes it very difficult to read. So, I made an effort to put it all together in a more structured and readable way, the result of which is here in front of you. \n\nThere may be some errors that slipped my attention, but reading it is a much more pleasant experience than it used to be. Due to the complexity of references and the myriad of different pointers, all of them mixed up within the main text, occasionally I was not sure which one belongs where. Hence many footnotes were omitted - better to have no reference, than a wrong one. I hope you'll enjoy it.\n\nNo need to thank me (though I wouldn't be offended if you do) - just read the book and apply the realization to your everyday life. And please share with your friends and family!\n","torrent":{"xt":"urn:btih:233d20cf4667333573f373c176bfa6d7603ea34e","amp;dn":"Erich+Fromm+-+The+Fear+of+Freedom+%28Escape+From+Freedom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"233d20cf4667333573f373c176bfa6d7603ea34e","infoHashBuffer":{"type":"Buffer","data":[35,61,32,207,70,103,51,53,115,243,115,193,118,191,166,215,96,62,163,78]},"announce":[],"urlList":[]}}