{"title":"Neuropsychological Neurology, 2E [PDF] [StormRG]","uid":10383763,"size":3470083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23716fc687cb6d9fd5e09720dbc3dbb7967a9866&amp;dn=Neuropsychological+Neurology%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":3,"time":1403111123,"description":"Author: A. J. Larner\nPaperback: 250 pages\nPublisher: Cambridge University Press; 2 edition (May 2, 2013)\nLanguage: English\nISBN-10: 1107607604\nISBN-13: 978-1107607606\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nUnderstanding the cognitive aspects of neurological disorders is essential to manage effectively patients suffering from these conditions. This book begins by outlining the various cognitive domains and how these can be tested, before covering in depth the cognitive deficits seen in prototypical neurodegenerative cognitive disorders, (Alzheimer's disease, frontotemporal dementias, Huntington's disease, prionoses), and other common neurological disorders that may be complicated by cognitive impairment (stroke, multiple sclerosis, Parkinson's disease, brain tumours). This Second Edition has been completely revised and updated, with new material added throughout, including two new chapters: Sleep-Related Disorders, and Psychiatric Disorders in the Cognitive Function Clinic. This an essential reference for all neurologists, not just for those with an interest in cognitive disorders. General physicians and specialists who deal with endocrine, metabolic, vascular, or infective disorders that may compromise cognitive function, and allied health professionals who work with cognitively impaired patients, will also find this text useful.","torrent":{"xt":"urn:btih:23716fc687cb6d9fd5e09720dbc3dbb7967a9866","amp;dn":"Neuropsychological+Neurology%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23716fc687cb6d9fd5e09720dbc3dbb7967a9866","infoHashBuffer":{"type":"Buffer","data":[35,113,111,198,135,203,109,159,213,224,151,32,219,195,219,183,150,122,152,102]},"announce":[],"urlList":[]}}