{"title":"Rufio - Discography (2001-2010) [FLAC]","uid":8984158,"size":1798672321,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:237b2b5bc07ad67eb62d7794c79fdc4b86590190&amp;dn=Rufio+-+Discography+%282001-2010%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1380587488,"description":"\n  Rufio - Discography (2001-2010) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk-Pop, Emo, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2001 Perhaps, I Suppose...\n  2003 MCMLXXXV (1985)\n  2003 Rufio EP\n  2005 The Comfort Of Home\n  2005 Perhaps, I Suppose... (Deluxe)\n  2010 Anybody Out There\n\n  Originating in suburban Rancho Cucamonga, California, Rufio was formed in 2000 by members Scott Sellers (guitar, vocals), Jon Berry (bass, vocals), Clark Domae (lead guitar), and Mike Jimenez (drums). Sporting a bright pop-punk sound that drew comparisons to blink-182 and Sum 41, the band issued its debut recording, Perhaps, I Suppose..., in 2001 on the Revelation Records label. The band returned in June 2003 with the well-received MCMLXXXV (1985) (Rufio's first release on the Nitro label), which was recorded with the aid of producer Nick Rasculinecz and went on to sell over 75,000 copies. Rufio's members further upped their profile with a series of Warped Tour dates that summer.\n\n  A more mature effort, The Comfort of Home, was released in July 2005. By the following autumn, the guys had joined forces with MxPx and Relient K on a national tour. Berry amicably parted ways with the band in early 2006, though, with Jimenez following closely behind. Rufio added new members to the lineup and hit the road for a string of springtime shows, but the loss of two founding members proved to be a difficult hurdle. The next year, Rufio officially called it quits, playing their last American shows in June 2007 and capping things off with a short South American tour.\n\n  The breakup didn't last long, though. Rufio gave a few scattered performances throughout 2008 and officially re-formed in 2009, with newcomers Taylor Albaugh and Terry Stirling, Jr. rounding out the lineup. After releasing an EP, The Loneliest, in December, the group returned the following year with Anybody Out There.","torrent":{"xt":"urn:btih:237b2b5bc07ad67eb62d7794c79fdc4b86590190","amp;dn":"Rufio+-+Discography+%282001-2010%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"237b2b5bc07ad67eb62d7794c79fdc4b86590190","infoHashBuffer":{"type":"Buffer","data":[35,123,43,91,192,122,214,126,182,45,119,148,199,159,220,75,134,89,1,144]},"announce":[],"urlList":[]}}