{"title":"Robert Ferguson - The Hammer and the Cross. A New History of the","uid":10016887,"size":34091813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:238808635b21d3bd9a9f5d720d87f5e98a29c9d3&amp;dn=Robert+Ferguson+-+The+Hammer+and+the+Cross.+A+New+History+of+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1398159344,"description":"Description\nProduct details\nBook Title: The Hammer and The Cross: A New History of the Vikings\t\nBook Author: Robert Ferguson (Author)\nPaperback: 464 pages\nPublisher: Penguin (11 April 2010)\nLanguage: English\nISBN-10: 0141017759\nISBN-13: 978-0141017754\n============================\nBook Description\nPublication Date: 11 April 2010\nFor those living outside Scandinavia, the Viking Age effectively began in 793 with an attack on the monastery at Lindisfarne, a characteristically violent harbinger of what was in store for Britain and much of Europe from the Vikings for the next 300 years, until the final destruction of the heathen temple to the Norse gods at Uppsala around 1090.\nRobert Ferguson is a sure guide across what he calls 'the treacherous marches which divide legend from fact in Viking Age history'. His long familiarity with the literary culture of Scandinavia - the eddas, the poetry of the skalds and the sagas - is combined with the latest archaeological discoveries and the evidence of picture-stones, runes, ships and objects scattered all over northern Europe, to make the most convincing modern portrait of the Viking Age in any language. The Hammer and the Cross ranges from Scandinavia itself to Kievan Rus and Byzantium in the east, to Iceland, Greenland and the north American settlements in the west. Beyond its geographical boundaries the book takes us on a journey to a misty region inhabited by Hallfred the Troublesome Poet, Harald Bluetooth, Ragnar Hairy-Breeches, Ivar the Boneless and Eyvind the Plagiarist, in which literature, history and myth dissolve into one another.\n=============================\nReview\nFerguson adds another layer to our perception of our origins in this compelling and often poignant account of a pagan warrior society faced with Christianity on the march (Independent)\n=============================\nAbout the Author\nRobert Ferguson is one of the world's leading scholars in Scandinavian studies. After studying in London under Peter Foote, co-author of the classic Viking Achievement, he emigrated to Norway in 1984. At the invitation of the Norwegian Government he has lectured on aspects of Norwegian and Scandinavian history and culture at embassies, universities and other cultural venues in St Petersburg, New Delhi, Mumbai, Oslo, Bergen, Prague, Warsaw, Riga, Edinburgh, Vasa, New York and at the Library of Congress in Washington. His previous books include biographies of Henrik Ibsen and Knut Hamsun.\n=============================\nMost Helpful Customer Review\n5.0 out of 5 stars Absolutely fantastic, interesting and entertaining! 9 Feb 2012\nBy valkyrie1008\nFormat:Hardcover\nThis book is a brilliantly detailed, well researched, a laid out walk through from the earliest stages of the Viking era through to its demise not just at 1066 but in all the countries the Vikings made land fall and settled (England, Ireland, Scotland, Wales, Iceland, Hebrides, Shetland, Greenland, North America, Istanbul and the Mediterranean, Russia etc) and of course their home nations of Scandinavia.\nThe brilliant thing about this book besides it great detail, research, anecdotes and use of archeological evidence and up-to-date findings is how Robert Ferguson examines the mythology and pagan religion of this mighty race of people and how it changed and adapted or in most cases became outlawed and faded away with the oncoming of Christianity. You meet the regular famous characters of this era, Ethelred the Unready, Alfred the Great, Guthrum, Ivar and Cnut etc but you also meet many other great historical power heads of the era not just from Britain but in any country that was invaded by the Vikings and their struggle to defeat and convert them from Marangian Kings to Holy Roman Emperors.\nIf anyone is interested in this era and of the Viking people then this book is for the keen learner and long-term researcher as it is a very long book due to its detail and knowledge but by the end of it you gain a new fascinating indepth insight into the world from so many different points of view.\n","torrent":{"xt":"urn:btih:238808635b21d3bd9a9f5d720d87f5e98a29c9d3","amp;dn":"Robert+Ferguson+-+The+Hammer+and+the+Cross.+A+New+History+of+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"238808635b21d3bd9a9f5d720d87f5e98a29c9d3","infoHashBuffer":{"type":"Buffer","data":[35,136,8,99,91,33,211,189,154,159,93,114,13,135,245,233,138,41,201,211]},"announce":[],"urlList":[]}}