{"title":"[ExploitedCollegeGirls] Emma (20 Years Old / 02.20.2014)","uid":9644173,"size":913206693,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:23f37641f93eb36c5e2a02bcdaf9835efab829a4&amp;dn=%5BExploitedCollegeGirls%5D+Emma+%2820+Years+Old+%2F+02.20.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"chkm8te","files":1,"time":1392966550,"description":"[ExploitedCollegeGirls] Emma (20 Years Old / 02.20.2014)\n\nI've been on a hell of a run lately, and Emma continues that streak. She's got a perfect spinner body, her face is a ten and she's enthusiastically multiorgasmic. We get started with the interview and I'm pretty blown away by Emma's innocent face versus her dirty, dirty sexual history. From movie theater blowjobs to sex toy parties, this is a girl who isn't afraid to take care of herself or her man. I respect that.\nEventually Emma slips out of her sexy little dress and shows off her hard, athletic body. She tells me that her perky little tits are B cups, though in this case I think the B stands for 'barely' and I'm very okay with that. As soon as she strips, her nips are at full pokie and my cock is in about the same state. While I'd like to dive right in, I pace myself by starting off with my fingers. It takes a little while to find my rhythm but when I do Emma responds with a fantastic orgasm. I get it on all the cameras and there's a very hot replay of this and her following O's.\n\nAfter getting her off a few times I get Emma on her knees to demonstrate her beej skills which turn out to be absurdly good. She swallows me to the base and then suggests that I face fuck her as she lays on her back. Normally I ignore suggestions from models, but this one is really on point. (Don't worry, plenty of replays, you'll see everything from the deep throat to a little ass licking.) Nothing gets me harder than face fucking, so I toss Emma up on the bed and pound her to 1-2 more vocal orgasms until I can't hold out and I have to unleash on her face.\nI have a sneaking suspicion that while this is Emma's first porn scene, it won't be her last. Her amazing looks and happy sexuality make her magic on camera. After the shoot we talk about it and she admits that she's been thinking about a career in adult and even has the perfect porn starlet name: Emma Stoned.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=p29983cqfyrlt6zoyk4w.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=p29983cqfyrlt6zoyk4w.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qusmls7m1exhs3pspj19.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qusmls7m1exhs3pspj19.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:23f37641f93eb36c5e2a02bcdaf9835efab829a4","amp;dn":"%5BExploitedCollegeGirls%5D+Emma+%2820+Years+Old+%2F+02.20.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f37641f93eb36c5e2a02bcdaf9835efab829a4","infoHashBuffer":{"type":"Buffer","data":[35,243,118,65,249,62,179,108,94,42,2,188,218,249,131,94,250,184,41,164]},"announce":[],"urlList":[]}}