{"title":"The Complete Idiot's Guide to Chess, 2nd Edition (Patrick Wolff","uid":8766078,"size":25225500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2424bd449f230c25492c0e8ed96e5da966217990&amp;dn=+The+Complete+Idiot%27s+Guide+to+Chess%2C+2nd+Edition+%28Patrick+Wolff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1375335785,"description":"This revised and updated edition provides players with even more tactics to tackle the game of chess.\n\nThe Games category is consistently popular with people of all ages. The first edition sold very well, but there have been great advances the online chess experience since 1997. The second edition will provide updated exercises, and even more information on how to find opponents on the Web.\n\nAuthor is an internationally known expert in chess.\n\nCovers every aspect of game play, and is useful to beginnings and experienced players alike. Confused by esoteric chess terms like castling, forking, and making Luft? Cant tell whether youve got your opponent in check or checkmate? This book will tell you everything you need to know to become a budding Kasparov, from the names of pieces and their movements to tactics and strategies, from advanced maneuvers to setting up chess tournaments and clubs where you can test your skills. Also covered- a history of chess, from its beginnings in ancient India to how it became the worlds most played game; all the basics of the board and the pieces; elementary rules and object of the game; famous openings and well-know tactics; sneak attacks and other tricky plays; exercises that explain strategies and chess-move annotations (often found in newspapers); and advice for using the Internet and computer programs to better your game and tips on starting a chess club or tournament.\n\n\n-- About the author --\n\nPatrick Wolff is a two-time U.S. Chess Champion (1992 and 1995) and an International Chess Master. He also represented the U.S. at the World Under-26 Chess Olympiad in 1991, where he earned the Gold Medal. Patrick writes feature articles for Chess Life, New in Chess, and Chess Horizons. In addition, he is a chess coach and instructor and has appeared in several instructional chess videos. ","torrent":{"xt":"urn:btih:2424bd449f230c25492c0e8ed96e5da966217990","amp;dn":"+The+Complete+Idiot%27s+Guide+to+Chess%2C+2nd+Edition+%28Patrick+Wolff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2424bd449f230c25492c0e8ed96e5da966217990","infoHashBuffer":{"type":"Buffer","data":[36,36,189,68,159,35,12,37,73,44,14,142,217,110,93,169,102,33,121,144]},"announce":[],"urlList":[]}}