{"title":"The Hollow Crown: The War of the Roses - Dan Jones (2014)","uid":11399797,"size":217812438,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:243b0bb5cb16520bd72fa16d3f84e652a1285cfb&amp;dn=The+Hollow+Crown%3A+The+War+of+the+Roses+-+Dan+Jones+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"davieboy1966","files":4,"time":1415409283,"description":"Audio Books : History : MP3/Variable : English\nThe Wars of the Roses: The Fall of the Plantagenets and the Rise of the Tudors [Audiobook] by Dan Jones\nEnglish | October 14, 2014 | ASIN: B00OI2HKZY | MP3@32 kbps | 15 hrs 7 mins | 207 MB\nNarrator: John Curless | Genre: Nonfiction/History\n\nThe author of the New York Times best-seller The Plantagenets chronicles the next chapter in British history - the actual historical backdrop for Game of Thrones. The 15th century saw the longest and bloodiest series of civil wars in British history. The crown of England changed hands five times as two branches of the Plantagenet dynasty fought to the death for the right to rule. Now, celebrated historian Dan Jones describes how the longest reigning British royal family tore itself apart until it was finally replaced by the Tudors. Some of the greatest heroes and villains in history were thrown together in these turbulent times - from Joan of Arc and Henry V, whose victory at Agincourt and prudent rule marked the high point of the medieval English monarchy, to Richard III, who stole the throne and murdered his own nephews, the princes in the Tower. It is also a period of headstrong and resilient women - Margaret of Anjou, Elizabeth Woodville, Margaret Beaufort - who were not afraid to seize power and bend men to their will. With vivid descriptions of the battles of Towton and Bosworth, where the last Plantagenet king was slain, this is a bold and dramatic narrative history that will delight listeners who like their history with a healthy dose of bedlam, romance, and intrigue.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:243b0bb5cb16520bd72fa16d3f84e652a1285cfb","amp;dn":"The+Hollow+Crown%3A+The+War+of+the+Roses+-+Dan+Jones+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"243b0bb5cb16520bd72fa16d3f84e652a1285cfb","infoHashBuffer":{"type":"Buffer","data":[36,59,11,181,203,22,82,11,215,47,161,109,63,132,230,82,161,40,92,251]},"announce":[],"urlList":[]}}