{"title":"Nancy Drew Mystery Stories - Carolyn Keene","uid":8584002,"size":16154107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2497cf00e3f2789feed224e50d22f717e96f74bd&amp;dn=Nancy+Drew+Mystery+Stories+-+Carolyn+Keene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":56,"time":1371488128,"description":"Nancy Drew is a fictional character in a mystery fiction series created by publisher Edward Stratemeyer. The character first appeared in 1930; the books have been ghostwritten by a number of authors and are published under the collective pseudonym Carolyn Keene. The character has proved continuously popular worldwide: at least 80 million copies of the books have been sold, and the books have been translated into over 45 languages. Nancy Drew has featured in five films, two television shows, and a number of popular computer games; she also appears in a variety of merchandise sold over the world.\n\nA cultural icon, Nancy Drew has been cited as a formative influence by a number of women, from Supreme Court Justices Sandra Day O'Connor and Sonia Sotomayor to Secretary of State Hillary Rodham Clinton and former First Lady Laura Bush. Feminist literary critics have analyzed the character's enduring appeal, arguing variously that Nancy Drew is a mythic hero, an expression of wish fulfillment, or an embodiment of contradictory ideas about femininity.","torrent":{"xt":"urn:btih:2497cf00e3f2789feed224e50d22f717e96f74bd","amp;dn":"Nancy+Drew+Mystery+Stories+-+Carolyn+Keene","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2497cf00e3f2789feed224e50d22f717e96f74bd","infoHashBuffer":{"type":"Buffer","data":[36,151,207,0,227,242,120,159,238,210,36,229,13,34,247,23,233,111,116,189]},"announce":[],"urlList":[]}}