{"title":"Bletchley Park Code-Breakings Forgotten Genius ENSUB x265 [MPup]","uid":12430369,"size":216144339,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:24b643513609b636f12bf878e5c7515fe65b5cc2&amp;dn=Bletchley+Park+Code-Breakings+Forgotten+Genius+ENSUB+x265+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1442445163,"description":"BBC.Documentaries.2015.09.07.Bletchley.Park.Code-Breakings.Forgotten.Genius.EN.SUB.x265.720p.WEBRIP.[MPup]\n\nFormat: HVEC\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary looking at Gordon Welchman, a codebreaker crucial to the allies defeating the Nazis in World War II. Filmed extensively at Bletchley Park.\n\nGordon Welchman was one of the original elite codebreakers crucial to the allies defeating the Nazis in World War II. He is the forgotten genius of Bletchley Park.\n\nFilmed extensively at Bletchley Park, the centre for codebreaking operations during World War II, this documentary features the abandoned buildings where thousands of people worked tirelessly trying to crack the codes, Hut 6, where Welchman pioneered his groundbreaking work, and the machines that Welchman helped design.\n\nPost-war, Welchman moved to the United States to be at the nerve centre of the computer revolution. He was employed by the Mitre Corporation, a US defence contractor, and engaged in top secret work. Recently released top secret documents reveal that the case of Gordon Welchman reached the desk of the British prime minister, Margaret Thatcher, and then led to questions being asked in the House of Commons after Welchman's untimely death.\n\nWelchman's legacy continues to this day as Professor John Naughton and former CIA analyst Cynthia Storer reveal how Welchman's pioneering work in the field of traffic analysis led directly to the modern secret surveillance state, and particularly the use of metadata - as revealed by whistleblower Edward Snowden","torrent":{"xt":"urn:btih:24b643513609b636f12bf878e5c7515fe65b5cc2","amp;dn":"Bletchley+Park+Code-Breakings+Forgotten+Genius+ENSUB+x265+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b643513609b636f12bf878e5c7515fe65b5cc2","infoHashBuffer":{"type":"Buffer","data":[36,182,67,81,54,9,182,54,241,43,248,120,229,199,81,95,230,91,92,194]},"announce":[],"urlList":[]}}