{"title":"RarLab WinRAR v5.10 (32-64bit) with Key [TorDigger]","uid":10350707,"size":3664391,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2581e683a9de68f3c8238956d1508efcf029b2a4&amp;dn=RarLab+WinRAR+v5.10+%2832-64bit%29+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TorDigger","files":12,"time":1402669485,"description":"RarLab WinRAR\n\nWinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\n\n- Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n\n- WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n\n- WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface. \n\n- When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included. One price, one payment, once.\n\n- You also receive the benefit of a life-time use of the WinRAR archiver. No upgrade fee to pay. When a new release is made, simply download and install, your license is valid for life. \n\n- WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n\n- WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n\n- WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n\n- WinRAR offers the ability to create selfextracting and multivolume archives.\n\n- Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n\n- WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\nSupported OS:\n\nWinXP/2003/Vista/Win7/Win8 (x86-x64)\n\nHomepage: http://www.rarlab.com\n\nInstallation Instructions: \n\n- Install program.\n- Copy content from key folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:2581e683a9de68f3c8238956d1508efcf029b2a4","amp;dn":"RarLab+WinRAR+v5.10+%2832-64bit%29+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2581e683a9de68f3c8238956d1508efcf029b2a4","infoHashBuffer":{"type":"Buffer","data":[37,129,230,131,169,222,104,243,200,35,137,86,209,80,142,252,240,41,178,164]},"announce":[],"urlList":[]}}