{"title":"PRIVATE Gold 161 (Sexy, Horny and Homeless / Gazzman, Private / ","uid":10283038,"size":3892820296,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2582032daedc9474b72ff12d2bc1d2f958731ee8&amp;dn=PRIVATE+Gold+161+%28Sexy%2C+Horny+and+Homeless+%2F+Gazzman%2C+Private+%2F+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"2.No.2","files":1,"time":1401734948,"description":"PRIVATE Gold 161 (Sexy, Horny and Homeless / Gazzman, Private / 1080p / 2014)\n\nWelcome back god friends and awesome girls, to our next task, this time it will be a Private one called &quot;Private Gold 161: Sexy, Horny, and Homeless&quot;, the plot is very easy&quot; Vacation on Venice for these hot girls, no accommodation and no money, but they have something else to help them with the bill, so we better find out, - pretty much I have an idea of what they will do...-, they will ask a relative to wire some money, right?....\n\nScene 1- Ashley (Irina Bruni), Tony De Sergio, Ian Scott\n\nTime to get my Ashley fix of the day, It seems like the more I want to hold my need for her, she just pops in the following movie due for review, maybe a coincidence or maybe not, but here we go. She looks fantastic and explains something that I can't pay less attention, I'm just fixated to her beauty, what?, Oh yes, she says -she will have sex with two guys, to cover for her rent- and soon after she is giving head to one, while the other licks her sweet asshole clean, she get it from behind and there she open her asshole as well, she is then, DP'ed in RC then in CG, she kneels down to catch both pops in her mouth and she provides gently PCC.\n\nScene 2- Lucy Heart, Marco Banderas\nBlonde beauty is talk by her friend Ashley to have sex with an older guy so she doesn't have to pay for rent, she looks great and BJ's, before riding CG, then open/up legs that turns anal with a nice pace, she shows some gapes and goes RCA, ATM, spoon anal, doggy in both holes, she gets in mish where she gets a pop all over her pubic area.\n\nScene 3- Valentina Nappi, Tony De Sergio\nPrincess of my World, Valentina Nappi is next to have sex with a guy that will provide for her she BJ's and gets a few lick on her pussy then start there with her legs open/up, she turns around doggy, then jumps on top RCA, sweet, she looks awesome especially her bouncing tits, she does move CGA, she gets her pubic area sprayed and does PCC, as she only knows.\n\nScene 4- Emy Russo, Russo, Jazz Duro\nOur next girl is a redhead, she has no money and finds a place to stay, she only needs to be willing and does, she BJ's the provider and takes him from behind then rides CG that moves spoon anal, doggy anal, open/up legs anal she open her gape with her fingers, after few more strokes in doggy the guy pop all over her mouth and face, PCC.\n\nScene 5- Emma Leigh, Jazz Duro\nEmma was talking for about two scenes now is time for her to show up and she does show some great natural tits, she BJ's and takes as expected some tittie fuck, she then is orally loved, mish for her, doggy, rides CG, PTM, and gets a blast all over her nice and big tits, she provides PCC\n\nAshley, Emma, Valentina Nappi, Emy Russo, Lucy Heart\n\nAnal Sex, Hardcore, Gonzo, DP, Threesome, Big Tits\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=9a9coesou3wr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=9a9coesou3wr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=33if3shfb2hh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=33if3shfb2hh.jpg&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:2582032daedc9474b72ff12d2bc1d2f958731ee8","amp;dn":"PRIVATE+Gold+161+%28Sexy%2C+Horny+and+Homeless+%2F+Gazzman%2C+Private+%2F+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2582032daedc9474b72ff12d2bc1d2f958731ee8","infoHashBuffer":{"type":"Buffer","data":[37,130,3,45,174,220,148,116,183,47,241,45,43,193,210,249,88,115,30,232]},"announce":[],"urlList":[]}}