{"title":"True Films - 200 Documentaries You Must See Before You Die.pdf G","uid":8788881,"size":4620789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25b1f4211c6e6438856acf4358ce33db17ed48cb&amp;dn=True+Films+-+200+Documentaries+You+Must+See+Before+You+Die.pdf+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1375890715,"description":"True Films 200 Documentaries You Must See Before You Die\n\nKevin Kelly\nAuerbach Publications\nISBN: 0972392548 \n12/27/2007 \nPDF \n199 pages\n\nInexpensive equipment, new methods of distribution, and a very eager audience have all launched a Renaissance in non-fiction film making and viewing. The very best of these non-fiction films are as entertaining as the best Hollywood blockbusters. Because they are true, their storylines seem fresh with authentic plot twists, real characters, and truth stranger than fiction. Most true films are solidly informative, and a few are genuinely useful like a tool. The rise of documentaries and true cinema is felt not only in movie theaters, but on network TV and cable channels as well. Reality TV, non-fiction stations like the History Channel or Discovery, and BBC imports have increased the choices in true films tremendously. There's no time to watch them all, and little guidance to what's great.\nIn this book I offer 200+ great true films.\nI define true films as documentaries, educational films, instructional how-to's, and what the British call factual's a non-fiction visual account. These 200 are the best non-fiction films I've found for general interest. I've watched all these films more than once. Sometimes thrice. I haven't had TV for 20 years, so I've concentrated my viewing time on documentaries and true films. I run a little website (www.truefilms.com) where I solicit suggestions of great stuff.","torrent":{"xt":"urn:btih:25b1f4211c6e6438856acf4358ce33db17ed48cb","amp;dn":"True+Films+-+200+Documentaries+You+Must+See+Before+You+Die.pdf+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b1f4211c6e6438856acf4358ce33db17ed48cb","infoHashBuffer":{"type":"Buffer","data":[37,177,244,33,28,110,100,56,133,106,207,67,88,206,51,219,23,237,72,203]},"announce":[],"urlList":[]}}