{"title":"Vanishing into Things: Knowledge in Chinese Tradition (2015)pdf","uid":11804725,"size":2359529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:268008064f5cd5ffba86c1cb2f68b00e8178fca5&amp;dn=Vanishing+into+Things%3A+Knowledge+in+Chinese+Tradition+%282015%29pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1428533016,"description":"pdf\n\nVanishing into Things&quot; explores the concept of knowledge in Chinese thought over two millennia, from Confucius to Wang Yangming (ca. 1500 CE), and compares the different philosophical imperatives that have driven Chinese and Western thought. Challenging the hyperspecialized epistemology of modern philosophy in the West, Barry Allen urges his readers toward an ethical appreciation of why knowledge is worth pursuing. Western philosophers have long maintained that true knowledge is the best knowledge. Chinese thinkers, by contrast, have emphasized not the essence of knowing but the purpose. Ideas of truth play no part in their understanding of what the best knowledge is: knowledge is not deduced from principles or reducible to a theory. Rather, in Chinese tradition knowledge is expressed through wu wei,&quot; literally not doing a response to circumstances that is at once effortless and effective. This type of knowledge perceives the evolution of circumstances from an early point, when its course can still be changed, provided one has the wisdom to grasp the opportunity. Allen guides readers through the major Confucian and Daoist thinkers including Kongzi, Mengzi, Xunzi, Laozi, and Zhuangzi, examining their influence on medieval Neoconfucianism and Chan (Zen) Buddhism, as well as the theme of knowledge in China s art of war literature. The sophisticated and consistent concept of knowledge elucidated here will be of relevance to contemporary Western and Eastern philosophers alike.&quot;","torrent":{"xt":"urn:btih:268008064f5cd5ffba86c1cb2f68b00e8178fca5","amp;dn":"Vanishing+into+Things%3A+Knowledge+in+Chinese+Tradition+%282015%29pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268008064f5cd5ffba86c1cb2f68b00e8178fca5","infoHashBuffer":{"type":"Buffer","data":[38,128,8,6,79,92,213,255,186,134,193,203,47,104,176,14,129,120,252,165]},"announce":[],"urlList":[]}}