{"title":"Goliath (GOG)","uid":14605380,"size":659912919,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:268cc4996b4b8e3da36c7291f47e77cf84cacf3b&amp;dn=Goliath+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mercs215","files":4,"time":1463092822,"description":"Install instructions:\r\n- Run &quot;setup_goliath_2.0.0.4.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: GOLIATH\r\nGenre: Action - Adventure - Sandbox\r\nWorks on: Windows (Vista, 7, 8, 10)\r\nLanguages: Text only: English\r\nFeatures: single-player - achievements - controller support\r\nReleased: May 12, 2016\r\nSize: 651 MB\r\nCompany: Whalebox / Octopus Tree\r\nStore page: https://www.gog.com/game/goliath\r\n\r\nAbout:\r\nGet Ready For A Giant-Sized Adventure!\r\nWelcome to the world of Goliath, an action-adventure about crafting giant robots and punching monsters in the face! After stumbling through a mysterious rift, you find yourself in a mysterious world consisting of the jumbled fragments of a hundred dead civilizations. Ruined buildings from 1930s America share space with wrecked pirate ships and the overgrown remains of spaceships from a far-flung future. Several powerful factions battle for control of this strange and broken land, but even the strongest among them tremble in fear of the monstrous giants that roam the land. Fortunately, you can build giants of your own! Search the world for the items you need to craft tools and weapons, including giant robotic suits called Goliaths that will help you even the odd against the enormous creatures you confront!\r\nTo survive among the giant creatures in this dangerous and mysterious world, you must scavenge for resources and create Goliaths to battle your life. Starting with simple wooden versions, you will learn to create dozens of Goliaths from a variety of materials: wood, stone, metal and other more unique materials found in the world. Your Goliath can be customized and outfitted with weapons to create options that are perfect for every situation and players’ preferences. But robots won’t solve every problem. You’ll also need to craft items and tools, build shelters and fortresses, and choose which factions to side with in the war that’s sweeping across the land.\r\nBuild A ‘Bot: Learn how to create dozens of robotic Goliath suits from a variety of materials, including wood, stone, metal and more. Each Goliath can be customized and equipped with a variety of weapons and add-ons that grant new abilities.\r\nSurvive A Savage Land: Gather materials to build the tools needed to survive, including healing salves, protective fortresses and more. As players explore the world, they'll learn more complex recipes for better tools and weapons.\r\nA Living World: Explore rolling prairies, dense forests, eerie swamps, frozen tundras and more, all with a complete day/night cycle and dynamic weather. Weather and terrain will affect how each Goliath type performs, so make sure you have the right machine for the job!\r\nChoose A Side: Several factions vie for control of resources and territory in the world of Goliath. Each faction can offer different strategic advantages in unique weapon and robot plans, so you must carefully choose with which factions to align with. Broker a peace deal or rally your faction to accelerate the war!\r\nProcedurally Generated World: With procedurally generated environments, quests and events, no two games of Goliath will ever be the same.\r\n\r\nMinimum system requirements - Windows: Windows Vista®, Windows® 7, Windows® 8, Windows® 10\r\nProcessor: Intel® Core® 2 Duo / AMD® Athlon™ x2 6400+ or faster\r\nMemory: 4GB RAM\r\nGraphics: nVidia® 8800 GT / AMD® 4670 or faster with 1GB VRAM (Mobile chipsets may not work)\r\nHard Drive: 5 GB Hard Disk Space\r\nDirectX 9.0 compatible sound card\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:268cc4996b4b8e3da36c7291f47e77cf84cacf3b","amp;dn":"Goliath+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268cc4996b4b8e3da36c7291f47e77cf84cacf3b","infoHashBuffer":{"type":"Buffer","data":[38,140,196,153,107,75,142,61,163,108,114,145,244,126,119,207,132,202,207,59]},"announce":[],"urlList":[]}}