{"title":"Bob Odenkirk, David Cross, Brian Posehn - Hollywood Said No!","uid":9184298,"size":550629963,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:28086051b207a1b86248db6c2034d8d414cd4291&amp;dn=Bob+Odenkirk%2C+David+Cross%2C+Brian+Posehn+-+Hollywood+Said+No%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"rambam1776","files":-1,"time":1384271698,"description":"Thanks to the OP on whatdotcd\n\n(Sorry, no track listing on the CD packaging or online.)\n\n3CDs. 4 hours. \n\n[Read by Bob Odenkirk, David Cross, and the full cast of Mr. Show]\n\nThe creative geniuses behind HBO's classic sketch comedy Mr. Show are back with a collection of hilarious, never-before-seen scripts that may just have been too good for Hollywood.\n\nIt's hard to write a film. It's even harder to get that film made. So over the years, when Hollywood has said ''No!'' to actor-writer-comedians Bob Odenkirk and David Cross, the two have simply moved on to other projects and continued living their lives. But what if those scripts were actually hilarious? What if they deserved to see the light of day? What if Hollywood was just plain wrong?\n\nHollywood Said No! includes the full-length, never-before-seen scripts for Bob and David Make a Movie and Hooray for America! They are all presented in a more readable manner than standard film scripts, and Bob and David Make a Movie has been fleshed out with brand-new storyboards by acclaimed artist Mike Mitchell, all drawn exclusively for this book. And because Bob and David love you, the book even includes a bonus section of orphaned sketch ideas from the Mr. Show days, suitable for performance by church groups that aren't all ''koo-koo'' about religion.\n\nWait, there's still more! The book will also include a section of ''constructive'' notes written by a ''studio executive.'' And last but not least (well, possibly least), Bob and David (and Brian Posehn) will provide a section of reminiscences to add context and backstory on what went right and what went wrong. -- Will you shout ''Yes!'' where Hollywood screamed ''No!''? It doesn't matter; nobody can hear you.","torrent":{"xt":"urn:btih:28086051b207a1b86248db6c2034d8d414cd4291","amp;dn":"Bob+Odenkirk%2C+David+Cross%2C+Brian+Posehn+-+Hollywood+Said+No%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28086051b207a1b86248db6c2034d8d414cd4291","infoHashBuffer":{"type":"Buffer","data":[40,8,96,81,178,7,161,184,98,72,219,108,32,52,216,212,20,205,66,145]},"announce":[],"urlList":[]}}