{"title":"Hidden Secrets - Part 71 - Blue Beam The FAKE Alien Invasion ","uid":12456747,"size":3892498599,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:286add0ab979be760c03398cbd25b380892958a4&amp;dn=Hidden+Secrets+-+Part+71+-+Blue+Beam+The+FAKE+Alien+Invasion+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"POtHS11","files":25,"time":1442758165,"description":"Hidden Secrets - Part 71 - Blue Beam The FAKE Alien Invasion Exposed\n\n\n What is the Blue Beam Project?\n\n\nIt involves two things. A technologically simulated &quot;second coming&quot; and the reemergence of new &quot;MONTAUK&quot; type projects that have the ability to take up a whole bunch of people as in a &quot;rapture&quot; type of situation and whisk the whole bunch into never-never land.\n\n \n\nIronically, portions of the holographic projections have the potential for changing the planet into oneness with God. Unfortunately, this operates on the premise that Man shall somehow become God in human form and control other Men and dictate all actions and thoughts.\n\n \n\nThe calculated resistance to the new religion, the New World Order and the new &quot;Messiah&quot; will entail human loss on a massive scale in the ensuing &quot;holy wars&quot;. The &quot;BLUE BEAM PROJECT&quot; will pretend to be the universal fulfillment of the prophecies of old; as major an event as that which took place 2000 years ago. In principle, it will make use of the sky as a holographic projection screen for space-based laser-generating satellites (star wars). These projectors will project simultaneous images to the four corners of the planet, in every language by region.\n\n \n\nIt deals with the religious aspect of the NEW WORLD ORDER.\n\nThe &quot;system&quot; has already been tested. Holographic projections of the &quot;CHRIST IMAGE&quot; have already been seen in some remote desert areas. These have only been reported in tabloid papers, so they are instantly rendered moot. They can also project images of alien craft, aliens, monsters, angels - you name it. Computers will coordinate the satellites and software will run the show-and-tell.\n\nHolography is based on very nearly identical signals combining to produce and image, or hologram, with depth perception. This is equally applicable to acoustic (ELF, VLF, LF) waves as it is to optical phenomena.\n\nSpecifically, the &quot;show&quot; will consist of laser projections of multiple holographic images to different parts of the planet, each receiving different images according to the predominating regional religious faith. Not a single area will be excluded. With computer animation and sound effects appearing to come from the depths of space, astonished followers of the various creeds will witness their own returned Messiah in spectacularly convincing lifelike realness.\n\nThe various images of Christ, Mohammed, Buddha, Krishna, etc., will merge into ONE after &quot;correct explanation&quot; of the mysteries, prophecies and revelations are disclosed.\n\n \n\nThis &quot;ONE GOD&quot; will in fact function as the &quot;Anti-Christ&quot;, who will &quot;explain&quot; that the various scriptures &quot;have been misunderstood&quot;- that the religious of old are responsible for turning brother against brother, nation against nation - that the religions of the world must be abolished to make way for the GOLDEN AGE (NEW AGE) of the One World Religion, representing the One God they see before them","torrent":{"xt":"urn:btih:286add0ab979be760c03398cbd25b380892958a4","amp;dn":"Hidden+Secrets+-+Part+71+-+Blue+Beam+The+FAKE+Alien+Invasion+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286add0ab979be760c03398cbd25b380892958a4","infoHashBuffer":{"type":"Buffer","data":[40,106,221,10,185,121,190,118,12,3,57,140,189,37,179,128,137,41,88,164]},"announce":[],"urlList":[]}}