{"title":"CDRoller v9.50.30 with Key [TorDigger]","uid":8100402,"size":7762055,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28d6c25c5cbd00dcd7a4350025e756d9dd350279&amp;dn=CDRoller+v9.50.30+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TorDigger","files":10,"time":1359954603,"description":"CDRoller\n\nCDRoller is a powerful, easy-to-use and low-cost toolset for for CD/DVD/BD/HD-DVD/Flash data recovery.\n\nKey Features:\n\nEffectively retrieves the lost data from the discs created by &quot;drag and drop&quot; CD/DVD/BD writing software, such as well-known Sonic (Roxio, Adaptec) and Ahead Nero software packages, CeQuadrat's PacketCD, DLA, B's CLiP and others.\nReads unfinalized (&quot;open&quot;, &quot;left as-is&quot;) CDs and DVDs, including the discs with Microsoft's Live File system created under Windows 7 and Vista.\nIncludes a fault-tolerant UDF reader for all Windows operating systems. No need to look for UDF Reader Driver in order to manage old discs on your new computer under Windows 7 or Vista.\nRetrieves the lost video and photos off unfinalized DVDs created by a wide set of standalone devices that record directly onto discs: Hitachi, Canon, Panasonic, Samsung and Sony DVD camcorders as well as standalone video recorders.\nConverts the recovered VOB or VRO video data into generic MPG files without loss of quality. In contrast to VOB files, MPG ones can be viewed properly with the help of Windows Media Player.\nMakes new DVD-video discs that can be played back in the most DVD players.\nRecovers M2TS video files on the mini discs that were not finalized by AVCHD camcorders.\nFinds and retrieves accidently deleted files, files located in the corrupted folders, files on incorrectly closed disks, etc.\nRecovers CD data written by Sony Mavica CD digital cameras.\nRetrieves the lost pictures, video and other types of files from flash memory cards, such as SmartMedia, Memory Stick, CompactFlash, xD Picture Card and other flash memory drives.\n&quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\nRetrieves back up files from the discs recorded in several stages (multisession discs).\nIncludes a built-in CD/DVD/BD data burner. There is no need to run third-party CD/DVD/BD mastering software if you wish to burn a new DVD-video disc or backup your files and folders immediately after recovery. The &quot;Burn&quot; option is integrated into a common shell. Just write a new disc with recovered data shortly, without leaving CDRoller!\nErases CD, DVD and BD re-writable media. Supports quick and full erase methods.\nExamines disc sectors at low level. Displays the sector content in text, binary, hexadecimal or unicode mode. It also scans all sectors of a disc (selected track or file) for particular data. Recommended for engineering purposes and also for law enforcement and forensic investigators.\nSupports external hex editor for detailed analysis of disc contents at low level.\nIdentifies the lost files on ISO/Joliet discs with the damaged file system (volume descriptors, path tables and directories), using the raw data only.\nRescues the data from scratched, damaged or defective discs.\nProvides direct access to hardware, bypassing the Windows File System. Looks for the lost tracks (sessions) every time when you insert a new disc into the drive. Supports SCSI Pass Through Direct (SPTD) layer as alternative method under Windows 2000/XP/2003/Vista/7.\nCreates and uses an own image file to manage disc sectors.\nDigitally extracts audio tracks into a wide set of wave formats.\nTests disc readability.\nExtracts ISO Image file. Burns ISO Image file to a new disc.\nCatalogs files and folders into CD/DVD library.\nAll features are integrated into a common and easy-to-use intuitive shell.\n\nSupport of wide set of CD, DVD, BD and HD-DVD formats such as:\n\nCD formats (CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode)\nCD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\nDVD formats (DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+R DL, DVD+RW, DVD-R DL, DVD-RAM).\nBlu-ray disc (BD) formats (BD-ROM, BD-R, BD-RE, BD-R DL, BD-RE DL).\nHigh Definition DVD (HD-DVD) formats (HD-ROM, HD DVD-R, HD DVD-RAM).\n\nSupported File Systems:\n\nISO 9660 file system, including so-called Joliet and Rock Ridge extensions for long file names (Windows and Unix files names).\nUniversal Disk Format (UDF), including versions 1.02, 1.50, 2.0, 2.01, 2.50, 2.60 and so-called UDF Bridge format.\nFAT32 (for DVD-RAM and BD-RE discs).\nNTFS / FAT12 / FAT16 / FAT32 (for flash memory cards and drives).\n\nSystem Requirements\n\nTo run CDRoller, you need at least:\nMicrosoft Windows 2000/XP/2003/Vista/7 operating system,\nIntel Pentium or compatible CPU,\n256 MB of RAM,\n12 MB free hard disk space for program installation and some additional space for CD/DVD images,\nCD/DVD/Blu-ray drive(s).\n\nHomepage: http://www.cdroller.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given serial.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:28d6c25c5cbd00dcd7a4350025e756d9dd350279","amp;dn":"CDRoller+v9.50.30+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28d6c25c5cbd00dcd7a4350025e756d9dd350279","infoHashBuffer":{"type":"Buffer","data":[40,214,194,92,92,189,0,220,215,164,53,0,37,231,86,217,221,53,2,121]},"announce":[],"urlList":[]}}