{"title":"Burnout Paradise The Ultimate Box RF","uid":9734752,"size":6813272083,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:28e5b08e0a58bb0b7a1227988ae89226e456ce8e&amp;dn=Burnout+Paradise+The+Ultimate+Box+RF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"razalgul1979","files":-1,"time":1394428848,"description":"*******************************************************************************\n                     Burnout Paradise The Ultimate Box RF\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: XBOX360\nPart Size............: 200,000,000 bytes\nNumber of Parts......: 35\nCompression Format...: RAR\nFile Validation......: SFV\nImage Format.........: .iso/.dvd\nImage Created with...: ImgBurn\n\n\n\n\n-------------------------------------------------------------------------------\n                               Post Information\n-------------------------------------------------------------------------------\nPosted by............: Electronic Arts-Criterion Games\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nThe fifth entry in the gonzo racing series, Burnout Paradise gives players \nlicense to wreak havoc in Paradise City, the ultimate racing battleground, with \na massive infrastructure of traffic-heavy roads to abuse. Gone is the need to \njump in and out of menus and aimlessly search for fun like many open world \ngames; in Burnout Paradise, every inch of the world is built to deliver heart-\nstopping Burnout-style gameplay. Every intersection is a potential crash \njunction and every alleyway is an opportunity to rack up moving violations.\n\nBurnout Paradise: The Ultimate Box is a special edition release that includes \nall the gameplay of the award-winning Burnout Paradise game plus the \npreviously-released Burnout Paradise Cagney and Burnout Paradise Bikes content \nupdates, and the brand new Burnout Paradise Party content. Burnout Paradise \nParty is an offline multiplayer mode designed to allow up to eight friends to \n&quot;pass-the-pad&quot; in dozens of Burnout challenges.\n\n\nSupported Functions\nNumber Of Players: 1-8\nOnline\nOnline - VS Number Of Players: 8\n\nFeature:\n\n*Explore Paradise - From big-surf beach, to downtown gridlock, there's over 30 \nsquare kilometers of the ultimate driving playground to explore from the get-go. \nNothing is blocked off.\n\n*Burnout Your Way - Just pull up to over 120 stoplights and spin your wheels to \nstart one of five different events - the classic Race, Road Rage and Burning \nRoute, and the all-new Stunt Run and Marked Man games.\n\n*Instant Online - Burnout Paradise sets the new standard in online social \ngameplay. See your friends online with the EasyDrive Friends List and connect \nwith them instantly without having to wait or exit your game.\n\n*Team up or Takedown - Join forces with up to seven of your buddies to beat \nhundreds of online FreeBurn Challenges together or heat up the competition and \ngo head-to-head in user created race routes.\n\n*Road Rules - Make and break the rules of each road by setting speed and \ndestruction records all over town. Track how many you own against your friends!\n\n*Mugshots - Track the length and breadth of up to 2,500 online rivalries. In \nyour moments of victory, grab mugshots of opponents who have connected a Xbox \nLIVE Vision camera. Gloat over them even more in your trophy room or export them \nfor ultimate bragging rights!\n\n*Speed, Speed and Even More Speed - The rebuilt, race-tuned Burnout game engine \ndelivers intense speed boost gameplay at a super-smooth and super-fast 60 \nframes-per-second.\n\n*Showtime: Crash Anywhere, Any Time - Feel like bringing chaos to the streets of \nParadise? Send your car wrecking, spinning and scraping down the road, smashing \nthrough traffic and leaving a trail of expensive wreckage in your wake.\n\n*Crash Deformation - Burnout Paradise features an all-new deformation technology \nthat gives players an astounding close-up and slow-motion view of super-real \ndestruction.\n\n*Cars - Muscle cars, exotics, hot rods and even supercharged SUVs, engineered to \nlook beautiful whether they're brand new or mashed into scrap. Choose from \nstunt, speed or aggression car classes, each built with their own unique boost \nability to give you the upper hand for specific challenges. Shut down roaming \nrivals and rack up wins on your license to strut the streets in a wide selection \nof unique rides.\n\n*Take it Aerial - Go airborne and pull boost-earning barrel rolls and \nspectacular mid-air spins. Find the hidden jumps to reach secret rooftop routes \nand 120 smashable Burnout Billboards.\n\n*Driver's License - Start with a Learner's Permit then rack up wins to progress \nall the way up to a Burnout Elite Driver's License - the ultimate accolade for \nany safety-unconscious motorist.\n\n*Burnout Paradise Party brings the social fun of Burnout Paradise into an \noffline environment where friends can pass the pad to play competitively. There \nare dozens of quick-fire, turn-based challenges where players compete in \ndifferent stunt, speed and skill events.\n\n*Features a new restart option added for racing.\n\n*Easier control of the early vehicles.\n\n*Packs in the Burnout Paradise Cagney and Burnoutâ„¢ Paradise Bikes content \nupdates\n\n-------------------------------------------------------------------------------\n                                 Install Notes\n-------------------------------------------------------------------------------\nGame Details\nMedia: 1 x DVD9\nRegion: Free\nESBR Rating: Everyone\nDashboard Languages: English-Japanese-German-French-Spanish-Italian\nGenre: Racing\n\nFile Details\nFormat: ISO .DVD\nUnpacked size: 7,29 GB (7.835.516.962 bytes)\nISO Created with ImgBurn\nTested and working with XBOX360 NTSC-U Modded with Ixtreme LT+3.0 \n\nInstructions\n1. Unrar\n2. Burn with your choice of burning software, suggest ImgBurn at x2.4-x4 to \nDVD+R DL\n3. Play\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n-------------------------------------------------------------------------------\nGenerated with Cool NFO Creator - http://fly.to/coolbeans\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:28e5b08e0a58bb0b7a1227988ae89226e456ce8e","amp;dn":"Burnout+Paradise+The+Ultimate+Box+RF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28e5b08e0a58bb0b7a1227988ae89226e456ce8e","infoHashBuffer":{"type":"Buffer","data":[40,229,176,142,10,88,187,11,122,18,39,152,138,232,146,38,228,86,206,142]},"announce":[],"urlList":[]}}