{"title":"Cat Stevens - The Very Best Of Cat Stevens [A&amp;M] (2000)","uid":8663045,"size":425785629,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:294c94427bff8d7561d36b9754139d191ec34e6f&amp;dn=Cat+Stevens+-+The+Very+Best+Of+Cat+Stevens+%5BA%26amp%3BM%5D+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":27,"time":1373349704,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nCat Stevens - The Very Best Of Cat Stevens [A&amp;M] (2000)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/414QGREPMXL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/414QGREPMXL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by William Ruhlmann):\n\nCat Stevens, born Steven Demetre Georgiou, was the son of a Swedish mother and a Greek father who ran a restaurant in London. He became interested in folk music and rock &amp; roll in his teens while attending Hammersmith College and in 1965 began performing under the name Steve Adams. Mike Hurst, a former member of the folk-pop group the Springfields, who had become a record producer, heard him and took him into a recording studio to cut his composition &quot;I Love My Dog.&quot; This demo caused Decca Records to sign him under the name Cat Stevens and assign him to its newly formed Deram subsidiary. &quot;I Love My Dog&quot; reached the British charts in October 1966, peaking in the Top 40. Stevens' next single, &quot;Matthew &amp; Son,&quot; entered the charts in January 1967 and just missed getting to number one (in America, it grazed the bottom of the charts). It was another self-written effort, and Stevens' reputation as a writer was further enhanced by the success of his song &quot;Here Comes My Baby,&quot; which was recorded by the Tremeloes and entered the British charts in February, reaching the Top Five. (In America, it peaked just outside the Top Ten.)\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/cat-stevens-p5528/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/cat-stevens-p5528/biography&lt;/a&gt;\n\nAll Music Album Review (by Evan Cater):\n\nIt is impossible to compile a single-disc greatest-hits compilation for Cat Stevens that will come close to satisfying all of his admirers. The Very Best of Cat Stevens is the fifth major attempt to do so and, like its predecessors, it is challenged by its subject's success. Remember Cat Stevens - The Ultimate Collection is the longest of the five (24 tracks) and may be the most comprehensive. But The Very Best of Cat Stevens, released just a year later, has several advantages that make it more appealing. To begin with, it is the only compilation to sequence chronologically songs from every one of Stevens' albums, including the experimental Foreigner. It also contains the delightful folk creed &quot;The Wind,&quot; which was a glaring omission from the so-called Ultimate Collection. Most significantly, it contains the previously unreleased &quot;I've Got a Thing About Seeing My Grandson Grow Old.&quot; Stevens recorded a demo of the song during the Mona Bone Jakon sessions in 1970, but it never saw the light of day until it was remixed for this collection. Perhaps this was because it was considered too eccentric for public consumption, straddling the line between the hook-rich pop of Stevens' '60s records and the groundbreaking folk-rock of his '70s efforts. If so, the public was vastly underestimated. The song is a buried treasure that fits in perfectly in the company of Stevens' best work.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kbfqxqlkld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kbfqxqlkld6e&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00004S51Y&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00004S51Y&lt;/a&gt;\n\nTrack List:\n\n01. Matthew &amp; Son\n02. The First Cut Is The Deepest\n03. Lady D'arbanville\n04. I've Got A Thing About Seeing My Grandson Grow Old\n05. Wild World\n06. Where Do The Children PlayÂ¿\n07. Hard Headed Woman\n08. Father And Son\n09. The Wind\n10. Morning Has Broken\n11. Moonshadow\n12. Peace Train\n13. Sitting\n14. Can't Keep It In\n15. Foreigner Suite (Excerpt)\n16. Oh Very Young\n17. Another Saturday Night\n18. Majik Of Majiks\n19. (Remember The Days Of The) Old Schoolyard\n20. Just Another Night\n","torrent":{"xt":"urn:btih:294c94427bff8d7561d36b9754139d191ec34e6f","amp;dn":"Cat+Stevens+-+The+Very+Best+Of+Cat+Stevens+%5BA%26amp%3BM%5D+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294c94427bff8d7561d36b9754139d191ec34e6f","infoHashBuffer":{"type":"Buffer","data":[41,76,148,66,123,255,141,117,97,211,107,151,84,19,157,25,30,195,78,111]},"announce":[],"urlList":[]}}