{"title":"Deep Purple - Perfect Strangers (1984) WMA320","uid":6296170,"size":115148479,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:296463f96060d5b149eba93f36edafe28422523c&amp;dn=Deep+Purple+-+Perfect+Strangers+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302002071,"description":"This 1984 release--one of the most anticipated of that year, eventually going platinum--saw Deep Purple's most successful line-up in a somewhat tentative reunion, fortunately bowing to pressure from their public to record and tour again. The first (and best) document of Purple's 80s reunion era, &quot;Perfect Strangers&quot; is a thrilling album, one of the supergroup's finest. The compositional output of Roger Glover, Ritchie Blackmore, and Ian Gillan is rough and gutsy, while remaining mystic and intriguing. \nThe near lack of sincerity of Deep Purple's reunited friendship is showcased in the hard-hitting, gripping songs, such as the agressive 'Under the Gun,' 'A Gypsy's Kiss,' and the anti-preachy 'Nobody's Home,' as the shaky reunion is captured more sympathetically on the ominous title cut. 'Hungry Daze' and 'Wasted Sunsets' are a gaze back at Purple's fast-living days past (one full of fury, the other longing and lonesome), and 'Knocking At Your Back Door' gave the group a smash hit single. 'Son Of Alerik' is a bonus track for this remaster, a driven and alluring studio jam.\nThe sound of the musicianship on this album could not be immitated; Blackmore's trademark guitar is facinating, Glover's bass reaches brilliant madness, Gillan's barbed wire voice soars, as Jon Lord's organ is a highlight as usual, and drummer Ian Paice remains out of his head. This album is a landmark for Deep Purple, and is aptly titled--the band was reunited only by pressure from their public, making them no longer musical mates, but &quot;Perfect Strangers.&quot; Not withstanding, the group were not strangers at all when it came to their common goal of making music.\n\nby Bud\n\nTRACKLIST:\n\n01 - Knockin' At Your Back Door.wma                              \n02 - Under The Gun.wma                                           \n03 - Nobody's Home.wma                                           \n04 - Mean Streak.wma                                             \n05 - Perfect Strangers.wma                                       \n06 - Gypsy's Kiss, A.wma                                         \n07 - Wasted Sunsets.wma                                          \n08 - Hungary Daze.wma                                            \n09 - Not Responsible (Bonus Track).wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:296463f96060d5b149eba93f36edafe28422523c","amp;dn":"Deep+Purple+-+Perfect+Strangers+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296463f96060d5b149eba93f36edafe28422523c","infoHashBuffer":{"type":"Buffer","data":[41,100,99,249,96,96,213,177,73,235,169,63,54,237,175,226,132,34,82,60]},"announce":[],"urlList":[]}}