{"title":"The Crossword Century: 100 Years of Witty Wordplay","uid":10600716,"size":3820362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:296aea8086dc2ba8a186bf975483b48443b8c300&amp;dn=The+Crossword+Century%3A+100+Years+of+Witty+Wordplay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405918852,"description":"The Crossword Century: 100 Years of Witty Wordplay, Ingenious Puzzles, and Linguistic Mischief by Alan Connor\n2014 | ISBN: 1592408583 | English | 208 pages | EPUB | 4 MB\n\nA journalist and word aficionado salutes the 100-year history and pleasures of crossword puzzles\n\nSince its debut in The New York World on December 21, 1913, the crossword puzzle has enjoyed a rich and surprisingly lively existence. Alan Connor, a comic writer known for his exploration of all things crossword in The Guardian, covers every twist and turn: from the 1920s, when crosswords were considered a menace to productive society; to World War II, when they were used to recruit code breakers; to their starring role in a 2008 episode of The Simpsons.\n\nHe also profiles the colorful characters who make up the interesting and bizarre subculture of crossword constructors and competitive solvers, including Will Shortz, the iconic New York Times puzzle editor who created a crafty crossword that appeared to predict the outcome of a presidential election, and the legions of competitive puzzle solvers who descend on a Connecticut hotel each year in an attempt to be crowned the American puzzle-solving champion.","torrent":{"xt":"urn:btih:296aea8086dc2ba8a186bf975483b48443b8c300","amp;dn":"The+Crossword+Century%3A+100+Years+of+Witty+Wordplay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296aea8086dc2ba8a186bf975483b48443b8c300","infoHashBuffer":{"type":"Buffer","data":[41,106,234,128,134,220,43,168,161,134,191,151,84,131,180,132,67,184,195,0]},"announce":[],"urlList":[]}}