{"title":"VisualJockey_ultimate_videosynth!","uid":4026266,"size":46136370,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:297a19ba74d86c2019076a06c3e51d4a97d4e4db&amp;dn=VisualJockey_ultimate_videosynth%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"videostar","files":2,"time":1202934800,"description":"Do you know what realtime animations are?\nVisualJockey Gold is one of the fastest and most flexible VJ software on the market.\n\nIt allows you to realize breathtaking visuals, interactive multimedia events, video installations or render video clips up to HD resolution and beyond.\n\nVisualJockey links an easy to use editor with a highly optimized render engine.\n\nAfter a few mouse clicks you can see stunning results, while the intuitive node-based architecture allows you the freedom to design everything, from simple to complex visual effects.\n\nDue to visualJockey&amp;#039;s open plugin architecture it&amp;#039;s possible to easily download additional free or commercial plugins and add-ons for even more complex and stunning compositions. Right now there is an unmatched 295 native effects available, and Freeframe compatibilty goes without saying.\n\nVisualJockey is able to generate an organic 2D and 3D realtime experience including deformations, interferences, alpha-blending, live-video and much, much more. It leaves the decision completely up to you. If you want to have full control via Midi and keyboard or let parts automatically stay in-sync with your music (MP3, CD, Line-In from DJ), or just everything all at once - the choice is yours.\n &lt;a href=&quot;\nhttp://www.visualjockey.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.visualjockey.com&lt;/a&gt;\n\nNOTE: this is legal freeware, torrent distribution to avoid bandwidth excess.\nNo malware, spam, or anything you don&amp;#039;t like included, only the installer and a link to visualjockey homepage.\n\nEnjoy and create nice stuff!","torrent":{"xt":"urn:btih:297a19ba74d86c2019076a06c3e51d4a97d4e4db","amp;dn":"VisualJockey_ultimate_videosynth%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297a19ba74d86c2019076a06c3e51d4a97d4e4db","infoHashBuffer":{"type":"Buffer","data":[41,122,25,186,116,216,108,32,25,7,106,6,195,229,29,74,151,212,228,219]},"announce":[],"urlList":[]}}