{"title":"A History of Venice (2010)","uid":5511987,"size":333446768,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2aaf4639f1af8ac271232cc2b8f96fc2b10a91ae&amp;dn=A+History+of+Venice+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"artpepper","files":-1,"time":1272094621,"description":"A History of Venice: Queen of the Seas By Prof. Thomas F. Madden\n\nRecorded Books 2010 | ISBN n/a | \n\n MP3 96 kbps | Length 7 hrs and 42 mins | 333 MB\n\n\n\n\n\n\n\n\n\nProfessor Thomas F. Madden focuses his expertise on what has been called the most beautiful city in the world: Venice. \n\n\nIn these lectures, Professor Madden explains how the city on the lagoon was established by refugees escaping the onslaught of northern &quot;barbarians&quot; invading the crumbling Roman Empire. \n\n\nThrough its history, Venice housed the world's leading merchants, thrived as a maritime powerhouse, and developed into an independent republic not unlike the present United States. \n\n\nVenice draws millions of visitors each year, and these lectures shed light on why the city is such a continual source of fascination.\n\n\n\n\n\n\n\n\nCourse Syllabus:\n\n\n\nLecture 1 Refugees of the Lagoon: The Origins of Venice\n\nLecture 2 Coming of Age: The Expansion of Venetian Power\n\nLecture 3 In a Dangerous World\n\nLecture 4 In the Age of the Crusades\n\nLecture 5 A Merchant Republic in a Feudal Age: Political Reform in Medieval Venice\n\nLecture 6 Birth of a Maritime Empire: Venice and the Fourth Crusade\n\nLecture 7 Birth of Modern Finance in Venice\n\nLecture 8 The Rise of Venice: Prosperity and Power in the West and East\n\nLecture 9 A Time of Wars: The Thirteenth and Fourteenth Centuries\n\nLecture 10 A New World: The Fall of Byzantium and the Rise of the Renaissance\n\nLecture 11 A Medieval Republic in a Modern World: The Decline and Fall of Venice\n\nLecture 12 The Grand Tour and Carnevale\n\nLecture 13 The Empty House: Venice and the State of Italy\n\nLecture 14 Modern Venice\n\n","torrent":{"xt":"urn:btih:2aaf4639f1af8ac271232cc2b8f96fc2b10a91ae","amp;dn":"A+History+of+Venice+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aaf4639f1af8ac271232cc2b8f96fc2b10a91ae","infoHashBuffer":{"type":"Buffer","data":[42,175,70,57,241,175,138,194,113,35,44,194,184,249,111,194,177,10,145,174]},"announce":[],"urlList":[]}}