{"title":"Moulin Rouge","uid":4160427,"size":1284748074,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ac25fa65191e09ec82f8ed51b80b8fe38651e6c&amp;dn=Moulin+Rouge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Amorous","files":1,"time":1209346120,"description":"Release Information....\n\nMovie: Moulin Rouge\nSource: DVD\nSpoken Language: English\nSubtitle: English\nCodec: xVid\nIMDB: &lt;a href=&quot; http://www.imdb.com/title/tt0203009/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0203009/&lt;/a&gt;\n\n\n\n\n\n\\&quot;Moulin Rouge!\\&quot; revives our imagination and relives the musical era of Hollywood. The film is like an extravagant, expensive Broadway production on screen, with enough open courage, engrossing passion, and zesty energy for several motion pictures. It\\&amp;#039;s one of the year\\&amp;#039;s best films; \\&quot;Moulin Rouge!\\&quot; may be a clichÃƒ?Ã‚Â©-ridden love triangle, but Baz Luhrmann, the film\\&amp;#039;s director, shines a fresh, stunning originality on a familiar plot. He creates a candid, exuberant style for his characters-a mixture between a fast-paced music video and lush, exotic images. He uses a vast variety of camera placements and shooting angles. In several of the songs, he cuts on nearly every word. This does indeed make us dizzy, but it is the perfect approach to the material.\n\nFrom the opening moments, \\&quot;Moulin Rouge!\\&quot; plays full force, overpowering our senses. The film doesn\\&amp;#039;t even wait for its opening credits to begin. The usual 20th Century Fox logo appears on the screen within a screen as a little bald musician rises from the bottom, and continues to frantically conduct the traditional Fox fanfare. From this, we cut to \\&quot;The Sound of Music,\\&quot; where young writer morns over the loss of his true love. The film includes an interesting use of the bookend structure, and I like how it reveals the information about the main character\\&amp;#039;s deadly disease early. This is the kind of movie that does not need to astonish us with sudden plot twists or unexpected character revelations. The joy of watching \\&quot;Moulin Rouge!\\&quot; is in the visual stimulation; the plot is more interested in its own character\\&amp;#039;s discoveries than playing mind games with the audience.\n\nEwan McGregor and Nicole Kidman prove that they can really sing. Most of the time, celebrity singers turn to the silver screen with a lot of star power but little acting ability. Look at LL Cool J, Ice Cube, Jennifer Lopez, and I just know Brittany Spears is going to turn up in a movie one of these days. \\&quot;Moulin Rouge\\&quot; may be one of the first movies to open musical doors for its leading performers. Even Jim Broadbent proves to be well cast in a crazy, intensified character that he really sinks his teeth into. I will never look at any of these stars in the same light again, even, to my great reluctance, John Leguizamo.\n\nThe film takes place in the early 19th century, as Christian (McGregor) enters Paris hoping to write love stories. Several peculiar figures live above him, including the French artist Toulouse-Lautrec (Leguizamo) and his Bohemian troupe attempting to construct a play. After a freak accident, Christian is suddenly thrust into the middle of their play. The crew hires him as the star writer. He then takes a visit to the flirtatious Moulin Rouge night club, ran by the robust Harold Zinder (Jim Broadbent). It is here where he tries to persuade the club\\&amp;#039;s popular, sexy lead performer and courtesan, Satine (Kidman), to work in their production.\n\nAfter mistaking Christian for a rich and powerful aristocrat, The Duke (Richard Roxburgh), Satine falls in love with Christian, much to the dismay of many. However, she believes herself to be a simple prostitute, who should never fall in love because it will get in the way of success. When the Duke agrees to produce a major production at the Moulin Rogue, but only under his circumstances, things become even more complicated. The Duke demands that Satine becomes his personal property if Harold and the others want his financial support.\n\nObviously, the best thing in \\&quot;Moulin Rouge!\\&quot; is the music. Apart from the cast, the film\\&amp;#039;s big list of musical artists includes David Bowe, Christina Aguilera, Mya, Pink, Fatboy Slim, Beck, and many others. The kind of music that plays here does not account for a period epic at all, however. \\&quot;Moulin Rouge!\\&quot; doesn\\&amp;#039;t try to be a historic depiction, but instead an expression of fantasy and passion. The elegant sets, eventful style, and powerful choreography scream modern day, post-pop-culture. I ran out to purchase the motion picture soundtrack. You should, too. But listening to the soundtrack on your CD player at home is nothing like experiencing the memorable singing and dancing, sexual energy, and relentless enthusiasm on the big screen.\n\nAs I say in very few film critiques, some movies are you watch, others you experience. \\&quot;Moulin Rouge\\&quot; is an experience not to be missed. It is a bizarre, unique blend of exhaustive energy and lively action-one of the bravest, most ambitious and entertaining movies of the year.","torrent":{"xt":"urn:btih:2ac25fa65191e09ec82f8ed51b80b8fe38651e6c","amp;dn":"Moulin+Rouge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac25fa65191e09ec82f8ed51b80b8fe38651e6c","infoHashBuffer":{"type":"Buffer","data":[42,194,95,166,81,145,224,158,200,47,142,213,27,128,184,254,56,101,30,108]},"announce":[],"urlList":[]}}