{"title":"Intelligence.US.S01E06.HDTV.x264-LOL","uid":9600293,"size":312679198,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2b3dd0d2647537f1f19764ba1cd7f6c72cd7e922&amp;dn=Intelligence.US.S01E06.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":1,"time":1392095752,"description":"Intelligence\n\nvisit:\n\nGenre: Action, Sci-Fi\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Michael Seitzman\nCast: Josh Holloway, Meghan Ory, Marg Helgenberger, Michael Rady, Tomas Arana.\n\n.: Plot :.\nItelligence is a dramatic thriller starring Josh Holloway as a high-tech intelligence operative enhanced with a super-computer microchip in his brain. With this implant, Gabriel is the first human ever to be connected directly into the worldwide information grid and have complete access to Internet, WiFi, telephone and satellite data. He can hack into any data center and access key intel in the fight to protect the United States from its enemies. Leading the elite government cyber-security agency created to support him is Director Lillian Strand, a straightforward and efficient boss who oversees the unit's missions. Strand assigns Riley Neal, a Secret Service agent, to protect Gabriel from outside threats, as well as from his appetite for reckless, unpredictable behavior and disregard for protocol. Other skilled members of the Cybercom team include Chris Jameso and Gonzalo &quot;Gonzo&quot; Rodriguez, two resourceful federal investigators. The brains behind the design of the chip is Dr. Shenendoah Cassidy, whose son, Nelson, is jealous of Gabriel's prominent place in his father's life. As the first supercomputer with a beating heart, Gabriel is the most valuable piece of technology the country has ever created and is the U.S.'s secret weapon.","torrent":{"xt":"urn:btih:2b3dd0d2647537f1f19764ba1cd7f6c72cd7e922","amp;dn":"Intelligence.US.S01E06.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3dd0d2647537f1f19764ba1cd7f6c72cd7e922","infoHashBuffer":{"type":"Buffer","data":[43,61,208,210,100,117,55,241,241,151,100,186,28,215,246,199,44,215,233,34]},"announce":[],"urlList":[]}}