{"title":"Imperium III - Great Battles of Rome - English Translation PC !2","uid":7529505,"size":747654552,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2be86fa83316c16ecbe2bfca436d59aa71e1069b&amp;dn=Imperium+III+-+Great+Battles+of+Rome+-+English+Translation+PC+%212&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"dimigeor","files":29,"time":1344888007,"description":"+This is a second updated reupload, for easement the torrent includes the missing Tutorial as a prepared installation file, you simple run it and WATCH you must choose the correct folder that you have installed the game Imperium III - Great Battles of Rome.\n\n------------------------------------\n\n\nImperium III - Great Battles of Rome \nfixed English Translation\n\n\nUpdated\n\n+Modifications/Adds: \n-Imperium Tutorial Adventures Roman and Gaul\n-GBR Tactics V2.4\n\n\nTake a look at the features of Celtic Kings.\nTake a look at the features of Punic Wars / Nemesis of the Roman Empire / Imperivm II. \n\n\n\nNew features\n\n\nCompletely new nations of Britons, Egyptians and Germans each of them with its unique gameplay style, units and upgrades \n\nSeparation of the Roman civilization into Republican Rome and Imperial Rome. \n\nNew single player modes - Great Battles of Rome, Great Challenges of Rome and Conquest of Europe. \n\nNew combat system. Addition of 'Stamina' statistic used by units for using their specials. \n\nNew unit specials including Triple strike (the unit deals three times her usual damage), Drain (reduces target's stamina by 2 on a successful attack), Expertise (instantly kills an enemy if unit damage is increased after adjustments with enemy armor and level modifier). \n\nAdditional hero skills. Now each hero has an addition of six skills which benefit as well as him as his army. Five of the skills could be developed. \n\nCompletely redone walls. Now the walls of players' strongholds are guarded by sentries who are able to shoot down every enemy. \n\nNew items including Scroll of Dead (every attached warrior has a 10% chance upon death to transform into a Ghoul), Amulet of Triumph (heals the bearer by 100 every time he kills an enemy), Elephant Tusk (heals the bearer by 20 every second). \n\nNew custom maps \n\nA lot of new graphic effects. \n\nNew music and more than 100 new sound effects. \n\nDozens of additions to the CK and PW engine: new outposts, improved naval battles, improved help system, etc. \n\n\n------------------\n\nINSTALLATION\nNOTES\n\n1.Open &quot;Setup&quot; and install the game.\n2. If you want install modifications.\n3. Play and Enjoy.\t\t","torrent":{"xt":"urn:btih:2be86fa83316c16ecbe2bfca436d59aa71e1069b","amp;dn":"Imperium+III+-+Great+Battles+of+Rome+-+English+Translation+PC+%212","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be86fa83316c16ecbe2bfca436d59aa71e1069b","infoHashBuffer":{"type":"Buffer","data":[43,232,111,168,51,22,193,110,203,226,191,202,67,109,89,170,113,225,6,155]},"announce":[],"urlList":[]}}