{"title":"Journey's Greatest Hits [FLAC+MP3]","uid":9509472,"size":589892105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2bf047272a4775da0dd41470fa3586cb832a174d&amp;dn=Journey%27s+Greatest+Hits+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Big-Papi","files":-1,"time":1390375279,"description":"Source: CD\n\n\n\nBy Daniel\n\nOne of the biggest rock groups synonymous with the late 1970's and mid-1980's was Journey, led by Steve Perry and Neal Schon. The band broke up following Steve Perry's bout with cancer and Neal Schon forming Bad English. But they did leave behind songs that were mostly yearning love songs that pepper many a classic rock station today. As they played a significant part in my musical education in the 1980's, they do merit a gander. Most of the songs here are instant classics. Key: [original studio album]\n\nThe rocker &quot;Only The Young&quot; sets the standard for Steve Perry's soaring vocals, a wistful chorus, a strong backbeat of drums, and a crash of guitars. This song, about a hopeful generation at a new dawn, is romantically optimistic: &quot;Only the young can say/They're free to fly away/Sharing the same desires/Burnin' like wildfire.&quot;\n\n&quot;Don't Stop Believing&quot; [Escape] is a mid-paced rocker with a strong keyboard chords punctuating the rhythm. There's a sad but true moral here: &quot;Some will win, some will lose/Some were born to sing the blues/Oh, the movie never ends/It goes on and on and on and on.&quot; However, there is a note of hope in the coda: &quot;Don't stop believin'/Hold on to the feelin'.&quot;\n\n&quot;Wheel In The Sky&quot; [Infinity] may be a followup to the male protagonist of the previous song who took that midnight train and has found life too hard going enough to want to go back home.\n\n&quot;Faithfully,&quot; [Frontiers] about a rocker on the road and vows to remain faithful to the dear one he has left behind because &quot;the road ain't no place to start a family.&quot; Perry's vocal reaches the heights in the finale. The slow ballad &quot;Lights&quot; and heartfelt &quot;Send Her My Love&quot; [Frontiers] also have the same theme.\n\n&quot;I'll Be Alright Without You,&quot; [Raised On Radio], avers that &quot;love's an empty face...\nThe rowdy party rocker &quot;Any Way You Want It,&quot; [Departure] the song Rodney Dangerfield and crew jams to on the green in Caddyshack is enough to chase out any blue funk.\n\nThe rocking &quot;Ask The Lonely&quot; tells those who've gotten the wrong end of the love stick and despairing to do the title act. The operatic backing vocals from the band really enhance the song.\n\nI remember trying to find the yearning &quot;One Love&quot; on Journey's albums before I was put wise-it was called &quot;Who's Crying Now.&quot; [Escape] One of my favourites.\n\nThe piercing opening synthesizers and chugging guitars make &quot;Separate Ways&quot; [Frontiers] one of the hardest songs they've ever done. Another big favourite. Memorable chorus: &quot;Someday love will find you/Break those chains that bind you/One night will remind you/How we touched/And went our separate ways&quot;\n\n&quot;Lovin' Touchin' Squeezin'&quot;[Evolution] incorporates a bluesy sound. Then comes a heartmelting power ballad and another favourite-&quot;Open Arms&quot; [Escape] about a reunited love after a long separation. Mariah Carey covers this on her Daydream album, BTW.\n\n&quot;The Girl Can't Help It&quot;-no, not the Little Richard song or movie-is another Raised On Radio hit. The chorus sets the basic idea: &quot;The girl can't help it, she needs more/He hasn't found what he's lookin' for/They're still standing in the rain/He can't help it, and she's just that way.&quot; Its fellow single, &quot;Be Good To Yourself&quot; rivals &quot;Any Way You Want It&quot; in sheer rockability. Which brings me to this-be good to yourself and get this collection!","torrent":{"xt":"urn:btih:2bf047272a4775da0dd41470fa3586cb832a174d","amp;dn":"Journey%27s+Greatest+Hits+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf047272a4775da0dd41470fa3586cb832a174d","infoHashBuffer":{"type":"Buffer","data":[43,240,71,39,42,71,117,218,13,212,20,112,250,53,134,203,131,42,23,77]},"announce":[],"urlList":[]}}