{"title":"Sous Chef - 24 Hours in the Kitchen [EPUB]","uid":9933940,"size":1314850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c3afc965a84ae3dbcc150d77ed6cbf120edd8a6&amp;dn=Sous+Chef+-+24+Hours+in+the+Kitchen+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AtomTPB","files":1,"time":1397142754,"description":"Hardcover: 599 pages\nPublisher: Ballantine Books (25 March 2014)\nLanguage: English\nISBN-10: 0804177872\nISBN-13: 978-0804177870\n\n\n\nFor fans of Heat and Kitchen Confidential comes an intense and unflinching twenty-four-hour cycle in the life of a sous chef, from an up-and-coming literary talent and fifteen-year veteran of New York restaurant kitchens. Sous Chef offers an adrenaline-fueled exploration into the world of professional cooking and the lives of people who have committed themselves to feeding others. It is both a love letter and a cautionary tale, meant to shed light in equal measure on the allures and adversities intrinsic to the job. Told uniquely in second person, the experience is immersive, allowing the curious kitchen enthusiast or basic home cook to imagine what it might be like to inhabit this world in real time, providing the fledgling cook with an honest picture of what lies ahead, giving voice to the hard work and dedication around which the Master Chef has built a career and furnishing all manner of readers with a more mindful perspective from which to think on the craft.\n\nKey Features:\n\nCulinary and Literary Audience: Gibney's many years in restaurant kitchens gives him undeniable street cred among culinary audiences, his MFA in nonfiction writing from Columbia University marks him as a serious literary voice.\nUnique Immersive Narrative: Sous Chef is written in second person, creating an unusual, intense and fast-paced read.\nGreat Quote Lineup: Philip Lopate and Gary Shteyngart gave quotes and we can expect plenty more from inside and outside the restaurant world.","torrent":{"xt":"urn:btih:2c3afc965a84ae3dbcc150d77ed6cbf120edd8a6","amp;dn":"Sous+Chef+-+24+Hours+in+the+Kitchen+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c3afc965a84ae3dbcc150d77ed6cbf120edd8a6","infoHashBuffer":{"type":"Buffer","data":[44,58,252,150,90,132,174,61,188,193,80,215,126,214,203,241,32,237,216,166]},"announce":[],"urlList":[]}}