{"title":"Dark Secrets of the New Age - Texe Marrs","uid":11712903,"size":7059399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c5cf704165f7fec7345ca87d78d8a70e91ca4e4&amp;dn=Dark+Secrets+of+the+New+Age+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":2,"time":1424399390,"description":"\nIn the pages of this revealing book, the secret &quot;Plan&quot; of the New Age Movement is exposed for the first time in startling detail. Basing the book on an in-depth investigation of the Movement, author Texe Marrs includes over 600 actual quotes from New Age leaders which unveil their &quot;Plan&quot; for establishing a New Age Messiah to lead a One-World Religion and a global government. As part of the &quot;Plan,&quot; the Movement intends to wage a total spiritual war against Christian believers. Their ultimate goal? To eliminate every vestige of Christianity.\n\nThis is the most complete and well-documented book ever published about the New Age Movement. It shows exactly what is now being done by the New Age leadership to gain influence in every facet of society, from the entertainment industry to public schools and government. Marrs details specifically the New Age Plan to win over the next generation by flooding the media--TV cartoon shows, movies, comic books, libraries, etc.--with material that promotes New Age religious thinking and doctrine. Finally, Marrs shows how New Age ideas have already begun to infiltrate and undermine Christian churches from within.\n\nDark Secrets of the New Age is a sobering expos of the alarming New Age Movement with an urgent message for every believing Christian.\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:2c5cf704165f7fec7345ca87d78d8a70e91ca4e4","amp;dn":"Dark+Secrets+of+the+New+Age+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c5cf704165f7fec7345ca87d78d8a70e91ca4e4","infoHashBuffer":{"type":"Buffer","data":[44,92,247,4,22,95,127,236,115,69,202,135,215,141,138,112,233,28,164,228]},"announce":[],"urlList":[]}}