{"title":"ISIS: A History (2016) pdf","uid":14754163,"size":3456642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cf5478f88ac8df7af14d6809a77cab4711e8c8b&amp;dn=ISIS%3A+A+History+%282016%29+pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1464784728,"description":"The Islamic State has stunned the world with its savagery, destructiveness, and military and recruiting successes. What explains the rise of ISIS and what does it portend for the future of the Middle East? In this book, one of the world's leading authorities on political Islam and jihadism sheds new light on these questions as he provides a unique history of the rise and growth of ISIS. Moving beyond journalistic accounts, Fawaz Gerges provides a clear and compelling account of the deeper conditions that fuel ISIS. The book describes how ISIS emerged in the chaos of Iraq following the 2003 U.S. invasion, how the group was strengthened by the suppression of the Arab Spring and by the war in Syria, and how ISIS seized leadership of the jihadist movement from Al Qaeda. Part of a militant Sunni revival, ISIS claims its goals are to resurrect a caliphate and rid &quot;Islamic lands&quot; of all Shia and other minorities. In contrast to Al Qaeda, ISIS initially focused on the &quot;near enemy&quot;–Shia, the Iraqi and Syrian regimes, and secular, pro-Western states in the Middle East. But in a tactical shift ISIS has now taken responsibility for spectacular attacks in Europe and other places beyond the Middle East, making it clear that the group is increasingly interested in targeting the &quot;far enemy&quot; as well. Ultimately, the book shows how decades of dictatorship, poverty, and rising sectarianism in the Middle East, exacerbated by foreign intervention, led to the rise of ISIS–and why addressing those problems is the only way to ensure its end. An authoritative introduction to arguably the most important conflict in the world today, this is an essential book for anyone seeking a deeper understanding of the social turmoil and political violence ravaging the Arab-Islamic world","torrent":{"xt":"urn:btih:2cf5478f88ac8df7af14d6809a77cab4711e8c8b","amp;dn":"ISIS%3A+A+History+%282016%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf5478f88ac8df7af14d6809a77cab4711e8c8b","infoHashBuffer":{"type":"Buffer","data":[44,245,71,143,136,172,141,247,175,20,214,128,154,119,202,180,113,30,140,139]},"announce":[],"urlList":[]}}