{"title":"Philip Glass - Glass Reflections (Cello Octet Conjunto Iberico)","uid":3601924,"size":108718081,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2cf9adefd6bd3c78bbcfc7397c26d459b990b2db&amp;dn=Philip+Glass+-+Glass+Reflections+%28Cello+Octet+Conjunto+Iberico%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"naxosking","files":12,"time":1169539441,"description":"Glass Reflections by Cello Octet - Conjunto Iberico came about when, in 1999, Composer Philip Glass heard a movement of his third symphony played by the cello octet in Amsterdam&amp;#039;s Concertgebouw, he was greatly impressed. Inspired by the great reception and the composer&amp;#039;s support, Conjunto Iberico and their conductor Elias Arizcurenm created an entire program of Glass works transcribed for their ensemble. The result is Glass Reflections which features works from the entire range of Glass&amp;#039;s compositional activities including the concert hall, theater, opera and film. The Composer&amp;#039;s symphonic and operatic music are well represented with selections from his opera Akhnaten, his incidental music for Samuel Beckett&amp;#039;s Company, and the breathtaking third movement from Symphony No. 3 (Symphony for Eight) for strings. In the past few years the composer&amp;#039;s output for film has increased, some examples Glass&amp;#039; best work in the medium are selections from Mishima and Joseph Conrad&amp;#039;s The Secret Agent. World famous cellist Yo-Yo Ma recently commented, &quot;(Conjunto Iberico) is a treasure indeed, a fine example to the world of music...Wherever I play: Brazil, the U.S., people talk to me about Conjunto Iberico...Elias Arizcuren is a true visionary who has achieved something absolutly unique with this group.&quot;","torrent":{"xt":"urn:btih:2cf9adefd6bd3c78bbcfc7397c26d459b990b2db","amp;dn":"Philip+Glass+-+Glass+Reflections+%28Cello+Octet+Conjunto+Iberico%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf9adefd6bd3c78bbcfc7397c26d459b990b2db","infoHashBuffer":{"type":"Buffer","data":[44,249,173,239,214,189,60,120,187,207,199,57,124,38,212,89,185,144,178,219]},"announce":[],"urlList":[]}}