{"title":"Eric B and Rakim - Paid In Full 1987 [FLAC] [h33t] - Kitlope","uid":4208215,"size":291702272,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d04fcc4496ea6974636d7c8d77e29d8e478f428&amp;dn=Eric+B+and+Rakim+-+Paid+In+Full+1987+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Kitlope","files":14,"time":1211918147,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 2D04FCC4496EA6974636D7C8D77E29D8E478F428\nFile Size: 278 Mb\nYear: 1987\nLabel: 4th &amp; Bway/Island/PolyGram\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\nEric Barrier (Eric B.) and Rakim Allah (Rakim), were a hip-hop duo known as Eric B. &amp; Rakim. The pair is generally considered to be one of the most influential and groundbreaking groups in the history of hip hop, due to their dark production and Rakim&amp;#039;s revolutionary rhyming style, which was smooth, seemingly effortless, and used remarkably complex rhyming schemes involving internal rhymes and sophisticated metaphors. Their single &quot;I Know You Got Soul,&quot; which borrowed extensively from the Bobby Byrd record &quot;I Know You Got Soul,&quot; was one of the era&amp;#039;s stand-out James Brown-influenced recordings, and further popularized the extensive sampling of Mr. Brown&amp;#039;s catalogue in an addition to other similar soul and funk artists\n\n\nPaid In Full was the debut album by hip-hop duo Eric B. &amp; Rakim, released in 1987 on 4th &amp; B&amp;#039;way/Island|/PolyGram Records. The album was produced by Eric B. &amp; Rakim, except for the tracks &quot;My Melody&quot; and &quot;Eric B. Is President,&quot; which were produced by Marley Marl.\n\nThe album was well-received upon release and has since become a classic hip-hop album. It was also the first full-length album on an Island Records subsidiary that was distributed independently before its acquisition by PolyGram Records in 1992\n\n\nAccording to Steve Huey of All Music Guide, ?It is one of the most influential hip-hop albums of all time.?[3] According to VIBE Magazine: &amp;#039;?[When Rakim] took to the mike in 1987, and served up Paid in Full with DJ Eric B., he set hip hop&amp;#039;s new course. [Rakim was] a street-wise mystic with eminently clear and dexterous rhymes that sounded like they might never end.? Furthermore, Eric B.&amp;#039;s innovative distillation of a James Brown sample in &quot;I Know You Got Soul&quot; introduced the godfather period that featured the extensive sampling of R&amp;B and soul music as instrumentals for hip-hop songs. &quot;Eric B. is President,&quot; the first single off the album and by the duo, was somewhat revolutionary at the time of its release in that it showcased a different style of emceeing that would soon be adapted by numerous MCs of the past and present. The song was also produced by Marley Marl, contrary to the popular belief that Eric B. had produced it singlehandedly.\n\nWhile certainly not a genre-creator in its own right, the album, nevertheless, introduced new conventions that redefined hip hop music while the genre was still in its infancy. The album Ranked #19 in Rolling Stone&amp;#039;s 50 Coolest Records, was included in Vibe&amp;#039;s 100 Essential Albums of the 20th Century and was ranked as the greatest hip-hop album of all time by MTV.[4] In 1998, the album was selected as one of The Source Magazine&amp;#039;s 100 best Rap Albums. In 2003, the album was ranked number 227 on Rolling Stone magazine&amp;#039;s list of the 500 greatest albums of all time.\n\nPaid in Full has become a benchmark hip-hop record and definitive piece during the late 1980s&amp;#039; Golden Age period[citation needed]. It has been acknowledged by numerous fans, hip-hop recording artists, and published music critics as unsurpassed in quality[citation needed]. Its lyrical content and delivery is looked upon as legendary and untouchable; Rakim&amp;#039;s ability to flow smoothly and powerfully at the same time was supplemented by Eric B.&amp;#039;s revolutionary sampling, as well as his jazz- and soul-oriented beats. Rakim&amp;#039;s use of elaborate metaphors, double puns, paradoxes, and more embedded in his rhymes have been copied and used by a vast number of MC&amp;#039;s since the release of this album. Steve Huey of All Music Guide said that &quot;Rakim basically invents modern lyrical technique over the course of Paid in Full with his complex internal rhymes, literate imagery, velvet-smooth flow, and unpredictable, off-the-beat rhythms.&quot;[5] Prior to Paid in Full, most hip-hop records consisted of stereotypical plain beats with little or no focus on the lyrics, since most were to assist beats meant for clubs. In 1987, many albums were released that were vital for the revolution that hip-hop faced and continued with through until around the end of the decade. Rakim and Eric B. are possibly at the top of the list for the most important and fundamental artists to garner this change, and rightly so because of the impeccable and nearly flawless content and quality of the album. The many directions that circa 1987 hip-hop had taken include the association of gangsta rap into mainstream music, change in the beats used by emcees in sampling or inclusion of more jazzy and even reggae beats in the record, more focus on the lyrical ability and skills possessed by the MC that distinguished him from others, the socio-political commentary incorporated in many records, and other messages coated within the song, among others. Rakim could incorporate most of these into just one album, and was very effective in carrying it out in a skillful manner leaving many listeners in awe. Even today, Rakim is referenced by countless other emcees and critics as being the driving force behind the turning point in hip-hop music, constantly associating him with the leader of the old school.\n\nIn the September 6, 2007, issue of Rolling Stone, emcee Common answers the question, &quot;When did you realize music was important to you?&quot; by saying, &quot;When Paid in Full came out. You could tell it was street music: It had knowledge, it had consciousness, it was hard, it was soulful.&quot;\n\nIn 2003, Eric B. alleged the duo had not in fact been paid in full for their work, and launched a lawsuit against its immediate current parent Island Def Jam Music Group, Lyor Cohen, and Russell Simmons.\n\n\n\nTracks\n\n1 &quot;I Ain&amp;#039;t No Joke&quot; 3:56 \n\n2 &quot;Eric B. Is on the Cut&quot; 3:54 \n\n3 &quot;My Melody&quot; 6:50 \n\n4 &quot;I Know You Got Soul&quot; 4:47 \n\n5 &quot;Move The Crowd&quot; 3:50 \n\n6 &quot;Paid In Full&quot; 3:46 \n\n7 &quot;As The Rhyme Goes On&quot; 4:04 \n\n8 &quot;Chinese Arithmetic&quot; 4:12 \n\n9 &quot;Eric B. is President&quot; 6:17 \n\n10 &quot;Extended Beat&quot; 3:49\n\n\nEnjoy :)\n\n","torrent":{"xt":"urn:btih:2d04fcc4496ea6974636d7c8d77e29d8e478f428","amp;dn":"Eric+B+and+Rakim+-+Paid+In+Full+1987+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d04fcc4496ea6974636d7c8d77e29d8e478f428","infoHashBuffer":{"type":"Buffer","data":[45,4,252,196,73,110,166,151,70,54,215,200,215,126,41,216,228,120,244,40]},"announce":[],"urlList":[]}}