{"title":"Helmut Newton - Helmut by June (2007)","uid":4667013,"size":652315280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d097f950ced56ced9585d179e556ff28e49298f&amp;dn=Helmut+Newton+-+Helmut+by+June+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nocarrier2","files":2,"time":1232601102,"description":"HELMUT BY JUNE &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1336101/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1336101/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.hbo.com/docs/programs/helmutbyjune/synopsis.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hbo.com/docs/programs/helmutbyjune/synopsis.html&lt;/a&gt;\n\nHelmut Newton revolutionized fashion photography and electrified the art world with disturbing, highly \n\neroticized images that transformed lush-bodied women into exquisite icons.\n\nDubbed the &quot;King of Kink&quot; by Time magazine, Newton died in 2004, leaving behind an influential and subversive \n\nbody of work.\n\nThe CINEMAX Reel Life presentation HELMUT BY JUNE portrays Newton's life as a photographer as seen through the \n\nlens of wife June Newton, who documented her husband at work at a number of shoots in the '90s.\n\nThe resulting portrait, distributed in Europe, was seen by devoted fan and Newton intimate Brett Ratner (&quot;X-\n\nMen: The Last Stand&quot;), who was determined to help bring it to a wider audience in the United States. Updated \n\nwith opening commentary from June, which was filmed by executive producer Ratner.\n\nUsing only the most basic camera equipment, Helmut Newton created haunting visual narratives set in a world \n\nsaturated with sex, glamour and implied violence.\n\nWhile his photographs appeared frequently on the pages of glossy magazines, Newton was far more than a fashion \n\nphotographer. He blurred the line between fine art and pornography with androgynous imagery, voyeuristic \n\ntitillation and sado-masochistic scenarios.\n\nJune Newton, his devoted spouse for 56 years, turns the tables on Newton, opening a voyeuristic window into \n\nhis complicated personal and creative life. At turns poignant, comical and unsettling, HELMUT BY JUNE paints a \n\nriveting portrait of photography's dark prince, who was equally comfortable on both sides of the camera.\n\nJune follows Newton as he painstakingly stages scenes that blend fashion and fetishism to reflect his lifelong \n\nfascination with women who are simultaneously powerful and vulnerable.\n\nAlways in complete control of his subjects, Newton describes the models in his photographs as &quot;a \n\ncommodity...paid to be made into what I want.&quot;\n\nAgainst the ultra-chic backdrops of Monte Carlo, Paris, Miami, Nice and Los Angeles, a who's who of fashion, \n\nincluding Cindy Crawford, Claudia Schiffer, Karen Mulder, Helena Christiansen, Carla Bruni and Gianni and \n\nDonatella Versace, parades before Newton's skewed lens.\n\nHollywood royalty, including Billy Wilder and Sigourney Weaver (in an iridescent green body suit and shaved \n\nhead), as well as opera stars Jane Anderson and Luciano Pavarotti, also allow themselves to be transformed \n\ninto figments of Newton's perverse imagination. His dissolute charm seduces even politicians, as Newton \n\nchortles about his &quot;ultimate pin-up girl,&quot; Margaret Thatcher.\n\n&quot;People want to get inside his head to see where the images come from,&quot; June observes. HELMUT BY JUNE \n\ndocuments the private side of a very public partnership, in addition to exploring Newton's extraordinary art.\n\n&quot;Helmut did not only photograph his subjects...he directed them,&quot; says Ratner. &quot;As his partner in life and in \n\nart, June brings unique insight into his artistic process and deepens our understanding of this genius of \n\n20th-century photography.&quot;\n\nJune Newton, Helmut's model, muse and wife, was born in Australia. A former actress, she is also a painter and \n\nphotographer known as Alice Springs, whose work has been exhibited in London, Paris, Los Angeles and Milan. \n\nWith her husband, she co- authored such books as &quot;Them and Us&quot; and &quot;Mrs. Newton.&quot; June Newton continues to \n\nserve as art director for all of her late husband's exhibitions and books.\n\nExecutive producer Brett Ratner has directed seven feature films that have collectively grossed over a billion \n\ndollars. He has also directed music videos for such artists as Madonna, Mariah Carey, Jessica Simpson, Jay-Z \n\nand P. Diddy.\n\nHELMUT BY JUNE is a co-production of Canal Plus/Byzance Productions, presented by Rat Films and HBO \n\nDocumentary Films; written, directed and narrated by June Newton; executive producers, Brett Ratner, Yves \n\nMonnet and Carlo Tedeschi; producer, Xavier Moreau; editor, Oliver Potterton. \n\n-------------\n\nThis is a 2-pass deinterlaced StaxRip encoding of the ISO torrent floating around for this same movie.\n\nEnjoy!\nNoCarrier &lt;a href=&quot;\nhttp://thepiratebay.se/user/nocarrier2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/nocarrier2&lt;/a&gt;\n\n===== File Information =====\t\t\t\t\nFile Name:\tHelmut by June.avi\t\t\t\t\nDuration:\t53:09.880 \t\t\t\nFile Size:\t652,310,528 bytes\t\t\t\n\n===== Video Information ===== \t\t\t\t\nVideo Codec:\tXviD 1.1.2 Final\t\t\t\nVideo Bitrate:\t1532\t\t\t\t\nQuality (bpp):\t0.159\t\t\t\t\nFPS:\t\t25.000 fps\t\t\nAspect Ratio:\t1.340\t\t\t\t\nDimensions:\t688 x 560\t\t\n\n===== Audio Information ===== \t\t\t\t\nAudio Codec:\t0x0055 MPEG-1 Layer 3\t\t\t\t\nAudio Bitrate:\t90\t\t\t\t\nChannel Count:\t2\t\t\t\n\nVideo information generated by GSpot v2.70a\t\t\n\n","torrent":{"xt":"urn:btih:2d097f950ced56ced9585d179e556ff28e49298f","amp;dn":"Helmut+Newton+-+Helmut+by+June+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d097f950ced56ced9585d179e556ff28e49298f","infoHashBuffer":{"type":"Buffer","data":[45,9,127,149,12,237,86,206,217,88,93,23,158,85,111,242,142,73,41,143]},"announce":[],"urlList":[]}}