{"title":"TCP/IP Sockets in C, Second Edition: Practical Guide for Program","uid":4980388,"size":1340178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d3989c4f302f967a5b82d360eacf8d0f0c8d42b&amp;dn=TCP%2FIP+Sockets+in+C%2C+Second+Edition%3A+Practical+Guide+for+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1246268392,"description":"The Internet allows computers thousands of miles apart to exchange information through programs such as Web browsers, and nearly all of these programs gain access to network communication services through the sockets programming interface. TCP/IP Sockets in C: Practical Guide for Programmers is a quick and affordable way to gain the knowledge and skills needed to quickly develop sophisticated and powerful web-based applications. Written by two experienced networking instructors, the book's focused, tutorial-based approach enables the reader to master the tasks and techniques essential to virtually all client-server projects using sockets in C. Programming concepts are introduced through simple, real-world examples, and are accompanied by line-by-line code commentary that describes the purpose of each part of the program. The book's companion website also contains myriad employable examples of command-based source code discussed throughout the text.\n\nA great deal has changed in the 6 years since the first edition of this book was published. The widespread adoption of IPv6 has led to a new standard for internetworking and the exponential increase of computer processing power have enhanced the efficacy and scope of electronic espionage. Therefore, this edition has amended and expanded outdated sections in accordance with both new advancements and dangers. The book now explains both the IPv6 and IPv4 address schemes as well as how to do sockets programming in the mixed IPv6/IPv4 networks environment. It also details defensive programming strategies in the context of building security-aware distributed systems, and introduces the select() system call from a performance and\npredictability perspective in large systems.\n\nIn summary, the book provides both a general overview of networking concepts to allow readers to synchronize the concepts with terminology, while providing a springboard to more advanced networking topics through the basic application of the latest technological developments. No other resource presents so concisely and effectively the material necessary to get up and running with C sockets programming.\n\n* Includes completely new and expanded sections that address the IPv6 network environment, defensive programming, and the select() system call, thereby allowing the reader to program in accordance with the most current standards for internetworking.\n\n* Streamlined and concise tutelage in conjunction with line-by-line code commentary allows readers to quickly program web-based applications without having to wade through unrelated and discursive networking tenets.\n\n* Grants the reader access to online source code, which the can then be used to directly implement sockets programming procedures.\n","torrent":{"xt":"urn:btih:2d3989c4f302f967a5b82d360eacf8d0f0c8d42b","amp;dn":"TCP%2FIP+Sockets+in+C%2C+Second+Edition%3A+Practical+Guide+for+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d3989c4f302f967a5b82d360eacf8d0f0c8d42b","infoHashBuffer":{"type":"Buffer","data":[45,57,137,196,243,2,249,103,165,184,45,54,14,172,248,208,240,200,212,43]},"announce":[],"urlList":[]}}