{"title":"The Rootkit Arsenal: Escape and Evasion","uid":9539936,"size":85282957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e311edbc18e460f82c552a12a547efa1c2d8f64&amp;dn=The+Rootkit+Arsenal%3A+Escape+and+Evasion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dendisuhubdy","files":1,"time":1391019456,"description":"Bill Blunden's book, The Rootkit Arsenal: Escape and Evasion in the Dark Corners of the System, is one of the hidden gems out there as far as computer security books are concerned, and I hope that I can convince you to give it a look. This review has been too-long to arrive, as I haven't had the time to read that I would like. That said, I felt it was very important to finally get the review up, as this is a book that I'm sure my regular readers will enjoy.\n\nI first spotted this book on a vendor table at Defcon, and it stood out among the rest mostly because *I hadn't heard of it*. I try to keep up with new book releases, especially on attack-oriented topics that would be of interest to the penetration testers and vulnerability analysts that read this blog. It was surprising to me that one had flown under the radar. I picked it up and flipped through the table of contents [...] (which I encourage you to do as well), and was very impressed with the amount of material it covers.\n\nI looked up the author, and was disappointed to realize that I had missed his talk at Blackhat earlier that week (looking forward to the video). I contacted him, and he was kind enough to supply a review copy of the book. It arrived very quickly, with a humorous personal note on the inside cover, and ever since, I have been learning a lot from it.\n\nThe author's style is excellent. The material is technical and has the potential to be very dry, but the text has a very conversational tone, as if it were being presented as a lecture for a (particularly good) class. Each concept is tied back to the main topic: hiding operations and data from the user and operating system, and frustrating forensic analysis","torrent":{"xt":"urn:btih:2e311edbc18e460f82c552a12a547efa1c2d8f64","amp;dn":"The+Rootkit+Arsenal%3A+Escape+and+Evasion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e311edbc18e460f82c552a12a547efa1c2d8f64","infoHashBuffer":{"type":"Buffer","data":[46,49,30,219,193,142,70,15,130,197,82,161,42,84,126,250,28,45,143,100]},"announce":[],"urlList":[]}}