{"title":"R.E.M. - Document (1987) WMA320","uid":6153645,"size":109599698,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e89e1f6e91e3d589bd20e95297c37a4c042294d&amp;dn=R.E.M.+-+Document+%281987%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296962810,"description":"Document was the album that helped elevate R.E.M. from kings of college radio to the mainstream. Buoyed by the catchy (and misunderstood) song &quot;The One I Love&quot;, Document hit number 10 on the album charts. That's not too bad for an album made up of some highly political songs and some very non-commercial ones. &quot;Finest Worksong&quot; &amp; &quot;Welcome To The Occupation&quot; open the album on a politically charged and powerful note. &quot;Exhuming McCarthy&quot; starts off with the sounds of a typewriter and then slides into pounding Bill Berry drumbeat and jangling Peter Buck guitar. &quot;Disturbance At The Heron House&quot; has a fine Michael Stipe vocal while &quot;Strange&quot; is an abbreviated number that has some good backup singing from Mike Mills in an almost doo wop style. &quot;King Of Birds&quot; has a deep south, r&amp;b feel to it. &quot;Lightnin' Hopkins&quot; and &quot;Oddfellows Local 151&quot; are the strangest songs on the album with the later being drenched in feedback. &quot;The One I Love&quot; became the first song by the band to gain major radio-play and actually peaked at number 9 on the charts. On the surface, the song seems like a love song, but it is really a barbed attack. &quot;It's The End Of The World As We Know It (And I Feel Fine)&quot; is the centerpiece of the album though. Michael Stipe sings at a breakneck speed and the song is one of the best of the 80's. Many ardent R.E.M. fans dismiss this album as the band selling-out, but that is hardly the case. R.E.M. remained true to their roots and actually released a typically non-commercial album that became a commercial success due to people finally realizing the greatness and talent of the band. They show that you can become superstars on your own terms. \n\nby Thomas Magnum\n\nTRACKLIST:\n\n01 - Finest Worksong.wma                                         \n02 - Welcome To The Occupation.wma                               \n03 - Exhuming Mccarthy.wma                                       \n04 - Disturbance At The Heron House.wma                          \n05 - Strange.wma                                                 \n06 - It's The End Of The World As We Know It (And I Feel Fine)...\n07 - The One I Love.wma                                          \n08 - Fireplace.wma                                               \n09 - Lightnin' Hopkins.wma                                       \n10 - King Of Birds.wma                                           \n11 - Oddfellows Local 151.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nDEDICATED TO azza1969","torrent":{"xt":"urn:btih:2e89e1f6e91e3d589bd20e95297c37a4c042294d","amp;dn":"R.E.M.+-+Document+%281987%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e89e1f6e91e3d589bd20e95297c37a4c042294d","infoHashBuffer":{"type":"Buffer","data":[46,137,225,246,233,30,61,88,155,210,14,149,41,124,55,164,192,66,41,77]},"announce":[],"urlList":[]}}