{"title":"Low Tech Hacking Street Smarts for Security Professionals.pdf Go","uid":8617086,"size":8026661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2eb0d8eb68670c948d6c049f6faf5cc3a850bd7a&amp;dn=Low+Tech+Hacking+Street+Smarts+for+Security+Professionals.pdf+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1372280145,"description":"Low Tech Hacking: Street Smarts for Security Professionals\nBy Jack Wiles, Terry Gudaitis, Jennifer Jabbusch, Russ Rogers, Sean Lowther\n2012 | 264 Pages | ISBN: 1597496650 | PDF | \n8 MB \nCriminals using hacking techniques can cost corporations, governments, and individuals millions of dollars each year. While the media focuses on the grand-scale attacks that have been planned for months and executed by teams and countries, there are thousands more that aren't broadcast. Low Tech Hacking focuses on the everyday hacks that, while simple in nature, actually add up to the most significant losses. Attackers are using common techniques like social engineering, wireless hacking, and targeting and surveillance to gain access to valuable data. This book contains detailed descriptions of potential threats and vulnerabilities, many of which the majority of the information systems world may be unaware. Author Jack Wiles spent many years as an inside penetration testing team leader, proving these threats and vulnerabilities exist and their countermeasures work. His contributing authors are among the best in the world in their respective areas of expertise.\nContains insider knowledge of what could be your most likely Low Tech threat\nIncludes timely advice from some of the top security minds in the world\nCovers many detailed countermeasures that you can employ to improve your security posture","torrent":{"xt":"urn:btih:2eb0d8eb68670c948d6c049f6faf5cc3a850bd7a","amp;dn":"Low+Tech+Hacking+Street+Smarts+for+Security+Professionals.pdf+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eb0d8eb68670c948d6c049f6faf5cc3a850bd7a","infoHashBuffer":{"type":"Buffer","data":[46,176,216,235,104,103,12,148,141,108,4,159,111,175,92,195,168,80,189,122]},"announce":[],"urlList":[]}}