{"title":"Avenged Sevenfold - Sounding The Seventh Trumpet","uid":4811161,"size":118726037,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2eb1e3f68524a5945036d62c3d8bdc7820bfcf49&amp;dn=Avenged+Sevenfold+-+Sounding+The+Seventh+Trumpet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mikey.Is.Random","files":-1,"time":1238378466,"description":"Avenged Sevenfold has crafted a tremendous variation of metalcore, inflecting the traditional metal sound with outrageous bursts of hardcore fury and mesmerizing wails more likely found in the European vein of death metal.  These elements together create an amazing but lethal crush on the listener, leaving one breathless after such feats. Sounding the Seventh Trumpet is an exceptional album that finds the group perfecting its own distinct style, and although the bandmembers remain fairly unknown on the metal scene, one could only imagine that this will change rather quickly.  Frontman M. Shadows is a force to be reckoned with, as his screams are capable of making blood flow from one's ears, while his singing voice has the ability to feel those vicious wounds.  Songs such as &quot;Darkness Surrounding&quot; and &quot;We Come Out at Night&quot; are excellent metalcore masterpieces, as the vocal harmonies add to these cuts to evolve the songs into fully atmospheric sonic blasts.  As the album unfolds, Shadows' singing voice becomes the more dominant style and that is slightly unfortunate; the melodies are given much more intensity when his voice is used to a lesser extent amidst the grating bellows --- yet there is no bad song included on this collection.  Musically, the band has seemlessly woven hardcore crunch with heavy metal flair, and never once bogs itself down with too much intricacy.  &quot;Streets&quot; may surprise some for its punk feel, yet it makes sense since it's a cover of the Successful Failure song, proving that Avenged Sevenfold could easily outdo many of the gritty punk groups in existence in the 21st century.  Sounding the Seventh Trumpet is a magnificent album that is suitable for any fan of metal music, as Avenged Sevenfold has a firm grasp on all that is extreme.\n\n~Jason D. Taylor, All Music Guide","torrent":{"xt":"urn:btih:2eb1e3f68524a5945036d62c3d8bdc7820bfcf49","amp;dn":"Avenged+Sevenfold+-+Sounding+The+Seventh+Trumpet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eb1e3f68524a5945036d62c3d8bdc7820bfcf49","infoHashBuffer":{"type":"Buffer","data":[46,177,227,246,133,36,165,148,80,54,214,44,61,139,220,120,32,191,207,73]},"announce":[],"urlList":[]}}