{"title":"Thousand Foot Krutch - 2003 - Phenomenon","uid":4916349,"size":32491251,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ec0220fe0d15f6625b7059cef945299c520853a&amp;dn=Thousand+Foot+Krutch+-+2003+-+Phenomenon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"TorrentTracts","files":11,"time":1243445858,"description":"Thousand Foot Krutch - 2003 - Phenomenon\n\n\nTRACK LISTING:\n\n01 - Phenomenon\n02 - Step To Me\n03 - Last Words\n04 - This Is A Call\n05 - Rawkfist\n06 - Faith, Love And Happiness\n07 - I Climb\n08 - Quicken\n10 - Bounce\n11 - Ordinary\n12 - Break The Silence\n\n\nADDITIONAL INFORMATION:\n\nYou probably wouldn't even know they are Christian if you just listen to the music. But the record label they are on (Tooth &amp; Nail) is a dead giveaway. The music mixes hard-rock with a little nu-metalish influence and a clean vocalist that fits the bands musical style. At times, the vocalist reminds me of the vocalist from Adema, and the music, at times, is similar to P.O.D. or Pillar, except the vocalist doesn't rap on this album like on their debut. \nAlso, the drummer, on certain songs, can get really complex. Sometimes it sounds like he's using a double-kick (but I don't think he does), and it gives the songs a nice beat that sounds really good and interesting. The bass, however, is probably the least impressive, since he just mostly follows what the guitar is doing. He does have some interesting lines, though, in the beginning of some songs where the guitar isn't being played, so the bassist still shares some of the spotlight on this album.\n\nThe lyrics on this album seem to have a religious 'feel' to them, but not so much that it would make TFK sound preachy. The lyrics have a positive and uplifting message, while still keeping the songs upbeat, catchy, and fun to listen to.\n\nSome things that kind of bothered me, though, is that some of the songs sound a bit too similar. You could switch the vocal tracks around with different songs and it would sound good, but too similar. This album would have been fantastic if TFK would have made some of the songs sound more distinct and different from each other, but they still do a good job overall. This album is still a very good listen and would be enjoyable for Christians and nonChristians alike. \n\n\n\nTORRENTED BY:\n\nTorrent Tracts, May 2009\n","torrent":{"xt":"urn:btih:2ec0220fe0d15f6625b7059cef945299c520853a","amp;dn":"Thousand+Foot+Krutch+-+2003+-+Phenomenon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec0220fe0d15f6625b7059cef945299c520853a","infoHashBuffer":{"type":"Buffer","data":[46,192,34,15,224,209,95,102,37,183,5,156,239,148,82,153,197,32,133,58]},"announce":[],"urlList":[]}}