{"title":"Nanomedicine Science, Business, and Impact","uid":15391123,"size":7602675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ec797b093e53dd0367dda213168fac62f15ceb7&amp;dn=Nanomedicine+Science%2C+Business%2C+and+Impact&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1469343561,"description":"Nanomedicine Science, Business, and Impact - Michael Hehenberger (Pan Stanford, 2016).pdf\r\n\r\nBy covering the science, business, and societal impact of nanomedicine, this book makes a strong case for funding of basic research, for effective translation of scientific breakthroughs into clinical care of patients, and for close collaboration among all stakeholders in the healthcare ecosystem. It covers the underlying science and technology of nanomedicine in detail to help understand the great promise of nanomedicine across all disease areas. Although rich and deep in content, the book attempts to introduce the topic of nanomedicine to a wide audience. Scientific jargon is avoided and advanced terms and concepts are explained from the ground up, whenever first introduced.\r\n\r\nThe book defines nanomedicine in a broad sense, including diagnostic devices such as DNA sequencing and molecular imaging, and new therapeutic options based on targeted drug delivery, regenerative medicine, immunotherapeutics, the creation of implanted devices such as continuous glucose monitors and deep brain stimulators, and even the 3D printing of new human organs. It also covers the returns of investment in global scientific projects, such as the Human Genome Project, and the historic and emerging importance of philanthropic foundations","torrent":{"xt":"urn:btih:2ec797b093e53dd0367dda213168fac62f15ceb7","amp;dn":"Nanomedicine+Science%2C+Business%2C+and+Impact","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec797b093e53dd0367dda213168fac62f15ceb7","infoHashBuffer":{"type":"Buffer","data":[46,199,151,176,147,229,61,208,54,125,218,33,49,104,250,198,47,21,206,183]},"announce":[],"urlList":[]}}