{"title":"Crash and Burn (Audiobook) By Artie Lange, Anthony Bozza 2013","uid":9165089,"size":471549290,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f536966d84aa4b94c1355c00bd1749fa6363a50&amp;dn=Crash+and+Burn+%28Audiobook%29+By+Artie+Lange%2C+Anthony+Bozza+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Alundra_B","files":14,"time":1383958694,"description":"Crash and Burn (Audiobook) By Artie Lange, Anthony Bozza, read by Sean Runnette\nUnabridged edition 2013 | 10 hours and 54 mins | ISBN: 145266806X | MP3 96 kbps | 450 MB\n\nAt a high point in his career, Artie Lange performed a sold-out show in Carnegie Hall-and he did it with a pocketful of heroin. In the midst of a deep, self-destructive depression, addicted to heroin, cocaine, and prescription drugs, he lashed out at everyone around him-from his cohosts on The Howard Stern Show to celebrity guests and even his longtime friends. Then came his legendary meltdown on-air, with 6 million people listening, after which Lange pulled himself together enough to go to a buddy's bachelor party in Amsterdam. He never made the party, but instead used the trip as an opportunity to hole up in his hotel room with a prostitute and do drugs.By turns dark and harrowing, hilarious and poignant, and always drop-dead honest, Crash and Burn is a blow-by-blow account of Lange's years of addiction, a suicide attempt (which he relates in terrifying detail), hitting rock bottom, stints in rehab, and painful relapses. With the help and support of friends and family, Lange manages to recover and get his life and career back on track. And despite his slip-ups, backslides, and permanent losses, Artie Lange forges on.From drugs to sports to falling in love, Lange tells all in Crash and Burn, the story of his life that is as shocking as it is funny, ever tempered by his characteristic humor, self-awareness, and inimitable way with words.","torrent":{"xt":"urn:btih:2f536966d84aa4b94c1355c00bd1749fa6363a50","amp;dn":"Crash+and+Burn+%28Audiobook%29+By+Artie+Lange%2C+Anthony+Bozza+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f536966d84aa4b94c1355c00bd1749fa6363a50","infoHashBuffer":{"type":"Buffer","data":[47,83,105,102,216,74,164,185,76,19,85,192,11,209,116,159,166,54,58,80]},"announce":[],"urlList":[]}}