{"title":"Incognito - Positivity 1993 (Acid Jazz) TQMP [FLAC]","uid":4390565,"size":437816189,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f833ff3bd12404f2913610a10680ed1ed740d61&amp;dn=Incognito+-+Positivity+1993+%28Acid+Jazz%29+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Breezin","files":20,"time":1221154084,"description":"Quote from Amazon.com\n\n&quot;Positivity&quot; a major plus-sign for British funk outfit, August 22, 2000 \nBy  John Jones &quot;Musician&quot; (Chicago IL)\nIn the early 90's a British funk group called The Brand New Heavies hired a singer named N'Dea Davenport and gave her four songs to sing on their self-titled debut. After three of her four tracks became smash hits, the group realized they had a star on their hands, and for the album's follow-up there were only three tracks she WASN'T featured on. Another British funk outfit, Incognito, had a similiar revelation with Maysa Leak, as her soulful vocals -particulary on a brilliant rendition of Stevie Wonder's &quot;Don't You Worry Bout a Thing&quot;- provided the only bright spots (and hit singles) for the group's otherwise spotty &quot;Tribes Vibes and Scribes&quot; album. For 1994's &quot;Positivity,&quot; a spotlight on Leak is the rule instead of the exception, and Incognito achieves greatness at last.\nWhat's most impressive about this record is the seamless blend of genres. The chords and progressions are often undeniably jazz, Maysa's vocals are of a classic soul variety (imagine a slightly subdued Chaka Khan), the rhythms keep the funk quotient high and the hooks are dying to create pop singles. The fusion is immediately noticeable on the album's opener, &quot;Step Into My Life,&quot; an energetic piece that manages to make its repeated scat as catchy as its worded chorus. &quot;Smiling Faces&quot; also incorporates something of a Latin-flavored samba element to its jazzy scatted-verse, sung-chorus formula. \n\nUpbeat rhythms are of the majority throughout the record, and the percussion-driven &quot;Givin it Up,&quot; the groove-heavy &quot;Do Right,&quot; and the Mica Paris-flavored title track beg to be danced to the most. The James Brown-ish &quot;Talkin Loud&quot; is a rousing funk number with a singable chorus, and the midtempo &quot;Still a Friend of Mine&quot; is another winner that finds Maysa trading soulful vocal runs with duet partner Marc Anthoni. Meanwhile, two instrumentals show off the band's impressive chops and musical unity: the hypnotic ballad &quot;Innervisions&quot; has just as many stunning chord progressions as it does killer solos, and the mercilessly upbeat &quot;Thinkin Bout Tomorrow&quot; utilizes Incognito's horn section to its fullest potential. The crowning moment, however, comes on the fluid ballad &quot;Deep Waters,&quot; which went on to become one of the band's biggest hits. The shuffling drum rhythms are classic Incognito, and a warm Rhodes keyboard and classy muted trumpet finish off the mood that Maysa's silky, enticing vocals sets in motion. This track makes for one of the finest moments in modern jazz. \n\nFollowing a handful of work that only skirted greatness, &quot;Positivity&quot; finds Incognito sure-footed on their artistic path, staking a claim as the Rufus of the 90's firmly, joyfully, and righteously.&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ee8c9c8b8b948780ae8287988bc08082&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)\n\n","torrent":{"xt":"urn:btih:2f833ff3bd12404f2913610a10680ed1ed740d61","amp;dn":"Incognito+-+Positivity+1993+%28Acid+Jazz%29+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f833ff3bd12404f2913610a10680ed1ed740d61","infoHashBuffer":{"type":"Buffer","data":[47,131,63,243,189,18,64,79,41,19,97,10,16,104,14,209,237,116,13,97]},"announce":[],"urlList":[]}}