{"title":"The Big Combo 1955 BrRip Avi Lee1001","uid":9826137,"size":1411252586,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fac050a78dd1f26da2bc5d413ceffc5a694e1e5&amp;dn=The+Big+Combo+1955+BrRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xultfoad","files":2,"time":1395781835,"description":"The Big Combo 1955 BrRip Avi Lee1001  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0047878/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0047878/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Big_Combo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Big_Combo&lt;/a&gt;\nPolice Lieutenant Leonard Diamond is determined to bring the notorious gangster boss Mr Brown to book. For Diamond, this is no longer work but a personal crusade against evil. The lieutenant's dedication to the case is strengthened when he falls for the gangster's mistress, Susan Lowell. In an act of foolhardy bravado, Diamond authorises a round up of Brown's gang members, but has to release them through lack of evidence. Just when all appears to be lost, Diamond learns about a missing woman named Alicia, who turns out to be Brown's wife. Convinced that Brown murdered Alicia, Diamond steps up his investigation, certain that he will soon find the evidence that will incriminate Brown and put him behind bars. Mr Brown is a resourceful man, however, and is not willing to go down without a fight... \n\nOne of the all-time classics in the film noir genre.\n\nThis tense and brutal film noir generated controversy at the time of its release but subsequently slipped off the radar. Even with budget restrictions and the lack of a major star however, The Big Combo remains a riveting thriller, notable for its stark appearance and censor-baiting sex and violence.\n\nThe story follows cop Leonard Diamond (Wilde) as he tries to gather enough evidence to convict mobster Mr Brown (Conte). The situation's complicated by the fact that this is Diamond's last chance to close the case, and by his obsession with Brown's girlfriend Susan (Wallace).\n\nBy 1955 director Joseph H Lewis was a dab hand at this sort of thing, having already directed dozens of low budget thrillers, among them Gun Crazy (aka Deadly Is The Female). Here, however, he goes for broke and a torture scene in which Fente (Van Cleef) blasts Diamond's ear with a hearing-aid still provokes an involuntary wince. Similarly striking is a provocative love scene between Mr Brown and Susan which, like so much of this cunning thriller, goes down a treat.\n\nThe film noir thrillers of this era were noted for their subtle erotic tension, but here the animal attraction between males and females is far more explicit. The sequences in which Cornel Wilde gets up close and personal with femme fatale Jean Wallace (luckily they were husband and wife at the time) have a flagrant sultry sensuality that, again, would have shocked contemporary audiences. And there is even the suggestion that two of the gun-toting gangsters have been carrying on a gay love affair. Could such a film really have been made in Hollywood in 1955? \n\nit's a dark night of several souls perfectly visualised in John Alton's extraordinary camerawork.\n\nVIDEO\nSize.... 1/31gb\nDuration.... 01:27:52\nCodec.... mp43\nFrame Width..... 1280\nFrame Height.... 720\nData Rate.... 2013kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:2fac050a78dd1f26da2bc5d413ceffc5a694e1e5","amp;dn":"The+Big+Combo+1955+BrRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fac050a78dd1f26da2bc5d413ceffc5a694e1e5","infoHashBuffer":{"type":"Buffer","data":[47,172,5,10,120,221,31,38,218,43,197,212,19,206,255,197,166,148,225,229]},"announce":[],"urlList":[]}}