{"title":"Steve Gerber: Howard The Duck # 1-33","uid":8613379,"size":206943566,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2fc0446b6dd5e201a9128abacff6fbcd7b6a5350&amp;dn=Steve+Gerber%3A+Howard+The+Duck+%23+1-33&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"fudoh101","files":33,"time":1372198244,"description":"*A series sadly overshaded by a misguided movie on which the less said the better*\n\nThe original 33 issues series published by Marvel 1976-1986\n\n\nHoward the Duck was created in 1973 by Steve Gerber and Val Mayerik in Adventure into Fear as a secondary character in that comic's Man-Thing feature.[3] He graduated to his own backup feature in Giant-Size Man-Thing, confronting such bizarre horror-parody characters as the Hellcow and the Man-Frog, before acquiring his own comic book title with Howard the Duck #1 in 1976.[4]\nGerber wrote 27 issues of the series (for the most part ditching the horror parodies), illustrated by a variety of artists, beginning with Frank Brunner. For Gerber, Howard was a flesh and blood duck and that, &quot;if Wile E. Coyote gets run over by a steamroller, the result is a pancake-flat coyote who can be expected to snap back to three dimensions within moments; if Howard gets run over by a steamroller, the result is blood on asphalt.&quot; Gene Colan became the regular penciller with issue #4. Gerber later said to Colan: &quot;There really was almost a telepathic connection there. I would see something in my mind, and that is what you would draw! I've never had that experience with another artist before or since.&quot;","torrent":{"xt":"urn:btih:2fc0446b6dd5e201a9128abacff6fbcd7b6a5350","amp;dn":"Steve+Gerber%3A+Howard+The+Duck+%23+1-33","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc0446b6dd5e201a9128abacff6fbcd7b6a5350","infoHashBuffer":{"type":"Buffer","data":[47,192,68,107,109,213,226,1,169,18,138,186,207,246,251,205,123,106,83,80]},"announce":[],"urlList":[]}}