{"title":"Rod Stewart - Time  (2013)  {FLAC} vtwin88cube","uid":8449798,"size":374515212,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:301303f0da948cd74ddb789e4928602061ea4b3b&amp;dn=Rod+Stewart+-+Time++%282013%29++%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1367970107,"description":"\n\n\nRod Stewart\nTime (2013)\n\n\n\n\n\nallmusic.com...\n\nOnce he became a superstar, Rod Stewart essentially gave up on songwriting because, let's face it, it's easier to play endless football and cavort with models. Every once in a while his muse returned, so he tried a little bit harder, such as in 1988 when he spun Bob Dylan's &quot;Forever Young&quot; into a song of his own, which wound up as the last hit single of his that he ever wrote. After that, he floated through the '90s before finding a comfortable groove as an old-fashioned crooner in the new millennium, spending no less than a full decade revisiting songs from the Great American Songbook. Authoring his memoir -- simply titled Rod: The Autobiography -- jostled something within the old boy and he picked up his guitar once again, writing songs about his past and present. Hearing that Stewart strapped on a guitar suggests that perhaps he's returned to the well-weathered folk-rock of his earliest solo albums and, certainly, parts of Time -- the 2013 album that has his greatest concentration of originals in a quarter decade -- flirt with folk. Appropriately, these are the songs where Rod is besotted with the past, offering what amounts to a capsule synopsis of his memoir on &quot;Can't Stop Me Now,&quot; revisiting his early pre-fame days as a busker on &quot;Brighton Beach,&quot; then telling us all to &quot;Love the life you live/Live the life you love,&quot; a sentiment that manages to not be the stickiest thing here thanks to a wealth of love songs to his third wife, Penny. Stewart's overwhelming devotion certainly seems sincere -- it's a common thread that ties Time to Rod: The Autobiography, which had a running theme of how he was saved by the love of a good woman -- but it's also quite drippy, not helped by his decision to thread in elements of the Vegas schmaltz of his Great American Songbook (&quot;Picture in a Frame&quot;) within what's essentially his revival of the glassy adult contemporary pulse of his Out of Order/Vagabond Heart days. At this point, after years of synthesized soft rock and glad-handed standards, this is a reflection of who Rod Stewart is in 2013: he is still a crowd-pleaser, still a bit of a sap, ready to romanticize days gone by but wanting to sound modern. As such, Time winds up a bit muddled, swinging from moments of genuine sweetness toward sharp saccharine, but even with all its flaws it's nice to hear Stewart engaged again, both as a writer and a singer. \n\n\nAudio Quality:\t\tFLAC (Lossless)\nAudiochecker:\t     \t93.83% CDDA\nLabel:\t\t\tCapitol\nCatalog:\t\t05099993478922\n\n\n\n\nAudio Info:\n\n01.She Makes Me Happy\n02.Can't Stop Me Now\n03.It's Over\n04.Brighton Beach\n05.Beautiful Morning\n06.Live The Life\n07.Finest Woman\n08.Time\n09.Picture In A Frame\n10.Sexual Religion\n11.Make Love To Me Tonight\n12.Pure Love\n\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n","torrent":{"xt":"urn:btih:301303f0da948cd74ddb789e4928602061ea4b3b","amp;dn":"Rod+Stewart+-+Time++%282013%29++%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301303f0da948cd74ddb789e4928602061ea4b3b","infoHashBuffer":{"type":"Buffer","data":[48,19,3,240,218,148,140,215,77,219,120,158,73,40,96,32,97,234,75,59]},"announce":[],"urlList":[]}}