{"title":"The Long Dark v1.66","uid":11600949,"size":552408529,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30bde3fb4cd310cf64f0fcf1e8e8364a82025b34&amp;dn=The+Long+Dark+v1.66&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bloodwize","files":-1,"time":1417306986,"description":"The Long Dark\n=============\nVersion:\tv1.66\nLanguage:\tEnglish\nPlatform:\tPC\nSource:\t\tSteam\n\n\nNOTE : *** If you like the game then please show your support to the developers and buy it. ***\n\nEnjoy,  ^_^\n-Bloodwizer\n\n\n----------------\n\n\nDESCRIPTION\n===========\nThe Long Dark is a thoughtful, exploration-survival experience that challenges solo players to think for themselves\nas they explore an expansive frozen wilderness. There are no zombies -- only you, the cold, and everything\nMother Nature can throw at you.\n\n\n----------------\n\n\nv.166 CHANGELIST\n================\nWOLF FIXES\n----------\n* Tuned bare-handed Wolf struggle to be more survivable (but still very challenging, as intended). \n* Tuned Wolf reaction to Campfires and Flares. The Campfire is now the most effective deterrent to Wolf attacks. \n* Addressed &quot;ambushing&quot; behaviour by ensuring Wolves cannot spawn near building entrances/exits. (Note that Wolves will still track you to a building exit and remain there for some time before returning to their &quot;Wander&quot; state, so entering/exiting a building in quick succession will not result in the Wolf despawning.) \n* Blood Loss now only begins after the Wolf Struggle ends. \n* Increased the radius of the Wolf territory around Coastal Townsite; this means the Wolves will wander around a larger radius around the Townsite, giving players more breathing room to explore. \n\nOTHER FIXES\n-----------\n* Fixed issue with achievements being unlocked from Main Menu \n* Fixed issue with clipping into Fishing Cabin after exit \n* Fixes for wolves sometimes ignoring the player \n* Fix for rare crash when using last match \n* Fish and Fishing-related gear items now spawn in certain containers \n* Introduced chance of &quot;Kill Shot&quot; when hitting wildlife in chest and neck \n* Container search times more randomized (generally shorter) \n* More vehicles added in Coastal Townsite, to provide shelter from roving Wolves \n* Fixed issue where sprained ankle status wasn't updating right away after taking Painkillers \n* Fixed issue with black polygons appearing in some interiors (only affected Mac); light shafts have now been re-enabled on Macs. \n* Fixed vertical line artifact on First Aid interface \n* Fixed several floating objects. \n* Fixed issue with Antibiotics and Painkillers not always stacking","torrent":{"xt":"urn:btih:30bde3fb4cd310cf64f0fcf1e8e8364a82025b34","amp;dn":"The+Long+Dark+v1.66","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30bde3fb4cd310cf64f0fcf1e8e8364a82025b34","infoHashBuffer":{"type":"Buffer","data":[48,189,227,251,76,211,16,207,100,240,252,241,232,232,54,74,130,2,91,52]},"announce":[],"urlList":[]}}