{"title":"POtHS - Area 51 Groom Lake J-Rod - Area 51 Whistle Blowers Tell ","uid":8713635,"size":8344697773,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:311bbbfc3e554f8679960d9881541cf23c3fec91&amp;dn=POtHS+-+Area+51+Groom+Lake+J-Rod+-+Area+51+Whistle+Blowers+Tell+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"POtHS11","files":-1,"time":1374287689,"description":"\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nArea 51 Groom Lake J-Rod\nArea 51 Whistle Blowers Tell All\n\n\n\n\nArea 51 Groom Lake J-Rod\nArea 51 Whistle Blowers Tell All\n\n\nPOtHS Comment: There are over 30 Videos from Whistle Blowers from Area 51..........DEMONS ARE NOT FALLEN ANGELS!!! Demons are the disembodied Spirits of The Nephilim. They want to enter your Body, but they must have your permission.\n\nINTRODUCTION\nA desert region sparsely populated with poisonous, spiny reptiles, insects, plant life, and for a short evolutionary period, the U-2 Dragon Ladies and the A-12 Archangels of THE ROADRUNNERS.\n\nPrompted by the Cold War era that began immediately after World War II, the CIA was given the task of developing strategic means of determining the military strength of its enemies. Kelly Johnson, an aircraft design and engineering genius running a special design team within the Lockheed Aircraft Company called the &quot;Skunk Works&quot; was asked to design the U-2 to gather intelligence on Soviet bomber and inter-continental ballistic missile bases in the Soviet Union.\n\nSeeking a place to test the U-2 in secret far from the prying eyes of would-be spies and the public, Johnson settled on Area 51, a remote site in the uninhabitable Nevada desert that had served the military as a remote place to test weapons for quite some time. Nellis Air Force Base, a few miles north of Atomic Test Las Vegas, and the AEC's (Atomic Energy Commission) Nevada Test Site (NTS) composed overU-2 1,300 square miles used to set off hundreds of atomic explosions during the early days of the Cold War. Tony LeVier, the pilot assigned by Johnson to find a suitable location, found several remote spots, but chose Groom Lake because of the mountainous perimeter it furnished a dry lake bed that would provide the ultimate runway. Located within Area 51 of the Nevada Test Site, the base came to be known simply as &quot;Area 51&quot;.\n\nNuclear tests from the 50's into the 60's caused several evacuations from Area 51. A bomb with the code-name HOOD, part of the 1957 Operation Plumbob, caused substantial damage at Watertown, the code-name for Area 51. Construction was completed by July 1955, and on the 24th the first U-2 prototype arrived from the Lockheed Skunk Works Headquarters in Burbank, California by a C-124 transport plane. On August 4 the U-2 made its first flight.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:311bbbfc3e554f8679960d9881541cf23c3fec91","amp;dn":"POtHS+-+Area+51+Groom+Lake+J-Rod+-+Area+51+Whistle+Blowers+Tell+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311bbbfc3e554f8679960d9881541cf23c3fec91","infoHashBuffer":{"type":"Buffer","data":[49,27,187,252,62,85,79,134,121,150,13,152,129,84,28,242,60,63,236,145]},"announce":[],"urlList":[]}}