{"title":"Amy Winehouse - Back To Black (Live Oxegen Festival 2008)","uid":4830080,"size":46944908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3195895e100df68a3d61a948685c5c16a7b7136e&amp;dn=Amy+Winehouse+-+Back+To+Black+%28Live+Oxegen+Festival+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"RosaMannen","files":1,"time":1239098966,"description":"Amy Jade Winehouse (born 14 September 1983is an English singer and songwriter, known for her eclectic mix of various musical genres including R&amp;B, soul, jazz, rock &amp; roll, and ska. Winehouse is best known for her soulful, powerful contralto vocals.\n\nWinehouse's 2003 debut album Frank was commercially and critically successful in her native Britain. It was nominated for the Mercury Prize. Her 2006 follow-up album Back to Black led to six Grammy Award nominations and five wins, tying the record for the most wins by a female artist in a single night, and made Winehouse the first British singer to win five Grammys, including three of the &quot;Big Four&quot;: Best New Artist, Record of the Year and Song of the Year. On 14 February 2007, she won a BRIT Award for Best British Female Artist; she had also been nominated for Best British Album. She has won the Ivor Novello Award three times, one in 2004 for Best Contemporary Song (musically and lyrically) for &quot;Stronger Than Me&quot;, one in 2007 for Best Contemporary Song for &quot;Rehab&quot;, and one in 2008 for Best Song Musically and Lyrically for &quot;Love Is a Losing Game&quot;, among other prestigious distinctions.\n\nWinehouse has received media attention apart from her singing. Her distinctive style has been the muse for fashion designers such as Karl Lagerfeld. The singer's problems with drug and alcohol addiction, as well as self-destructive behaviour, have become regular tabloid news since 2007. She and her husband, Blake Fielder-Civil, have been plagued by legal troubles that left him serving prison time and a subsequent pending divorce. In 2008, Winehouse faced a series of health complications that threatened both her life and her career.\n\nLive at Oxegen Festival, Ireland 2008.\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:3195895e100df68a3d61a948685c5c16a7b7136e","amp;dn":"Amy+Winehouse+-+Back+To+Black+%28Live+Oxegen+Festival+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3195895e100df68a3d61a948685c5c16a7b7136e","infoHashBuffer":{"type":"Buffer","data":[49,149,137,94,16,13,246,138,61,97,169,72,104,92,92,22,167,183,19,110]},"announce":[],"urlList":[]}}