{"title":"Imaging in Endocrinology- Pozzili [PDF] [StormRG]","uid":10707206,"size":150902688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31e6bf77b55ded1569b988a1458559faa1435f28&amp;dn=Imaging+in+Endocrinology-+Pozzili+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":2,"time":1407308059,"description":"Author: Paolo Pozzilli (Author), Andrea Lenzi (Author), Bart L. Clarke (Author), William F. Young Jr. (Author)\nHardcover: 248 pages\nPublisher: Wiley-Blackwell; 1 edition (January 7, 2014)\nLanguage: English\nISBN-10: 0470656271\nISBN-13: 978-0470656273\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nImaging in Endocrinology will provide endocrinologists and radiologists of all levels with an outstanding diagnostic imaging atlas to aid them in the diagnosis and management of all the major endocrine diseases they are likely to encounter.\n\nIn full colour throughout, the 300 high-quality images consist of CT scans, MRI, NMR and histopathology slides, and are arranged by each specific endocrine condition, resulting in a visually outstanding and easily accessible tool that guides the user through exactly what to look out for and provides a practical and extremely useful aid in helping them formulate a diagnosis. \n\nEvery major endocrine condition is covered in a specific section, including diseases of the thyroid, pituitary, reproductive and adrenal glands, the pancreas, bone metabolism problems, and the various forms of endocrine cancers. Each disease covered will offer a comparison of the normal findings so as to further assist in diagnosis. An accompanying website contains an online slide-atlas of all the figures in the book, to allow users to download all figures for use in presentations.\n\nLed by Paolo Pozzilli, an internationally-recognised expert in this field, the authors have assembled a wonderful collection of images that will be greatly valued by endocrinologists and radiologists alike, ensuring this is the perfect tool to consult when assessing patients with endocrine disease.","torrent":{"xt":"urn:btih:31e6bf77b55ded1569b988a1458559faa1435f28","amp;dn":"Imaging+in+Endocrinology-+Pozzili+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31e6bf77b55ded1569b988a1458559faa1435f28","infoHashBuffer":{"type":"Buffer","data":[49,230,191,119,181,93,237,21,105,185,136,161,69,133,89,250,161,67,95,40]},"announce":[],"urlList":[]}}