{"title":"FonePaw Mobile Transfer 1.3.0 Multilingual.Final","uid":15912773,"size":57392328,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:324d653fc14d7878fa1a21e4ceab3bdec83d4740&amp;dn=FonePaw+Mobile+Transfer+1.3.0+Multilingual.Final&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":null,"files":3,"time":1475131396,"description":"Transfer files from one phone to another couldn't be easier with FonePaw Mobile Transfer. Simply open FonePaw Mobile Transfer, connect both the phones to your computer and click Start Transfer. Phone numbers, photos, songs, videos and other media files are moved to your new phone. It's safe and risk-free, and all content it transfers is 100% the same as the original one.\r\nSupport Multiple and Latest iOS &amp; Android\r\nFonePaw Mobile Transfer is fully compatible with iTunes 12.1, iOS 8.3, and Android 5.0 Lollipop. Also,The latest iPhone 6/6 Plus, iPad Air 2/mini 3, Samsung Galaxy S6/S5, Note Edge/4/3, HTC One series, LG G3, Huawei Ascend Mate 7, Sony Xperia Z3, etc. are all supported.\r\n\r\nTransfer Your Contents between iOS and Android Device\r\nFonePaw Mobile Transfer makes it extremely easy to copy contacts, videos, music, photos, audio and more from your old phone to the new one without any data loss. No more hassle with transferring data to your new phone.\r\n\r\nContacts\r\nFonePaw Mobile Transfer makes comprehensive contact copy. Names, numbers job title, email addresses, company name, etc. can be all transferred to another phone.\r\n\r\nPhotos\r\nFonePaw Mobile Transfer is capable of transferring pictures that took by phone camera, imported from computer, and received by people from iOS to Android, Android to iOS, iOS to iOS and Android to Android.\r\n\r\nMedia\r\nTransfer Music, Movies, TV Shows, Music Videos, Podcasts, iTunes U, Ringtones, Audio Books and Voice Memos between iOS device. Move songs and videos from iPhone to Android or from Android to iPhone.\r\n\r\nOthers\r\nTransferring text messages, calendar, call logs and apps from phone to phone is coming. You shouldn't have to wait too much longer.\r\n\r\nenjoy","torrent":{"xt":"urn:btih:324d653fc14d7878fa1a21e4ceab3bdec83d4740","amp;dn":"FonePaw+Mobile+Transfer+1.3.0+Multilingual.Final","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"324d653fc14d7878fa1a21e4ceab3bdec83d4740","infoHashBuffer":{"type":"Buffer","data":[50,77,101,63,193,77,120,120,250,26,33,228,206,171,59,222,200,61,71,64]},"announce":[],"urlList":[]}}