{"title":"The Trachtenberg Speed System of Basic Mathematics","uid":5723217,"size":4211129,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32755d51b2beeb7c97289c6266645f7cd9136bc1&amp;dn=The+Trachtenberg+Speed+System+of+Basic+Mathematics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Djofullinn","files":1,"time":1280360490,"description":"The complete system of the Trachtenberg method of mathematics which makes possible high-speed arithmetical calculations with a remarkable degree of accuracy. \n\nThe book is a collection of techniques for carrying out arithmetic operations mentally according to Jakow Trachtenberg's system.\n\nThe Trachtenberg system for speed math is essentially the techniques taught in Vedic mathematics -- re-discovered. The bottom line is that using these simple techniques that require no special efforts you can multiply 20 digit numbers in your head and just jot down the answer, take square roots to any number of decimal places, and carry out similar math wizardry.\n\nIS THIS POSSIBLE??\n\nSure it is. It's been done for thousands of years by the Indians. Some of the techniques have been re-invented, re-engineered and re-introduced by a Russian Engineer -- Jakow Trachtenberg.\n\nHOW DOES IT WORK?\n\nThe basic idea behind ALL these tricks is to re-arrange the &quot;normal&quot; methods of calculation taught in school so that:\n\n- You calculate the digits of the final result one at a time.\n\n- You only calculate just enough information to enable you to come by the next digit of the result, and continue the computation from there.\n\nAs surprising as it may seem, discovering these techniques requires nothing beyond simple high school algebra. Even that much isn't needed in order to learn to follow these techniques.\n\nIf you're a math buff, if you like to play with numbers, this could be a fun book for you. The book paces itself slowly, introducing general techniques only by the middle of the book. There are plenty of worked out exercises too. When you'll be done, you'll wonder why you hadn't invented these techniques yourself; They're that simple! \n &lt;a href=&quot;\nhttp://www.amazon.com/Trachtenberg-Speed-System-Basic-Mathematics/dp/0313232008/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1280352039&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Trachtenberg-Speed-System-Basic-Mathematics/dp/0313232008/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1280352039&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:32755d51b2beeb7c97289c6266645f7cd9136bc1","amp;dn":"The+Trachtenberg+Speed+System+of+Basic+Mathematics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32755d51b2beeb7c97289c6266645f7cd9136bc1","infoHashBuffer":{"type":"Buffer","data":[50,117,93,81,178,190,235,124,151,40,156,98,102,100,95,124,217,19,107,193]},"announce":[],"urlList":[]}}