{"title":"Rocco's Psycho Teens 6 (NEW 2013 Evil Angel) [DVDRip]","uid":9165871,"size":2416651890,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:32b024971d47aa4bfb5e506b7d4b322611f11e41&amp;dn=Rocco%27s+Psycho+Teens+6+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"chkm8te","files":1,"time":1383978883,"description":"Rocco's Psycho Teens 6 (NEW 2013 Evil Angel) [DVDRip]\n\nSabby, Alice, Candy Sweet, Lolly Pop, Rocco Siffredi, Yanick Shaft, Jalace, Marcus, April Blue, Mr Clark, Matt Bird, Vittoria Risi, Anita Bellini, Gina Gerson, Tito, Koko De Mal\n\nI always put real teens and real passion in my scenes - I hate to put ponytails in the girls' hair just to make them look like real teens. I search for real teens and work to pull out their psycho parts; we all have them. All the scenes ere are different and alot of fun.' - Rocco Siffredi\n\nPorn superstud/suave international director Rocco Siffredi knows how to handle the moods and eccentricities of beautiful, young girls. And in the new 'Rocco's Psycho Teens 6,' the infamous Italian ladies' man has his hands full! The spunky little princesses in this crazy European fuckfest are nothing but trouble... the good kind! Petite schoolgirl Gina Gerson and sultry, shorthaired teen Koko De Mal get defiled by Rocco in a threesome that includes ass rimming and climaxes in a cum-flavored lesbian kiss!\n\nBusty, glamorous boss lady Vittoria Risi tours a construction site with foreman Omar Galanti as little, blonde Alice flirts with the hunky laborers. Alice orally services the muscular laborers; after a cocksucking free-for-all, a nasty private anal party culminates with big-boobed Vittoria lapping splooge from Alice's pretty feet. Sexy teen Candy Sweet fools around in the director's workshop - getting her juicy pussy fingered by horny Titoo - as gorgeous schoolgirls Anita Bellini and Jalace seduce Yanick Shaft, taking the older man's giant pole up their tiny asses and slurping his greasy shaft ass-to-mouth. After fight with boyfriend Marcus over his attentions for a younger girl, tanned, leggy, big-assed April Blue makes amends by blowing his prick and grinding on his face in a lewd 69. She even invites the voyeuristic teenager, pale Lolly Pop, to join them, so Marcus relentlessly rams both young beauties before dumping his creamy, messy load into April's open mouth. 'Rocco's Psycho Teens 6' is the next generation of perverse insanity!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=cns8opvezsngnhtpwzw1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=cns8opvezsngnhtpwzw1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=msroy1dvwpboj5r5k5kr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=msroy1dvwpboj5r5k5kr.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:32b024971d47aa4bfb5e506b7d4b322611f11e41","amp;dn":"Rocco%27s+Psycho+Teens+6+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32b024971d47aa4bfb5e506b7d4b322611f11e41","infoHashBuffer":{"type":"Buffer","data":[50,176,36,151,29,71,170,75,251,94,80,107,125,75,50,38,17,241,30,65]},"announce":[],"urlList":[]}}