{"title":"Real Player 11 Plus Gold (July 9, 2008)","uid":4284469,"size":13691811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:32cc8ff079e24355785aa757eb9eb82c0460adb4&amp;dn=Real+Player+11+Plus+Gold+%28July+9%2C+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"scribe28","files":3,"time":1215603592,"description":"Video Features\n \nTransfer web videos to your iPod\nTransfer your favorite videos from thousands of Internet sites to your iPod with a single click. Then watch them wherever and whenever you want.\n\n(RealPlayer Plus supports video transfer to video-capable iPod Nano and iPod Classic devices.) Please note RealPlayer does not currently support iPhone or iPod touch.\nVideo Recording\nSee it now or see it later. Download video in its original quality with a single click, or record live streams from the web. And you can download virtually all video formats, making it easy to watch content offline, build a personal video library or burn a CD for later viewing.\n \nDVD Burning\nAll that?s missing is the popcorn. Easily burn your favourite video, photos and movies to a disc to view on yout TV, laptop, PC - anywhere you can play a DVD.\nLivePause &amp; PerfectPlay\nControl your streams. Pause, rewind and fast-forward through live audio or video clips while they play. Create your own sports instant replay!\nUniversal Player\nFrom .AIFF to .X-STREAM, RealPlayer has never met a file type it didn?t like. Now, the same Player that handles your streaming media and downloaded QuickTime, Windows Media or MPEG audio/video files can also play your DVDs, VCDs and store-bought or home-made CD-ROMS. Finally, digital media has become more manageable.\nHigh Quality Video\nNew RealVideo 10? delivers superior video quality over any type of Internet connection - from narrowband to broadband. View and download DVD quality video starting at 500kbps.\nTurboPlay\nNo more waiting for clips to load! New TurboPlay improves streaming so your clips load faster, start quicker and play smoother over all types of connections - from dialup to high-speed broadband.\n \nAdvanced Video Controls\nAdjust your viewer just like a TV set for amazing picture quality. Handy sliders let you tweak your video controls for brightness, contrast, sharpness, hue, etc. Remembers your settings.\nAudio Features\nRealAudio Lossless Format\nOur new format allows you to burn professional-quality CDs using only half the disk space of the standard CD audio format (WAV)\n \nAdvanced CD burning\nThe simplicity of using 1-2-3-Burn to create your own CDs conceals some powerful options. Like the ability to normalize volume across all CD song tracks, set up cross fades, and even take out the gaps between audio tracks.\n \nAnalog Recording\nMigrating your vinyl or cassette collection to the digital world, or recording your own voice for narration or a quick audio message, taps RealPlayer?s capacity for Analog Recording, another valuable tool for transporting you and your media into the digital future/domain.\nMultiple Audio Formats\nRealPlayer supports all the latest formats, including audio CD, MP3, MPEG, Sony Memory Stick and many more.\nMulti-Channel Stereo Sound\nBump it up! Enjoy 5-channel audio plus a dedicated sub-woofer channel for streaming or playback through your sound system.\n \n10-Band Graphic EQ\nTake control of your music. Optimize your sound exactly the way you like it with this sweet graphic equalizer. Adjust your EQ for room size, input type, etc.\nHigh Bitrate Encoding\nAn audio lover?s dream! Mix, burn and rip CDs and MP3s at up to 320kbps for ultra-high quality.\n \nCrossfade\nRelease your inner deejay and get jiggy with it! Crossfade between songs and add reverb to give your mixes a professional par-tay sound.\nVisualizations\nMusic that looks as cool as it sounds! See the patterns your music makes on the screen with hundreds of colorful, cutting-edge animations from some of the Web?s hottest designers.\nAlbum Info\nDisplays handy reference info about the album or clips you?ve selected. Automatically loads info from CDs or streaming clips. Keep track of lyrics and other details about your clips.\nPortable Device\nTake your music with you! Download clips to your favorite portable digital music devices. Compatible with MP3, Sony Memory Stick, Palm, Nomad Zen, iPod and other formats. ","torrent":{"xt":"urn:btih:32cc8ff079e24355785aa757eb9eb82c0460adb4","amp;dn":"Real+Player+11+Plus+Gold+%28July+9%2C+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32cc8ff079e24355785aa757eb9eb82c0460adb4","infoHashBuffer":{"type":"Buffer","data":[50,204,143,240,121,226,67,85,120,90,167,87,235,158,184,44,4,96,173,180]},"announce":[],"urlList":[]}}