{"title":"Amnesia: A Machine for Pigs (2.0.0.3) GOG","uid":8902015,"size":2322545226,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:335d778a64efaa5c27fba0c4ff9248af9f4792f8&amp;dn=Amnesia%3A+A+Machine+for+Pigs+%282.0.0.3%29+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":13,"time":1378826161,"description":"genre adventure / fpp / horror\ndownload size 2.2 GB\nrelease date September 10, 2013\ncompatible with Windows (XP, Vista, 7, 8)\nlanguages Voice and text: English. Text only: Portuguese, Czech, French, German, Hungarian, Italian, Polish, Russian and Spanish.\ndeveloper / publisher The Chinese Room / Frictional Games\ngame modes single-player\n\nBonus content included :\nwallpaper\n9 concept arts\n\nWhat's cool about it:\n\nUnique game created in collaboration between two independent game companies famous for exploring the outer reaches of what games can be.\nFresh and new approach to the Amnesia world while staying true to its origins.\nUnique physics interaction that has been developed and improved since 2005.\nExceptional artwork and environments that run on low system specifications.\nThe darkest, most horrific tale ever told in a videogame.\nStunning soundtrack by award-winning composer Jessica Curry.\n\nOverview:\n\nThe Swine are Rising!\nIn 2010 Frictional Games terrified the world with the cult horror Amnesia: A Dark Descent. Now they bring you a new nightmare. Created in collaboration with The Chinese Room, the studio behind Dear Esther, Amnesia: A Machine for Pigs is an intense and terrifying journey into the heart of darkness that lurks within us all.\n\nThe year is 1899\nWealthy industrialist Oswald Mandus awakes in his bed, wracked with fever and haunted by dreams of a dark and hellish engine. Tortured by visions of a disastrous expedition to Mexico, broken on the failing dreams of an industrial utopia, wracked with guilt and tropical disease, he wakes into a nightmare. The house is silent, the ground beneath him shaking at the will of some infernal machine: all he knows is that his children are in grave peril, and it is up to him to save them.\n\nStep back into the horror\nLike The Dark Descent, this is a game driven by its story, exploration of the world and the constant fear of the unknown. You can expect classic Amnesia gameplay, physics interaction and the signature blend of high-end gaming with low system requirements.\n\nThink you understand fear? Think again.\nA Machine for Pigs takes both the world of Amnesia and the technology of The Dark Descent to new heights of horror. Built using an updated version of HPL2 engine, the game features stunning visual and environment design, incredible music and audio effects and adapted artificial intelligence. These are all driven by a gut-wrenching, blood-curdling new story, set sixty years after the events of the original game.\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 2.0 Ghz core i5 CPU Processor or equivalent., 2 GB RAM, Graphics: NVIDIA GeForce 3x0 / ATI Radeon HD 5x00 , 5 GB HDD, Mouse, Keyboard. Compatibility notice (PC): Integrated Intel HD Graphics should work but is not supported; problems are generally solved with a driver update.\n\nInstall and Play ","torrent":{"xt":"urn:btih:335d778a64efaa5c27fba0c4ff9248af9f4792f8","amp;dn":"Amnesia%3A+A+Machine+for+Pigs+%282.0.0.3%29+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"335d778a64efaa5c27fba0c4ff9248af9f4792f8","infoHashBuffer":{"type":"Buffer","data":[51,93,119,138,100,239,170,92,39,251,160,196,255,146,72,175,159,71,146,248]},"announce":[],"urlList":[]}}