{"title":"Eric Steven Raymond - The Art of Unix Programming","uid":3595598,"size":3773608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:337afe7724e0860b23d09abc216a6d3dd8ab2238&amp;dn=Eric+Steven+Raymond+-+The+Art+of+Unix+Programming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zvonSully","files":196,"time":1168740072,"description":"The Art of Unix Programming\n  by Eric Steven Raymond\n\nYou should read this book if you are an experienced Unix programmer who is often in the position of either educating novice programmers or debating partisans of other operating systems, and you find it hard to articulate the benefits of the Unix approach.\nYou should read this book if you are a C, C++, or Java programmer with experience on other operating systems and you are about to start a Unix-based project.\nYou should read this book if you are a Unix user with novice-level up to middle-level skills in the operating system, but little development experience, and want to learn how to design software effectively under Unix.\nYou should read this book if you are a non-Unix programmer who has figured out that the Unix tradition might have something to teach you. We believe you&amp;#039;re right, and that the Unix philosophy can be exported to other operating systems. So we will pay more attention to non-Unix environments (especially Microsoft operating systems) than is usual in a Unix book; and when tools and case studies are portable, we say so.\nYou should read this book if you are an application architect considering platforms or implementation strategies for a major general-market or vertical application. It will help you understand the strengths of Unix as a development platform, and of the Unix tradition of open source as a development method.\n\navailable on-line on home page http://www.faqs.org/docs/artu/","torrent":{"xt":"urn:btih:337afe7724e0860b23d09abc216a6d3dd8ab2238","amp;dn":"Eric+Steven+Raymond+-+The+Art+of+Unix+Programming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"337afe7724e0860b23d09abc216a6d3dd8ab2238","infoHashBuffer":{"type":"Buffer","data":[51,122,254,119,36,224,134,11,35,208,154,188,33,106,109,61,216,171,34,56]},"announce":[],"urlList":[]}}