{"title":"Process Lasso 8.4.0.2 + Portable (BRD)","uid":12099378,"size":11448881,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:33aabfc79ab7df31f0b898bce988902438e5fa82&amp;dn=Process+Lasso+8.4.0.2+%2B+Portable+%28BRD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jovo_bih","files":1,"time":1436260405,"description":"-------------------------------------\nRelease date: 07/07/2015\n-------------------------------------\n\nProcess Lasso is NOT yet another task manager. It is a process priority optimization and system automation utility. Priority optimization, affinity optimization, core optimization, automated rules, automated power profiles; you name it, and Process Lasso does it!\n\nProcess Lasso's most popular feature is the unique process optimization technology called ProBalance (Process Balance) that will improve your PC's responsiveness and stability by making intelligent dynamic adjustments to the priority class of background processes. Windows, by design, allows programs to monopolize your CPU without sufficient restraint -- leading to hangs, micro-lags, and delays in your keystroke or mouse actions. ProBalance intelligently adjusts process priorities so that badly behaved processes won't negatively impact the responsiveness of your PC.\n\nProcess Lasso, and it's ProBalance algorithm, are as usual and efficacious for new PCs as they are for old PCs, especially since the speed of processors hasn't been increasing a lot in recent years, replaced instead by increased parallelism (more cores). In fact, a strong argument can be made that Process Lasso is now more useful and efficacious than ever!\n\nIn addition to ProBalance, there are countless features allowing the user to take full automated control of the processes on their PC. You can have a wide range operations performed, or settings applied, each time a process is run. Core optimization technologies allow you to choose on what CPUs/cores a process should run, as well as what their CPU priority class and I/O priority class should be. You can also disallow specified processes from running, log all processes run, and set various other process rules.\n\n----------------------\nGeneral PC Optimization\n----------------------\t\n\n- ProBalance retains system responsiveness during high loads by dynamic process priority and/or CPU affinity adjustments\n- Gaming Mode with Bitsum Highest Performance power plan - the next generation of this technology\n- SmartTrim - The first intelligent RAM optimizer - new\n\n---------\nProcess Settings Automation\n---------\n\n- Persistent (saved) CPU, memory, and I/O priorities, CPU affinities, and other process settings\n- Disallowed processes, terminate problematic processes every time they are seen running\n- Limit per-process CPU use by default CPU affinities\n- Instance limits, limit the number of instances a process may have per user session, or for the whole PC\n- Restart selected processes if they terminate, crash, or are closed\n- Watchdog allows custom rules. When processes go over a CPU or virtual memory threshold, one can execute a command, change their CPU affinity, process priority class, I/O priority, trim the working set, log the occurrence, and more!\n- Hyper-Threaded core avoidance\n\n-------------------\nPower Profile Automation\n-------------------\n\n- IdleSaver - Run at maximum performance while active, but conserve energy when idle.\n- Application Power Profiles - switch power profiles when given applications are running. For instance, switch to 'High Performance' when you start a game\n- Anti-Sleep - Keep the PC and/or display awake when specified processes are running\n\n-------------------\nOther\n-------------------\n\n- Unique System Responsiveness calculation - Accurately shows responsiveness of your by percentage, based on real-time latency in the Windows user interface.\n- Stand-alone core engine that can run as a system service\n- Designed for multi-user environments\n- Control core parking, and visualize parked CPUs in real-time\n- Minimal resource use and totally optional GUI that goes into a sleep-mode when minimized to the tray\n- Log of processes launched, and statistics on process duration and average CPU use when they exit\n- Silent installer with command line switches for easy deployment\n- Optional password protection on configuration\n- Select and act on multiple processes at once\n- Expansive command line support for unattended (silent) installation and custom configurations\n- Great for Audiophiles\n- Automated updates\n- Localized to Chinese (Traditional and Simplified), German, French, Polish, Finnish, Italian, Japanese, Serbian, PTBR, and more!\n- Compatible with Windows XP, Vista, 7, 8, and Windows 10\n\n----------------------------------\nHomepage: https://bitsum.com/processlasso/\nFile: Process Lasso 8.4.0.2.rar\nSize: 10.9 MB","torrent":{"xt":"urn:btih:33aabfc79ab7df31f0b898bce988902438e5fa82","amp;dn":"Process+Lasso+8.4.0.2+%2B+Portable+%28BRD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33aabfc79ab7df31f0b898bce988902438e5fa82","infoHashBuffer":{"type":"Buffer","data":[51,170,191,199,154,183,223,49,240,184,152,188,233,136,144,36,56,229,250,130]},"announce":[],"urlList":[]}}