{"title":"[TabooHandJobs / Clips4Sale] Lexi Belle (Bratty sister jerks off","uid":13577020,"size":185330475,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:34b7976999027beb37eb021fc780574fffc11681&amp;dn=%5BTabooHandJobs+%2F+Clips4Sale%5D+Lexi+Belle+%28Bratty+sister+jerks+off&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1455721685,"description":"[TabooHandJobs / Clips4Sale] Lexi Belle (Bratty sister jerks off her step brother) 720p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kyw\r\n \nhttp://imgsnaps.com/image/kyr\r\n\r\nEvery weekend my step-dad leaves my step-brother and I treats. He has done this for as long as I can remember. This week he brought home two beautiful cupcakes from a nearby bakery. I couldn't resist bringing them both to my room and scarfing them down before my brother found out. Oops! ... He found out as I was halfway into my yummy red velvet cake and pretty much done with his lemon chiffon. I offered him the crumbs and maybe a taste of my cake, or not. I didn't owe him anything because I had something on him. I knew something that would get him in much more trouble than me eating his weekend treat. I know he watches me when I shower. He probably touches himself while he peeks through the door. If our parents knew he spied on me and touched himself while thinking perverted thoughts of me, he would be on lock down for weeks so that's why I had no problem eating his cupcake plus mine today.\r\n\r\nI'm already a few steps ahead of him in anything that goes on in our house plus I let him know I could rub him out better than he ever could. I'm sure he has soiled plenty a tissue at the thought of my tight little body. I wanted to see just how hard his cock gets for me. If I stroke him off then it fulfills one of his fantasies and lets him know once again, whatever he does I can do better. He wasted no time in lying down on my bed to get jerked off by his sister. I grabbed a hold of his dick as if it were my own and started cranking, using my cupcake-sweetened saliva as lube. Not only did I cover his cock with my sweet spit, I stripped from my clothes and climbed on his body to show him all that he wanted to see without having to spy on me in the bathroom. I slid my pussy right up close to his swollen testicles and stiff shaft as I continued to tell him how naughty we were being with each other. I teased him about how easy it would be to slip his dick inside my little wet slit. I stroked him super fast and then nice and slow, he was in my complete control and I liked it. He was quivering as I blew cold air on the tip of his dick and teased the soft ridge. I could sense he was reaching explosion so I grabbed on tight and jacked him off so hard like his dick owed me money. He had a few post cum convulsions and I let him know he didn't have to sneak around and spy on me anymore, all he has to do is ask and I will show him whatever he wants to see, including the inside of my pretty pink pussy. All he has to do is ask","torrent":{"xt":"urn:btih:34b7976999027beb37eb021fc780574fffc11681","amp;dn":"%5BTabooHandJobs+%2F+Clips4Sale%5D+Lexi+Belle+%28Bratty+sister+jerks+off","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34b7976999027beb37eb021fc780574fffc11681","infoHashBuffer":{"type":"Buffer","data":[52,183,151,105,153,2,123,235,55,235,2,31,199,128,87,79,255,193,22,129]},"announce":[],"urlList":[]}}