{"title":"Coast To Coast AM 11-02-2014 - Bushman's Area 51 Secrets - NDE R","uid":11372696,"size":55286492,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:34d380fc2bb26b8e5151793a10836aed0ce187f6&amp;dn=Coast+To+Coast+AM+11-02-2014+-+Bushman%27s+Area+51+Secrets+-+NDE+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Isaac09","files":-1,"time":1415106364,"description":"Bushman's Area 51 Secrets/ NDE Research\n\nDate:\t11-02-14\nHost:\tGeorge Noory\nGuests:\tDavid B. Sereda, P. M. H. Atwater\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 33mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 52.4 MiB (99%)\n\nIn the first half, scientist, filmmaker, and spiritual explorer David Sereda spoke about his friendship with the late Lockheed engineer Boyd Bushman, who made controversial claims about aliens and UFOs at Area 51 before his death. Bushman had been a Lockheed Martin Senior Scientist for 20+ years and was said to develop advanced beam weapons, a Tesla-styled 'Death Ray,' and advanced propulsion concepts. He also worked for McDonald Douglas, Texas Instruments, and Howard Hughes, said Sereda. In fact, Bushman told him (Sereda interviewed him extensively in 2007 for an as yet unreleased video documentary) that Hughes relocated to Las Vegas so he could track activity at Area 51 related to recovered UFOs and reverse engineering.\n\nBushman alleged he had true photographs of the preserved alien from Roswell (see comparison photos), and Sereda concluded there was possibly some authenticity to his claims, as the face in the Bushman photo contained unique irregularities, while the knock-off dolls, sold at places like K-mart, could have been part of a smear or disinformation campaign to discredit the actual photo. Further, Sereda suggested that the alien body was likely preserved with chemicals and plastics, creating the effect of the darkened eyes and rings around them, as fluid was lost from the body.\n\n------------------------------------\nIn the latter half, near-death experience researcher for over 30 years, PMH Atwater discussed various accounts of NDEs, including those who reported contact with God or an all-encompassing sense of oneness during their encounters. One such person was Walter Russell who had his first NDE at the age of 7, and a number of them after that. He went into an incredible light for a period of around one month, and later, he gradually recalled the experiences for books such as The Universal One, in which he explains that the universe is all propelled by thought.\n\nPeople who have NDEs return with a number of after effects, said Atwater. These include changes in brain structure and function, changes in the nervous and digestion system, increased sensitivity to light and sound, and a lowered tolerance to pharmaceutical dosages. Interestingly, she noted that the NDE experience of going through a tunnel (before they get to the light), is more of a media myth, and actually occurs in just a small percentage of cases. Also, most NDE cases are not related to surgery or a hospitalization, she added.\n\nNews segment guests: Christian Wilde, Jerome Corsi\n\nWebsite(s):\ndavidsereda.net\npmhatwater.com\nBook(s):\nDying to Know You\nNear Death Experiences: The Rest of the Story","torrent":{"xt":"urn:btih:34d380fc2bb26b8e5151793a10836aed0ce187f6","amp;dn":"Coast+To+Coast+AM+11-02-2014+-+Bushman%27s+Area+51+Secrets+-+NDE+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d380fc2bb26b8e5151793a10836aed0ce187f6","infoHashBuffer":{"type":"Buffer","data":[52,211,128,252,43,178,107,142,81,81,121,58,16,131,106,237,12,225,135,246]},"announce":[],"urlList":[]}}