{"title":"The Complete Sherlock Holmes Canon - Sir Arthur Conan Doyle","uid":12051555,"size":5225287528,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3504013123a3e8db27e996fa905f218b4d21e7fd&amp;dn=The+Complete+Sherlock+Holmes+Canon+-+Sir+Arthur+Conan+Doyle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"prettyrandom","files":93,"time":1435005788,"description":"\nThe Complete Sherlock Holmes Canon by Sir Arthur Canon Doyle\n\nThe unabridged audiobooks are performed by Sir Derek Jacobi.\n\nAlso included is 'The House of Silk', the official new Sherlock Holmes novel by Anthony Horowitz.\n\nAll the audiobooks are ripped by me from CDs using Exact Audio Copy and are in the m4b audiobook format with iTunes compatible chapters.\n\nThe BBC Radio dramas star Clive Merrison as Holmes &amp; Michael Williams as Watson. They are also ripped by me from CDs using Exact Audio Copy and are variable bitrate mp3s. The only exception being the 'Hound of the Baskervilles'.\n\nThe BBC reversioned the CDs of Baskervilles into a movie length drama, rather than its original two episodes. This annoyed me so much that I reconstructed the two part format by combining my CD rip with an off-air recording of the episodes from digital radio. The digital radio portions are the first and last three minutes of episode one and the first four minutes of episode two. In my opinion the difference in sound quality for those portions is negligible.\n\nAlso included is 'The Further Adventures of Sherlock Holmes' by Bert Coules starring Clive Merrison as Holmes &amp; Andrew Sachs as Watson, also ripped from CDs with EAC.\n\nHere is the complete list:\n\nUnabridged Audiobooks read by Sir Derek Jacobi,\n\n1887 A Study in Scarlet by Sir Arthur Canon Doyle\n\n1890 The Sign of the Four by Sir Arthur Canon Doyle\n\n1892 The Adventures of Sherlock Holmes by Sir Arthur Canon Doyle\n\n1893 The Memoirs of Sherlock Holmes by Sir Arthur Canon Doyle\n\n1902 The Hound of the Baskervilles by Sir Arthur Canon Doyle\n\n1904 The Return of Sherlock Holmes by Sir Arthur Canon Doyle\n\n1915 The Valley of Fear by Sir Arthur Canon Doyle\n\n1917 Sherlock Holmes His Last Bow by Sir Arthur Canon Doyle\n\n1927 The Casebook of Sherlock Holmes by Sir Arthur Canon Doyle\n\n2011 The House of Silk by Anthony Horowitz\n\nBBC Radio Dramas,\n\n1887 A Study in Scarlet - Two Episodes\n\n1890 The Sign of the Four - Two Episodes\n\n1892 The Adventures of Sherlock Holmes - Twelve Episodes\n\n1893 The Memoirs of Sherlock Holmes - Eleven Episodes\n\n1902 The Hound of the Baskervilles - Two Episodes\n\n1904 The Return of Sherlock Holmes - Thirteen Episodes\n\n1915 The Valley of Fear - Two Episodes\n\n1917 Sherlock Holmes His Last Bow - Eight Episodes\n\n1927 The Casebook of Sherlock Holmes - Twelve Episodes\n\n2002 - 2010 The Further Adventures of Sherlock Holmes - Sixteen Episodes","torrent":{"xt":"urn:btih:3504013123a3e8db27e996fa905f218b4d21e7fd","amp;dn":"The+Complete+Sherlock+Holmes+Canon+-+Sir+Arthur+Conan+Doyle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3504013123a3e8db27e996fa905f218b4d21e7fd","infoHashBuffer":{"type":"Buffer","data":[53,4,1,49,35,163,232,219,39,233,150,250,144,95,33,139,77,33,231,253]},"announce":[],"urlList":[]}}