{"title":"Hacking - The Art of Exploitation 2nd Edition - [UA-07]","uid":7979308,"size":754911578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:351f69a777347d07f07174a184f1308f2401bc90&amp;dn=Hacking+-+The+Art+of+Exploitation+2nd+Edition+-+%5BUA-07%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"UA-07","files":4,"time":1357126261,"description":"Hacking is the art of creative problem solving, whether that means finding an unconventional solution to a difficult problem or exploiting holes in sloppy programming. Many people call themselves hackers, but few have the strong technical foundation needed to really push the envelope.\n\nRather than merely showing how to run existing exploits, author Jon Erickson explains how arcane hacking techniques actually work. To share the art and science of hacking in a way that is accessible to everyone, Hacking: The Art of Exploitation, 2nd Edition introduces the fundamentals of C programming from a hacker's perspective.\n\nThe included LiveCD provides a complete Linux programming and debugging environment-all without modifying your current operating system. Use it to follow along with the book's examples as you fill gaps in your knowledge and explore hacking techniques on your own. Get your hands dirty debugging code, overflowing buffers, hijacking network communications, bypassing protections, exploiting cryptographic weaknesses, and perhaps even inventing new exploits. This book will teach you how to:\n\nProgram computers using C, assembly language, and shell scripts\n\n\nCorrupt system memory to run arbitrary code using buffer overflows and format strings\n\n\nInspect processor registers and system memory with a debugger to gain a real understanding of what is happening\n\n\nOutsmart common security measures like nonexecutable stacks and intrusion detection systems\n\n\nGain access to a remote server using port-binding or connect-back shellcode, and alter a server's logging behavior to hide your presence\n\n\nRedirect network traffic, conceal open ports, and hijack TCP connections\n\n\nCrack encrypted wireless traffic using the FMS attack, and speed up brute-force attacks using a password probability matrix\nHackers are always pushing the boundaries, investigating the unknown, and evolving their art. Even if you don't already know how to program, Hacking: The Art of Exploitation, 2nd Edition will give you a complete picture of programming, machine architecture, network communications, and existing hacking techniques. Combine this knowledge with the included Linux environment, and all you need is your own creativity.\n\n     =======================================================================\n \n                                      UA-07\n                               Î¨ Together For Ever Î¨ \n     =======================================================================\t\t","torrent":{"xt":"urn:btih:351f69a777347d07f07174a184f1308f2401bc90","amp;dn":"Hacking+-+The+Art+of+Exploitation+2nd+Edition+-+%5BUA-07%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"351f69a777347d07f07174a184f1308f2401bc90","infoHashBuffer":{"type":"Buffer","data":[53,31,105,167,119,52,125,7,240,113,116,161,132,241,48,143,36,1,188,144]},"announce":[],"urlList":[]}}