{"title":"The Filth and the Fury - A Sex Pistols Film (2000)","uid":4765060,"size":2142787276,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35e998586a15c51ed5fdc752060186a26240a694&amp;dn=The+Filth+and+the+Fury+-+A+Sex+Pistols+Film+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eyesofflys","files":3,"time":1236835319,"description":"The Filth and the Fury - A Sex Pistols Film (2000)\n\nProduct Description\n&quot;Ever get the feeling you've been cheated?&quot; sneers Johnny Rotten at the Sex Pistols' farewell performance. After seeing this picture you'll understand his disgust, but Julian Temple's sharp portrait of the ragged, raw band of working-class Brits won't leave you disappointed. The Sex Pistols left their legacy in a whirlwind 26-month reign, spitting out a caustic, confrontational brand of rock &amp; roll that became the rallying cry for angry, disaffected youths in late 1970s England and defined the punk movement. Their story was first told two decades ago in the cynical The Great Rock and Roll Swindle, also directed by Temple but produced by the Sex Pistols' smarmy manager, Malcolm McLaren, who stage-managed the film into a self-promoting vanity project. For The Filth and the Fury, Temple turns to the four surviving band members to tell their own stories. His vibrant, vigorous direction captures the period of social unrest and alienated youth without turning into a history lesson, and shows the Pistols in all their insolent glory: spewing obscenities and gesturing lewdly to audiences and press alike, screaming out lyrics, overcoming musical limitations with pure passion and attitude. Rare, raw concert footage (including their final performance, which is appropriately enough the song &quot;No Fun&quot;) and previously unseen interviews with the deceased Sid Vicious further energize the portrait. There's even footage of the smiling band cutting cake for kids at a fundraiser with nary a nasty gesture or sneering comment. Now there's a side of the Pistols you don't see everyday. \n\n(Image)\nWidth 720 Pixels\nHeight 384 Pixels\n(Audio)\nDuration 1:47:50\nBit Rate 192kbps\nAudio Format AC-3 ACM Codec\n(Video)\nFrame Rate 23 Frames/Second\nData Rate 2585kbps\nVideo Sample Size 12 Bit\nVideo Compression XVID\n\nEnjoy!!","torrent":{"xt":"urn:btih:35e998586a15c51ed5fdc752060186a26240a694","amp;dn":"The+Filth+and+the+Fury+-+A+Sex+Pistols+Film+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35e998586a15c51ed5fdc752060186a26240a694","infoHashBuffer":{"type":"Buffer","data":[53,233,152,88,106,21,197,30,213,253,199,82,6,1,134,162,98,64,166,148]},"announce":[],"urlList":[]}}