{"title":"The T.A.M.I. Show Collector's Edition (1964)","uid":5495826,"size":946638954,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:368c2e8347cd802103d94bbb83867b4a4d19543d&amp;dn=The+T.A.M.I.+Show+Collector%5C%27s+Edition+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"st2580smile","files":-1,"time":1271267619,"description":"&quot;In the top three of all rock movies&quot; - Quentin Tarantino\nIt is the Greatest, Grooviest, Wildest, Most Exciting Beat Blast Ever to Pound the Screen!\n\nFilmed just eight months after The Beatles appeared on The Ed Sullivan Show, The T.A.M.I. Show introduced rock n soul youth culture to America in the first concert movie of the rock era. One of the rarest and most sought-after performance films from its time, the 1964 concert event featured future Rock and Roll Hall of Famers The Rolling Stones, James Brown, Chuck Berry, The Beach Boys, Marvin Gaye, Smokey Robinson &amp; The Miracles, The Supremes and many other American and British Invasion hitmakers in their prime.\n\nThis legendary film has never been available on DVD and has not been seen in its entirety since it originally appeared in theaters in 1964. Mastered from a new High Definition transfer and uncut, this complete version features the Beach Boys performances that were removed following the films initial theatrical run. This is what music fans have been waiting for: the ultimate collectors edition of this long-unavailable landmark film.\n\nFilmed at the Santa Monica Civic Auditorium, October 29, 1964, performances include:\nJan &amp; Dean- (Here They Come) From All Over The World\nChuck Berry- Johnny B. Goode, Maybellene, Sweet Little Sixteen, Nadine (Is it You?)\nGerry And The Pacemakers- Maybellene, Dont Let The Sun Catch You Crying, Its Gonna Be Alright, How Do You Do It?, I Like It\nSmokey Robinson &amp; The Miracles- Thats What Love Is Made Of, You've Really Got a Hold on Me, Mickeys Monkey\nMarvin Gaye- Stubborn Kind Of Fellow, Pride And Joy, Can I Get A Witness, Hitch Hike\nLesley Gore- Maybe I Know, You Dont Own Me, You Didnt Look Around, Hey Now, Its My Party, &amp; Judys Turn To Cry\nJan &amp; Dean- The Little Old Lady (From Pasadena) &amp; Sidewalk Surfin\nThe Beach Boys- Surfin U.S.A., I Get Around, Surfer Girl, &amp; Dance, Dance, Dance\nBilly J. Kramer &amp; The Dakotas- Little Children, Bad To Me, I'll Keep You Satisfied, &amp; From A Window\nThe Supremes- When The Lovelight Starts Shining Through His Eyes, Run, Run, Run, Baby Love, &amp; Where Did Our Love Go\nThe Barbarians- Hey Little Bird\nJames Brown &amp; The Flames- Out Of Sight, Prisoner Of Love, Please, Please, Please, &amp; Night Train\nThe Rolling Stones- Around and Around, Off The Hook, Time Is On My Side, It's All Over Now, &amp; I'm All Right\nAll Performers- Show Close: Lets Get Together\n\n Directors: Steve Binder\n Format: Collector's Edition, Black &amp; White, NTSC, Widescreen\n Language: English\n Aspect Ratio: 1.77:1\n Rating: NR (Not Rated)\n Release Date: March 23, 2010\n Run Time: 112 minutes","torrent":{"xt":"urn:btih:368c2e8347cd802103d94bbb83867b4a4d19543d","amp;dn":"The+T.A.M.I.+Show+Collector%5C%27s+Edition+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"368c2e8347cd802103d94bbb83867b4a4d19543d","infoHashBuffer":{"type":"Buffer","data":[54,140,46,131,71,205,128,33,3,217,75,187,131,134,123,74,77,25,84,61]},"announce":[],"urlList":[]}}