{"title":"Jim Rogers - Adventure Capitalist (audiobook)","uid":3919907,"size":329114732,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:36b05a71d845bf3a84e4b9930c01e4614ba03d2b&amp;dn=Jim+Rogers+-+Adventure+Capitalist+%28audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"perpetual_traveller","files":33,"time":1196722918,"description":"In Adventure Capitalist, legendary investor Jim Rogers, dubbed &quot;the Indiana Jones of finance&quot; by Time magazine, proves that the best way to profit from the global situation is to see the world mile by mile.\n\nRogers and his fiance, Paige Parker, began their &quot;Millennium Adventure&quot; on January 1, 1999, from Iceland. They traveled through 116 countries, including many where most have rarely ventured, such as Saudi Arabia, Myanmar, Angola, Sudan, Congo, Colombia, and East Timor. They drove through war zones, deserts, jungles, epidemics, and blizzards. They had many narrow escapes.\n\nThey camped with nomads and camels in the Western Sahara. They ate silkworms, iguanas, snakes, termites, guinea pigs, porcupines, crocodiles, and grasshoppers.\n\nBest of all, they saw the real world from the ground up - the only vantage point from which it can be truly understood - economically, politically, and socially.\n\nHere are just a few of the author&amp;#039;s conclusions:\n\n- The new commodity bull market has started.\n- The twenty-first century will belong to China.\n- A dramatic shortage of women is developing in Asia.\n- Pakistan is on the verge of disintegrating.\n- India, like many other large nations, will break into several countries.\n- The Euro is doomed to fail.\n- There are fortunes to be made in Angola.\n- Nongovernmental organizations (NGOs) are a scam.\n- Bolivia is a comer after decades of instability, thanks to gigantic amounts of natural gas.\n\nAdventure Capitalist is the most opinionated, sprawling, adventurous journey you&amp;#039;re likely to take within the pages of a book - the perfect read for armchair adventurers, global investors, car enthusiasts, and anyone interested in seeing the world and understanding it as it really is.\n\n5 hours and 37 min. - abridged by the author himself, MP3s @128","torrent":{"xt":"urn:btih:36b05a71d845bf3a84e4b9930c01e4614ba03d2b","amp;dn":"Jim+Rogers+-+Adventure+Capitalist+%28audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b05a71d845bf3a84e4b9930c01e4614ba03d2b","infoHashBuffer":{"type":"Buffer","data":[54,176,90,113,216,69,191,58,132,228,185,147,12,1,228,97,75,160,61,43]},"announce":[],"urlList":[]}}