{"title":"The Animals Film (1981)(uncut documentary)(with Extras,incl.OST)","uid":8842396,"size":1866107662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:36ca84a70450a20a35055e035f01f7fb483c4d44&amp;dn=The+Animals+Film+%281981%29%28uncut+documentary%29%28with+Extras%2Cincl.OST%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"glngwl","files":22,"time":1377282108,"description":"&quot;The Animals Film&quot; (1981).\n\nLegendary animal rights feature documentary, narrated by actress Julie Christie.  It details mankind's many uses of animals, including in factory farming, as pets, for entertainment, in scientific and military research, and in hunting.  The film also profiles a controversial animal rights movement, and incorporates secret government footage, cartoons, newsreels and excerpts from propaganda films.\n\nVIDEO: XviD   576x432   1.33:1   25fps   r1.2.0.dev47   L5   1231Kbps\nAUDIO: 130mins   English   AC3   2.048.0KHz   320Kbps\n\nThis is the complete uncut original cinema version, re-released and digitally remastered in 2008 by the BFI (British Film Institute).  It contains the entire final sequence (the last 7 minutes) which the UK's Channel 4 removed when it aired the film in its first week of broadcasting in November 1982.  (These scenes show a group of activists on a break-in, interviews with them, and their training preparations.)\n\nIn the cinemas the film screened at the usual theatrical 24fps, and ran for 136 minutes.  The version in this torrent is a PAL re-release, which plays at the slightly faster 25fps, and consequently runs for only 130m 22s.  It is NOT cut.\n\n(The previous year in 2007 there had been a &quot;Director's Cut&quot; which ran for only 120m, and which contained a new conclusion.  This version is not contained in this torrent; but its cover art is, along with the film's original VHS cover from the 1980s.)\n\nThe extra material contained in this torrent comprises:\n- a 30-minute interview with director Victor Schonfeld (filmed in London in June 2008),\n- an audio statement from Julie Christie (made for this release),\n- original theatrical trailer,\n- complete original soundtrack by Robert Wyatt of Soft Machine.  (Cover scan included.)  (The music of Talking Heads was also used in the film, but did not appear on the OST.)","torrent":{"xt":"urn:btih:36ca84a70450a20a35055e035f01f7fb483c4d44","amp;dn":"The+Animals+Film+%281981%29%28uncut+documentary%29%28with+Extras%2Cincl.OST%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36ca84a70450a20a35055e035f01f7fb483c4d44","infoHashBuffer":{"type":"Buffer","data":[54,202,132,167,4,80,162,10,53,5,94,3,95,1,247,251,72,60,77,68]},"announce":[],"urlList":[]}}