{"title":"The First Modern Jew: Spinoza and the History of an Image (2012)","uid":8311350,"size":10020905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36dbe2d21dc450174ba8040372ab9cb86d699cb1&amp;dn=The+First+Modern+Jew%3A+Spinoza+and+the+History+of+an+Image+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"workerbee","files":-1,"time":1364488867,"description":"Daniel B. Schwartz - The First Modern Jew: Spinoza and the History of an Image (Princeton University Press, 2012).\n\nISBN: 9780691142913 | 296 pages | PDF\n\nPioneering biblical critic, theorist of democracy, and legendary conflater of God and nature, Jewish philosopher Baruch Spinoza (1632-1677) was excommunicated by the Sephardic Jews of Amsterdam in 1656 for his &quot;horrible heresies&quot; and &quot;monstrous deeds.&quot; Yet, over the past three centuries, Spinoza's rupture with traditional Jewish beliefs and practices has elevated him to a prominent place in genealogies of Jewish modernity. The First Modern Jew provides a riveting look at how Spinoza went from being one of Judaism's most notorious outcasts to one of its most celebrated, if still highly controversial, cultural icons, and a powerful and protean symbol of the first modern secular Jew.\n\nRanging from Amsterdam to Palestine and back again to Europe, the book chronicles Spinoza's posthumous odyssey from marginalized heretic to hero, the exemplar of a whole host of Jewish identities, including cosmopolitan, nationalist, reformist, and rejectionist. Daniel Schwartz shows that in fashioning Spinoza into &quot;the first modern Jew,&quot; generations of Jewish intellectuals -- German liberals, East European maskilim, secular Zionists, and Yiddishists -- have projected their own dilemmas of identity onto him, reshaping the Amsterdam thinker in their own image. The many afterlives of Spinoza are a kind of looking glass into the struggles of Jewish writers over where to draw the boundaries of Jewishness and whether a secular Jewish identity is indeed possible. Cumulatively, these afterlives offer a kaleidoscopic view of modern Jewish culture and a vivid history of an obsession with Spinoza that continues to this day.\n\nReviews:\n\n&quot;This is a spectacular book, deeply researched and brilliantly written, on a riveting subject -- the historical reception of Spinoza from the seventeenth to the twentieth centuries. Schwartz demonstrates his command of European philosophy, modern European Jewish history, Hebrew and Yiddish literature, and Zionist culture. A tour de force.&quot; -- David Biale, University of California, Davis\n\n&quot;We have long needed a thorough and careful study of the various ways in which Spinoza has been appropriated by Jewish causes and movements. Daniel Schwartz's welcome book takes a close look for the first time at what the author calls 'the rehabilitation of Spinoza in Jewish culture.'&quot; -- Steven Nadler, Times Literary Supplement\n\n&quot;Schwartz displays admirable versatility in tracing the idolizations, disputes, and ambivalences evoked by Spinoza in Germany (Moses Mendelssohn and Berthold Auerbach) and eastern Europe (Salomon Rubin), within Zionism (Yosef Klausner), and in Yiddish literature (Isaac Bashevis Singer)... Essential.&quot; -- M. A. Meyer, Choice\n\n&quot;Passionate arguments, of the kind now richly documented by Schwartz, about Spinoza's Jewishness and his relevance to our times, still enrich and enrage ... and probably will continue to do so -- without end.&quot; -- Allan Nadler, Forward.com\n\n&quot;This is the first full-scale history of Spinoza's reception among Jews... It clearly demonstrates how this excluded philosopher could be viewed as religious or secular, as more Baruch or more Benedict, but almost necessarily as a touchstone in defining Jewish identity in the modern age.&quot; -- Choice","torrent":{"xt":"urn:btih:36dbe2d21dc450174ba8040372ab9cb86d699cb1","amp;dn":"The+First+Modern+Jew%3A+Spinoza+and+the+History+of+an+Image+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36dbe2d21dc450174ba8040372ab9cb86d699cb1","infoHashBuffer":{"type":"Buffer","data":[54,219,226,210,29,196,80,23,75,168,4,3,114,171,156,184,109,105,156,177]},"announce":[],"urlList":[]}}