{"title":"[Clips4Sale / Family-Therapy] Molly Jane (Dad Helps Me Quit Smok","uid":13675073,"size":1011424228,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:370785e0941d5e94ec785d0539fafeeabffb7a17&amp;dn=%5BClips4Sale+%2F+Family-Therapy%5D+Molly+Jane+%28Dad+Helps+Me+Quit+Smok&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1456389894,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/kUr\r\n \nhttp://imgsnaps.com/image/kUt\r\n\r\nHi, its Molly:-) My Dad is such a crazy asshole sometimes..Lol. I'm a big girl and I can make my own decisions!!!! Like the other night my Dad was pounding beers and he kept making me sit on his lap and listen to his dumb stories- just so he could grab my tits btw. So I got up and went to my bathroom to smoke a cigarette and get some peace for a minute. I only get a few drags and my Dad barges in and throws my smoke in the toilet!! He starts yelling at me that this is his house and I'm not allowed to smoke inside. I LIVE HERE TOO!!! And Mom said she didn't care as long as I opened the window. Anyway, my Dad is so dramatic sometimes! - he bent me over the sink and started spanking me. And if that wasn't bad enough he made me get on my knees and HE PULLED HIS COCK OUT!!! What a perv... He made me jerk his wiener and kept telling me what a bad daughter I was and even kept slapping me when I talked back. But it gets worse- after I wouldn't suck it he made me sit on the sink and started grabbing my tits and pussy. AND THEN MY DAD PUT HIS DICK IN ME!! IT HURT!!! He kept telling me it was to teach me a lesson- but I think he's just looking for any excuse to do me because he's tired of screwing Mom... My Dad somehow thinks putting his fat dick in me is going to make me not smoke anymore... I just know I have to do what he wants if I don't want to be punished even worse. Dad kept slamming his dick into me and making me promise to be good. I guess it started to work. My Dad's dick started to feel REALLY GOOD!! I didn't want too but I started getting really turned on and I CAME ALL OVER DADDY'S COCK!!! I guess he is kinda good at sex... Then He made me get on my knees and jerk his dick until he came on my big tits. I still think I should be able to smoke because I'm a big girl and I get stressed out sometimes...but I guess I'll try asking Dad for help next time I want a cigarette....or not","torrent":{"xt":"urn:btih:370785e0941d5e94ec785d0539fafeeabffb7a17","amp;dn":"%5BClips4Sale+%2F+Family-Therapy%5D+Molly+Jane+%28Dad+Helps+Me+Quit+Smok","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370785e0941d5e94ec785d0539fafeeabffb7a17","infoHashBuffer":{"type":"Buffer","data":[55,7,133,224,148,29,94,148,236,120,93,5,57,250,254,234,191,251,122,23]},"announce":[],"urlList":[]}}