{"title":"Marvel NOW! Week 9 (darkhomr) [TPB]","uid":8029459,"size":334031164,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:370e4cb6075e9fa28dd32c082b07f8ee257c36ab&amp;dn=Marvel+NOW%21+Week+9+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dadrkhomr","files":9,"time":1358376662,"description":"Starting the week of January 16, 2013 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/anxm6.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/cap3.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/da185.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ih3.jpg[/IMG]\n\nAll New X-Men #6 (CBR 1/16/2013)\n\nDavid Marquez (Ultimate Comics: Spider-Man) takes the artistic reins for 3 issues!  Brian Bendis further defines the future of the X-Men! \n\nAvengers Assemble #11 (CBR 1/16/2013)\n\nSpider-Woman is totally safe locked in that box with the parasite-infested Hulk right?  Remember that time Tony Stark said he hated trust falls? You knew that was going to come back. C'mon.  ::whistles:: Hanging coffins of the Bo ::whistles::  Yun Guang Han's done it--he's infected his Order of the Dragon initiates with next-step evolutionary bacteria and built himself a super-creepy (and kind of gross) army WITH WHICH TO CONQUER THE WORLD.  Mwah ha ha etc. \n\nAvenging Spider-Man #16 (CBR 1/16/2013)\n\nNEW CREATIVE TEAM! NEW DIRECTION! THE SUPERIOR AGE BEGINS!  The all new Superior Spider-Man teams with Wolverine and the X-Men!  Christopher Yost (Scarlet Spider, X-Force) and Paco Medina (Ultimate X-Men) begin a new SUPERIOR era of Avenging Spider-Man! \n\nCaptain America #3 (CBR 1/16/2013)\n\n1930: Witness the birth of a legend! How did Steve Rogers, a 98 lb weakling, earn his courage?  NOW: With the fate of a world hinging on his victory Captain America must defeat the barbarian lord of the Phrox!  MEANWHILE: Arnim Zola's plans move forward, cursing Steve Rogers for years to come. \n\nCaptain Marvel #9 (CBR 1/16/2013)\n\nA PERFECT JUMPING-ON POINT FOR FANS NEW AND OLD! PART ONE OF A NEW STORY.  Carol finally returns home, but is changed. What is weakening Captain Marvel's powers?  PLUS: Carol gets a JOB.  Find out why CAPTAIN MARVEL is being hailed as one of Marvel's best new series this year! \n\nDark Avengers #185 (CBR 1/16/2013)\n\nSkaar, Moonstone &amp; Ragnarok go to war with... THE DEADLY DR. STRANGE!  'The Witch' Dr. June Covington is turned loose in a Tony Stark's Frankensteinian Laboratory. Her first subject for 'improvement'? RAGNAROK! \n\nIndestructible Hulk #3 (CBR 1/16/2013)\n\nHULK: AGENT OF S.H.I.E.L.D.!!!  HULK'S first official mission: take down the ALL-NEW QUINTRONIC MAN!!!  More on Banner's secret hold over S.H.I.E.L.D. Director Maria Hill!  What and where isÃ–BANNERTOWN, U.S.A? \n\nNew Avengers #2 (CBR 1/16/2013)\n\n'EVERYTHING DIES'  The Illuminati gather to plan for the death of Everything. Infinity gems, old wounds, lies, agendas and universal incursions.  'It breaks hope -- it crushes what makes us decent and steals what little honor remains.' --Black Swan \n\nSavage Wolverine #1 (CBR 1/16/2013)\n\nWolverine awakes to find himself transported to the Savage Land and labeled public enemy number one! With no memory of how he got there, and Shanna the She-Devil his only ally, Logan must unravel the mystery that slumbers at the heart of the Savage Land before it finds a way to kill him first.  This January, Wolverine is all brawls, babes, and brachiosaurs, and you'll never see the end -- or the future of the Marvel Universe -- NOW! \n\nX-Factor #250 (CBR 1/16/2013)\n\nA year of X-FACTOR stories culminates here in the first part of 'HELL ON EARTH WAR'! The various Hell lords battle for domination in a war that was triggered by the seven billionth soul born on Earth, and only X-Factor can avoid the entire world going up in flames! This is the beginning of the end for X-Factor as you know it.\n","torrent":{"xt":"urn:btih:370e4cb6075e9fa28dd32c082b07f8ee257c36ab","amp;dn":"Marvel+NOW%21+Week+9+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370e4cb6075e9fa28dd32c082b07f8ee257c36ab","infoHashBuffer":{"type":"Buffer","data":[55,14,76,182,7,94,159,162,141,211,44,8,43,7,248,238,37,124,54,171]},"announce":[],"urlList":[]}}