{"title":"Kings of Leon 24 Bit Vinyl Pack","uid":8953660,"size":3794128189,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37901389eb11a8054a29ab8909ac8ee7598ce040&amp;dn=Kings+of+Leon+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1379954390,"description":"\n  Kings of Leon 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Southern Rock, Country-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  2005 A-Ha Shake Heartbeat (180g 2LP)\n  2007 Because of the Times\n  2008 Only by the Night\n  2013 Mechanical Bull\n\n  Initially embraced as &quot;the Southern Strokes&quot; for their resurrection and reinvention of Dixie-styled rock &amp; roll, Kings of Leon steadily morphed themselves into an experimental rock outfit during the 2000s. The Tennessee-bred quartet debuted in 2003 with the Holy Roller Novocaine EP, whose blend of raw, unpolished boogie rock was further explored on their debut full-length, Youth &amp; Young Manhood. Such revivalist music was matched by a similarly revivalist appearance -- including long hair, mustaches, and tight-fitting denim -- and Kings of Leon experienced immediate popularity in the U.K. (where they would later enjoy platinum album sales, despite an initially lukewarm reception at home). As the band explored different sonic textures with subsequent releases, most notably on 2007's Because of the Times and 2008's Only by the Night, those tenuous links to the Strokes were finally dissolved.\n\n  Comprised of three Followill brothers -- Caleb (guitar), Nathan (drums), and Jared (bass) -- as well as first cousin Matthew Followill (guitar), Kings of Leon formed in 2000. The Followill siblings had spent their youth traveling across America's heartland with their evangelist father, decamping at Pentecostal churches and tent revivals for several days at a time before moving onward. When their father resigned from the church and divorced his wife in 1997, the boys relocated to Nashville and embraced the rock music (not to mention the accompanying lifestyle) they'd previously been denied. Cousin Matthew was added to the lineup, and a Southern garage rock sound quickly emerged. RCA took note, signing the band in 2001 and facilitating a partnership with Nashville-based producer Angelo Petraglia, who furthered the band's rock &amp; roll education and co-wrote the material for 2003's Holy Roller Novocaine EP.\n\n  Tours across North America and the U.K. coincided with the release of the band's full-length debut, Youth &amp; Young Manhood, that same summer. Thanks to the popular single &quot;Molly's Chambers,&quot; the album found moderate success in the U.K. However, it was their sophomore effort, 2004's Aha Shake Heartbreak, that made them European stars, with three songs cracking the U.K. charts. The album saw an American release in February 2005, and Kings of Leon toured the country alongside U2 before retreating to work on their third effort. The darker, expansive Because of the Times followed in 2007. Featuring production from Ethan Johns (who had helmed the band's previous releases as well), the album proved to be the band's biggest release to date, debuting at number 25 on the U.S. Billboard 200 and topping the album charts in the U.K., Ireland, and New Zealand.\n\n  Kings of Leon returned one year later with Only by the Night, a colossally popular album whose lead single, &quot;Sex on Fire,&quot; gave the band its first number one hit in the U.K. The album itself fared similarly well, topping the U.K. charts upon its release and debuting at number four in America. It eventually gained platinum status in eight countries, including America, and its success allowed the band to tour heavily throughout much of 2008 and 2009. Live at the O2 was released at the tail-end of 2009, capturing one of the band's midsummer performances in London. Kings of Leon briefly holed up in Manhattan's Avatar Studios to work on a fifth record, but they returned to the road during the summer of 2010, taking the opportunity to play some of their new material in concert. By the time the tour wrapped up in September, the group's newest single, &quot;Radioactive,&quot; had already been released. The accompanying album, Come Around Sundown, followed in October. The record was a worldwide hit and it reached number one in 15 countries, including the U.S., U.K., Canada, and Australia.\n\n  Later that year they embarked on a marathon tour, however: a disastrous show in Texas resulted in frontman Caleb walking off the stage without returning for the end of the set. After this incident, the brothers decided to undertake a self-imposed hiatus in 2011 and cancelled the rest of the tour while the band attempted to reconcile the personal and group problems. In the time apart, bassist Jared released music with Mona frontman Nick Brown under the moniker Smoke &amp; Jackal, while Caleb found sobriety after moving to New York and the birth of his son. They returned to the band with a batch of new material and set to work on their sixth record, Mechanical Bull, which appeared in September of 2013.\n\n  Greets:\n\n  SmashAndGrab, 24.96","torrent":{"xt":"urn:btih:37901389eb11a8054a29ab8909ac8ee7598ce040","amp;dn":"Kings+of+Leon+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37901389eb11a8054a29ab8909ac8ee7598ce040","infoHashBuffer":{"type":"Buffer","data":[55,144,19,137,235,17,168,5,74,41,171,137,9,172,142,231,89,140,224,64]},"announce":[],"urlList":[]}}