{"title":"The Abyss Beyond Dreams - Peter F. Hamilton - Audiobook MP3","uid":11471757,"size":648955638,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37e4a8a8caeb8d802f0ff27377cb1c91e2646425&amp;dn=The+Abyss+Beyond+Dreams+-+Peter+F.+Hamilton+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416097825,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Abyss Beyond Dreams: Chronicle of the Fallers, Book 1\n\nWritten by: Peter F. Hamilton\nNarrated by: John Lee\nLength: 22 hrs and 35 mins\nSeries: Chronicle of the Fallers, Book 1\nUnabridged Audiobook\nRelease Date:10-21-14\n\nThe year is 3326. Nigel Sheldon, one of the founders of the Commonwealth, receives a visit from the Raiel - self-appointed guardians of the Void, the enigmatic construct at the core of the galaxy that threatens the existence of all that lives. The Raiel convince Nigel to participate in a desperate scheme to infiltrate the Void. Once inside, Nigel discovers that humans are not the only life-forms to have been sucked into the Void. The humans trapped there are afflicted by an alien species of biological mimics - the Fallers - that are intelligent but merciless killers. Yet these same aliens may hold the key to destroying the threat of the Void forever - if Nigel can uncover their secrets","torrent":{"xt":"urn:btih:37e4a8a8caeb8d802f0ff27377cb1c91e2646425","amp;dn":"The+Abyss+Beyond+Dreams+-+Peter+F.+Hamilton+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e4a8a8caeb8d802f0ff27377cb1c91e2646425","infoHashBuffer":{"type":"Buffer","data":[55,228,168,168,202,235,141,128,47,15,242,115,119,203,28,145,226,100,100,37]},"announce":[],"urlList":[]}}