{"title":"American Guerrilla in the Philippines 1950 DvdRip Avi Lee1001","uid":9829181,"size":1205589438,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37fef7862a448508f9057efc0dfabe8d1da1ffd7&amp;dn=American+Guerrilla+in+the+Philippines+1950+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"xultfoad","files":2,"time":1395814217,"description":"American Guerrilla in the Philippines 1950 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0042195/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0042195/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/American_Guerrilla_in_the_Philippines&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/American_Guerrilla_in_the_Philippines&lt;/a&gt;\nAmerican Guerrilla in the Philippines is an American war film first released in 1950, directed by Fritz Lang. The film is based on a novel by Ira Wolfert and stars Tyrone Power, Micheline Presle, Tom Ewell and Robert Patten and Tommy Cook. It has also been released under the title: I Shall Return. It is a Twentieth Century Fox Film Corporation production, produced by Lamar Trotti.\n\nWith a title like American Guerilla In The Philippines, you'd hope Fritz Lang's Hollywood-made war movie would be exciting. And while it's a million miles away from his European classics Metropolis, The Testament Of Dr Mabuse and M, the German legend wrings all sorts of thrills from the Pacific War.\n\nReleased in the UK as I Will Return - a nod to General Douglas MacArthur's famous speech - Lang's film focuses upon a band of American soldiers who, unable to flee the Philippines ahead of the Japanese invasion, choose to fight their away across the country. As Ensign Chuck Palmer (matinee idol Tyrone Power) and crewman Jim Mitchell (Tom Ewell) make their way towards Del Monte airport, they encounter Jeanne Martinez (Michelle Prelle), a teacher at an American mission school. Learning that the air strip has also been captured by the invaders, the trio have no choice but to ride out the occupation and create as much chaos as possible.\n\nAlthough the movie's moniker and the presence of Tyrone Power might suggest a degree of trashiness, American Guerilla is a cut above your average Hollywood war movie. Okay, so Lang made better movies during his time in the US - The Big Heat is by far the nastiest if not quite the best film noir - but you can tell from the pacing and the compositions that American Guerilla was created by someone with a sophisticated appreciation of the medium. As for the actors, Lang must got down alongside Edmund Goulding (The Razor's Edge) as one of the few directors able to coax a convincing performance out of the teak-like Tyrone Power. Meanwhile, fans of walleyed actor Jack Elam are sure to enjoy his typically colorful performance.\n\nIf American Guerilla leaves you hungry for more war movies set in and around the Philippines, you're probably better off skipping expensive propaganda pieces such as Bataan, Back To Bataan and They Were Expendable. Instead, try and track down cult favourites Back Door To Hell and Fight To Fury.\n\nTwo films shoot back-to-back in the islands by Monte Hellman, these superior Roger Corman productions are as exciting as they are efficient. Oh yes, and they were written by one of the members of the cast, a young chap with a thinning thatch called Jack Nicholson\n \nDavid Richardson in Naval Uniform after WWII.On who's exploits this movie is based,here's his story\n\nThough critics pummeled the film at the time, it appears now as a top-notch action production with great pace and gusto, having the necessary elements of tension and drive, with an excellent score and lush photography.\n\nVIDEO\nSize.... 1.12gb\nDuration.... 01:40:44\nCodec.... divx\nFrame Width..... 720\nFrame Height.... 528\nData Rate.... 1403kbps\nFrame Rate.... 25 F/S\nAUDIO\nBit Rate.... 192kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:37fef7862a448508f9057efc0dfabe8d1da1ffd7","amp;dn":"American+Guerrilla+in+the+Philippines+1950+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37fef7862a448508f9057efc0dfabe8d1da1ffd7","infoHashBuffer":{"type":"Buffer","data":[55,254,247,134,42,68,133,8,249,5,126,252,13,250,190,141,29,161,255,215]},"announce":[],"urlList":[]}}