{"title":"Claudia Chevalier Vampire (2009) cbr","uid":10162543,"size":111117673,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3812c06e16cc6dcf94fc6684bc2a21338c7be1de&amp;dn=Claudia+Chevalier+Vampire+%282009%29+cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GP67","files":-1,"time":1400318998,"description":"Claudia was an ordinary mother to a bystander, but in secret she was not so ordinary. She in fact was a gatekeeper to a satanic sect. This job was her to make sure regular human sacrifices went exactly like they were supposed to go. She had been in contact with a character named Lord Mortis, who talked to her from hell. One day a sacrifice went bad, the victim escaped, and as the rules says, gatekeeper is taken in place of the sacrifice. She knew exactly what was waiting her in after life, she became a nosferatu. And to become a vampire knight, she went through the regular two year training. Magic runes were tattooed on her skin and protective talismans sewed into it. Black chrysalis was inserted into her and it was fed with dark opium, to enhance her vampire abilities. She was knighted and given name Lady Claudia Demona. One thing that bothered her masters was that she promised to sacrifice her daughter at her 21 birthday, but Claudia died too early, her daughter was only 18. they made her promise that she keeps her promise to sacrifice her. There was only one problem: no one ever has returned to the world of living after they been sent to hell. It is still unknown if Claudia succeeded in that or is that task still ahead of her.\n\nenjoy","torrent":{"xt":"urn:btih:3812c06e16cc6dcf94fc6684bc2a21338c7be1de","amp;dn":"Claudia+Chevalier+Vampire+%282009%29+cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3812c06e16cc6dcf94fc6684bc2a21338c7be1de","infoHashBuffer":{"type":"Buffer","data":[56,18,192,110,22,204,109,207,148,252,102,132,188,42,33,51,140,123,225,222]},"announce":[],"urlList":[]}}