{"title":"Shogun - Total War","uid":3323801,"size":1187152534,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:38d43a59dbcc2987e80420e5886cf1b82c0b0ed9&amp;dn=Shogun+-+Total+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Koscher","files":1,"time":1114907215,"description":"Japan - The 16th Century.\n\nSengoku Jidai - The Age of the Country at War.\n \nThe land is being torn apart by rival warlords, each with the burning ambition to be declared supreme ruler of Japan - to become Shogun. You are one of them. \nThousands of loyal warriors stand before you, a nation lies ready to be conquered. In the shadows, ninja assassins await your orders, now it begins..... \n\nPlan your campaign wisely. Grow your economy to build mighty fortresses and train vast armies. Gain honour and respect to forge allegiances - but be wary of whom you trust. Then face your enemies in epic battles on a scale never before experienced. \n\nTotal Warfare: \nA unique combination of strategic decisions and intense real-time action on the battlefield will take you deeper into this savage historical period than you ever believed possible. \n\nThe Art of War: \nUse the wisdom of Sun Tzu to master the strengths and weaknesses of your units as well as assess the tactical effects of formations, moral, fatigue, terrain, weather, and fortifications. \n\nEpic Battles Made Easy: \nControl massive armies with thousands of Samurai on full 3-D landscapes. Watch huge armies perform intricate battlefield maneuvers with a simple click of the mouse. \n\nIn-Depth Strategy: \nDevelop your economy from the ground up, forge trade relationships, and strategic alliances, conduct espionage and order assassinations. \n\nThe Game: \nThe main game is divided into two main game sections. Turn-based strategy map: In addition to taking the role of commander-in-chief of your armies, you must also manage the wealth of your lands, construct defences and dojos, train your men and balance alliances with rival Daimyo while you wait for the right time to strike. Season by season, you must use Ninja, Shinobi and other strategic units to gain every advantage and so take Japan region by region. \n \n\nReal-Time Battles: \nWhen armies from different clans come to occupy the same region in the same season, you will experience war as it occurred in the 16th century. It is bloody, but it is also glorious, with a strict code of honour that must be adhered to if you are to overcome your enemies. With an intuitive yet richly diverse interface you can command thousands of men on the battlefield. Warfare has never been experienced on a grander or more epic scale. \n\nHistorical Battle Mode: \nRecreate some of feudal Japan's greatest battles. The simulations have been constructed using the expertise of some of the period's leading historical authorities. \n\nCustom Battles: \nEngage in a fully-customisable single battle. \n\n","torrent":{"xt":"urn:btih:38d43a59dbcc2987e80420e5886cf1b82c0b0ed9","amp;dn":"Shogun+-+Total+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d43a59dbcc2987e80420e5886cf1b82c0b0ed9","infoHashBuffer":{"type":"Buffer","data":[56,212,58,89,219,204,41,135,232,4,32,229,136,108,241,184,44,11,14,217]},"announce":[],"urlList":[]}}