{"title":"[FSX] - France VFR - Pays-de-Loire Photo HD (2011)","uid":7449132,"size":9089244451,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3989cb6f74e679607998a442af274f1d3dccf310&amp;dn=%5BFSX%5D+-+France+VFR+-+Pays-de-Loire+Photo+HD+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xxtsh","files":-1,"time":1342457090,"description":"[FSX] - France VFR - Pays-de-Loire Photo HD (2011)\n\nThe PHOTO Regional product range provides a high resolution photoreal and terrain mesh coverage for each French region and island. This photoreal texture coverage replaces the standard Microsoft Flight Simulator X default scenery with a real lanscape. You can then add local sceneries onto this photoreal texture based for more realism.\n\nPlease visit France VFR website and forum for more details about extension pack products and compatibility.\n\nTECHNICAL SPECIFICATIONS\n \n-High resolution photoreal scenery covering a French region.\n-0.85 to 1 meter resolution ground texture made from aerial photography (IGN) retreated for an optimal visual rendition in Flight Simulator XÂ® (summer only).\n-High resolution real 19 meter (LOD11) optimized custom mesh incuded.\n-All lakes and rivers have been entirely cut out and faithfully represented, reworked with bodies of landable water.\n-Water transparency effects for the whole scenery coverage.\n-Optional Waterclass and original water texture provided.\n-Extremely precise geo-referenced texture positionning is carried out in order to ensure a maximal compatibility with scenery add-ons for this region.\n-Process development is fully conform to the Microsoft Flight Simulator XÂ® SDK, ensuring a maximal compatibility with future versions of Flight Simulator.\n-Open scenery concept allows an easy integration of scenery add-ons from other editors.","torrent":{"xt":"urn:btih:3989cb6f74e679607998a442af274f1d3dccf310","amp;dn":"%5BFSX%5D+-+France+VFR+-+Pays-de-Loire+Photo+HD+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3989cb6f74e679607998a442af274f1d3dccf310","infoHashBuffer":{"type":"Buffer","data":[57,137,203,111,116,230,121,96,121,152,164,66,175,39,79,29,61,204,243,16]},"announce":[],"urlList":[]}}