{"title":"Elementary Seizoen 2 Dvd 2 nlsubs)sharky-TBS","uid":9230449,"size":4617171934,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:398f5285918ae3074a0982c7083bf73c75d7212a&amp;dn=Elementary+Seizoen+2+Dvd+2+nlsubs%29sharky-TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sharky57","files":-1,"time":1385062775,"description":"Elementary Seizoen 2 Dvd 2 nlsubs)sharky-TBS\n\n\n\n\nElementary is een Amerikaanse dramaserie van de zender CBS.\n\nNadat hij uit de gratie viel bij Scotland Yard en in een ontwenningskliniek belandde, vlucht de excentrieke Sherlock Holmes naar Manhattan, \nwaar zijn rijke vader hem dwingt om zijn ergste nachtmerrie te bezoeken, namelijk Dr. Joan Watson. \nZij was een succesvolle chirurg tot op een dag een patient stierf op haar operatietafel en ze haar vergunning verloor. \nNu helpt ze voormalige verslaafden om nuchter te blijven. \nVoor Watson is dit een nieuwe kans om mensen te helpen en tegelijkertijd is het een soort van boete voor haar.\n\nMaar Sherlock Holmes waarschuwt haar dat hij niet zoals haar andere klanten is en dat ze niets met haar expertise kan betekenen voor hem. \nZo is hij vastbesloten om zijn eigen afkickprogramma te volgen door zijn werk als politie-adviseur weer op te nemen, nu in New York City.\n\nJoan Watson ziet geen andere mogelijkheid dan Sherlock te begeleiden tijdens zijn werkopdrachten. \nMaar beiden beginnen naar elkaar toe te groeien. Sherlock kan de medische kennis van Watson goed gebruiken en door Sherlock ontdekt \nWatson dat ze talent heeft om een onderzoeker te spelen.\n\nEnglish\n\nELEMENTARY stars Jonny Lee Miller as detective Sherlock Holmes and Lucy Liu as Dr.Joan Watson in a modern-day drama about \na crime-solving duo that cracks the NYPD's most impossible cases. \nFollowing his fall from grace in London and a stint in rehab, eccentric Sherlock escapes to Manhattan where his wealthy father \nforces him to live with his worst nightmare - a sober companion, \nDr. Watson. A successful surgeon until she lost a patient and her license three years ago, Watson views her \ncurrent job as another opportunity to help people, as well as paying a penance. \nHowever, the restless Sherlock is nothing like her previous clients. He informs her that none of her expertise as an \naddiction specialist applies to him and he's devised his own post-rehab regimen - resuming his work as a police consultant in New York City. \nWatson has no choice but to accompany her irascible new charge on his jobs. \nBut Sherlock finds her medical background helpful, and Watson realizes she has a knack for playing investigator. \nSherlock's police contact, Capt. Tobias &quot;Toby&quot; Gregson (Aidan Quinn), knows from previous experience working with \nScotland Yard that Sherlock is brilliant at closing cases, and welcomes him as part of the team. \nWith the mischievous Sherlock Holmes now running free in New York solving crimes, it's simple deduction that he's \ngoing to need someone to keep him grounded, and it's elementary that it's a job for Watson.\n\n\n\n\nEpisodes Dvd 2:\n\n05. Ancient History\n\n06. An Unnatural Arrangement\n\n07. The Marchioness\n\n08. Blood is Thicker\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2191671/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2191671/&lt;/a&gt;\n\n\n\t\tinfo\n\t\n\tAudio: Engels DD 5.1\n\tBewerking Dvd: Dgpc\n\tSubs: NL\n\tVertaling Japetie, Gibbs, Quetsbeek, Cyclopsq.\n\tPresync Quetsbeek Controle JM.\n\n\n\n\nmet dank aan savales\n\nVeel plezier gewenst met deze film \n\nHave fun with this movie \n\n\n\n\neen bedankje wordt altijd graag ontvangen!!\n\nuploaded by sharky\n","torrent":{"xt":"urn:btih:398f5285918ae3074a0982c7083bf73c75d7212a","amp;dn":"Elementary+Seizoen+2+Dvd+2+nlsubs%29sharky-TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"398f5285918ae3074a0982c7083bf73c75d7212a","infoHashBuffer":{"type":"Buffer","data":[57,143,82,133,145,138,227,7,74,9,130,199,8,59,247,60,117,215,33,42]},"announce":[],"urlList":[]}}