{"title":"Lenny Bruce","uid":4542640,"size":465035205,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:39b5c785e463b08718d8d0e743a95a8379b88c39&amp;dn=Lenny+Bruce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Malinkaz","files":7,"time":1228000860,"description":"Lenny Bruce (1925-1966) - Leonard Alfred Schneider  \n \nAmerican stand-up comedian and brilliant satirist, who created much controversy in his time due to his use of so-called &amp;#039;dirty words&amp;#039; in his nightclub comedy act. The black humor of Bruce&amp;#039;s largely improvised shows often overstepped the bounds of what was considered in the 1950s and 1960s respectable. Bruce&amp;#039;s performances, his fresh and daring way of breaking rules, influenced such comedians as George Carlin, Richard Pryor, and Robin Williams. \n\n&quot;Children ought to watch pornographic movies : it&amp;#039;s healthier than learning about sex from Hollywood.&quot; (from How to Talk Dirty and Influence People, 1965) \nLeonard Alfred Schneider (Lenny Bruce) was born in New York. &quot;To me, if you live in New York or any other big city, you are Jewish, he once said. &quot; It doesn&amp;#039;t matter even if you&amp;#039;re Catholic; if you live in New York you&amp;#039;re Jewish. If you live in Butte, Montana, you are going to be goyish if you&amp;#039;re Jewish.&quot; When Bruce was five his parents divorced and he was brought up by relatives. During World War II he served in the Navy on the U. S. S. Brooklyn, a light cruiser, and was discharged in 1946. After spending some time in odd jobs, he moved to Hollywood to study acting. In 1947 he changed his name to Bruce, because &quot;Leonard Alfred Schneider sounded too Hollywood.&quot; \n\nThe fifties was the breakthrough decade for Bruce and such comedians as Mike Nichols, Elaine May, Mort Sahl, who were all Jewish, with their own vision of ethnicity. Their humor evoked a response among young Bohemians and college-educated people. Bruce worked as a night-club performer in Brooklyn and Baltimore, where he met a striptease dancer, who worked under the name Hot Honey Harlowe. She was born Harriett Jolliff in 1927. Harlowe had ran away from home in her teens and spent also some time in jail. &quot;Honey and I just stared at each other and got hot,&quot; Bruce later said. They married in 1951. \n\nBruce drew national attention with his daring style of satire, in which he probed taboo subjects such as racial fears, sexual fantasies, Jewish-Christian tensions, and presidents. &quot;I really dig what they do with a homosexual in this country. They put him into a prison with a lot of other men. That&amp;#039;s a really good punishment.&quot;\n\nBruce imagined Hitler in show business and stewardesses jettisoning infants from overloaded airliners, betraying at the same time a schooling in the Catskills resorts. The black sheep among salon tyros and young comics, such as Joe E. Lewis, Buddy Hackett, Alan King, Bruce played to intellectuals, wearing jeans, not tuxedo. His wit and inimitable frankness won him an admiring audience and made his act celebrated in liberal literary circles. \n\nIn 1961 Bruce was imprisoned on obscenity charges and in 1963 he was refused permission to enter Britain. &quot;The comic, Lenny Bruce, was booed offstage in England,&quot; claimed the controversial radio journalist Walter Winchell. Eventually Bruce&amp;#039;s show was banned both in England and Australia. \n\nIn spite of pressures, Bruce refused to clean up his language. &quot;All my humour is based on destruction and despair,&quot; he said. &quot;If the whole world were tranquil, I&amp;#039;d be standing in the breadline, right back of J. Edgar Hoover.&quot; (from The Essential Lenny Bruce, ed. by J. Cohen, 1970) In 1964 Bruce was convicted of giving obscene performances at the Cafe au Go Go in Greenwich Village. \n\nWhen he was arrested by the police in April 1964, Norman Mailer, James Jones and other prominent writers and intellectuals defended him as a social satirist &quot;in the tradition of Swift, Rabelais and Twain.&quot; In his later years Bruce became addicted to heroin. In 1963 he was found guilty of illegal possession of drugs. Bruce died of an overdose on August 3, 1966, in his home on Hollywood Boulevard. He was 40 years old. \n\n\n\n&quot;Lenny Bruce is dead but he didn&amp;#039;t commit any crime \nHe just had the insight to rip off the lid before its time. \nI rode with him in a taxi once, only for a mile and a half, \nSeemed like it took a couple of months. \nLenny Bruce moved on and like the ones that killed him, gone.&quot; \n(Bob Dylan in &amp;#039;Lenny Bruce&amp;#039;, from Shot of Love, 1983) \n \n\n\n\nAcredited to Lenny Bruce:\n\nA lot of people say to me, &amp;#039;Why did you kill Christ?&amp;#039; I dunno, it was one of those parties, got out of hand, you know. \nLenny Bruce \n\nCommunism is like one big phone company. \nLenny Bruce \n\nEvery day people are straying away from the church and going back to God. \nLenny Bruce \n\nI hate small towns because once you&amp;#039;ve seen the cannon in the park there&amp;#039;s nothing else to do. \nLenny Bruce \n\nI won&amp;#039;t say ours was a tough school, but we had our own coroner. We used to write essays like: What I&amp;#039;m going to be if I grow up. \nLenny Bruce \n\nI&amp;#039;ll die young, but it&amp;#039;s like kissing God. \nLenny Bruce \n\nIf Jesus had been killed twenty years ago, Catholic school children would be wearing little electric chairs around their necks instead of crosses. \nLenny Bruce \n\nIf you can take the hot lead enema, then you can cast the first stone. \nLenny Bruce \n\nIn the Halls of Justice the only justice is in the halls. \nLenny Bruce \n\nMiami Beach is where neon goes to die. \nLenny Bruce \n\nSatire is tragedy plus time. You give it enough time, the public, the reviewers will allow you to satirize it. Which is rather ridiculous, when you think about it. \nLenny Bruce \n\nThe &quot;what should be&quot; never did exist, but people keep trying to live up to it. There is no &quot;what should be,&quot; there is only what is. \nLenny Bruce \n\nThe liberals can understand everything but people who don&amp;#039;t understand them. \nLenny Bruce \n\nThe only honest art form is laughter, comedy. You can&amp;#039;t fake it... try to fake three laughs in an hour - ha ha ha ha ha - they&amp;#039;ll take you away, man. You can&amp;#039;t. \nLenny Bruce \n\nThe only truly anonymous donor is the guy who knocks up your daughter. \nLenny Bruce \n\nThe role of a comedian is to make the audience laugh, at a minimum of once every fifteen seconds. \nLenny Bruce \n\nThere are never enough I Love You&amp;#039;s. \nLenny Bruce \n\nWhen you&amp;#039;re eight years old nothing is your business. \nLenny Bruce \n\n\n\n\n\n\n\n\nTitle                          Artist      Album           Genre \n-------------------------------------------------------------------\n                                                                      \nBerkeley Concert               Lenny Bruce Berkley Concert Comedy\nChrist &amp; Moses                 Lenny Bruce Busted (Live)   Comedy\nCop, Flashlights &amp; Bottles     Lenny Bruce Busted (Live)   Comedy\nDrugs                          Lenny Bruce Busted (Live)   Comedy\nEntrapment By Cops             Lenny Bruce Busted (Live)   Comedy\nHow To Relax Colored People    Lenny Bruce Busted (Live)   Comedy\nImprisonment                   Lenny Bruce Busted (Live)   Comedy\nInfidelity                     Lenny Bruce Busted (Live)   Comedy\nIntro                          Lenny Bruce Busted (Live)   Comedy\nJewish Theatre                 Lenny Bruce Busted (Live)   Comedy\nKing Kong Routine              Lenny Bruce Busted (Live)   Comedy\nPaul Molloy &amp; Christianity     Lenny Bruce Busted (Live)   Comedy\nSex Is Dirty                   Lenny Bruce Busted (Live)   Comedy\nTalks To Lady In Audience      Lenny Bruce Busted (Live)   Comedy\nThe Bust                       Lenny Bruce Busted (Live)   Comedy\nThe Milwaukee Gig              Lenny Bruce Busted (Live)   Comedy\nWar Criminals                  Lenny Bruce Busted (Live)   Comedy\nWho&amp;#039;s A Fag                    Lenny Bruce Busted (Live)   Comedy\nCarnegie Hall Concert (Disc 1) Lenny Bruce Carnegie Hall   Comedy\nCarnegie Hall Concert (Disc 2) Lenny Bruce Carnegie Hall   Comedy\nAdolf Hitler                   Lenny Bruce Vintage Comedy  Comedy\nAirplane Glue                  Lenny Bruce Vintage Comedy  Comedy\nChristians &amp; Jews              Lenny Bruce Vintage Comedy  Comedy\nCritics                        Lenny Bruce Vintage Comedy  Comedy\nEichmann                       Lenny Bruce Vintage Comedy  Comedy\nFantasy With The Judge         Lenny Bruce Vintage Comedy  Comedy\nFat Boy                        Lenny Bruce Vintage Comedy  Comedy\nFather Flotski&amp;#039;s Triumph       Lenny Bruce Vintage Comedy  Comedy\nHow the Negro and the Jew Got  Lenny Bruce Vintage Comedy  Comedy\nJail                           Lenny Bruce Vintage Comedy  Comedy\nLenny Bruce Is Out Again       Lenny Bruce Vintage Comedy  Comedy\nNuns &amp; Paul Robeson            Lenny Bruce Vintage Comedy  Comedy\nRelax Your Coloured Friends    Lenny Bruce Vintage Comedy  Comedy\nReligions Inc.                 Lenny Bruce Vintage Comedy  Comedy\nSoutherners                    Lenny Bruce Vintage Comedy  Comedy\nThank You Masked Man           Lenny Bruce Vintage Comedy  Comedy\nThe Law, Language &amp; Lenny      Lenny Bruce Vintage Comedy  Comedy\nThe Palladium                  Lenny Bruce The Palladium   Comedy\nWhite Collar Drunks            Lenny Bruce Vintage Comedy  Comedy\nWhite Woman &amp; Black Woman      Lenny Bruce Vintage Comedy  Comedy\n","torrent":{"xt":"urn:btih:39b5c785e463b08718d8d0e743a95a8379b88c39","amp;dn":"Lenny+Bruce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b5c785e463b08718d8d0e743a95a8379b88c39","infoHashBuffer":{"type":"Buffer","data":[57,181,199,133,228,99,176,135,24,216,208,231,67,169,90,131,121,184,140,57]},"announce":[],"urlList":[]}}