{"title":"SimpleCast 2.5.3 - Includes Serial","uid":5548141,"size":1727311,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3a6d3398a61d9a84d4db962aa06fc791e7cf59dd&amp;dn=SimpleCast+2.5.3+-+Includes+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TheSpark","files":-1,"time":1273445770,"description":"SimpleCast takes audio from your line-in, microphone or any audio being played over your soundcard and then encodes this audio in real-time to be streamed over the internet to listeners across the world - all with a single click of a button.\n\nThis application is not only easy to use, it's powerful ... Metadata adaptors allows external applications to send song and captioning data to SimpleCast. (Already has native support for most major automation systems). Gather real-time statistics from all your streaming servers so you know how many listeners are connected at any given time and generates song history logs.\n\nSimpleCast is perfect for broadcasting\n- Sporting events\n- Concerts and Live shows\n- Live DJ/Night Club appearances\n- Private Parties\n- or audio from any music system that does not support internet streaming\n\n\nPowered by SAM streaming technology\n\nQuick overview\n\n    * Contains fully licensed mp3PRO streaming encoders! The Bandwidth saving, High Quality, mp3PRO encoder can deliver CD quality audio at only 56kb/s! And you will be amazed at how good it sounds at only 24kb/s.\n      Trust your ears! Take the listen challenge...\n    * Also supports Ogg, Windows Media v9 and normal MP3 streaming.\n    * Can stream to SHOUTcast, Icecast, Live365, Windows Media Server and P2P Streamer.\n    * Reports how many people are listening in real-time from all your streaming servers.\n    * Stream in multiple formats at multiple bitrates from the SAME plugin!\n    * Full title streaming, scripting and metadata support for ALL formats.\n\n\nEncoders\n\n    * Multi-format support includes &quot;bandwidth saving&quot; mp3PRO, normal MP3, Ogg and advanced WMA9 encoders.\n    * Use ANY combination of encoders together simultaneously - even with multiple bitrates!\n      Example: You can run a 24kb/s mp3PRO, 56kb/s mp3PRO and 56kb/s Windows Media stream at the SAME TIME from the SAME SOURCE!\n    * Stream to Shoutcast, Live365, Windows Media, Icecast1, Icecast2 or P2P Streamer.\n    * Full title streaming for mp3PRO, MP3, Ogg and Windows Media\n    * Full meta data streaming for both Windows Media and mp3PRO/MP3! (The only plugin that can do this!)\n    * Captioning for Windows Media (With full HTML support)\n      Scripting support allows you to\n      - Display the artist, title, album cover pictures and buy CD links - updates the information the instant the song changes!\n      - Sync up banners to display at the same time as an audio advertisement.\n    * Archive stream to file\n    * Automatically turns on your Live365 server upon connection if needed.\n    * Record from DSP data or directly from soundcard.\n    * Stay streaming 24/7: Recovers from errors and reconnects to the streaming server if needed.\n    * Scripting interface allows you to open up the browser to a certain location on the listener's computer.\n    * Metadata streaming also allows you to sink up banners with audio advertising.\n    * Support for both Windows Media &quot;Pull&quot; and &quot;Push&quot; streaming methods.\n\n\nStatistic relays\n\n    * Grab statistics in real-time from Shoutcast, Live365, Windows Media, Icecast1, Icecast2 and P2P Streamer - so you know exactly how many people are listening at any given time!\n    * View graphs of statistics over a period of time\n    * View current, high and maximum listeners counts for a single relay or all the relays combined.\n    * Get free extra exposure and more listeners by being listed on AudioRealm.com\n    * View free extended 24 hour graphs and daily graphs in the member section of AudioRealm.com\n    * Instantly see which relays are up and running and which are reporting errors.\n","torrent":{"xt":"urn:btih:3a6d3398a61d9a84d4db962aa06fc791e7cf59dd","amp;dn":"SimpleCast+2.5.3+-+Includes+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a6d3398a61d9a84d4db962aa06fc791e7cf59dd","infoHashBuffer":{"type":"Buffer","data":[58,109,51,152,166,29,154,132,212,219,150,42,160,111,199,145,231,207,89,221]},"announce":[],"urlList":[]}}