{"title":"Lucius GOG","uid":8252048,"size":2164123536,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3a888954e72aef511616d41a8fe9e7ec9f90d334&amp;dn=Lucius+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1363181768,"description":"genre: adventure / tpp / horror\nrelease date: October 26, 2012\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: Audio and text: English, German. Text only: Russian\ndeveloper / publisher: Shiver Games / Lace Mamba Digital\ngame modes: single-player\n\nBonus content included for FREE with purchase:\nmanual\n4 wallpapers\n4 avatars\n\nHomage to the classics of the horror movie genre, including &quot;The Omen&quot;, &quot;The Shining&quot;, and &quot;The Exorcist&quot;.\nA breathtaking atmosphere overflowing with stunning and captivating visuals!\nA wide, open 3D world for you to explore and manipulate with your wicked powers!\n\nOverview:\n\n&quot;Here is wisdom. Let him that hath understanding count the number of the Beast: for it is the number of a man; and his number is Six hundred threescore and six.&quot; - Revelation 13:18\n\nWhen little Lucius was born on the devilishly significant date of June 6th, 1966, no one expected him to be anything other than a normal little boy. His childhood, spent in a luxurious manor, was as normal as every kid's childhood years - well, except for the extreme wealth of his parents, as Lucius grew up with everything he desired and more. Everything went to Hell, in a manner of speaking, when Lucius turned 6. The Devil, who is his real father, manifests himself in his dreams the night before his birthday revealing to Lucius his true heritage. It's up to Lucius to bring Hell on Earth using any and all means necessary.\n\nOrchestrate deadly accidents, using items, tools, and hell's powers such as telekinesis and mind control. By combining classic adventure gameplay with the freedom and openness of a 3D world, you'll have to use your wits and ensure no one knows of your fiendish mission until it's too late!\n\nAge requirements: PEGI Rating: 18+\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, Pentium 4 1,5GHz or Athlon XP equivalent, 1.5 GB RAM, NVIDIA 8800 Series or ATI equivalent, DirectX 9.0c, DirectX 9.0c-compatible sound card, 3 GB HDD, Mouse, Keyboard.\n\nInstall and play\n","torrent":{"xt":"urn:btih:3a888954e72aef511616d41a8fe9e7ec9f90d334","amp;dn":"Lucius+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a888954e72aef511616d41a8fe9e7ec9f90d334","infoHashBuffer":{"type":"Buffer","data":[58,136,137,84,231,42,239,81,22,22,212,26,143,233,231,236,159,144,211,52]},"announce":[],"urlList":[]}}