{"title":"ABC of Dementia [PDF] [StormRG]","uid":11037043,"size":2287450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3aade72845dddcb384d1d93bbb2a9e4ee36095df&amp;dn=ABC+of+Dementia+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"0xmovva","files":2,"time":1410805527,"description":"Author: Bernard Coope (Editor), Felicity Richards (Editor)\nSeries: ABC Series\nPaperback: 74 pages\nPublisher: BMJ Books; 1 edition (May 5, 2014)\nLanguage: English\nISBN-10: 1118474023\nISBN-13: 978-1118474020\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nABC of Dementia is a practical guide to help healthcare professionals develop knowledge, skills, confidence and an understanding of dementia, in order to support those with dementia to live well.\n\nIt begins with the cognitive disabilities and underlying brain diseases that define dementia, before moving on to diagnostic assessment and early intervention for dementia. There is a focus on the experience of the person with dementia and their families, highlighting the journey from diagnosis to end of life, including the role of person-centred care, and the limited therapeutic options available.\n\nSeparate chapters address dementia in acute hospital settings, primary care, and care for those with the most severe challenges, as well as the specific needs of younger people developing dementia. The ethical and legal context of dementia care is also outlined.\n\nFrom a multidisciplinary author team, ABC of Dementia is a valuable resource for general practitioners, family physicians and other health care professionals caring for patients with dementia and related disorders. It is also relevant for geriatricians, psychologists, specialist and practice nurses, and nursing home staff.","torrent":{"xt":"urn:btih:3aade72845dddcb384d1d93bbb2a9e4ee36095df","amp;dn":"ABC+of+Dementia+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aade72845dddcb384d1d93bbb2a9e4ee36095df","infoHashBuffer":{"type":"Buffer","data":[58,173,231,40,69,221,220,179,132,209,217,59,187,42,158,78,227,96,149,223]},"announce":[],"urlList":[]}}