{"title":"Yeah! yeah! yeah!  the Beatles,Beatlemania, and the music that c","uid":11421873,"size":10708153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3adbb0d6d23985c074eba8a65c7e11eeb513cc64&amp;dn=Yeah%21+yeah%21+yeah%21++the+Beatles%2CBeatlemania%2C+and+the+music+that+c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415629297,"description":"It starts in the housing projects and school playgrounds of Liverpool, where four boys would discover themselves - and a new form of music called rock 'n roll. It takes us from the famous first meeting between John and Paul, to the clubs of Liverpool and Germany when George and Ringo join the band, down Penny Lane and Strawberry Fields, to America and the height of the Beatles' success - when they were still teenagers.\n\nIn Yeah! Yeah! Yeah!, Spitz recreates the thrills, tears and magic of his New York Times bestselling adult biography, but in a style and format that's accesible for young readers. This book includes photos, sidebars and graphic elements. It's a book about teens who changed the world.\n\nPublisher: Little, Brown Children (14 Aug 2008)\nLanguage: English\nISBN-10: 031611555X\nISBN-13: 978-0316115551\n\nBook Description\nBased on The New York Times bestselling biography of the Beatles - in a style and format for young readers\n\nAbout the Author\nBob Spitz has represented the careers of Bruce Springsteen and Elton John. He is the author of The Beatles, The Making of the Superstars, Barefoot in Babylon, Dylan, and Shoot Out the Lights. His articles appear regularly in various international publications.\n\nMost Helpful Customer Reviews\n\nHere Are the Beatles!\nBy BeatleBangs1964 TOP 1000 REVIEWER on 9 Mar 2008\nThis is a well written book that contains some of the text from Spitz' adult biography of the Beatles. For example, his description of George Harrison is identical to the passage in his other book. I liked that because I felt he was including younger readers into a wider net of Beatle information.\n\nUnlike his adult biography which was riddled with errors, this book contained only one error and it was minor. George Harrison's death was given as being on a Tuesday when in fact it was a Thursday. Small thing, yeah, but hyperalert Beatle fans can't help but notice these things.\n\nThere are some excellent pictures in this book and it is a compliment to young readers' intelligence and a good gift for cultural appreciation/exposure. I will be giving this book as a gift to some younger relatives who postdate the Beatles' careers.\n\n\na fun and entertaining overview of the Beatles 17 Sep 2007\nBy Jenny P. -\nPeople of all ages love the Beatles' music. Now young people have a book of their own to get caught up in the phenomenon.\nI read Bob Spitz's bestselling adult biography, called The Beatles The Beatles: The Biography, and I found it exhilarating and insightful. So I got this book for my 13-year-old son, and I never saw him get so enthusiastic about something he's read. His younger sister is engaged by it, too. Our whole family is now talking about the Beatles story and enjoying the music together.\nAnd what a great story this is, especially the Beatles' early years. They were four young guys from humble families who used their hard work and talent to create something great. It's inspiring, and Spitz tells it in a fast-paced and entertaining way. Yeah Yeah Yeah is full of great pictures and interesting facts, too. I recommend it to anyone who already likes the Beatles or anyone who is discovering them for the first time.\n\nYeah! Yeah! Yeah!: The Beatles, Beatlemania, and the Music that Changed the World 26 Aug 2008\nBy Nest Mom -\nYeah! Yeah! Yeah! is a simple but complete narrative of the life and music of one of the biggest bands of all time, The Beatles. Bob Spitz, a long time writer of many rock books, shares an almost entire biography of each of the four men in the legendary group. Though this book is targeted for younger people (Spitz has written an adult biography of the same band), it is very enjoyable for fans of all ages.\nThe book's many focuses range from the life of the boys before the band, the start of the band, where John Lennon and Paul McCartney meet for the first time after a performance from John's skiffle band, the Quarry Men, to the start of the band, all through the Beatles' performances, and finally the end of the extraordinary band. The book clearly illustrates the many stages of the group, from rock as a form of music mainly about girls and cars, to their later use of drugs as a form of art, and later on, a deep interest in religious and spiritual meaning through peace and meditation, and how their many interests shaped the music of that time.\nI loved the book. It was written in so that people with less knowledge about the band and the time could understand and enjoy it, while people more familiar with the group could still learn from and love. It was unlike most biographies--it seemed to have little of the author's opinion, but the well researched book offered countless quotes and inside information. My favorite part of the book, however, would have to be the many side panels and boxes with little fun facts, ranging from definitions to stories to quotes and explanations.\nThe book was a lot of fun. I learned a lot, and, being an avid Beatles fan, was able to relate to a lot of things. I would recommend this book not only to all Beatles fans, but also to anyone else, as Bob Spitz has done a wonderful job of showing not only how great they were as musicians, but also as great, creative, but otherwise normal people with an innovative new way of looking at life","torrent":{"xt":"urn:btih:3adbb0d6d23985c074eba8a65c7e11eeb513cc64","amp;dn":"Yeah%21+yeah%21+yeah%21++the+Beatles%2CBeatlemania%2C+and+the+music+that+c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3adbb0d6d23985c074eba8a65c7e11eeb513cc64","infoHashBuffer":{"type":"Buffer","data":[58,219,176,214,210,57,133,192,116,235,168,166,92,126,17,238,181,19,204,100]},"announce":[],"urlList":[]}}