{"title":"Early Edition - Season 1.DVDRip.XviD-SAiNTS","uid":6822691,"size":8441905199,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3b236f882abddd01b524a808669514fe0526069f&amp;dn=Early+Edition+-+Season+1.DVDRip.XviD-SAiNTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Saki33","files":-1,"time":1321458207,"description":"His name is Gary Hobson. He gets tomorrow's newspaper today. He doesn't know how. He doesn\\'t know why. All he knows is when the early edition hits his doorstep, he has twenty-four hours to set things right. \n\n***\n\nI could find no subtitles that work for the dvd rip.\n\nI went back to thank the original uploader of this torrent and I can't find it, and can't find it at any site, so decided to re-upload. I loved this series when it originally aired, and the early seasons were the best. I had originally just downloaded the first few episodes, but noticed that the seeders were disappearing fast, and even fewer peers, so I thought I had better finish it while it was possible. It was dismaying to see so many drop off as soon as their download finished. I have so far seeded the original at 3.280 ratio, and will continue to seed this one as long if I see support for it. It has been my experience from my other uploads that so many peers do not continue to seed at first, but eventually for a top notch series there are loyal supporters who want to share. I hope you don't disappoint me this time. ","torrent":{"xt":"urn:btih:3b236f882abddd01b524a808669514fe0526069f","amp;dn":"Early+Edition+-+Season+1.DVDRip.XviD-SAiNTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b236f882abddd01b524a808669514fe0526069f","infoHashBuffer":{"type":"Buffer","data":[59,35,111,136,42,189,221,1,181,36,168,8,102,149,20,254,5,38,6,159]},"announce":[],"urlList":[]}}