{"title":"Woman In the Moon (1929) (dir.Fritz Lang) DVDrip","uid":3674738,"size":1468432431,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b2dc8c6df61ee14da54eb655ac7310f595d46f4&amp;dn=Woman+In+the+Moon+%281929%29+%28dir.Fritz+Lang%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"pckiller2007","files":2,"time":1177706751,"description":"Director: Fritz Lang \nWriting: Fritz Lang, Hermann Oberth (technical material), Thea von Harbou (story) \n\nActors: Willy Fritsch, Gerda Maurus, Klaus Pohl, Fritz Rasp, Gustl Gstettenbaur \n\nSynopsis:\nA scientist discovers that there&amp;#039;s gold on the moon, he builds a rocket to fly there, but there&amp;#039;s too much rivalry among the crew to have a sucessful expedition. \n\nTwo years after revolutionazing the science fiction film with his epic Metropolis, dir,F.Lang revisited teh genre with an abitious spectacle taht dramatizes the furst lunar expedition. Rather than a flight of pure fantasy, Lang, screenwriter Thea von Harbou and a group of technical consultants concieved a modernized &quot;Trip to the Moon&quot; grounded in state-of-the-art astrophysics. Spiced with romance and espionage,this film was one of the most influential sci-fi films of its era \nOne of the first major films to dwell upon the possibility of space travel, Fritz Lang&amp;#039;s Woman in the Moon (Frau im Mond) is, like many of its modern-day counterparts, more successful on a special-effects level than it is in terms of character development. The titular female, played by Gerda Maurus (one of the stars of Lang&amp;#039;s 1928 classic Spies) joins an extraterrestrial expedition in search of gold on the moon. Among the many prescient aspects of the film is its use of a countdown before blast-off and its depiction of the effects of centrifugal force upon the lunar passengers. Willy Ley, later a leading light of the U.S. space program, served as technical adviser. Reportedly, Adolf Hitler was so overwhelmed by Woman in the Moon that he used the rocket depicted in the film as the prototype for the dreaded V1 and V2 assault missiles. Curiously unavailable during the Sputnik fever of the 1950s, Woman in the Moon rose back to the surface when it was excerpted in David Wolper&amp;#039;s landmark 1960 TV documentary, The Race for Space. \n\nSource: DVD \nVideo: 4:3, b/w, 169 min \nAudio: DD 2.0, music score only (silent movie) \nSubtitles: english \nDVD cover (hi-res, 3Mb) -","torrent":{"xt":"urn:btih:3b2dc8c6df61ee14da54eb655ac7310f595d46f4","amp;dn":"Woman+In+the+Moon+%281929%29+%28dir.Fritz+Lang%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b2dc8c6df61ee14da54eb655ac7310f595d46f4","infoHashBuffer":{"type":"Buffer","data":[59,45,200,198,223,97,238,20,218,84,235,101,90,199,49,15,89,93,70,244]},"announce":[],"urlList":[]}}