{"title":"Spider-Man Soundtrack 320cbr (Big Papi) 2002","uid":9439510,"size":158136897,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b4d6c217547912ce1aae6fa09bc84428ad661ff&amp;dn=Spider-Man+Soundtrack+320cbr+%28Big+Papi%29+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1388976258,"description":"Source: 2002 CD\n\n\nBy A Customer\nThis is a very solid soundtrack. There are very few songs that i have to skip. Only get this soundtrack if you love alternative music though:\n1. Spiderman Theme- 4/5 Not my favorite, intro...but its cool.\n\n2. Chad Kroeger &amp; Josey Scott- Hero: 5/5 The reason I bought this soundtrack! I love this song, i'm sure you've heard it.\n\n3. Sum 41- What We're All About: 2/5 The beginning is awesome...before they start singing/trying to rap. I do not see how this song has anything to do with the movie.\n\n4. Black Lab- Crawling: 5/5 This is just as good as Hero. This should be a hit on the radio. Very catchy song with good lyrics. Totally ties in with the movie.\n\n5. Bleu- Someone else: 5/5 Song has a theme of belonging in it...totally reflects on Peter Parker.\n\n6. Alien Ant Farm- Bug Bytes: 1/5 To me this is worst than the Sum 41 song. I don't like Alien Ant Farm so maybe you'll have a different opinion.\n\n7. Default- Blind: 3/5 This is a tolerable song....sounds Deny, Wasting My Time...nothing new. Its about when a friend backstabs you like Peter's friend kinda does.\n\n8. Corey Taylor- Bother: 5/5 This is the guy from Slipknot and even though I have never listened to Slipknot and do not think I would like them anyways...THIS IS AN AWESOME SONG. The guys has a good voice for someone who screams. Its a very dark, but beautiful song. It sounds different from the rest of the album.\n\n9. Greenwheel- SHelter: 4/5 I like this song also. Its your normal alternative song that stands out from the rest. Sound like a song about evil (William Defoe).\n\n10. The Strokes- When It Started: 5/5 I love this song because it sounds differet....I like the retro-ness of it. This is the only song I have liked so far from The Strokes,\n\n11. The Hives- Hate To Say I Told You SO: 5/5 Yet another awesome retro song...\n12. Theory of A Dead Man- Invisible Man: 4/5 Regular run of the mill--yet good alternative song. SOunds like another song about the darkside or wanting to belong.\n\n13. Pete Yorn- Undercover: Ok this is one of my favorites on this whole soundtrack. Its soft, yet alternative. This is the first song I've heard from Pete Yorn and i love him. Explains the love story between MaryJane and Peter.\n\n14. Macy Grey- Nut Meg Fantasy: 4/5 i had to grow into this one...its a catchy song when you get used to it. This was in the movie!\n\n15. Injected- IV-V: 5/5 Hmm...I think that's how you spell it. I had to get used to this song also. I love the chorus and the lead guy's voice. Very catchy song when you actually listen to the whole thing.\n\n16. Jerry Cantrell- She Was My Girl: 5/5 Very interesting song. Explains the love triangle in Spiderman very well.\n\n17. Danny Elfman- Main Titles: 5/5 This is like the musical score. Its the when they show the cast's names in the beginning of the movie...very good song.\n\n18. Danny Elfman- Farwell: 4/5 This song is kinda slow...it gets good at the end...repeats melody of previous track alittle.\n\nBottom line is...there are some extraordinary songs on here. So it is so worth getting this soundtrack if you love alternative music. The songs relate to the movie and are not useless soundtrack filler to back up the movie hit. SO GET IT TODAY!","torrent":{"xt":"urn:btih:3b4d6c217547912ce1aae6fa09bc84428ad661ff","amp;dn":"Spider-Man+Soundtrack+320cbr+%28Big+Papi%29+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b4d6c217547912ce1aae6fa09bc84428ad661ff","infoHashBuffer":{"type":"Buffer","data":[59,77,108,33,117,71,145,44,225,170,230,250,9,188,132,66,138,214,97,255]},"announce":[],"urlList":[]}}