{"title":"Teenage Spermaholics 2 (xvid) - anal/DP/DPP/DAP, Teagan Presley,","uid":4612185,"size":1479738799,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3b4fc42d9b0e580397c6100fc56112c028c4cae5&amp;dn=Teenage+Spermaholics+2+%28xvid%29+-+anal%2FDP%2FDPP%2FDAP%2C+Teagan+Presley%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"pure_screens","files":6,"time":1230674099,"description":"Teenage Spermaholics 2 (DVD.xvid)\n\n\n\n\n\nDVD-covers + 44 large screenshots:\n\n &lt;a href=&quot;\nhttp://main.blogbugs.org/4510327/Teenage-Spermaholics-2---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://main.blogbugs.org/4510327/Teenage-Spermaholics-2---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nThese TEENS are sex junkies and SPERM is their drug. \nWe feed their constant cravings with plenty of ASS-TO-MOUTH DP's, DOUBLE ANAL and their favorite drug, SPERM SHOT right in their MOUTHS! \n\n\nMissy's a Cum Junkies! \nTyla tastes Melissa's ASS JUICE! \nTeagan's DP! \nMissy Squirts! \nMelissa's Gape! \nTianna Squirts!   \n\n\n\nActresses\n\n    * Chiquita Lopez       [Anal Facial DP Bald Swallow A2M]\n    * Melissa Lauren       [Anal DP DPP DAP CumSwap A2M]\n    * Missy Monroe         [Anal Facial DP DPP Squirt Bald Swallow A2M IR]\n    * Teagan Presley       [Anal Facial DP Bald Swallow A2M]\n    * Tiana Lynn           [Facial Squirt Bald Swallow]\n    * Tyla Wynn            [Anal Facial DP CumSwap Swallow A2M]\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Erik Everhard, John Strong, Michael Stefano, Missy Monroe, Tee Reel\n    * Scene 2. Erik Everhard, John Strong, Tiana Lynn\n    * Scene 3. Brian Surewood, Chiquita Lopez, Jon Dough, John Strong, Michael Stefano\n    * Scene 4. Erik Everhard, Michael Stefano, Teagan Presley\n    * Scene 5. John Strong, Melissa Lauren, Michael Stefano, Tyla Wynn\n\n\n\n\nStudio: \t        Jules Jordan Productions\nRelease Date:    \tOct 13, 2006\nCategory:      \t        Anal, Double Penetration, Swallowing\nDirector:         \tMike John\n\n\n\nREVIEW:\n\nMan, just when I think Red Light District can't top itself, they go out and make something like &quot;Teenage Spermaholics 2.&quot; First, any flick that has the words &quot;teenage&quot; and &quot;sperm&quot; in the title is well worth a look. Second, you know it's from RLD, so you can expect a certain level of quality out of it. Finally, looking at Teagan on the box cover should just about give you a priapism.\n\nFirst up is cute little blonde firecracker Missy Monroe. There's a bit of a plot here, but it's actually kind of funny. Her boyfriend drops her off at the porn shoot, and he's concerned that she'll turn full-lesbo on him, because he thinks she only does girl-girl stuff. Missy assures him she's not a lesbian. After boyfriend leaves, Erik, Mike, John, and Brian come out and we get a four-on-one scene. Missy loves to choke on cock and her technique belies this. She gags down the four dudes' poles, and the guys get a little aggressive while they're at it. She takes cock in doggy (no one wears a rubber) and she even squirts. In fact, she squirts so much you'd think she needs to take fluids, intravenously to keep from getting dehydrated. Missy ratchets up the heat a bit by taking a DPP while sucking cock. One of the things that really works in this scene is Missy's constant dirty talk. I love that. Missy takes DPs in cowgirl, reverse cowgirl, and standing. She even takes a few ATMs. In the end, all four guys dump their loads in her mouth, which she gulps down.\n\nThe very tasty, redhead Tianna Lynn is next. She starts us off by bouncing up and down on a couch, showing us how her tits move. She gets down to business sucking cock and slapping dude's dick against her face. She really seems to be getting into her cocksucking, and takes two loads of cum going down her gullet.\nNext, the two dudes take turns fucking her and she squirts a few times, coating the camera lens. RLD should be selling the squirting aspects of this flick better, because there's lots of it so far. In fact, Erik bangs her to such an orgasm that she falls off the couch while squirting. She rims some ass for a bit, then takes another couple shots of goo down her throat - this time she gargles before swallowing.\n\nChiquita Lopez is a great looking young Latina with a wonderful body and nice ass. This spermaholic is joined by Brian, Mike, Jon, and John. She gets right to work sucking cock. &quot;Sucking&quot; is a tender, gentle word however. More like the guys are face fucking her. Anyway, the guys take turns banging her snapper while she sucks another dude. This all leads up to DPs, taking different partners and positions. The guys take turns fucking her ass and she even does some A2Ms. In the end, the guys fill up her mouth with cum and even manage to shoot some up her nose.\n\nI love Teagan. She's a gorgeous young blonde with a fantastic body and an even more wonderful ass. She does a bit of a tease, showing off her sweet body and ass, then struts upstairs to hook up with Erik and Mike. She seem to really be into Erik as they kiss and he feeds her his cock. After some warm up, Mike gets to bang her butt, then Erik gets a poke. This all leads up to a DP. She seems reluctant to do her A2M suck, but someone must have reminded her there was a check waiting. There's more DP before she takes their loads of cum in her mouth.\n\nTyla and Melissa are gorgeous young blondes. I give the looks edge to Tyla, but if Melissa came by looking to get fucked, I'd grudgingly do it. There's some plot going on here about some missing chick but, to be honest, I could barely pay enough attention to regurgitate it her for your perusal. Apparently, Melissa has been chained up in John's house and Tyla finds her. Whatever. The relevant thing, here, is that Tyla gets busy sucking John's cock while Melissa plays with Mike. Tyla and Melissa give John a little rimmer and blowjob. Next, the chicks pair off with the guys and get their snatches poked before they take it up the ass. There are several A2Ms present, then both chicks get DP'd. Tyla takes both shots of cum in her mouth, then the two do some cum swapping back and forth.\n\n\n\nOverall, this was a fantastic movie. \nThe chicks were hot, the sex was fantastic, and if you're a bodily fluid fan, you'll enjoy the squirting and swallowing. Highly recommended. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:3b4fc42d9b0e580397c6100fc56112c028c4cae5","amp;dn":"Teenage+Spermaholics+2+%28xvid%29+-+anal%2FDP%2FDPP%2FDAP%2C+Teagan+Presley%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b4fc42d9b0e580397c6100fc56112c028c4cae5","infoHashBuffer":{"type":"Buffer","data":[59,79,196,45,155,14,88,3,151,198,16,15,197,97,18,192,40,196,202,229]},"announce":[],"urlList":[]}}