{"title":"Mighty.Med.s02e05.720p.HDTV.x264-w4f.mkv","uid":11672873,"size":742707871,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3b5f9921e42cc4e23a52a7e9ffd89135d9c63f0c&amp;dn=Mighty.Med.s02e05.720p.HDTV.x264-w4f.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"QQQQQ1","files":1,"time":1422738133,"description":"Kaz and Oliver feverishly search The Domain for any information that can help them defeat the Annihilator. When Oliver finds the first Annihilator comic book, telling how Hapax the Elder mentored the Annihilator as a boy, training him to become a superhero, but his anger at being called a freak turned him to a super villain, Kaz decides to find Hapax on Skylar's home planet, Caldera, to convince the mentor to come back to Earth and defeat the Annihilator. The boys steal the wormhole generator from Horace's desk and travel to Caldera. Once there, Kaz and Oliver find identical Skylar Calderians, as well as Skylar's pet doringbosh, (who closely resembles Gus). Gus leads them to Hapax's cave, and they find that Hapax bears a striking resemblance to Alan. Back on Earth, in Mighty Med, Optimo reveals he's coming to the hospital for a 'rash', but really just wants to see Alan. However, Horace discovers that the rash actually is serious, and will kill Optimo within 10 minutes, unless Alan donates some super-erythrocytes. Horace scrambles to keep Alan from seeing Optimo, and when Horace asks Alan to donate, he faints at the needle, allowing Horace to take the erythrocytes and cure Optimo. Meanwhile, Hapax is reluctant to return to Earth, and says if the boys can recover the box of Azimuth, he'll accompany them. Kaz, Oliver, and Gus-the-doringbosh make it up the volcano and fight the guardian, an old lady who breathes lava. The doringbosh sacrifices himself to knock the guardian into the lava pit, and Kaz and Oliver recover the box and successfully prove their bravery to Hapax, who reveals the box just contains something to hold up his coffee table. He agrees to accompany them. As he leaves to get something, Skylar and the Annihilator arrive via space portal","torrent":{"xt":"urn:btih:3b5f9921e42cc4e23a52a7e9ffd89135d9c63f0c","amp;dn":"Mighty.Med.s02e05.720p.HDTV.x264-w4f.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b5f9921e42cc4e23a52a7e9ffd89135d9c63f0c","infoHashBuffer":{"type":"Buffer","data":[59,95,153,33,228,44,196,226,58,82,167,233,255,216,145,53,217,198,63,12]},"announce":[],"urlList":[]}}