{"title":"Thich Nhat Hanh - Mindful Movements - avi","uid":3963143,"size":371080872,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3bbcd819906e4ff7dd6a997a64c30f4316412bdb&amp;dn=Thich+Nhat+Hanh+-+Mindful+Movements+-+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bee961","files":2,"time":1199569915,"description":"MINDFUL MOVEMENTS: Learn Mindful Exercises, DVD by Thich Nhat Hanh on Video (36 minutes)\n\nWhen you calm your body and your emotions, teaches Zen master Thich Nhat Hanh, you restore yourself, and you restore peace to the world around you. On Mindful Movements, this renowned teacher of mindfulness meditation guides you through a series of gentle exercises created specifically to cultivate a joyful awareness of the body and breath. These are the same &quot;meditations in motion&quot; that the monks and nuns of Plum Village Monastery use daily as a complement to their sitting meditation practice. \n\nDeveloped by Thich Nhat Hanh himself, the exercises taught here combine simple stretching and graceful gestures with mindfulness meditation. Join Thich Nhat Hanh and Plum Village monk Brother Michael to explore step by step these ten unique movements. Practice them before or after sitting meditation, at home, or at work - any time you have a few minutes to refresh your body and quiet your mind. Mindfulness has the power to sustain and heal you in every aspect of your life. \n\nEnjoy!\n","torrent":{"xt":"urn:btih:3bbcd819906e4ff7dd6a997a64c30f4316412bdb","amp;dn":"Thich+Nhat+Hanh+-+Mindful+Movements+-+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bbcd819906e4ff7dd6a997a64c30f4316412bdb","infoHashBuffer":{"type":"Buffer","data":[59,188,216,25,144,110,79,247,221,106,153,122,100,195,15,67,22,65,43,219]},"announce":[],"urlList":[]}}