{"title":"Hot Chip - In Our Heads (2012) [FLAC]","uid":7346541,"size":412182430,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3bd49f1e0bfe331a559f10c87c5bb2aff7a34d14&amp;dn=Hot+Chip+-+In+Our+Heads+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1339440104,"description":"\n  Hot Chip - In Our Heads (2012) [FLAC]\n\n  Release Date: June 12, 2012\n  Duration: 56:48\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Alternative\n  Codec: FLAC\n  Bit Rate: ~1,000 Kbps\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Motion Sickness  \n  02 How Do You Do  \n  03 Don't Deny Your Heart  \n  04 Look At Where We Are  \n  05 These Chains  \n  06 Night and Day  \n  07 Flutes  \n  08 Now There Is Nothing  \n  09 Ends of the Earth \n  10 Let Me Be Him \n  11 Always Been Your Love\n  \n  After 2010's relatively somber One Life Stand, Hot Chip's members resurfaced in side projects including the About Group, the 2 Bears, and New Build, all of which took different approaches to electro-pop but shared an almost tangible joy in music-making. It sure feels like some of that happiness rubbed off on In Our Heads, one of Hot Chip's most confident, joyous, and danceable albums yet; if the band's previous album was about how seriously they take the relationships in their lives, then this album explores how much fun they have in them. &quot;Remember when we first heard the wall of sound?,&quot; Alexis Taylor asks on the soaring album opener, &quot;Motion Sickness.&quot; This intermingling of love, music, and love of music -- all propelled by some of Hot Chip's most undeniable rhythms -- carries through the rest of In Our Heads, whether it's the breezily endearing '80s synth pop reinventions of &quot;Don't Deny Your Heart,&quot; the life-affirming electro-funk of &quot;How Do You Do?,&quot; or the soulful surrender of &quot;These Chains&quot; (like many of the album's numerous highlights, these two songs have Taylor and Joe Goddard share lead vocal duties). Hot Chip let their unabashed love of dance music get the upper hand on two of In Our Heads' most show-stopping tracks -- which, probably not coincidentally, were both lead singles for the album. &quot;Night &amp; Day&quot; is one of the band's most playful and sneakily sexy dancefloor movers since &quot;Ready for the Floor,&quot; all wriggling basslines and deadpan rap (&quot;I like Zapp, not Zappa/So please quit your jibber-jabber,&quot; Taylor insists at one point). Meanwhile, the smooth house underpinnings on &quot;Flutes&quot; make its seven-minute journey from doubt to love all the more transporting. In Our Heads is also Hot Chip's most direct album yet, delivering their quirks and grooves with bigger, broader strokes that don't feel dumbed down; &quot;Let Me Be Him&quot; spells out the album's themes, but also decorates them with chirping birds and languid guitars that sound like an idyllic afternoon in a park. That Hot Chip manage to balance their kinetic and confessional sides so well here is no small feat, and In Our Heads is some of their finest and most accessible music, which is an extra treat for fans who liked One Life Stand's sentiments but wished that album moved feet as easily as it moved hearts.","torrent":{"xt":"urn:btih:3bd49f1e0bfe331a559f10c87c5bb2aff7a34d14","amp;dn":"Hot+Chip+-+In+Our+Heads+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd49f1e0bfe331a559f10c87c5bb2aff7a34d14","infoHashBuffer":{"type":"Buffer","data":[59,212,159,30,11,254,51,26,85,159,16,200,124,91,178,175,247,163,77,20]},"announce":[],"urlList":[]}}