{"title":"TSPussyhunters--TPH-36186 Venus Lux and Amy Faye","uid":11190027,"size":2188291238,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3bdc4c860d930237226977f9b692c3f63bb316a7&amp;dn=TSPussyhunters--TPH-36186+Venus+Lux+and+Amy+Faye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"merzedes","files":-1,"time":1412978421,"description":"\nPlastic Surgeon Seduction - Venus Feels UP her Patient!\n\nOct 10, 2014 - Performers: Venus Lux  and  Amy Faye \n\n\nMed, Hi and HD MP4 + Pics.\n\n\nVenus can tell her new client, Amy, is nervous. She's fidgeting and constantly eying Venus to see what &quot;parts&quot; of her have been, well augmented...Venus likes the look of little Amy so much, she pretends to be the doctor's assistant and leads her into the exam room where she begins to strip Amy down and fondle her ass and tits, groping and pinching her nipples until they are hard. \n\nAmy likes the attention and the advise - Venus clearly has so much more experience in this area and she's radiant and beautiful. Amy is quickly developing a crush. When Venus asks if she can finger her pussy and rub her tongue on her clit, Amy blushes but can't contain the growing wetness in her panties. She agrees and Venus goes in for the kill. She gets Amy riled up and completely absorbed in the idea of cumming, that she even forgets she is laying on the doctor's desk with her legs in the air. Venus slowly pulls down her own panties and her hard cock springs free. Amy's pussy gushes a little - boobs and a cock? The idea is dreamy and she welcomes Venus into her hot cunt with a thrust. Venus even convinces Amy to let her get the tip of her dick into her ass, but Amy's ass is too new to really take a fucking. A little slip inside is about all Venus can get before returning to her pussy which is more than willing to take her. When Venus cums it is all over Amy's face and mouth, a load so big it looks like she has not popped in a month. Her penis shoots rivers of cum and Amy is grateful for the hot load and her well fucked pussy clenches up in post-orgasmic bliss. \n\nScreens &lt;a href=&quot;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=36186&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tspussyhunters.com/site/shoot.jsp?shootId=36186&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n\n","torrent":{"xt":"urn:btih:3bdc4c860d930237226977f9b692c3f63bb316a7","amp;dn":"TSPussyhunters--TPH-36186+Venus+Lux+and+Amy+Faye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bdc4c860d930237226977f9b692c3f63bb316a7","infoHashBuffer":{"type":"Buffer","data":[59,220,76,134,13,147,2,55,34,105,119,249,182,146,195,246,59,179,22,167]},"announce":[],"urlList":[]}}