{"title":"Pond - Hobo Rocket (2013) [FLAC]","uid":8778759,"size":258629824,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c0e3b74de4c36094c8da0ee3dc9f7a5947237cf&amp;dn=Pond+-+Hobo+Rocket+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1375628105,"description":"\n  Pond - Hobo Rocket (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative, Neo-Psychadelia\n  Duration: 34:05\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Whatever Happened to the Million Head Collide \n  02 Xanman \n  03 O Dharma \n  04 Aloneaflameaflower \n  05 Giant Tortoise \n  06 Hobo Rocket \n  07 Midnight Mass (At The Market Street Payphone) \n\n  Considering that both bands share members and a similarly psychedelic mindset, Tame Impala are often the introductory gateway drug for the less established Pond. However, it's on 2013's Hobo Rocket that the little-brother band starts to establish its own unique identity. Armed with a desire to rock harder than they did on their former outing, Beard, Wives, Denim, or Tame Impala's textural Lonerism, heavy guitar fuzz takes the group's sound to a darker place. Nick Allbrook, Jay Watson, Joseph Ryan, Cam Avery, and Jamie Terry have been playing together for a while by now -- this being Pond's fifth official outing -- and their chemistry shows, made evident by some seriously extreme shifts in signatures and dynamics. Choice cuts &quot;Aloneaflameaflower&quot; and &quot;Giant Tortoise&quot; both demonstrate this range, propelled by crystalline, echo-laden vocals in slow, dreamy verses, before breaking hard into crazed drumming and fist-pumping Sabbath-influenced guitar riffs. While the fidelity is blown out to the red and hooks aren't as obvious this time (nothing is as instantly hummable as &quot;When It Grows&quot;), the Australian five-piece's arrangements are more schizophrenic and articulately structured, so it's a nice return to the spacy weirdness of their earlier outings when special guest Cowboy John (who is credited as a mystic, wanderer, and eccentric) takes over on vocal duties for the title track, slurring on about riding the cosmic express to find a horse with wings. Wide-eyed wonder still intact, there's a lot of depth to explore in the 30 minutes of Hobo Rocket, from bombastic glam, to chugging stoner rock, to colorful psychedelia -- all of it odd as usual.","torrent":{"xt":"urn:btih:3c0e3b74de4c36094c8da0ee3dc9f7a5947237cf","amp;dn":"Pond+-+Hobo+Rocket+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c0e3b74de4c36094c8da0ee3dc9f7a5947237cf","infoHashBuffer":{"type":"Buffer","data":[60,14,59,116,222,76,54,9,76,141,160,238,61,201,247,165,148,114,55,207]},"announce":[],"urlList":[]}}