{"title":"Ghosts of War by Brad Taylor (Pike Logan #10) (ePub)","uid":15129748,"size":747752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c6a574ecdd006e981c96fc3c86b93a42709ae1c&amp;dn=Ghosts+of+War+by+Brad+Taylor+%28Pike+Logan+%2310%29+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Skyeater","files":2,"time":1467142437,"description":"Ghosts of War (Pike Logan #10)\r\nby Brad Taylor\r\n\r\n-------------\r\n\r\nWorld War is on the horizon in New York Times bestselling author Brad Taylor’s tenth heart-pounding Pike Logan thriller.\r\n\r\nThe Taskforce has stopped countless terrorist threats across the globe, operating outside of US law to prevent the death of innocents. But now, along the fault lines of the old Iron Curtain, the danger is far greater than a single attack. With Russia expanding its influence from Syria to the Baltic States, the Taskforce is placed on stand-down because of the actions of one rogue operator.\r\n\r\nMeanwhile, Pike Logan and Jennifer Cahill travel to Poland, hired to verify artifacts hidden for decades in a fabled Nazi gold train, only to find themselves caught amid growing tensions between East and West. A Russian incursion into Belarus under the facade of self-defense is trumped by a horrific attack against the United States, driving NATO to mobilize even as it tries to determine who is behind the strike. \r\n\r\nOn the brink of war, Pike and Jennifer discover that there is a separate agenda in play, one determined to force a showdown between NATO and Russia. With time running out, and America demanding vengeance, Pike and Jennifer race to unravel the mystery before a point of no return is reached. Unbeknownst to them, there is another attack on the way. \r\n\r\nOne that will guarantee World War III","torrent":{"xt":"urn:btih:3c6a574ecdd006e981c96fc3c86b93a42709ae1c","amp;dn":"Ghosts+of+War+by+Brad+Taylor+%28Pike+Logan+%2310%29+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c6a574ecdd006e981c96fc3c86b93a42709ae1c","infoHashBuffer":{"type":"Buffer","data":[60,106,87,78,205,208,6,233,129,201,111,195,200,107,147,164,39,9,174,28]},"announce":[],"urlList":[]}}