{"title":"International Encyclopedia of Housing and Home - Susan J. Smith","uid":15574132,"size":171459135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c84935183f2045206349165dab041ca5c94d6d2&amp;dn=International+Encyclopedia+of+Housing+and+Home+-+Susan+J.+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"clouderone","files":1,"time":1471303573,"description":"International Encyclopedia of Housing and Home - Susan J. Smith (Elsevier, 2012).pdf\r\n\r\nAvailable online via SciVerse ScienceDirect, or in print for a limited time only, The International Encyclopedia of Housing and Home is the first international reference work for housing scholars and professionals, that uses studies in economics and finance, psychology, social policy, sociology, anthropology, geography, architecture, law, and other disciplines to create an international portrait of housing in all its facets: from meanings of home at the microscale, to impacts on macro-economy.\r\n\r\nThis comprehensive work is edited by distinguished housing expert Susan J. Smith, together with Marja Elsinga, Ong Seow Eng, Lorna Fox O'Mahony and Susan Wachter, and a multi-disciplinary editorial team of 20 world-class scholars in all. Working at the cutting edge of their subject, liaising with an expert editorial advisory board, and engaging with policy-makers and professionals, the editors have worked for almost five years to secure the quality, reach, relevance and coherence of this work. A broad and inclusive table of contents signals (or tesitifes to) detailed investigation of historical and theoretical material as well as in-depth analysis of current issues.\r\n\r\nThis seven-volume set contains over 500 entries, listed alphabetically, but grouped into seven thematic sections including methods and approaches; economics and finance; environments; home and homelessness; institutions; policy; and welfare and well-being. Housing professionals, both academics and practitioners, will find The International Encyclopedia of Housing and Home useful for teaching, discovery, and research needs.\r\n\r\n\r\n\r\nInternational in scope, engaging with trends in every world region\r\nThe editorial board and contributors are drawn from a wide constituency, collating expertise from academics, policy makers, professionals and practitioners, and from every key center for housing research\r\nEvery entry stands alone on its merits and is accessed alphabetically, yet each is fully cross-referenced, and attached to one of seven thematic categories whose ‘wholes' far exceed the sum of their parts","torrent":{"xt":"urn:btih:3c84935183f2045206349165dab041ca5c94d6d2","amp;dn":"International+Encyclopedia+of+Housing+and+Home+-+Susan+J.+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c84935183f2045206349165dab041ca5c94d6d2","infoHashBuffer":{"type":"Buffer","data":[60,132,147,81,131,242,4,82,6,52,145,101,218,176,65,202,92,148,214,210]},"announce":[],"urlList":[]}}