{"title":"John Robb - Punk Rock An Oral History (Epub)","uid":12165431,"size":5537861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cba0055e1da7901a33d16bfaaa4b5b5820f8fa0&amp;dn=John+Robb+-+Punk+Rock+An+Oral+History+%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438017375,"description":"'To see The Clash on the White Riot tour was like discovering how to be a rock star: you just did it yourself. You didn't wait for someone to come and discover you. That was the most important thing that came out of punk... We came home and we cut our hair and bought skinny trousers. It was year zero. That was the moment for me' Billy Bragg\n\nPunk Rock is a book like no other. It is an oral history of a radical movement which exploded in Seventies Britain. With its own clothes, hair, artwork, fanzines and radical politics, Punk boasted a DIY ethos that meant anyone could take part. The scene was uniquely vibrant and energetic, leaving an extraordinary legacy of notorious events, charismatic characters and inspirational music.\n\nJohn Robb has spent over a year interviewing more than 100 contributors including Glen Matlock, Mick Jones, Don Letts, Slash, Billy Bragg, Hugh Cornwell and Captain Sensible. Now, for the first time, they give the inside view on events such as The Sex Pistols' swearing live on the Bill Grundy TV show and staging their anti-Jubilee riverboat party on the Thames, famous gigs at The Roxy and 100 Club, and the groundbreaking records by The Pistols, The Clash, The Damned and others.\n\nFrom the widely debated roots of punk in the late-Sixties through to the fallout of the post-punk period in 1984, and the ongoing influence on today's bands, Punk Rock is the definitive oral history of an inimitable and exciting movement","torrent":{"xt":"urn:btih:3cba0055e1da7901a33d16bfaaa4b5b5820f8fa0","amp;dn":"John+Robb+-+Punk+Rock+An+Oral+History+%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cba0055e1da7901a33d16bfaaa4b5b5820f8fa0","infoHashBuffer":{"type":"Buffer","data":[60,186,0,85,225,218,121,1,163,61,22,191,170,164,181,181,130,15,143,160]},"announce":[],"urlList":[]}}