{"title":"New Millennium Funk Party 320cbr","uid":9496879,"size":171253981,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d7866b4d3cc7d2be2e822f080e68b09757f3715&amp;dn=New+Millennium+Funk+Party+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1390137340,"description":"Source: CD\n\nBy Warren \nComing on the heels of the original Millennium FUNK Party, NEW Millennium Funk Party is just as strong. This collection is a 70s/80s DJs dream of high quality, danceable 70s funk that has few weak points. All of these tracks are digitally remastered, and sound studio clean. My personal favorites from this CD are Fire (Ohio Players), For The Love Of Money (O'Jays), Supeprfreak (Rick James) and the cherry on my funky sundae, Bustin' Loose (Chuck Brown &amp; The Soul Searchers). There are a couple tracks that are not what this DJ would call &quot;funk&quot;, but still high quality R&amp;B tracks nonetheless. These would be Lady Marmalade (LaBelle) and Respect Yourself (Staple Singers) OK, so someone ran a few tracks shy of a funk CD, at least they filled with some GREAT R&amp;B numbers. This CD is great dance music for us children of the 70s and 80s. It is also playable as &quot;old school&quot; I highly recommend this CD if you like your soulful music sung and not rapped, or if you want to hear some top rate percussion, brilliant horn sections, tight harmony and infectious basslines -- in a word, musicianship. I would also recommend this CD for those who wonder where those cool samples came from in their modern hip hop songs. I would not recommend this CD if you want a smooth, slow, mellow R&amp;B sound.... this music is upbeat and lively from start to finish.","torrent":{"xt":"urn:btih:3d7866b4d3cc7d2be2e822f080e68b09757f3715","amp;dn":"New+Millennium+Funk+Party+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d7866b4d3cc7d2be2e822f080e68b09757f3715","infoHashBuffer":{"type":"Buffer","data":[61,120,102,180,211,204,125,43,226,232,34,240,128,230,139,9,117,127,55,21]},"announce":[],"urlList":[]}}