{"title":"Modest Mouse - Good News...Bad News (2004) [FLAC]","uid":8024067,"size":332346454,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d9a2dca5775ab970711f67356b3e879d23137bb&amp;dn=Modest+Mouse+-+Good+News...Bad+News+%282004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1358268751,"description":"\n  Modest Mouse - Good News...Bad News (2004) [FLAC]\n\n  Album: Good News for People Who Love Bad News\n\n  Released: 2004\n  Duration: 48:42\n  Genre: Pop/Rock\n  Style: Alternative, Indie\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Horn Intro\n  02 The World At Large\n  03 Float On\n  04 Ocean Breathes Salty \n  05 Dig Your Grave\n  06 Bury Me With It\n  07 Dance Hall\n  08 Bukowski\n  09 This Devil's Workday\n  10 The View\n  11 Satin In A Coffin\n  12 Interlude (Milo)\n  13 Blame It On The Tetons\n  14 Black Cadillacs\n  15 One Chance\n  16 The Good Times Are Killing Me\n\n  After more than a decade with Modest Mouse, Isaac Brock still sounds young and weird and searching, and never more so than on Good News for People Who Love Bad News, which follows the band's meditative The Moon &amp; Antarctica with a set of songs that are more focused, but also less obviously profound. The occasionally indulgent feel of The Moon &amp; Antarctica allowed Modest Mouse the room to make epic statements about life, death, and the afterlife; while Good News for People Who Love Bad News is equally concerned with mortality and spirituality, it has a more active, immediate feel that makes its comments on these subjects that much more pointed. The band hits these points home with a louder, more rock-oriented sound than they've had since The Lonesome Crowded West, particularly on &quot;Bury Me with It,&quot; which embodies many of the contradictions that continue to make Modest Mouse fascinating. For a song loosely about contemplating death, it sounds strikingly vital and liberated; Brock delivers finely shaded lyrics like &quot;We are hummingbirds who've lost the plot and we will not move&quot; with a barbaric yawp; it's nonsensical but oddly climactic, conveying how what seems trivial can be anything but. &quot;The View&quot;'s angular bassline and scratchy guitars underscore the Talking Heads influence on Modest Mouse, but since the Heads have become a more trendy touchstone (mostly for bands with less creativity than either Talking Heads or Modest Mouse), it's nice to hear how Brock and company take that influence in a different direction instead of just rehashing it with less inspiration. Feeling stuck is a major theme on Good News for People Who Love Bad News, but the same can't be said about the album's sound, which spans the forceful rock of the aforementioned songs, to the pretty guitar pop of &quot;Float On&quot; and &quot;Ocean Breathes Salty,&quot; to the lovely, rustic &quot;Blame It on the Tetons.&quot; That's not even mentioning the contributions of the Dirty Dozen Brass Band, who open Good News for People Who Love Bad News with the aptly named &quot;Horn Intro.&quot; They also add a theatrical jolt to the wickedly funny, Tom Waits-inspired &quot;Devil's Workday,&quot; which along with the noisy stomp of &quot;Dance Hall&quot; and &quot;Bukowski&quot;'s witty self-loathing, underscore that Modest Mouse haven't lost the edge that made the band compelling in the first place. Other standouts include &quot;Satin in a Coffin,&quot; a creatively creepy mix of rattling bluegrass-rock with a tango beat that nods to the group's backwater roots; &quot;One Chance,&quot; an unusually open and straightforward ballad; and the dreamlike &quot;World at Large,&quot; on which Brock sings, &quot;I like songs about drifters -- books about the same/They both seem to make me feel a little less insane,&quot; once again proving that he's a past master of lyrics that are both abstract and precise. Even though this album isn't as immediately or showily brilliant as The Moon &amp; Antarctica, Good News for People Who Love Bad News reveals itself as just as strong a statement. By drawing an even sharper contrast between the harsh and beautiful things about their music, as well as life, Modest Mouse have made an album that's moving and relevant without being pretentious about it.","torrent":{"xt":"urn:btih:3d9a2dca5775ab970711f67356b3e879d23137bb","amp;dn":"Modest+Mouse+-+Good+News...Bad+News+%282004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9a2dca5775ab970711f67356b3e879d23137bb","infoHashBuffer":{"type":"Buffer","data":[61,154,45,202,87,117,171,151,7,17,246,115,86,179,232,121,210,49,55,187]},"announce":[],"urlList":[]}}