{"title":"Barbie and the Diamond Castle 2008 Retail DVD5 Audio Ned.Fr.Eng.","uid":7171160,"size":4682240353,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3da34ade2a1154004eefa90fd74296f06299b82c&amp;dn=Barbie+and+the+Diamond+Castle+2008+Retail+DVD5+Audio+Ned.Fr.Eng.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"juutje","files":-1,"time":1333969379,"description":"Barbie and the Diamond Castle 2008 Retail DVD5 Audio Ned.Fr.Eng.TBS\n\nBarbie and the Diamond Castle (2008)\n\nAlternatieve titel: Barbie &amp; het Diamanten Kasteel \n\n\n\nVerenigde Staten\nAnimatie\n77 minuten\n\ngeregisseerd door Gino Nichele\nmet de stemmen van Kelly Sheridan, Melissa Lyons en Cassidy Ladden\n\nBarbie en Teresa vertellen ons het sprookjesachtige verhaal van Liana en Alexa, twee vriendinnen die alles met elkaar delen, waaronder hun liefde voor muziek. Hun gewone leventje verandert echter op slag wanneer ze een toverspiegel krijgen en vriendschap sluiten met het meisje dat erin gevangen zit. Om hun nieuwe vriendinnetje te redden, ondernemen Liana en Alexa een hachelijke reis naar het Diamantkasteel. Deze zware tocht stelt hun vriendschap op de proef, maar dankzij de kracht van muziek en het gezelschap van twee schattige pups overwinnen ze samen alle obstakels. Zo ontdekken ze dat vriendschap de enige echte schat is.\n\n\n\nEngels\n\nThe movie begins with Barbie and Teresa writing a song together on their guitars when Barbie's sister Stacie storms in angry with her friend Courtney. (This is the first appearance of Barbie's sister Stacie in any of the Barbie Films.) Barbie decides to tell Stacie the story of two friends named Liana and Alexa.\n\nAlthough the two girls do not have much, they have each other, a love of music and depend on planting flowers to upkeep their living. They live in a hut in a beautiful garden. One day, they find a pair of heart-shaped stones in the river near their house,not realizing they are actually trinkets of the mythical Diamond Castle, turn them into necklaces to symbolize their friendship. The next day, after sharing the last of their food with an old woman, she gives them a mirror, although none of them are aware that it is the hiding place of Melody, an apprentice muse on the run from Lydia, who turned evil and changed the other two muses to stone, but not before they hid their home, the Diamond Castle, and left the key with Melody. As the Diamond Castle is the birthplace of all music, Lydia's finding it would mean the end of music, and with it, eventually the world. Liana and Alexa coax a song out of Melody, and Lydia's minion, a dragon known as Slyder, is able to locate the young muse by her voice.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/51627#&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/51627#&lt;/a&gt;\nWeblink http://www.imdb.com/title/tt1294138/\n\n\n\n\nFile Format: Video TS Bestand Pal\nBron: Retail\nFile size:4.35 GB\nLanguage:English French,Dutch DD 5.1\nSUBS: English,Dutch,French, (selectable)\nBreedte : 720 pixels\nHoogte  : 576 pixels\nCategory : Movie\nFormaat: Dvd 5\nMenu: Yes \nExtra: Yes\nCover: Yes\n\nEnjoy the Movie\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:3da34ade2a1154004eefa90fd74296f06299b82c","amp;dn":"Barbie+and+the+Diamond+Castle+2008+Retail+DVD5+Audio+Ned.Fr.Eng.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da34ade2a1154004eefa90fd74296f06299b82c","infoHashBuffer":{"type":"Buffer","data":[61,163,74,222,42,17,84,0,78,239,169,15,215,66,150,240,98,153,184,44]},"announce":[],"urlList":[]}}