{"title":"Oruchuban Ebichu 1-24(Complete)","uid":3527793,"size":2088284160,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3dbeb19e0d6bb69158803f786435e25a1025b3fb&amp;dn=Oruchuban+Ebichu+1-24%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ethra","files":12,"time":1158951625,"description":"Oruchuban Ebichu\n---------------------------\n\n\nEbichu is very adult in nature, and its explicit violence, innuendo, and sexual scenes could only be shown on DirecTV Japan. The uncut version of the series is only found on DVD. The show is done in a simplistic art style, and its sexual content is played for laughs rather than for fanservice.\n\nMost episodes follow Ebichu, a talking hamster devoted to her oft-indifferent owner, who is only identified as OL (&quot;Office Lady&quot;), a single 25 year old (this is the age Japanese women are considered nearing the end of the ideal marrying age) who doles out cynical commentary and the occasional beating on the rodent. Ebichu tends to take this in stride with endless praise and compliments. However, such abuse is usually caused by Ebichu&amp;#039;s almost disturbing lack of tact or propriety, often embarassing her master in front of other people.\n\nEbichu often attempts to correct OL&amp;#039;s bad decisions, such as her berating of OL&amp;#039;s obnoxious and untrustworthy boyfriend Ebichu nicknamed Kaishounachi (literally, Useless).\n\nEbichu is sometimes joked by fans to be the complete polar opposite of Hamtaro, a popular children&amp;#039;s anime featuring a hamster in more wholesome adventures.\n\nThe origin of the anime came about during voice recording sessions for Neon Genesis Evangelion. Kotono Mitsuishi, the seiyuu for the character of Misato Katsuragi would read the Ebichu manga in between takes and laugh at the humor. She would show others what she was reading and eventually it was decided that the series was worth animating. As a result, Mitsuishi Kotono was selected to voice the title character of housekeeping hamster Ebichu.\n\n\n--------------------------\n\n\nAnother upload by Ethra, I can really recommend this anime to just about everyone, great fun, some sex and furious hamster-beatings :D\n","torrent":{"xt":"urn:btih:3dbeb19e0d6bb69158803f786435e25a1025b3fb","amp;dn":"Oruchuban+Ebichu+1-24%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dbeb19e0d6bb69158803f786435e25a1025b3fb","infoHashBuffer":{"type":"Buffer","data":[61,190,177,158,13,107,182,145,88,128,63,120,100,53,226,90,16,37,179,251]},"announce":[],"urlList":[]}}