{"title":"Neal Asher -  The Skinner (Spatterjay #1)","uid":11570783,"size":689680958,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3dfce9db73c517033dead46b41bed6b4860b1df2&amp;dn=Neal+Asher+-++The+Skinner+%28Spatterjay+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Cybotage","files":16,"time":1417019467,"description":"Neal Asher -  The Skinner (Spatterjay #1)\n\nWritten by Neil Asher\nFormat: MP3\nUnabridged\n\nNeal Asher, whom Tor introduced to the American audience with Gridlinked, takes us deeper into his unique universe with an even more remarkable second novel, The Skinner.\n\nOn the planet Spatterjay arrive three travelers: Janer, acting as the eyes of the hornet Hive mind, on a mission not yet revealed to him; Erlin, searching for Ambel -- the ancient sea captain who can teach her how to live; and Sable Keech, on a vendetta he cannot abandon, though he himself has been dead for 700 years. This remote world is mostly ocean, and it is a rare visitor who ventures beyond the safety of the island Dome. Outside it, only the native Hoopers dare risk the voracious appetites of the planet's wildlife. But somewhere out there is Spatterjay Hoop -- and Keech will not rest until he brings this legendary renegade to justice for hideous crimes committed centuries ago during the Prador Wars.\n\nWhile Keech is discovering that Hoop is now a monster -- his body and head living apart from each other -- Janer is bewildered by a place where the native inhabitants just will not die and angry when he finally learns the Hive mind's intentions for him. Meanwhile, Erlin thinks she has plenty of time to find the answers she seeks, but could not be more wrong. For one of the most brutal of the alien Prador is about to pay the planet a surreptitious visit, intent on exterminating all remaining witnesses to his wartime atrocities. As the visitors' paths converge, major hell is about to erupt in a chaotic waterscape where minor hell is already a remorseless fact of everyday life . . . and death","torrent":{"xt":"urn:btih:3dfce9db73c517033dead46b41bed6b4860b1df2","amp;dn":"Neal+Asher+-++The+Skinner+%28Spatterjay+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfce9db73c517033dead46b41bed6b4860b1df2","infoHashBuffer":{"type":"Buffer","data":[61,252,233,219,115,197,23,3,61,234,212,107,65,190,214,180,134,11,29,242]},"announce":[],"urlList":[]}}