{"title":"Kingdom Hearts: Birth by Sleep - Sony PSP","uid":9494841,"size":1767471104,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3e04c02a5bccd42bb86e772c0ced13623ba22847&amp;dn=Kingdom+Hearts%3A+Birth+by+Sleep+-+Sony+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"InsideNigga","files":-1,"time":1390074935,"description":"** This is an ISO File... Goes in your ISO folder in your PSP**\n\nASIN: B002I0GZ5Y\nMedia: Video Game\nRelease Date: September 7, 2010\n\nDisney worlds and characters never before seen in KINGDOM HEARTS, such as Enchanted Dominion (Sleeping Beauty) and Castle of Dreams (Cinderella) will make their first appearances in KINGDOM HEARTS Birth by Sleep.\n\nUnravel the mystery surrounding the origin of the KINGDOM HEARTS saga through the tales of three unique characters - Terra, Ventus and Aqua. The whole story is revealed only after playing through with all three characters\n\nThe familiar action-packed experience that fans have come to embrace returns with an enhanced battle system, with all new features such as Command Styles, Command Decks, Shotlocks and Dimension Links making it the most advanced KINGDOM HEARTS title to date\n\nShare the excitement and fun with your friends with four brand-new multiplayer modes: Versus, Arena, Command Board and Rumble Racing\nWorld renowned creator and character designer Tetsuya Nomura brings the the latest installment of Kingdom Hearts to life with vibrant, colorful and stunning graphics in 16:9 widescreen presentation made possible by the PSP system hardware","torrent":{"xt":"urn:btih:3e04c02a5bccd42bb86e772c0ced13623ba22847","amp;dn":"Kingdom+Hearts%3A+Birth+by+Sleep+-+Sony+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e04c02a5bccd42bb86e772c0ced13623ba22847","infoHashBuffer":{"type":"Buffer","data":[62,4,192,42,91,204,212,43,184,110,119,44,12,237,19,98,59,162,40,71]},"announce":[],"urlList":[]}}