{"title":"Metropolis (1927) - Moroder Version (1984) [DVD5 Sub ENG ITA] [a","uid":6150731,"size":4714642549,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3ea7623922157a80b635d3aad193198260bd1569&amp;dn=Metropolis+%281927%29+-+Moroder+Version+%281984%29+%5BDVD5+Sub+ENG+ITA%5D+%5Ba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"dedalo33","files":28,"time":1296868590,"description":"METROPOLIS - Fritz Lang(1927)\nMORODER version (1984)\n\nby aritanga\n\n\n:::-&gt; Scheda del film &lt;-:::\n\nCast: Alfred Abel Gustav FrÃƒÂ¶hlich Rudolf Klein-Rogge Fritz Rasp Theodor Loos Erwin Biswanger Heinrich George Brigitte Helm Fritz Alberti Grete Berger Olly Boeheim Max Dietze Ellen Frey Beatrice Garga Heinrich Gotho Dolly Grey Anny Hintze Georg John Walter Kuehle Margarete Lanner Rose Lichtenstein Hanns Leo Reich Arthur Reinhardt Curt Siodmak Henrietta Siodmak Olaf Storm Erwin Vater Rolf von Goth Helen von MÃƒÂ¼nchofen Helene Weigel Hilde Woitscheff\n\n\n:::-&gt;Trama&lt;-:::\n\nXXI secolo. Una metropoli tiranneggiata da Frederson, un uomo che schiavizza gli operai costringendoli a vivere nel sottosuolo. I proletari sono guidati nella riscossa da Maria, di cui si innamora l' ignaro figlio del dittatore. Frederson, per controllare gli operai, fa costruire da uno scienziato un cyborg sosia di Maria.\nBen prima di George Orwell e del suo romanzo &quot;1984&quot;, Lang ipotizza un possibile 2026, esattamente 100 anni di distanza da quella di produzione del film, nel quale le divisioni classiste sembrano accentuarsi ; nella sfavillante Metropolis, infatti, vivono gli industriali, i manager, i ricchi e nel sottosuolo vivono gli operai confinati in un ghetto di cui i ricchi sembrano neanche ricordarsi. Proprio Freder, figlio di John Fredersen proprietario delle macchine che forniscono l' energia alla cittÃƒÂ , si accorge del mondo che gli sta sotto grazie a Maria, una vate che predica agli operai il possibile avvento di un mediatore tra loro e i capitalisti.\n\n:::-&gt; Riferimenti, commenti e curiositÃƒÂ  &lt;-:::\n\nAll' inizio di Metropolis si legge questo messaggio di introduzione:\n- Questo film non ÃƒÂ¨ di oggi o del futuro.\n- Non ha un luogo.\n- Non appoggia ideologie, partiti o classi.\n- Ha una morale che si sviluppa sulla comprensione :&quot;Il cuore ÃƒÂ¨ l' intermediario tra i muscoli e la mente&quot;.\n\nIdeologicamente risente delle idee della sceneggiatrice Thea von Harbou (all' epoca moglie del regista ed autrice del romanzo da cui l' opera ÃƒÂ¨ tratta), ma il tocco cinematografico di Lang supera qualunque polemica : espressionista ma giÃƒÂ  lanciato nella modernitÃƒÂ . Il film ÃƒÂ¨ tratto da un romanzo d' appendice della stessa von Harbou, pubblicato nei primi anni dieci, ma si discosta notevolmente dalla trama del racconto. La von Harbou negli anni venti aveva maturato una coscienza politica molto differente da quella che aveva ispirato il romanzo e in quegli anni anche la sua produzione non si distaccÃƒÂ² mai dalla mediocritÃƒÂ . Con l' ascesa al potere di Hitler Thea von Harbou arrivÃƒÂ² a riconoscersi nel nazionalsocialismo, tanto che Lang, disgustato da questo cambiamento, chiese il divorzio e fuggÃƒÂ¬ dalla Germania.\n\nLe immagini della cittÃƒÂ  del futuro e delle tecnologie immaginate nel 1926 stupiscono per la loro modernitÃƒÂ , mentre il messaggio ÃƒÂ¨ riconducibile alle istanze di rivalsa sociale piÃƒÂ¹ edulcorate e politicamente corrette.\nProprio in virtÃƒÂ¹ di ciÃƒÂ², sarÃƒÂ  lo stesso Fritz Lang, in un' intervista del 1966, a &quot;rinnegare&quot; in parte il proprio magistrale lavoro:\n&quot;Ho spesso dichiarato di non amare Metropolis perchÃƒÂ© ÃƒÂ¨ impossibile per me oggi accettare il &quot;messaggio&quot; del film. E un' assurditÃƒÂ  quella di dire che il cuore ÃƒÂ¨ l' intermediario fra le braccia e la mente. CioÃƒÂ¨, evidentemente, tra l' impiegato e il datore di lavoro, il lavoro e il Capitale. Il problema ÃƒÂ¨ sociale e non morale.\nCi credevo mentre giravo il film, come avrei potuto terminarlo altrimenti ? Ma in seguito cominciai a capire che non andava. Ho pensato, ad esempio, che uno dei difetti consisteva nel modo con il quale avevo descritto il lavoro dell' uomo e delle macchine. Ricordate, ad esempio, gli orologi e l' uomo che lavora in armonia con essi ?\nDiventava una parte integrante delle macchine. Compresi che tutto ciÃƒÂ² era troppo simbolico, eccessivamente semplicistico nell' evocazione di quelli che si definiscono i guai della meccanizzazione.&quot;\n\nMetropolis fu proiettato per la prima volta il 10 gennaio 1927 (da qui le diversitÃƒÂ  di attribuzioni dell' anno tra 1926 e 1927...) all' UFA-Palast am Zoo di Berlino. Nella sua storia ottenne anche recensioni tutt' altro che positive:\n- Uno dei peggiori film mai fatti (Herbert George Wells)\n- Un film retorico, banale, pedante, intriso di romanticismo superato... ma se opponiamo alla storia la fotogenia plastica del film, allora reggerÃƒÂ  qualsiasi confronto, ci sconvolgerÃƒÂ  come il piÃƒÂ¹ bel libro d' immagini mai visto (Luis Bunuel)\nCiononostante oggi Metropolis ÃƒÂ¨ considerato una delle pellicole piÃƒÂ¹ importanti nella storia del Cinema.\n\nL' ispirazione per Metropolis deriva da un' esperienza personale di Lang. Mentre stava arrivando negli Stati Uniti per la prima de &quot;I Nibelunghi&quot;, Lang rimase colpito e impressionato dalla vista notturna di New York e del suo skyline.\nLang ha ripudiato il finale del film. Il finale esistente ÃƒÂ¨ quello scritto da Thea von Harbou. Quello scritto da Lang avrebbe visto i due innamorati partire su un razzo, mentre la cittÃƒÂ  veniva distrutta dagli sconvolgimenti della ribellione.\nEsiste una versione del film da 87 minuti, colorizzata e ridoppiata con colonna sonora rock, realizzata nel 1984 dal musicista Giorgio Moroder. Tra i brani inseriti nel commento sonoro spicca Radio Ga Ga dei Queen il cui video utilizza proprio spezzoni del film.\nGli operai non hanno caratteristiche fisiche determinanti e, con l' eccezione di 11811, non vengono mai caratterizzati con espressioni o nomi. Anche le operazioni che compiono non sono riconducibili ad alcuna vera pratica produttiva e sono solo movimenti simbolici rappresentativi della meccanizzazione delle azioni umane.\nAdolf Hitler amava Metropolis e lo considerava uno dei suoi film preferiti (ehm...ricordatevi delle tradite radici socialiste del soggetto... del resto comuni anche a Mussolini..).\n\nL' influenza di Metropolis in opere successive\nMetropolis ÃƒÂ¨ una pietra miliare del cinema. Molti capolavori successivi, ma anche opere non cinematografiche, hanno tratto ispirazione e reso omaggio a questo film. Eccone alcune:\n- Nel Dottor Stranamore, di Stanley Kubrick, lo scienziato pazzo veste un guanto nero sulla mano destra che non riesce a controllare coscientemente. E' considerato un omaggio a Metropolis\n- Anakin e Luke Skywalker, nella saga Guerre Stellari di George Lucas, perdono la mano destra in combattimento ed entrambi le rimpiazzano con delle protesi rivestite da un guanto nero. Inoltre C3PO assomiglia molto al robot Maria\n- Nel film Hakers c' ÃƒÂ¨ una locandina di Metropolis\n- Osamu Tezuka ha dichiarato che il suo manga Metropolis ÃƒÂ¨ ispirato alla locandina del film, ma di non aver visto il lungometraggio del 1927\n- Il video Express Yourself di Madonna e le scenografie iniziali degli spettacoli &quot;Blond Ambition Tour&quot; del 1990 sono un omaggio a Metropolis\n- I Queen hanno utilizzato spezzoni del film per il loro video Radio Ga Ga\n\nTra i tanti film di fantascienza che citano o si ispirano a questa pellicola si ricordano Blade Runner, Brazil, Guerre Stellari (da notare la somiglianza tra l' androide Maria e C3PO).\n\n\n:::-&gt; Tecnica &lt;-:::\n\nIl film ÃƒÂ¨ costruito come un opera lirica, ed ÃƒÂ¨ nettamente diviso in tre parti : il &quot;Prologo&quot; che dura per l' intera prima metÃƒÂ  del film, un breve &quot;Intermezzo&quot; e un &quot;Furioso&quot; che segna le scene finali.\nDal punto di vista tecnico nel 1927 Metropolis era un film prodigioso. Faceva uso di tecniche di ripresaa allora strabilianti. Tra queste, l' introduzione nel cinema d' autore del Passo uno, ovvero le riprese effettuate per singoli fotogrammi che rimasero nel campionario dei realizzatori di effetti speciali fino all' avvento della computer grafica.\nI fondali sono dipinti con grande cura per gli effetti prospettici e di profonditÃƒÂ  e mantengono un' ispirazione grafica in stile anni '30 molto caratterizzante.\nNel fim vi sono sequenze di animazione e un uso estremamente innovativo e sapiente dei modellini in scala per la realizzazione delle scene panoramiche o della cittÃƒÂ  sotterranea.\nLa tecnica di ripresa usata ÃƒÂ¨ quella nota come Metodo Schufftan : davanti alla cinepresa viene posto uno specchio inclinato a 45Ã‚Â° che riflette la scena riprodotta con modellini su un fondale proiettato.\nLo specchio viene grattato dove il fondale sopravanza l' effetto dei modellini permettendo di curare nel dettaglio la profonditÃƒÂ  di campo. Questa tecnica dÃƒÂ  i suoi migliori risultati nelle scene della CittÃƒÂ  dei Lavoratori, della Torre di Babele e delle viste aeree di Metropolis.\nNon esistendo tecniche di editing adatte, le scene con esposizioni multiple sono state realizzate direttamente sul posto, riavvolgendo la pellicola e filmandovi sopra piÃƒÂ¹ volte, in alcuni casi anche per 30 passaggi. Questa tecnica ÃƒÂ¨ molto difficile e delicata, in quanto un solo errore comprometterebbe tutto il lavoro.\nNon esiste una vera e propria edizione &quot;ufficiale&quot; del film. Lang montÃƒÂ² la prima versione che venne subito accorciata di oltre 30 minuti. Altre versioni furono rilasciate in seguito. Oggi quella riconosciuta come piÃƒÂ¹ attendibile ÃƒÂ¨ quella restaurata da Enno Patalas nel 1984 per la Cineteca di Monaco da 147 minuti.\nUna versione restaurata ÃƒÂ¨ stata edita nel 2001, recuperando parte del materiale originale sopravvissuto.\nUna versione da 115' ÃƒÂ¨ comunemente reperibile su DVD.\nLa produzione impegnÃƒÂ² la troupe per diciannove mesi, trecentodieci giorni di riprese e sessanta notti furono necessarie per produrre 600.000 metri di pellicola fotografica.\nErich Pommer e la casa di produzione UFA non badarono a spese per la lavorazione assoldando 36.000 comparse. L' investimento superÃƒÂ² i 50 milioni di marchi tedeschi di allora.\nQueste spese non vennero coperte dagli introiti della pubblicazione tanto che la UFA andÃƒÂ² in bancarotta.\nAlfred Hugenberg, editore e membro del Partito Nazista, comprÃƒÂ² la UFA trasformandola in parte della macchina propagandistica del nazismo.\nIl film non ebbe grande successo in Europa ma negli Stati Uniti, al Rialto di New York, alla prima nazionale si presentarono oltre 10.000 persone.\nIl valore culturale e tecnico del film lo ha portato ad essere stato il primo film inserito nel registro Memory of the world, un progetto dell'Unesco nato nel 1992 per salvaguardare le opere documentarie piÃƒÂ¹ importanti dell'umanitÃƒÂ .\nOggi dell' originale Metropolis sopravvive solo parte dei negativi e alcune copie di versioni ridotte realizzate all' epoca. Un quarto del filmato originale ÃƒÂ¨ andato perduto, cosÃƒÂ¬ come tutte le sceneggiature, i modellini e il robot Maria distrutti durante i bombardamenti alleati della Seconda guerra mondiale.\n\nRelease METROPOLIS (restored version 2001): http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=76235\n\nRelease Metropolis (1927) - Moroder version (1984), [XviD - MP3 - Sub Eng Ita]: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=106907\nN.B. Nella presente release (DVD) ÃƒÂ¨ contenuto anche il file audio .mp3 e le istruzioni per sostituire quello &quot;fuori sincrono&quot; contenuto nel file XviD &quot;METROPOLIS (Moroder version).avi&quot;\n\n\n:::-&gt;Scheda tecnica del DVD&lt;-:::\n\nDurata: 87'\nLingue: N/A\nAudio: LPCM 2-ch\nMenu: Si\nSottotitoli: Eng (panel) - Ita\nFormato Video: NTSC 4:3\nCompressione: No\nProgrammi utilizzati: Vari per menu e aggiunta sub Ita","torrent":{"xt":"urn:btih:3ea7623922157a80b635d3aad193198260bd1569","amp;dn":"Metropolis+%281927%29+-+Moroder+Version+%281984%29+%5BDVD5+Sub+ENG+ITA%5D+%5Ba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ea7623922157a80b635d3aad193198260bd1569","infoHashBuffer":{"type":"Buffer","data":[62,167,98,57,34,21,122,128,182,53,211,170,209,147,25,130,96,189,21,105]},"announce":[],"urlList":[]}}