{"title":"Grace Holliday Mystery series - Elisabeth Crabtree","uid":9695865,"size":1457206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f20ee5c7829d36e017e4093bad739e20f5ef4f1&amp;dn=Grace+Holliday+Mystery+series+-+Elisabeth+Crabtree&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1393891810,"description":"Elisabeth Crabtree is the author of the Grace Holliday Cozy Mystery Series. There are currently two books in the series, with a third coming out Spring 2013. As a life-long mystery fan, Elisabeth enjoys writing light, comedic mysteries with a touch of romance. When not working on her next book, she enjoys playing part-time genealogist, spending time with her family, and playing with her dog, Scooby.\n\n#1 Deadly Magic \nIt's Halloween night and the normally unhappy co-workers of the Straker Toy Company are eagerly looking forward to the celebration of their tyrannical boss' fiftieth birthday. None more so than Grace Holliday. After all, it's not every day she gets invited to the annual costumed bash at the Dragon's Lair, the premier magic theater in Manhattan.\nWhat promises as a night of magic and mystery, quickly turns into a night of mayhem and murder when the boss' equally tyrannical wife dies on stage. \nAccording to the police, it was an obvious suicide. Now it's up to Grace to discover which one of her co-workers pulled off the trick of the year before she becomes the killer's next victim.\n\n#2 Deadly Reunion\nGrace Holliday has come back home to Rabbit Falls, Colorado. Regrettably, not as successful or as wealthy as she had intended when she left her small town ten years before. Fired from her job, evicted, and having to move back in with her parents was not how she pictured her life turning out, and the last thing she wants to do is attend her ten year high school reunion. Unfortunately, her twin sister, Hope, has other ideas.\nHope drags Grace back to their old school, determined to settle an old score. Despite the best efforts of the planning committee, things quickly go from bad to deadly, and before the night is through, one of Grace's classmates will be murdered.\nAll Grace wants to do is put the horrible night behind her, go home, and scour the want ads. Unfortunately, the only job available is the only one she doesn't want: figuring out who killed the Reunion Queen.\n\n#3 Death Takes a Holiday\nHoping to turn her friendship with Kyle into something more, Grace Holliday jumps at the chance to accompany him on a pre-New Year's Eve romantic train ride through the mountains. But a threatening message scrawled on the bathroom mirror turns their romantic getaway into a nightmare. \nSoon, she discovers that all of the passengers have been lured to the train under false pretenses and that a sinister presence lurks among the luxurious accommodations. \nWhen one of the passengers is murdered, and the train becomes stranded in the middle of nowhere, Grace and Kyle find themselves in a race against time to trap a killer before the clock strikes twelve.\n\n#4 Murder Games\nIt's the Crystal Palace Hotel's 5th annual murder mystery game extravaganza. A weeklong event of clues, costumes, red herrings, suspense, chills and murders spread across the hotel's expansive mountaintop acres. \nKyle and Grace have secured two tickets to the most coveted game the Crystal Palace has to offer. Two days at Murder Manor, a Victorian mansion secluded far away from the hotel and nestled within an elaborate hedge maze. Two days of safe murderous fun or so they thought but when a dead body is found floating in the pond near the hotel and rumors abound of a killer lurking on the grounds, Grace begins to wonder whether they are truly safe and how can you know what's real when every one is pretending to be someone they're not. With only each other to rely on, Grace and Kyle go on the hunt for a dangerous killer stalking the manor and its guests.","torrent":{"xt":"urn:btih:3f20ee5c7829d36e017e4093bad739e20f5ef4f1","amp;dn":"Grace+Holliday+Mystery+series+-+Elisabeth+Crabtree","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f20ee5c7829d36e017e4093bad739e20f5ef4f1","infoHashBuffer":{"type":"Buffer","data":[63,32,238,92,120,41,211,110,1,126,64,147,186,215,57,226,15,94,244,241]},"announce":[],"urlList":[]}}