{"title":"Halo: Silentium: The Forerunner Saga, Book 3 (Unabridged)","uid":8871506,"size":1172656628,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3f24497356721273880aa38e6f62e02e40e95106&amp;dn=Halo%3A+Silentium%3A+The+Forerunner+Saga%2C+Book+3+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Lignus","files":-1,"time":1378076317,"description":"Written by Greg Bear\nRead by Euan Morton\nFormat: Mixed\nBitrate: Variable\nUnabridged\n\nHalo: Silentium: The Forerunner Saga, Book 3 (Unabridged)\n\nThere is a Chaptered M4B file(16kbps) as well as a folder containing all the chapters in MP3(320kbps).\n\nPublisher Summary:\n\nIn the last years of the Forerunner empire, chaos rules. The Flood - a horrifying shape-changing parasite - has arrived in force, aided by unexpected allies. Internal strife within the ecumene has desperately weakened Forerunner defenses.\n\nToo little, too late, the legal rate of Juridicals is only now investigating possible crimes by the Master Builder and others. Evidence-gathering agents known collectively as Catalog have been dispatched to collect testimony from the Librarian and both Didacts: the Ur-Didact, treacherously abandoned in a Flood-infested system, and the Bornstellar Didact, who accompanies the Librarian as she preserves specimens against the dire possibility of Halo extermination.\n\nFacing the imminent collapse of their civilization, the Librarian and the Ur-Didact reveal what they know about the relationship between the long-vanished Precursors and the Flood. The Precursors created many technological species, including humanity and the Forerunners. But the roots of the Flood may be found in an act of enormous barbarity, carried out beyond our galaxy 10 million years before.... Because of that barbarism, a greater evil looms. Only the Ur-Didact and the Librarian - husband and wife pushed into desperate conflict - hold the keys to a solution. Facing the consequences of a mythic tragedy, one of them must now commit the greatest atrocity of all time - to prevent an insane evil from dominating the entire universe.\n\nÂ©2013 Greg Bear (P)2013 Macmillan Audio","torrent":{"xt":"urn:btih:3f24497356721273880aa38e6f62e02e40e95106","amp;dn":"Halo%3A+Silentium%3A+The+Forerunner+Saga%2C+Book+3+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f24497356721273880aa38e6f62e02e40e95106","infoHashBuffer":{"type":"Buffer","data":[63,36,73,115,86,114,18,115,136,10,163,142,111,98,224,46,64,233,81,6]},"announce":[],"urlList":[]}}