{"title":"Oneohtrix Point Never - R Plus Seven (2013) [FLAC]","uid":8984193,"size":245463238,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f4ac051dffd8737336b52a33693f76733dfdecb&amp;dn=Oneohtrix+Point+Never+-+R+Plus+Seven+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1380589090,"description":"\n  Oneohtrix Point Never - R Plus Seven (2013) [FLAC]\n\n  Genre: Electronic\n  Styles: Ambient, Experimental\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Boring Angel\n  02 Americans\n  03 He She\n  04 Inside World\n  05 Zebra\n  06 Along\n  07 Problem Areas\n  08 Cryo\n  09 Still Life\n  10 Chrome Country\n  \n  Over the course of Oneohtrix Point Never's discography, Daniel Lopatin managed to sound markedly different from album to album while keeping an overarching aesthetic. His Warp debut, R Plus Seven, often feels like a microcosm of that approach; these shape-shifting songs hold together more because of Lopatin's bold sonic palette than any unifying concept. Aside from the opening track, &quot;Boring Angel,&quot; he downplays the drones that made up the heart of his earlier work (and Replica, to a lesser extent) in favor of bright, briskly applied tones that, on the surface, seem like the opposite of his usual modus operandi. This fragmentation could be seen as a variation of Replica's choppy recontextualizing, though the results are dizzying rather than hypnotic: &quot;Americans&quot; hops from environmental sounds to zapping synths to cheery strings to choral vocals in what feels like the musical equivalent of a series of smash cuts. Similarly, Lopatin trades one kind of nostalgia for another: instead of evoking (and sampling from) the '70s and early '80s as his earlier work did, the brittle, sometimes cheap MIDI-esque sounds he sprinkles throughout R Plus Seven recall the late '80s and early '90s. \n\n  The preponderance of choral pads on tracks such as the fittingly named &quot;Still Life&quot; give the album an eerie, uncanny valley-ish undercurrent, while &quot;Along&quot;'s mix of piping synth flutes, exotic percussion, and sax sounds like new age and smooth jazz run through a woodchipper. However, thanks to the light-handed arrangements, what could be cheesy or ironic more often than not feels forward-looking. Despite the dots and dashes of sound at any given moment, the album gives an overall impression of sleekness, and its subversive glossiness suggests that its tracks were made from pop songs that were shattered into shards that are as alluring as they are difficult to piece together. Occasionally, Lopatin tones down the hyperactivity a bit, resulting in highlights like &quot;Problem Areas,&quot; which is carried by rubbery bass and a stairstepping brass motif, and &quot;Zebra&quot; and &quot;Chrome Country,&quot; which both use warm-sounding synths to surprisingly emotional effect (even if the latter song tweaks the choral pad so violently that it sounds like it's shrieking). By conventional standards, R Plus Seven isn't a widely appealing crossover for Lopatin's new label. Yet in an almost perverse way, the playful spirit of these tracks and their lively sounds make for some of his most accessible work yet. For the most part, the album showcases Oneohtrix Point Never's restlessness and ambition in flattering ways; if it's equal parts mystifying and beautiful, it's also a puzzle well worth trying to figure out.","torrent":{"xt":"urn:btih:3f4ac051dffd8737336b52a33693f76733dfdecb","amp;dn":"Oneohtrix+Point+Never+-+R+Plus+Seven+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f4ac051dffd8737336b52a33693f76733dfdecb","infoHashBuffer":{"type":"Buffer","data":[63,74,192,81,223,253,135,55,51,107,82,163,54,147,247,103,51,223,222,203]},"announce":[],"urlList":[]}}