{"title":"Gandhi, Rajmohan - Punjab_ A History from Aurangzeb to Mountbatt","uid":10037073,"size":1679284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fd9593507a89b8f192ffb9e6ef30e76d02bd61b&amp;dn=Gandhi%2C+Rajmohan+-+Punjab_+A+History+from+Aurangzeb+to+Mountbatt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Papushi","files":-1,"time":1398410755,"description":"For centuries, the fertile land of five rivers in the north of the Indian subcontinent was coveted by numerous empires and invaders. In this, the first major account of undivided Punjab, award-winning historian, biographer and scholar, Rajmohan Gandhi, traces its history during its most tumultuous phase from the death of Aurangzeb, in the early eighteenth century, to its brutal partition in 1947, coinciding with the departure of the British.\n\nRelying on fresh sources as well as previous accounts provided from opposing perspectives, the author gives us a compelling narrative about the great events of the time in the region the battles and tragedies that routinely disrupted the lives of ordinary Punjabis, the sacking of iconic cities like Lahore, Amritsar, Multan and Jalandhar by a succession of conquerors, the ravages wrought by invaders like Nadir Shah, the rise of the Sikhs culminating in the storied reign of Maharaja Ranjit Singh, Britain s successful wars against the Sikh kingdom, the Great Rebellion of 1857 and its effect on Punjab, imperialist machinations, the influence on the people by leaders of the independence movement like Mahatma Gandhi, Muhammad Ali Jinnah and Lala Lajpat Rai, as also key regional figures such as Fazl-i-Husain, Master Tara Singh, Sikander Hayat Khan and Khizr Hayat Tiwana, the devastation of Partition and much else besides.\n\nBelieving that modern India and Pakistan cannot be understood without comprehending the Punjab that was, the author also delves into the idea of Punjabiyat Punjabiness the literature and poetry of creative giants like Bulleh Shah, Waris Shah, Iqbal, Amrita Pritam and Saadat Hasan Manto, the spiritual teachings of the Sikh Gurus and Sufi saints, and, above all, the testimonials and narratives of ordinary Punjabis, to create an unforgettable portrait of a place undivided Punjab - that continues to fascinate us. ","torrent":{"xt":"urn:btih:3fd9593507a89b8f192ffb9e6ef30e76d02bd61b","amp;dn":"Gandhi%2C+Rajmohan+-+Punjab_+A+History+from+Aurangzeb+to+Mountbatt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fd9593507a89b8f192ffb9e6ef30e76d02bd61b","infoHashBuffer":{"type":"Buffer","data":[63,217,89,53,7,168,155,143,25,47,251,158,110,243,14,118,208,43,214,27]},"announce":[],"urlList":[]}}