{"title":"Mixed Media Revolution - Creative Ideas for Reusing Your Art (gn","uid":11371641,"size":15669686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fe795a8fef7c8a4f7e16782aa93fc5005900f13&amp;dn=Mixed+Media+Revolution+-+Creative+Ideas+for+Reusing+Your+Art+%28gn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1415092096,"description":"Mixed Media Revolution - Creative Ideas for Reusing Your Art\nby Sandra Duran Wilson and Darlene Olivia McElroy\nNorth Light Books | December 2012 | ISBN-10: 1440318719 | ePUB | 14.9 mb\n\nRecycle, Reuse, Reinvent!\nWith Mixed Media Revolution, you'll learn how to leverage your art and take your paintings and transfers to the next level!\nLeftovers, little bits and scraps, pieces of art that didn't turn out quite right...we all have them. And it hurts to have to throw them away. But what if someone could suggest another way? Another way, perhaps, to get one more use out of that transparency. Or cut up a piece of art and put it back together differently. Or use leftover paint to create one-of-a-kind transfers? Darlene Olivia McElroy and Sandra Duran Wilson, in their groundbreaking third book, will show you how to do all those things and more!\n\nInside You'll Find:\n    10 themed chapters\n    More than 50 fully stepped-out, photographic mixed media techniques\n    More than 80 additional fast and easy techniques\n    Dozens of troubleshooting tips and variations\n    More than 70 big, beautiful finished pieces of art illustrating the techniques\n    Links to online bonus content\n\nYou'll find something new and exciting on every page--add Mixed Media Revolution to your creative toolbox and expand your artistic horizons today!\n\nAbout the Author\nDarlene Olivia McElroy and Sandra Duran Wilson have been the unofficial ambassadors of mixed media ever since their first book, Image Transfer Workshop, became a runaway hit! Their second book, Surface Treatment Workshop, continued the tradition and provided unique techniques accompanied by solid troubleshooting and inspirational advice. Darlene and Sandra teach workshops and lead seminars on a national level. They are currently at work on their fourth book.\n\nCONTENTS\nHow to Use This Book \nTools and Materials to Get You Started \nRecycle, Reuse\nCopy, Scanning \nCreate Layers \nMorph It\nChange of Scale \nLoosen Up \nPlay with Composition\nFear No Color\nTexture Where You Want It\nEverything Else\nResources \nAbout Sandra Duran Wilson \nAbout Darlene Olivia McElroy","torrent":{"xt":"urn:btih:3fe795a8fef7c8a4f7e16782aa93fc5005900f13","amp;dn":"Mixed+Media+Revolution+-+Creative+Ideas+for+Reusing+Your+Art+%28gn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fe795a8fef7c8a4f7e16782aa93fc5005900f13","infoHashBuffer":{"type":"Buffer","data":[63,231,149,168,254,247,200,164,247,225,103,130,170,147,252,80,5,144,15,19]},"announce":[],"urlList":[]}}