{"title":"Ally Condie - Matched [Books 1 to 3]","uid":12283001,"size":1006867078,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:403f0afc893faa157237ca850a45d114e6afaf79&amp;dn=Ally+Condie+-+Matched+%5BBooks+1+to+3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Cybotage","files":4,"time":1440438982,"description":"1 - Matched\n\nCassia has always trusted the Society to make the right choices for her: what to read, what to watch, what to believe. So when Xander's face appears on-screen at her Matching ceremony, Cassia knows with complete certainty that he is her ideal mate... until she sees Ky Markham's face flash for an instant before the screen fades to black.\n\nThe Society tells her it's a glitch, a rare malfunction, and that she should focus on the happy life she's destined to lead with Xander. But Cassia can't stop thinking about Ky, and as they slowly fall in love, Cassia begins to doubt the Society's infallibility and is faced with an impossible choice: between Xander and Ky, between the only life she's known and a path that no one else has dared to follow. \n\n---\n\n2 - Crossed\n\nThe Society chooses everything.\n\nThe books you read.\nThe music you listen to.\nThe person you love.\n\nYet for Cassia the rules have changed. Ky has been taken and she will sacrifice everything to find him.\n\nAnd when Cassia discovers Ky has escaped to the wild frontiers beyond the Society there is hope.\n\nBut on the edge of society nothing is as it seems...\n\nA rebellion is rising.\n\nAnd a tangled web of lies and double-crosses could destroy everything.\n\n---\n\n3 - Reached\n\nAfter leaving Society to desperately seek The Rising, and each other, Cassia and Ky have found what they were looking for, but at the cost of losing each other yet again. Cassia is assigned undercover in Central city, Ky outside the borders, an airship pilot with Indie. Xander is a medic, with a secret. All too soon, everything shifts again. \n\n---\n\n\nRead by Kate Simses, Jack Riccobono\nFormat: M4B\nUnabridged","torrent":{"xt":"urn:btih:403f0afc893faa157237ca850a45d114e6afaf79","amp;dn":"Ally+Condie+-+Matched+%5BBooks+1+to+3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"403f0afc893faa157237ca850a45d114e6afaf79","infoHashBuffer":{"type":"Buffer","data":[64,63,10,252,137,63,170,21,114,55,202,133,10,69,209,20,230,175,175,121]},"announce":[],"urlList":[]}}