{"title":"FAQs in Ophthalmology (Jaypee) [PDF] [StormRG]","uid":10382992,"size":3372774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40ef02847e74b023a698d16fe4b64bd4d3c8a120&amp;dn=FAQs+in+Ophthalmology+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":3,"time":1403103718,"description":"Author: N. Venkatesh Prajna\nPaperback: 701 pages\nPublisher: Jp Medical Ltd; 1 edition (June 1, 2013)\nLanguage: English\nISBN-10: 9350901838\nISBN-13: 978-9350901830\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nPREFACE FROM THE AUTHOR\n\nThe specialty of ophthalmology has developed by leaps and bounds in the recent past. Excellent comprehensive books are being brought out at regular intervals, which helps an ophthalmologist to keep abreast with times. In my 15 years experience as a residency director, I have often found the need for a concise, examination oriented ready-reckoner, which would be of use to the postgraduates to answer specifically to the point. This book aims to fill this gap and serves as a compilation of the frequently asked questions (FAQs) and the answers expected in a postgraduate clinical ophthalmology examination. This book should not be misconstrued as a replacement to the existing standard textbooks. These questions have been painstakingly gathered over a 10-year period from the collective experience of several senior teachers at Aravind Eye Hospital, Madurai, Tamil Nadu, India. Apart from the exam-oriented questions, this book also contains examples of case sheet writing and different management scenarios, which will help the students to logically analyze and answer in a coherent manner. I do sincerely hope that this book helps the postgraduate to face his/her examination with confidence.","torrent":{"xt":"urn:btih:40ef02847e74b023a698d16fe4b64bd4d3c8a120","amp;dn":"FAQs+in+Ophthalmology+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ef02847e74b023a698d16fe4b64bd4d3c8a120","infoHashBuffer":{"type":"Buffer","data":[64,239,2,132,126,116,176,35,166,152,209,111,228,182,75,212,211,200,161,32]},"announce":[],"urlList":[]}}