{"title":"Breath of Fire 5 Dragon Quarter USA NTSC","uid":4693064,"size":743418296,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:411a54c3036a083b68314ea57dc5fa68cbd81ebd&amp;dn=Breath+of+Fire+5+Dragon+Quarter+USA+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"vashx85","files":-1,"time":1233460468,"description":"Breath of Fire: Dragon Quarter\n\nNTSC-USA Format\n\nIn ISO Format, compressed with 7zip\n\nfound from scenew.com\n\nWorks with PCSX2 0.9.5,  or PCSX2 Playground 1.0 or higher edition. &lt;a href=&quot;\nhttp://www.pcsx2.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pcsx2.net/&lt;/a&gt;\n\n\n\n\nFrom wikipedia \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Lin_(Breath_of_Fire)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Lin_(Breath_of_Fire)&lt;/a&gt;\n\nAn unspecified amount of time before the game begins, humanity fled the desolate surface world to the underground in order to survive. Now, the world lies in a state of turmoil; polluted and stagnant, only the upper classes are able to escape to higher levels with better air. The game follows Ryu, a low level citizen, who rebels against his government in order to save the life of Nina, who is unable to survive underground, due to an experimental surgery performed on her in order to convert her into an air purification machine. According to Breath of Fire tradition, dragons play a large role in Dragon Quarter, and Ryu himself is able to transform into a dragon. Despite this tradition, however, the main influence of Dragons is felt in the storyline of the game and not the gameplay - unlike every other installment, Ryu can only transform into one Dragon form. The focus of the story is on Ryu's escape to the surface with Nina, accompanied by the ever-watchful Lin. A majority of the game simply focuses on Ryu and company's ascent from over a kilometre(kilometer) below the surface to ground level, traversing dark underground passageways and fending off the encounters they find. On the lowest levels one can find those with low D-ratios; as one ascends the levels, the D-ratio of the inhabitants increases. As the name suggests, D-ratios are expressed as a fraction with a numerator of 1; lower numbers in the denominators indicate a higher D-Ratio. As one can see, D-ratio is the main determinant of social status in the world of Dragon Quarter. The highest D-ratio a human can achieve is 1/4 - this is the Dragon Quarter of the title, which represents a one in four chance of linking with an available dragon.\n\nThere are two main subplots in the game; the first one concerns the five mysterious rulers of the entire underground world, who seem to be ubiquitous in their ability to gain information and their ability to act on this information. These rulers also reveal the storyline via a legend passed down that says a boy with the power to become a dragon will bring the world back to the surface.\n\nThe other subplot is introduced almost at the outset of the game: a rivalry between Ryu and Bosch, the latter of which is portrayed as an entitled, monomaniacal elitist. Bosch eventually wishes to use Ryu as his lackey in order to attain a higher rank, due to his (Bosch's) high D-ratio of 1/64. Early on in the story, Bosch inadvertently releases Ryu's ability to become a dragon when he tries to kill Ryu; after he has seen this power, Bosch's will to beat Ryu in battle drives him to undergo experimental dragon fusion, eventually resulting in his ability to become a dragon as well.\n\nRyu's entire struggle comes to a head as he is forced to invade the upper levels of the underground to lead Nina to the clean air she needs to survive. Three of the five regents which govern the entire world Ryu knows fall beneath his blade before he comes face to face with Elyon.\n\nElyon acknowledges Ryu's power, noting that none have ever come closer to reclaiming the surface world than he. He then summons two pieces of himself he banished away to extend his life, using his newly rediscovered power to attack Ryu, Nina and Lin. After a fierce battle, Elyon lays defeated and Ryu notes that Elyon was &quot;Odjn's first&quot;, heavily alluding to the fact that Elyon was directly responsible for Mankind not reclaiming the sky hundreds of years ago because he feared to push his power to the limit.\n\nWith their final obstacle out of the way, Ryu, Lin and Nina venture forth to the hatch itself. There Bosch catches up with them, now containing his own true dragon instead of a mere construct. He and Ryu clash for one final time before Bosch is truly defeated. Seeming to give up, Bosch gives himself over to Chertyre and allows the dragon to manifest himself fully in the world again.\n\nRyu, faced with a true dragon and Odjn's power ready to kill him is forced to ignore the possibility of death and use his own D-Breath attack to channel Odjn's power against Chertyre. It is important to note that this brings his D-Counter to 100%, something to be avoided at all costs during other points in the game.\n\nFrom this point, which should kill him, Ryu channels more and more of Odjn's power, his D-Counter rising far above 100%, and finally defeats Chertyre and opens the way to the surface. As he lays dying, Ryu tells Lin and Nina to go on ahead, that he'll catch up with them in a moment.\n\nAs Nina and Lin walk up the spiral staircase to the surface, Ryu dies. Odjn comes to him then, asking if Ryu has any regrets. Ryu replies that he has none, stating that reaching the surface was his only goal. Odjn exhults, telling Ryu that it was not his power which brought Ryu this far, but his own determination. As Lin and Nina grieve, Odjn restores Ryu's life to him. What the three of them would do for the rest of their lives on the now pure, lush and green surface world would remain a mystery.","torrent":{"xt":"urn:btih:411a54c3036a083b68314ea57dc5fa68cbd81ebd","amp;dn":"Breath+of+Fire+5+Dragon+Quarter+USA+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411a54c3036a083b68314ea57dc5fa68cbd81ebd","infoHashBuffer":{"type":"Buffer","data":[65,26,84,195,3,106,8,59,104,49,78,165,125,197,250,104,203,216,30,189]},"announce":[],"urlList":[]}}