{"title":"Keith Jarrett, Gary Peacock, Jack DeJohnette - My Foolish Heart ","uid":12154779,"size":738932516,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4130f082896235720b4b0a9816598b5354598bbc&amp;dn=Keith+Jarrett%2C+Gary+Peacock%2C+Jack+DeJohnette+-+My+Foolish+Heart+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pucholoco","files":40,"time":1437750937,"description":"    Keith Jarrett, Gary Peacock, Jack DeJohnette - My Foolish Heart (2007) [2CD]\n                EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 630 Mb\n                        Full Artwork @ 300 dpi (jpg) -&gt; 77 Mb\n\n\n\nThis release commemorates the 25th year of the jazz supergroup of pianist Keith Jarrett, bassist Gary Peacock, and drummer Jack DeJohnette, one of the longest-running small combos in jazz history. This threesome is sometimes known as &quot;the standards trio,&quot; their specialty being classic songs that have become cornerstones of jazz and pre-rock pop (&quot;What's New,&quot; &quot;The Song Is You&quot;). One special thing about this trio is that both Peacock and DeJohnette played with the late Bill Evans, the intensely lyrical piano icon who was one of Jarrett's influences. \n\nAspects of Evans's approach are all over their playing, from the melodious interpretations and innate sense of swing to the economy of style and graceful technique. Even though Jarrett, Peacock, and DeJohnette stretch out quite a bit, there is nary a wasted or unnecessary note. Nearly two hours of lively, thoughtful, and beautifully recorded music, MY FOOLISH HEART - LIVE is a necessity for fans of piano-trio jazz.\n\nAlmost two hours in length, the program is comprised entirely of jazz and pop standards -- beginning with a tough, limber, punchy version of Miles Davis' &quot;Four&quot; lasting over nine minutes. That the music begins like this, so utterly strident and swaggering, full of lyric invention and energy, is almost reason enough for purchase. The inherent commitment to the music is not measured: it's total. There are few -- if any -- groups in jazz that have been together for such a long time. And there are few groups new or old that are even capable enough to manage such a wide-ranging selection of the repertoire: from the title track and &quot;Four&quot; to &quot;Oleo,&quot; &quot;Straight, No Chaser,&quot; and even &quot;Five Brothers&quot;! But the selection of material is only the wrapper. \n\nWhat's inside it is not just the history of jazz but history in the making, because these three prove beyond all measure not only the vitality of the material but also the necessity of the trio interpretation of it, and indeed what is possible: bop, hard bop, post-bop, swing, and here even ragtime, played with all the seriousness and joy it demands. The readings of Fats Waller's &quot;Ain't Misbehavin'&quot; and &quot;Honeysuckle Rose&quot; and Rodgers &amp; Hart's &quot;You Took Advantage of Me&quot; are wild affairs, beautifully executed, sure, but played with the requisite emotion that new interpretations require.\n\nOn this set, these tunes have been brought out of history, out of the canon of milquetoast sweetness as diversions for the purpose of entertainment, and out into the present as revelatory statements in harmony and rhythmic and lyric invention. The interplay between Peacock and DeJohnette is utterly dynamic. The way these two not only complement but also challenge one another creates a sense of balance that allows Jarrett room for flight -- not into his own quirks as a musician, but into the entire universe of jazz. Peacock and DeJohnette solo a lot here, with in-the-pocket contributions to the melodic panorama of the music. \n\nThe ballads, too, such as the delicate reading of Sammy Cahn and Jule Styne's &quot;Guess I'll Hang My Tears Out to Dry&quot; and the curious but spot-on choice for a set closer, Cahn and James Van Heusen's &quot;Only the Lonely,&quot; are read with such sensitivity and confidence that overly reverent interpretation (a trap for any player who risks bloodlessness) is impossible; the nature of &quot;song&quot; is kept as the trio offers these renditions with deep emotion and a singer's sense of space and elegance. Over 13 tunes, this band offers more surprises, delights, and jaw-dropping musical acumen than even fans believed possible. As Jarrett writes in his liner notes, &quot;There was no other night when we felt that we had to (almost literally) grab the audience by the throat and shake them into hearing what we were doing.&quot; Perhaps they were distracted by heat, bad sound, and lighting problems -- Jarrett speaks to these twice in his notes -- but perhaps, until they reached the ragtime segment of the set that demanded a waking response, they were just floored by the swinging intensity with which the set began. Whatever the reason, this document is a mindblower from start to finish, and there are moments when all you can do in response is look at the box slack-jawed and wonder if what you just heard really happened. It did and it does, over and over again. This set is a magical, wondrous moment in the life of a trio when it all comes pouring out as inspiration and mastery.\n\n\n01. Four\n02. My Foolish Heart\n03. Oleo\n04. What's New\n05. The Song Is You\n06. Ain't Misbehavin'\n\nCD2\n01. Honeysuckle Rose\n02. You Took Advantage Of Me\n03. Straight, No Chaser\n04. Five Brothers\n05. Guess I'll Hang My Tears Out To Dry\n06. Green Dolphin Street\n07. Only The Lonely\n\n*2007 ECM Records | ECM 2021~22\n\n\nPersonnel:\nKeith Jarrett - piano\nGary Peacock - double-bass\nJack DeJohnette - drums\n\n\n\nEnjoy and sharing, Thanks!\n\n\n\nKeith Jarrett - W.A. Mozart. Piano Concertos (1996) [2CD] [EAC-FLAC]:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/11279580/Keith_Jarrett_-_W.A._Mozart._Piano_Concertos_%281996%29_%5B2CD%5D_%5BEAC-F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/11279580/Keith_Jarrett_-_W.A._Mozart._Piano_Concertos_%281996%29_%5B2CD%5D_%5BEAC-F&lt;/a&gt;","torrent":{"xt":"urn:btih:4130f082896235720b4b0a9816598b5354598bbc","amp;dn":"Keith+Jarrett%2C+Gary+Peacock%2C+Jack+DeJohnette+-+My+Foolish+Heart+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4130f082896235720b4b0a9816598b5354598bbc","infoHashBuffer":{"type":"Buffer","data":[65,48,240,130,137,98,53,114,11,75,10,152,22,89,139,83,84,89,139,188]},"announce":[],"urlList":[]}}