{"title":"Bernard Williams - The Sense of the Past. Essays in the History ","uid":10447955,"size":1457744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:421f0f3605236b6f13f492f50ff441213048ef4c&amp;dn=Bernard+Williams+-+The+Sense+of+the+Past.+Essays+in+the+History+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1403982618,"description":"Description\nProduct Details\nBook Title: The Sense of the Past: Essays in the History of Philosophy\t\nBook Author: Bernard Williams (Author), Myles Burnyeat (Editor)\nPaperback: 416 pages\nPublisher: Princeton University Press (December 23, 2007)\nLanguage: English\nISBN-10: 0691134081\nISBN-13: 978-0691134086\n\n===================================================================================\nBook Description\nPublication Date: December 23, 2007 | ISBN-10: 0691134081 | ISBN-13: 978-0691134086\nBefore his death in 2003, Bernard Williams planned to publish a collection of historical essays, focusing primarily on the ancient world. This posthumous volume brings together a much wider selection, written over some forty years. His legacy lives on in this masterful work, the first collection ever published of Williams's essays on the history of philosophy. The subjects range from the sixth century B.C. to the twentieth A.D., from Homer to Wittgenstein by way of Socrates, Plato, Aristotle, Descartes, Hume, Sidgwick, Collingwood, and Nietzsche. Often one would be hard put to say which part is history, which philosophy. Both are involved throughout, because this is the history of philosophy written philosophically. Historical exposition goes hand in hand with philosophical scrutiny. Insights into the past counteract blind acceptance of present assumptions.\nIn his touching and illuminating introduction, Myles Burnyeat writes of these essays: &quot;They show a depth of commitment to the history of philosophy seldom to be found nowadays in a thinker so prominent on the contemporary philosophical scene.&quot;\nThe result celebrates the interest and importance to philosophy today of its near and distant past.\nThe Sense of the Past is one of three collections of essays by Bernard Williams published by Princeton University Press since his death. In the Beginning Was the Deed: Realism and Moralism in Political Argument, selected, edited, and with an introduction by Geoffrey Hawthorn, and Philosophy as a Humanistic Discipline, selected, edited, and with an introduction by A. W. Moore, make up the trio.\n\n===================================================================================\nReviews\n&quot;These discussions combine incisive authority and even a touch of technicality with Bernard Williams's characteristically urbane wit. A great intellectual wealth in which philosophy is made to show us how it thinks about philosophy.&quot;--George Steiner, Times Literary Supplement\n\n&quot;Bernard Williams' contribution to philosophy is timeless. He has a voice that is both distinctively of our time and a reminder that the past can still be brought alive philosophically. Williams' belief in the importance of history to philosophy is readily apparent in this collection. If for no other reason, readers of philosophy should value this book highly.&quot;--Peter Johnson, European Legacy\n\n&quot;Williams attempts to make strange what is familiar in our assumptions, and he admirably succeeds in this task. . . . The Sense the of the Past is an excellent contribution to the field, and deserves a wide audience.&quot;--Basil Smith, Review of Metaphysics\n\n&quot;The sheer variety of Williams's historical interests and the spontaneity with which he displays them give this collection a sense of vigor and dialectical fun that are characteristic of its author.&quot;--Nicholas White, Ethics\n\n&quot;It is pleasing to have many of Williams' previously published meditations on Plato's thought--including those dealing with Plato's construction of intrinsic goodness, the analogy of city and soul in the Republic, and an introduction to the Theaetetus dialogue--gathered together in one place. . . . [T]his book represents an appropriate tribute to a philosopher of rare talents.&quot;--Jonathan Wright, Heythrop Journal\n\n===================================================================================\nFrom the Back Cover\n&quot;It is difficult to imagine a better collection. The essays on Greek thought and literature, Plato, and Aristotle would make up a distinguished volume in their own right and, together with Williams's essays on Descartes, Hume, Nietzsche, and Collingwood (several of them unpublished until now), they constitute a work I can only describe as an idiosyncratic landmark. What could be more valuable than to see how, in the hands of one of the most important philosophers in recent years, all these philosophers and the questions they ask can illuminate one another?&quot;--Alexander Nehamas, Princeton University\n\n&quot;Philosophical activity, when it comes alive, is precious. This brilliant and captivating book is philosophy alive in its history.&quot;--Jonathan Lear, The University of Chicago\n\n===================================================================================\nAbout the Author\nBernard Williams was Knightbridge Professor of Philosophy at the University of Cambridge (1967-1979) and Provost of King's College. He held the Monroe Deutsch Professorship of Philosophy at the University of California, Berkeley (1998-2000) and was White's Professor of Moral Philosophy at the University of Oxford (1990-2003). He was Fellow of All Souls College, Oxford until his death in 2003. Myles Burnyeat is Senior Research Fellow in Philosophy, All Souls College, Oxford. His books include &quot;The 'Theaetetus' of Plato&quot; (Hackett, 1990) and &quot;A Map of Metaphysics Zeta&quot; (Mathesis Publications, 2001).\n===================================================================================","torrent":{"xt":"urn:btih:421f0f3605236b6f13f492f50ff441213048ef4c","amp;dn":"Bernard+Williams+-+The+Sense+of+the+Past.+Essays+in+the+History+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"421f0f3605236b6f13f492f50ff441213048ef4c","infoHashBuffer":{"type":"Buffer","data":[66,31,15,54,5,35,107,111,19,244,146,245,15,244,65,33,48,72,239,76]},"announce":[],"urlList":[]}}