{"title":"Derek Parfit - On What Matters. Volume I &amp; II [2011][A]","uid":10270806,"size":14678850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:430636bf88273c58190a3d9060b53d67361f2df1&amp;dn=Derek+Parfit+-+On+What+Matters.+Volume+I+%26amp%3B+II+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Anette14","files":-1,"time":1401584220,"description":"Description\nProduct Details\nBook Title: On What Matters (2 Volume Set)\t\nBook Author: Derek Parfit\nHardcover: 1440 pages\nPublisher: Oxford University Press; First Edition edition (June 20, 2011)\nLanguage: English\nISBN-10: 0199265925\nISBN-13: 978-0199265923\n\n===================================================================================\nBook Description\nPublication Date: June 20, 2011 | ISBN-10: 0199265925 | ISBN-13: 978-0199265923 | Edition: First Edition\nOn What Matters is a major work in moral philosophy. It is the long-awaited follow-up to Derek Parfit's 1984 book Reasons and Persons, one of the landmarks of twentieth-century philosophy. In this first volume Parfit presents a powerful new treatment of reasons and rationality, and a critical examination of three systematic moral theories -- Kant's ethics, contractualism, and consequentialism -- leading to his own ground-breaking synthetic conclusion. Along the way he discusses a wide range of moral issues, such as the significance of consent, treating people as a means rather than an end, and free will and responsibility. On What Matters is already the most-discussed work in moral philosophy: its publication is likely to establish it as a modern classic which everyone working on moral philosophy will have to read, and which many others will turn to for stimulation and illumination.\n\n===================================================================================\nReviews\n&quot;[On What Matters] stands as a grand and dedicated attempt to elaborate a fundamentally misguided perspective. Its diligence and its honesty command respect. Perhaps these real virtues will set standards for a very different ventures in academic ethics. Naturalist or otherwise--for a return to the tradition of attempts to understand and improve everyday judgment, and to provide resources for people and policymakers everywhere. In the end, that is what matters.&quot;--Philip Kitcher, The New Republic\n\n&quot;The most significant work in ethics since Sidgwick's masterpiece was published in 1873 ... a work of epic proportions and ambitions&quot;--Peter Singer, Times Literary Supplement\n\n&quot;The most eagerly awaited book in philosophy since Ludwig Wittgenstein's Philosophical Investigations... Should the book become as influential as the stars guiding its arrival suggest, it could seriously alter the way that ethics is thought about and taught.&quot;--Constantine Sandis, Times Higher Education\n\n&quot;Represents many years of work by one of the most influential philosophers of our time&quot;--Simon Blackburn, Financial Times\n\n&quot;It is finally here. . . there is no doubt that On What Matters is an epochal work . . . a remarkable achievement, giving us a truly comprehensive picture of the moral outlook . . . of one of the greatest moral thinkers of our time. . . . Parfit's intellectual personality radiates throughout On What Matters, which as a whole presents a gripping and illuminating picture of a single, comprehensive view of the projects of both normative and metaethical inquiry.&quot;--Mark Schroeder, Notre Dame Philosophical Reviews\n\n&quot;Parfits arguments are of extraordinary brilliance and clarity, and by any standards On What Matters is an immensely powerful achievement. . . Parfits intricate and beautifully lucid book is undoubtedly the work of a philosophical genius.&quot;--John Cottingham, The Tablet\n\n&quot;This book presents a comprehensive theory of the metaphysics, epistemology, and substance of ethical thought. It originality is often striking and its arguments profound. On What Matters is a monument that will shape the field for many years.&quot;--Kieran Setiya, Mind\n\n===================================================================================\nAbout the Author\nDerek Parfit is one of the leading philosophers of our time. He is a Senior Research Fellow at All Souls College, Oxford, Global Distinguished Professor of Philosophy at New York University, and a Fellow of the British Academy and of the American Academy of Arts and Sciences. He is the author of Reasons and Persons (OUP, 1984), one of the most influential books in philosophy of the last several decades.\n===================================================================================","torrent":{"xt":"urn:btih:430636bf88273c58190a3d9060b53d67361f2df1","amp;dn":"Derek+Parfit+-+On+What+Matters.+Volume+I+%26amp%3B+II+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430636bf88273c58190a3d9060b53d67361f2df1","infoHashBuffer":{"type":"Buffer","data":[67,6,54,191,136,39,60,88,25,10,61,144,96,181,61,103,54,31,45,241]},"announce":[],"urlList":[]}}