{"title":"Marvel Masterworks - The Silver Surfer v1-v2 TPB (Bchry-DCP).","uid":10600067,"size":572323295,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:432e84e9f19b8fac25deb48961754d13a2309ed1&amp;dn=Marvel+Masterworks+-+The+Silver+Surfer+v1-v2+TPB+%28Bchry-DCP%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1405908157,"description":"Marvel Masterworks - The Silver Surfer v1-v2 TPB (2010|2012|Bchry-DCP)\n\nPromotional info for v1 - &quot;The Silver Surfer, the Sentinel of the Spaceways, has betrayed Galactus to save the Earth, but now he is trapped there! In his breakout series, the Silver Surfer is a misunderstood alien doing his best to protect humankind from whatever threats abound! See: the first appearances of the Badoon and Mephisto! Witness: the manipulations of Loki! Experience: the threats of Quasimodo, the Overlord, and the Stranger! All this, and the origins of the Silver Surfer! Guest-starring Thor and the Fantastic Four!&quot;\n\nPromotional info for v2 - &quot;The world's favorite space-faring super hero in his continuing saga of anguish and adventure! he sacrificed himself to save his homeworld of Zenn-La from the planet-devouring menace Galactus, saving those he loved in exchange for a life of servitude as the Silver Surfer. Now, after disobeying his master, Norrin Radd is stranded on the planet Earth--forever removed from his love Shalla-Bal and from the beckoning spaceways! In these pages, the Surfer will face ghosts from beyond the grave seeking redemption, the horrors of war, the devious Mephisto, and mighty Marvel heroes including Spider-Man to the Human Torch and the Inhumans. So what more do you need to know? Reserve that copy today, True Believer!&quot;\n\nBetween both editions, this is the full run of Silver Surfer v1 by Lee and Kirby. I have also posted the run in digital single issues here if you prefer: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9837000&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9837000&lt;/a&gt;\n\nThanks to Bchry-DCP for these great copies. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:432e84e9f19b8fac25deb48961754d13a2309ed1","amp;dn":"Marvel+Masterworks+-+The+Silver+Surfer+v1-v2+TPB+%28Bchry-DCP%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"432e84e9f19b8fac25deb48961754d13a2309ed1","infoHashBuffer":{"type":"Buffer","data":[67,46,132,233,241,155,143,172,37,222,180,137,97,117,77,19,162,48,158,209]},"announce":[],"urlList":[]}}