{"title":"Pro Tools Mixing and Mastering UPDATE (2014) with Brian Lee Whit","uid":9681759,"size":4603498174,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:43387dedfb22f539d5477bdd799dc8379205bf5d&amp;dn=Pro+Tools+Mixing+and+Mastering+UPDATE+%282014%29+with+Brian+Lee+Whit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"suchezyma","files":1,"time":1393634110,"description":"After recording and editing a session, take advantage of the lessons in Pro Tools Mixing and Mastering to refine the final mix and master of your project. Avid Certified Expert and pro mix engineer Brian Lee White covers all the basic mixing tools that every producer and engineer should know, from using EQ to add clarity and focus to applying compression and limiting to control dynamics and maximize track levels within a mix. The course stresses the importance of creating a solid mixing plan and setting up the studio before beginning any work in Pro Tools. Throughout the course, Brian lends his insights, inspirations, and studio secrets from over a decade of professional mixing to help you become a better mixer. \n\nTopics Include:\n\nWhat is mixing? Exploring the past, present, and future\nMixing &quot;in the box&quot;\nSetting up monitors and ensuring proper acoustics in the studio\nStaying organized with labels, memory locations, and window configurations\nWorking with the Pro Tools Mixer\nBuilding healthy and profitable mixing habits when putting together a final mix\nUsing volume and pan to balance the mix\nEmploying corrective versus creative EQ strategies to create clarity and contrast\nKnowing when and when not to process the audio of a track\nWorking with compressors and dynamics processors\nUsing saturation effects to capture an analog-type sound\nAdding reverb and delay to create depth in a mix\nWorking with limiting and multiband compression during the mastering process\nDealing with plug-in delay and latency in a mix\nUsing the bundled plug-ins in Pro Tools to add clarity, punch, and width to a mix\nRecording and editing automation to add drama and excitement\nUsing clip based gain to control headroom and gain staging\n","torrent":{"xt":"urn:btih:43387dedfb22f539d5477bdd799dc8379205bf5d","amp;dn":"Pro+Tools+Mixing+and+Mastering+UPDATE+%282014%29+with+Brian+Lee+Whit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43387dedfb22f539d5477bdd799dc8379205bf5d","infoHashBuffer":{"type":"Buffer","data":[67,56,125,237,251,34,245,57,213,71,123,221,121,157,200,55,146,5,191,93]},"announce":[],"urlList":[]}}