{"title":"Discworld 1(PC GAME)","uid":4228759,"size":179233173,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:43a0b4667ee7df00c938e14acca72c73e1d85a71&amp;dn=Discworld+1%28PC+GAME%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"kingswoodtown","files":1,"time":1212943065,"description":"Discworld 1(PC GAME)\n\n\nYou&amp;#039;ll find here wizards, dragons, heros and household hygiene specialists. There is danger here, but there is also custard around the place. Because Discworld is a fantasy world with a low reality threshold. The real world keeps on breaking through, but the Discworld changes it.\n\nSo you&amp;#039;ll find here things that you sort of recognise.\n\nDiscworld has got photgraphy (tiny imps paint the pictures) and movies (tiny imps piant really fast) and it is even getting its second generation of computers now that the old stone circles don&amp;#039;t work fast enough.\n\nHowever, because it is a fantasy world there are some things that it has to have, and one of them is a certain tendecy to experience some trouble with dragons.\n\nUnfortunately, a dragon is now ravaging Ankh-Morpork, the world&amp;#039;s leading city. Many people would consider that this falls under the heading civic improvement, but what Ankh-Morpork needs right now is a hero. All it&amp;#039;s got, however, is Rincewind the wizard, whose only talent is that he is not in fact dead yet. He also has the Luggage, the nastiest piece of travelware in the Universe. With that at his side, there is probably no limit to the things he can fail to do..\n\nOh, did I say he? I meant... you.\n\nBeware of anyone who TALKS LIKE THIS and carries a scythe, and remember that a loaded pun sometimes goes off...\n\n... and have fun..","torrent":{"xt":"urn:btih:43a0b4667ee7df00c938e14acca72c73e1d85a71","amp;dn":"Discworld+1%28PC+GAME%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43a0b4667ee7df00c938e14acca72c73e1d85a71","infoHashBuffer":{"type":"Buffer","data":[67,160,180,102,126,231,223,0,201,56,225,74,204,167,44,115,225,216,90,113]},"announce":[],"urlList":[]}}