{"title":"Criticism of the Western Civilization - Collection 50 (Gambling)","uid":11718733,"size":145210527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43a1447e4b5c1009b7c8f6eabb8bf8d5dd8e30dc&amp;dn=Criticism+of+the+Western+Civilization+-+Collection+50+%28Gambling%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moman73","files":35,"time":1424712989,"description":"Criticism of the Western Civilization - Collection 50 (Gambling):\n\nWe have 35 titles here:\n\n-  Barnes - The Real Cost of Casinos; a Health Equity Impact Assessment (2013)\n\n-  Coryn - Economic Aspects of Gambling Regulation-EU and US Perspectives (2008)\n\n-  Derevensky &amp; Gupta (Eds.) - Gambling Problems in Youth; Theoretical and Applied Perspectives (2004)\n\n-  Dickerson &amp; O'Conner - Gambling as an Addictive Behaviour; Impaired Control, Harm Minimisation, Treatment and Prevention (2005)\n\n-  Ferentzy &amp; Turner - The History of Problem Gambling; Temperance, Substance Abuse, Medicine, and Metaphors (2013)\n\n-  Gambling Problems in First Nations and Inuit Communities of Quebec; a Brief Status Report (2010)\n\n-  Gambling Review Report, Dept. for Culture, Media and Sport, UK (2001)\n\n-  Gambling; Productivity Commission Inquiry Report, Vol. 1, Australia (Feb. 2010)\n\n-  Gambling; Productivity Commission Inquiry Report, Vol. 2, Australia (Feb. 2010)\n\n-  George &amp; Gowden-Jones - Gambling; the Hidden Addiction, Royal College of Psychiatrists (2014)\n\n-  Goldman - Great Gambling Scams; True Stories of the World's Most Amazing Hustlers (2007)\n\n-  Grinols - The Hidden Social Costs of Gambling (2011)\n\n-  Hoffer - Jackpot Nation; Rambling and Gambling Across Our Landscape of Luck (2007)\n\n-  Kingma - Global Gambling; Cultural Perspectives on Gambling Organizations (2010)\n\n-  Kling - The Rise of the Biggest Little City; an Encyclopedic History of Reno Gaming, 1931-1981 (2000)\n\n-  Littler &amp; Fignaut (Eds.) - The Regulation of Gambling; European and National Perspectives (2007)\n\n-  McFarland et al - Jackpot! Money Laundering Through Online Gambling (McAfee Labs, 2014)\n\n-  McGowan - The Gambling Debate (2008)\n\n-  Meyer et al (Eds.) - Problem Gambling in Europe; Challenges, Prevention, and Interventions (2009)\n\n-  Morse &amp; Goss - Governing Future; Casino Gambling in America (2007)\n\n-  Nelson &amp; Mason - How the South Joined the Gambling Nation; the Politics of State Policy Innovation (2007)\n\n-  Newman - Gambling; Hazard and Reward (1972)\n\n-  Orford - An Unsafe Bet; the Dangerous Rise of Gambling and the Debate We Should Be Having (2011)\n\n-  Parmalee - Legalized Gambling (2011)\n\n-  Pathological Gambling; a Critical Review (NAS, 2003)\n\n-  Problem Gamblers and Their Finances; a Guide for Treatment Professionals (2000)\n\n-  Problem Gambling; the Issues, the Options, Center for Addiction and Mental Health, Canada (2012)\n\n-  Reith - Research on the Social Impacts of Gambling, Scottish Executive Social Research (2006)\n\n-  Schull - Addiction by Design; Machine Gambling in Las Vegas (2012)\n\n-  Simich &amp; Wright (Eds.) - The Peoples of Las Vegas; One City, Many Faces (2005)\n\n-  The Impact of Gambling, Select Committee on Gambling, New South Wales (2014)\n\n-  Thompson - Gambling in America; an Encyclopedia of History, Issues, and Society (2001)\n\n-  Toronto Public Health - The Health Impacts of Gambling Expansion in Toronto, Technical Report (Nov. 2012)\n\n-  Wardle et al - British Gambling Prevalence Survey, 2010 (2011)\n\n-  Ziettlow - Seniors in Casino Land; Tough Luck for Older Americans (IAV, 2014)","torrent":{"xt":"urn:btih:43a1447e4b5c1009b7c8f6eabb8bf8d5dd8e30dc","amp;dn":"Criticism+of+the+Western+Civilization+-+Collection+50+%28Gambling%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43a1447e4b5c1009b7c8f6eabb8bf8d5dd8e30dc","infoHashBuffer":{"type":"Buffer","data":[67,161,68,126,75,92,16,9,183,200,246,234,187,139,248,213,221,142,48,220]},"announce":[],"urlList":[]}}