{"title":"Introducing Autodesk Maya 2014 Autodesk Official Press(pdf){Zzzz","uid":11052362,"size":53724832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:440e0a0541f70874f7505bda463b6a110295ac30&amp;dn=Introducing+Autodesk+Maya+2014+Autodesk+Official+Press%28pdf%29%7BZzzz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411050574,"description":"What you need to get up and running on Autodesk Maya 2014\n\nAutodesk Maya is the industry-leading 3D animation and effects software, and this detailed Autodesk Official Press book is the ideal way to get you started using Maya like a studio veteran. Professional visual effects artist and Maya expert Dariush Derakhshani clearly explains the basics of modeling, texturing, animating and visual effects for new users, while leading you through fun and challenging lessons that give you plenty of hands-on practice. The book includes a color insert featuring dazzling examples from talented beginners, so you can see what's possible.\n\n    Gets beginners and those migrating from other 3D applications up and running on Autodesk Maya 2014\n    Helps users master the Maya interface and the basics of modeling, texturing, animating, and visual effects\n    Provides practical and fun, step-by-step tutorials that illustrate realistic, professional challenges\n    Includes a full-color insert of amazing examples from talented beginners\n    Written by an Autodesk Authorized Author and is an Autodesk Official Press book\n\nWhether you're new to 3D or migrating from another 3D application, Introducing Autodesk Maya will kickstart your creativity and get you up and running on Maya.\n\n\nPublisher: Sybex; 1 edition (May 28, 2013)\nLanguage: English\nISBN-10: 1118574907\nISBN-13: 978-1118574904\n\nEditorial Reviews\nFrom the Back Cover\n\nThe Perfect Primer on Maya 2014\n\nAutodesk Maya is a top choice for 3D professionals who create the stunning characters and visual effects you see in today's films, games, commercials, and other animation. If you want to begin developing professional-level Maya and 3D skills, the new edition of this top-selling book is the best place to start.\n\nBuilding from the ground up, this book combines straightforward text with practical examples, making it easy to absorb the basics and start designing and animating your own digital models and scenes. The fun and challenging step-by-step lessons, along with the downloadable project files, enable you to learn by doing and gain confidence. This book also includes a beautiful full-color insert with striking examples from talented new Maya users to inspire you.\n\n    Learn CG and 3D core concepts and production workflows\n    Get a fast, thorough lesson on Maya 2014's user interface, menus, and plug-ins\n    Build a simple animation of the planets in the solar system, right away\n    Explore the basics of NURBS, polygons, modeling, and new NEX tools\n    Create a decorative box, a steam locomotive, a starfish, a child's table lamp, and more\n    Rig for animation and use nCloth to create cloth motion, such as a flag blowing in the wind\n    Master HDRI lighting, mental ray rendering, dynamics, simulations, and effects\n\nUse the new Modeling Toolkit to create models quickly and efficiently\n\nUsing lights and an HDRI, you'll light the scene that you've built\nAbout the Author\n\nDariush Derakhshani is an award-winning visual effects supervisor, author, and educator. He has worked on movies such as The Fantastic Four and Pan's Labyrinth, the South Park TV series, and countless commercials and music videos. He teaches Maya and 3D animation, and is the author all the Introducing Maya books, as well as coauthor of Autodesk 3ds Max 2012 Essentials and Autodesk 3ds Max 2013 Essentials. Dariush is also an Autodesk Certified Instructor (ACI) and Autodesk Certification Evaluator (ACE).\n\n","torrent":{"xt":"urn:btih:440e0a0541f70874f7505bda463b6a110295ac30","amp;dn":"Introducing+Autodesk+Maya+2014+Autodesk+Official+Press%28pdf%29%7BZzzz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440e0a0541f70874f7505bda463b6a110295ac30","infoHashBuffer":{"type":"Buffer","data":[68,14,10,5,65,247,8,116,247,80,91,218,70,59,106,17,2,149,172,48]},"announce":[],"urlList":[]}}