{"title":"Interventional Cardiology (Oxford American Cardiology Library) [","uid":10199172,"size":68154503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:450e300a94a116543acb5e16f6db6e3dad165a20&amp;dn=Interventional+Cardiology+%28Oxford+American+Cardiology+Library%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":3,"time":1400744974,"description":"Author: Cardiology (Author), Director of Cardiac Catheterization Laboratories (Author), Debabrata Mukherjee (Editor), Anthony Bavry (Editor)\nSeries: Oxford American Cardiology Library\nPaperback: 304 pages\nPublisher: Oxford University Press; 1e edition (January 28, 2011)\nLanguage: English\nISBN-10: 0199732604\nISBN-13: 978-0199732609\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nInterventional cardiology refers to catheter-based treatment of cardiovascular diseases. This dynamic new field is one of the fastest growing fields in medicine. In the United States, more than a million percutaneous coronary interventions (PCI) are performed annually; moreover, the number of procedures performed will likely continue to increase. The field of interventional cardiology has evolved dramatically over the past decade with the availability of embolic protection devices, drug eluting stents, mechanical thrombectomy catheters, etc. Interventional cardiology represents a rapidly moving target for the cardiologist who seeks to integrate recent advances into their clinical practice. The advent of newer technology presents both an opportunity as well as numerous challenges for the cardiologist to treat patients optimally.\n\nInterventional Cardiology: Essential Clinicians Guide (Oxford American Cardiology Library) aims to provide clinicians with concise, easily accessible guidance on the pre-procedural, procedural and post procedural aspects of PCI in general situations and in various specific clinical settings. The volume features evidence-based discussion on patient selection, vascular access, general principles of PCI, and various specific settings and optimal post procedure management of these patients. This handbook focuses on tailoring stent type to the individual patient, taking into account specific risk factors and comorbidities, appropriate use of embolic protection and thrombectomy catheters. Highly practical in format, content and style, Interventional Cardiology: Essential Clinician's Guide serves as a succinct, yet comprehensive, easily accessible point-of-care reference for busy practitioners. Useful tools, such as treatment algorithms, charts, tables and illustrations assist in making this volume a practical reference tool.","torrent":{"xt":"urn:btih:450e300a94a116543acb5e16f6db6e3dad165a20","amp;dn":"Interventional+Cardiology+%28Oxford+American+Cardiology+Library%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450e300a94a116543acb5e16f6db6e3dad165a20","infoHashBuffer":{"type":"Buffer","data":[69,14,48,10,148,161,22,84,58,203,94,22,246,219,110,61,173,22,90,32]},"announce":[],"urlList":[]}}