{"title":"Humble Pie - 'The Definitive Collection' [320k MP3]","uid":4637300,"size":181482644,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:457b8be70a014f48b26cad3e01530077defa11ab&amp;dn=Humble+Pie+-+%5C%27The+Definitive+Collection%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"smbdownload","files":-1,"time":1231599393,"description":"Humble Pie were a rock, rhythm and blues band from England and were one of the first supergroups of the 1970s and were successful in America and UK. They are best remembered for their dynamic live concert performances and songs such as 30 Days in the Hole, I Don't Need No Doctor and Natural Born Bugie (often misspelt as boogie). The original band line-up featured Steve Marriott from the Small Faces, Peter Frampton lead singer and guitarist of The Herd, Greg Ridley former bassist from Spooky Tooth and seventeen-year-old drummer Jerry Shirley.\n\nThe Definitive Collection [320k MP3]\n\n   01. Natural Born Woman 4:11 \n   02. The Sad Bag Of Shaky Jake 2:57 \n   03. Big Black Dog 4:02 \n   04. Live With Me 7:52 \n   05. I'm Ready 4:57 \n   06. Shine On 2:59 \n   07. Stone Cold Fever 4:10 \n   08. Rollin' Stone 5:59 \n   09. Four Day Creep 3:35 \n   10. I Don't Need No Doctor 8:48 \n   11. Hot 'N' Nasty 3:19 \n   12. C'mon Everybody 5:12 \n   13. 30 Days In The Hole 3:57 \n   14. Black Coffee 3:09 \n   15. I Believe To My Soul 4:04 \n   16. Ninety-Nine Pounds 2:44 \n   17. Road Hog 3:08 \n\n--------------------------------------------------------------------------------\n\nEarly Humble Pie:\n\nIn late 1968 Steve Marriott formed Humble Pie with Greg Ridley, Peter Frampton and Jerry Shirley who had been the drummer for the mod band Apostolic Intervention.Because they had previously played in high-profile groups many viewed Humble Pie as a &quot;supergroup and they were signed to Andrew Loog Oldham's record label Immediate Records. Their debut single Natural Born Bugie was released in July 1969 becoming a #4 hit in the UK Singles Chart and was quickly followed by the album As Safe As Yesterday Is, which peaked at #16 in the UK album charts. In the 2006 documentary Heavy: The Story of Metal, As Safe As Yesterday Is was recalled as the first album to have been described by the term &quot;heavy metal&quot;. Their second album, Town and Country released in the UK during 1969 while the band was away on its first tour of USA. This album featured a more acoustic sound and songs written by all four members. Humble Pie concerts at this time featured an acoustic set, with a radical re-working of Graham Gouldman's &quot;For Your Love&quot; as its centerpiece followed by an electric set. Recent tape archives show that the band recorded around 30 songs in its first nine months of existence, many of which remained unreleased for decades, including a cover of the Ray Charles classic Drown In My Own Tears.\n\nA&amp;M Records:\n\nDuring 1970 Humble Pie switched to A&amp;M Records and Dee Anthony became their manager. Anthony was focused on the market in USA and discarded the acoustic set, instigating a more rawkus sound with Marriott as the front man. The group's first album for A&amp;M Humble Pie was released later that year and alternated between progressive rock and hard rock. A single Big Black Dog, which had a Stax feel, was released to coincide with the album and failed to chart, however the band was becoming known for popular live rock shows in USA.In 1971 Humble Pie released its most successful record to date Rock On as well as a simaltaneous release of a Humble Pie concert recorded at the Fillmore East New York entitled Performance Rockin' the Fillmore. The live album reached #21 on the US Billboard 200 and both Rock On and Performance were certified gold by the RIAA. The loud-quiet-loud epic &quot;I Don't Need No Doctor&quot; was an FM radio hit in the United States peaking at #73 on the Billboard Hot 100, propelling the album up the charts. Frampton left the band by the time the album was released and went on to enjoy success as a platinum selling solo artist.\n\n1972-1975:\n\nFrampton was replaced by Dave &quot;Clem&quot; Clempson and Humble Pie moved towards a harder sound emphasizing Marriott's blues and soul roots. Their first record with Clempson Smokin' was released in 1972, along with two singles &quot;Hot 'n' Nasty&quot; and &quot;30 Days in the Hole.&quot; It was the band's most commercially successful record and reached #6 on the US charts, helped by a busy touring schedule. After the success of Smokin' the band's record label A&amp;M released Humble Pie's first two Immediate albums in one album, as Lost and Found. The marketing ploy was a success and the album charted at #37 on the Billboard 200.Looking for a more authentic R&amp;B sound, Marriott hired three female backing singers, The Blackberries. The trio consisted of Venetta Fields, Clydie King and Sherlie Matthews who was later replaced by Billie Barnum. They had performed with Tina Turner as the The Ikettes and with Ray Charles as The Raelettes. This new lineup included Sidney George on sax for the recording of Eat It, a double album released in 1973 made up of Marriott originals (some acoustic), classic R&amp;B covers, and a Humble Pie concert recorded in Glasgow . The album peaked at #13 in the US charts. After the more focused Thunderbox was released in 1974 and Street Rats a year later, Humble Pie ran out of creative energy. Joined by keyboardist Tim Hinkley they a played the Goodbye Pie Tour in 1975 before disbanding.\n\n1979-1982:\n\nDuring 1979 Steve Marriott revived Humble Pie with Jerry Shirley, adding Bobby Tench vocalist and guitarist from The Jeff Beck Group and the repected US East coast bassist Anthony &quot;Sooty&quot; Jones. They submitted Fool for a pretty face, a song which Marriott had written earlier, to record companys. The song proved good enough for them to secure a recording contract with Atlantic Records subsidiary Atco and in the UK their material was released by Jet Records, owned by former Small Faces manager Don Arden. They recorded the album On to Victory which was released in 1981 and the single of Fool for a Pretty Face reached #52 on the US singles charts. On to Victory reached #60 on the Billboard 200 album charts even though it was not well received by the music press. Humble Pie toured USA as part of the Rock 'N' Roll Marathon bill and recorded the album Go for the Throat which was hurriedly released in 1981 and touring resumed despite a die hard music press. At the beginning of this tour Marriott crushed his hand delaying earlier scheduled appearances by the band and later developed a duodenal ulcer forcing the cancellation of all further tour dates. Soon afterwards this line up disbanded.\n\nHumble Pie Featuring Jerry Shirley 1989-1990:\n\nDrummer Jerry Shirley obtained the rights to the name Humble Pie in 1989 and reformed the group with different musicians. This project was called Humble Pie Featuring Jerry Shirley, Shirley was the only original performing member. The band began performing concerts and was based in Cleveland, Ohio USA. This time the line up included vocalist Charlie Huhn, who also played lead and rhythm guitar. Huhn had previously worked with Ted Nugent and Victory and his vocal style closely resembled Steve Marriott's. While Huhn and Shirley were the only permanent members of the group several other musicians appeareed from time to time including Wally Stocker formerly of Rod Stewart's band and Cleveland guitarist Alan Greene. Humble Pie Featuring Jerry Shirley developed a strong reputation as a live act but never released any official studio recordings. They were featured on several live radio broadcasts and appeared in the line-up at the Woodstock Festival's 20th Anniversary Celebration which was broadcast live on television in the United States and other countries. Frampton and Marriott started collaborating again in 1990. Two songs from this collaboration, &quot;The Bigger They Come&quot; and &quot;I Won't Let You Down&quot;, with Steve Marriott on vocals, appeared on Peter Frampton's album Shine On: A Collection.\n\nSteve Marriott:\n\nOn Saturday April 20, 1991 Marriott died in a fire which also burnt out his home.\n\n1991-2003:\n\nDuring 1991, when it had appeared that a reunion featuring Frampton and Marriott would happen, Shirley put Humble Pie Featuring Jerry Shirley on hold. After Marriott's death he revived his band which dissolved in 1999 when Shirley returned home to England. Shirley re-formed Humble Pie again in 2001 with a line up which reunited Greg Ridley with Bobby Tench and brought in guitarist Dave Colwell. They recorded an album entitled Back on Track which was released by Sanctuary Records in 2002. Keyboard players Zoot Money and Victor Martin are brought in for recording sessions. A brief tour of UK and Europe followed. Jerry Shirley appeared at the Steve Marriott Tribute Concert held at the London Astoria in 2001 to commemorate the 10th anniversary of Marriott's death. The concert featured a Humble Pie line up of Peter Frampton, Clem Clempson, Greg Ridley and Jerry Shirley. Former Humble Pie guitarist Bobby Tench also appeared as the front man for the house band which included Zak Starkey from The Who and Oasis, keyboard player Rabbit Bundrick of The Who and bassist Rick Wills from Foreigner. This concert was released as a DVD by Chrome Dreams in 2005 entitled &quot;The Steve Marriott Astoria Memorial Concert 2001&quot; and as a CD in 2006 by &quot;Darlings of Wapping Warf&quot; with the title One more for the old tosser.\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:457b8be70a014f48b26cad3e01530077defa11ab","amp;dn":"Humble+Pie+-+%5C%27The+Definitive+Collection%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"457b8be70a014f48b26cad3e01530077defa11ab","infoHashBuffer":{"type":"Buffer","data":[69,123,139,231,10,1,79,72,178,108,173,62,1,83,0,119,222,250,17,171]},"announce":[],"urlList":[]}}