{"title":"El viaje de Chihiro DVDRIP SPANISH DIVX","uid":3390241,"size":733673702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:45810f26342fc1f6609d55e45b473616649ef67e&amp;dn=El+viaje+de+Chihiro+DVDRIP+SPANISH+DIVX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Xpektro","files":2,"time":1128094733,"description":"Sinopsis:\nChihiro es una ni&amp;ntilde;a caprichosa y testaruda de diez a&amp;ntilde;os que cree que el universo entero debe someterse a sus de-seos. Cuando sus padres ? Akio y Yugo ? le dicen que tienen que cambiar de casa se pone furiosa y no hace nada para ocultar sus sentimientos. Cuando la familia se marcha Chihiro se agarra al ramo de flores que le han regalado sus amigos como si llevara en &amp;eacute;l todos sus recuerdos. Rumbo a su nueva casa, la familia parece equivocarse de camino y de repente se encuentran al final de un mis-terioso callej&amp;oacute;n sin salida. All&amp;iacute; se yergue un enorme edificio rojo con un intermi-nable t&amp;uacute;nel en el centro que parece una boca gigantesca. El t&amp;uacute;nel conduce a un pueblo fantasmal donde les espera un magn&amp;iacute;fico banquete. Akio y Yugo se lanzan sobre la comida. Chihiro mira a sus padres, que siguen devorando plato tras plato, cuando de repente son transformados en cerdos. Sin querer han en-trado en un mundo habitado por dioses antiguos y seres m&amp;aacute;gicos, dominado por la diab&amp;oacute;lica Yubaba, una arp&amp;iacute;a hechicera. Yubaba le explica a Chihiro que a los intrusos los transforman en animales y despu&amp;eacute;s los matan para comerlos. Los que consiguen escapar de este tr&amp;aacute;gico destino son condenados a morir una vez que se demuestra su inutilidad. Afortunadamente Chihiro encuentra un aliado en forma del enigm&amp;aacute;tico Haku. Para postergar su terrible destino y para sobrevivir en este extra&amp;ntilde;o y peligroso mundo debe hacerse &amp;uacute;til, debe trabajar. Chihiro sale de su pereza habitual pero a la vez debe renunciar a su humani-dad, a sus recuerdos e incluso a su nombre...\n\nTodo esto y mucho m&amp;aacute;s en:\n\nWwW.LaMejorFrikiWeb.CjB.NeT","torrent":{"xt":"urn:btih:45810f26342fc1f6609d55e45b473616649ef67e","amp;dn":"El+viaje+de+Chihiro+DVDRIP+SPANISH+DIVX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45810f26342fc1f6609d55e45b473616649ef67e","infoHashBuffer":{"type":"Buffer","data":[69,129,15,38,52,47,193,246,96,157,85,228,91,71,54,22,100,158,246,126]},"announce":[],"urlList":[]}}