{"title":"Mary Mary - Discography","uid":6268057,"size":412699895,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:45fbf2afc319ebf53bbde7e2bcb4aea05984af67&amp;dn=Mary+Mary+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"piratetorrent1989","files":76,"time":1300926554,"description":"Mary Mary is a three time Grammy-award winning American gospel music duo, consisting of sisters Erica Atkins-Campbell (born April 29, 1972(1972-04-29)) and Tina Atkins-Campbell (born May 1, 1974(1974-05-01)). The duo are often credited along with Kirk Franklin for broadening the fan base of urban contemporary gospel in the 2000s by introducing elements of soul music, hip hop, funk and jazz. Mary Mary broke onto the music scene with their popular song &quot;Shackles (Praise You)&quot; which is considered one of the pioneering songs of urban contemporary gospel music.\n\nTheir debut album Thankful (2000) was certified Platinum. The duo has released three Gold albums: Incredible (2002), and Mary Mary (2005), which all charted #1 on the Billboard Top Gospel Albums.\n\nA meeting with producer Warryn Campbell led to their song publishing deal with the giant EMI music conglomerate and a series of songs that landed on the soundtracks. They wrote &quot;Dance&quot; and performed it with Robin S. for the soundtrack to the 1998 film Dr. Dolittle; they performed &quot;Let Go, Let God&quot; for The Prince of Egypt and won more than two Grammy's Inspirational. Several of their songs were recorded by 702. The sisters' profile in the gospel industry was raised when their songs &quot;Time To Change&quot; and &quot;Yeah&quot; were recorded by Yolanda Adams on the Mountain High... Valley Low CD. At the same time, Mary Mary as a musical entity took shape. Mary Mary together with Bebe &amp; Cece Winans featuring the West Angeles Choir performed at The Tonight Show With Jay Leno","torrent":{"xt":"urn:btih:45fbf2afc319ebf53bbde7e2bcb4aea05984af67","amp;dn":"Mary+Mary+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45fbf2afc319ebf53bbde7e2bcb4aea05984af67","infoHashBuffer":{"type":"Buffer","data":[69,251,242,175,195,25,235,245,59,189,231,226,188,180,174,160,89,132,175,103]},"announce":[],"urlList":[]}}