{"title":"Alex Is Lovesick","uid":4612125,"size":734270614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:464bebecd22ab499a25e07e101a4b7090381cb51&amp;dn=Alex+Is+Lovesick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"InfX","files":2,"time":1230672615,"description":"NOTES: \n\nThis is actually the same file linked by www.wnet.co.il, downloaded from ed2k network, i am uploading it here by someone's request.\n\nThe movie is in Hebrew, but i've included the English subs, just in case a non-Hebrew-speakers would like to watch it too, it's a public tracker and a public torrent after all.\n\n\n\n\nPLOT:\n\nThe movie is a romantic comedy which takes place in Israel during the Austerity period of the 1950s. The movie's hero is Alex, a 13 year old boy who is about to attend his Bar Mitzvah.\n\nAlex has a typical Polish mother and father that suffers quietly. On account of the difficult economic situation they are compelled to share their apartment with a Persian tenant named Faruk that tries to fight his baldness by means of different creams.\n\nAlex falls in love with the new girl in his class, Mimi. Everything changes when his aunt Lola arrives in Israel from Poland to search for lost love. They were together when she lived in Poland but he vanished when Nazis conquered the country. Alex falls for his aunt and she on her part gives him more than just maternal love.\n\nThe film describes in the exact form the ambiance that dominated the country in the 1950s, the Austerity in Israel in these days, the black markets, the radio broadcasts concentrating on the search for lost relatives, music of the 1950s, the clothes and dresses and forms of pastime.","torrent":{"xt":"urn:btih:464bebecd22ab499a25e07e101a4b7090381cb51","amp;dn":"Alex+Is+Lovesick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"464bebecd22ab499a25e07e101a4b7090381cb51","infoHashBuffer":{"type":"Buffer","data":[70,75,235,236,210,42,180,153,162,94,7,225,1,164,183,9,3,129,203,81]},"announce":[],"urlList":[]}}