{"title":"Cinema 4D Studio R12 (Full version)","uid":6098608,"size":9445359378,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:466f0dd807b28adc6a70ea97c7b6d9bcfe154ec1&amp;dn=Cinema+4D+Studio+R12+%28Full+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"kevinthdinosaur","files":396,"time":1294874232,"description":"CINEMA 4D Studio is the very best that MAXON has to offer for professional 3D artists. If you want to create advanced 3D graphics but need a helping hand to ensure you create jaw-dropping graphics quickly and easily, then this is the choice for you. \n\nAs well as containing all of the features found in CINEMA 4D Prime, Visualize and Broadcast, CINEMA 4D Studio adds advanced character tools, hair, a physics engine and an unlimited clients network rendering. The end result is that CINEMA 4D Studio can tackle any project you throw at it with ease.\n\nCINEMA 4D Studio's character tools make it easy to create character rigs and advanced character animations. Adding hair or fur to characters is fast and simple with a powerful suite of hair tools that let you grow, comb, style and animate. The physics engine, which has been overhauled in R12, makes it simple to perform complex collisions and interaction between objects, be it a few or thousands. Network rendering allows you to take advantage of all computers on your network to help render your animations faster. \n\nDespite being for advanced 3D, the extra tools found in Studio are still designed to be user-friendly and intuitive. Generating advanced 3D effects such as hair is surprisingly easy and fast, with CINEMA 4D doing much of the hard work for you. For example, hair will automatically swoosh and sway as you move your character around; and making thousands of objects collide with each other only takes a few mouse clicks to set up.\n\nCINEMA 4D Studio lets you unleash your creativity and enjoy 3D without limits.\n","torrent":{"xt":"urn:btih:466f0dd807b28adc6a70ea97c7b6d9bcfe154ec1","amp;dn":"Cinema+4D+Studio+R12+%28Full+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"466f0dd807b28adc6a70ea97c7b6d9bcfe154ec1","infoHashBuffer":{"type":"Buffer","data":[70,111,13,216,7,178,138,220,106,112,234,151,199,182,217,188,254,21,78,193]},"announce":[],"urlList":[]}}