{"title":"Maximize Your Brain power by P. Carter and K. Russell","uid":9393980,"size":6610396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46a2d50f552fdad2620b02d4353fc1be87e6e556&amp;dn=Maximize+Your+Brain+power+by+P.+Carter+and+K.+Russell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"420weedman","files":-1,"time":1387943106,"description":"The latest book in the successful IQ Workout Series gives you the opportunity to test your mind to the full. We only use a tiny percentage of our potential brainpower, while the rest is locked away in the subconscious mind. Just as an athlete can improve performance by rigorous training, you too can become mentally fitter by using the workouts contained in this book. A set of brand new tests will push your mind to the limit, covering creativity, problem solving, memory, agility of mind and IQ tests. Also included is a hints section, as well as all the answers. You can either pit yourself against the clock, or try out the puzzles at your own pace.\t\n\nUse this and other books in The IQ Workout Series as a fun and informative way of testing, assessing, and expanding your brainpower! These books are suitable for anyone from 18 to 80 who wants to put themselves to the test. Ken Russell and Philip Carter have written over 100 books on all aspects of testing, puzzles and crosswords.","torrent":{"xt":"urn:btih:46a2d50f552fdad2620b02d4353fc1be87e6e556","amp;dn":"Maximize+Your+Brain+power+by+P.+Carter+and+K.+Russell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a2d50f552fdad2620b02d4353fc1be87e6e556","infoHashBuffer":{"type":"Buffer","data":[70,162,213,15,85,47,218,210,98,11,2,212,53,63,193,190,135,230,229,86]},"announce":[],"urlList":[]}}