{"title":"Agatha Christie  - 147 libros en castellano","uid":3886664,"size":54437377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46ce7a2ef55c5bc8db3b9d7b5c7a26e856d56152&amp;dn=Agatha+Christie++-+147+libros+en+castellano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"lelo_eet","files":151,"time":1194898854,"description":"- 147 Libros de Misterio por Agatha Christie -\n\nAgatha Christie (n. 15 de septiembre, 1890 /m. 12 de enero, 1976) fue la mÃƒÂ¡s importante escritora britÃƒÂ¡nica de novelas de misterio; tambiÃƒÂ©n escribiÃƒÂ³ novelas romÃƒÂ¡nticas bajo el seudÃƒÂ³nimo de Mary Westmacott. Se le llama aÃƒÂºn hoy dÃƒÂ­a &quot;la Reina del Crimen.&quot;\nSus libros han vendido mÃƒÂ¡s de mil millones de ejemplares en lengua inglesa y otros mil millones en mÃƒÂ¡s de 45 idiomas extranjeros (hasta 2003). Como ejemplo de su ÃƒÂ©xito internacional, se puede mencionar que es la escritora que mÃƒÂ¡s libros ha vendido en Francia, superando los 40 millones de ejemplares (hasta 2003), contra 22 millones de Ãƒ?mile Zola, su competidor mÃƒÂ¡s cercano.\nAgatha Christie estuvo escribiendo desde el final de la Primera Guerra Mundial, cuando creÃƒÂ³ a su personaje Hercules Poirot, el pequeÃƒÂ±o detective belga con su cabeza con forma de huevo y su pasiÃƒÂ³n por el orden, y desde entonces uno de los detectives mÃƒÂ¡s populares desde Sherlock Holmes. \n\nEn diciembre de 1926 desapareciÃƒÂ³ durante once dÃƒÂ­as, causando gran alarma en la prensa. Su auto se hallÃƒÂ³ abandonado en una cantera. Finalmente se la encontrÃƒÂ³ en un hotel de Harrogate, donde dijo haber sufrido amnesia a causa de un ataque de nervios tras la muerte de su madre y la confesiÃƒÂ³n de infidelidad por parte de su marido. Se discutiÃƒÂ³ mucho tiempo sobre la veracidad de esta historia, si todo era verdad o simplemente un truco publicitario. Cartas descubiertas recientemente prueban, sin embargo, que ambas hipÃƒÂ³tesis son incorrectas, ya que la autora fingiÃƒÂ³ su desapariciÃƒÂ³n para castigar a su marido y evitar que ÃƒÂ©ste se vaya de vacaciones a la costa con su amante, \nEn 1930 se casÃƒÂ³ (a pesar de ser divorciada) con el catÃƒÂ³lico Max Mallowan, un arqueÃƒÂ³logo 14 aÃƒÂ±os mÃƒÂ¡s joven. Lo acompaÃƒÂ±ÃƒÂ³ en sus viajes al Medio Oriente, que sirviÃƒÂ³ de trasfondo a varias de sus novelas.\nEn 1961 fue nombrada miembro de la Real Sociedad de Literatura y hecha doctora honoris causa en Letras por la Universidad de Exeter.\nEn 1971 se le concediÃƒÂ³ el tÃƒÂ­tulo de Dama del Imperio BritÃƒÂ¡nico (Dame), el equivalente masculino del tÃƒÂ­tulo de Sir, un tÃƒÂ­tulo de nobleza que en aquellos dias se concedÃƒÂ­a con menos frecuencia a las mujeres de lo que se hace con justicia hoy en dÃƒÂ­a.\nAgatha Christie muriÃƒÂ³ de causas naturales el 12 de enero de 1976, a la edad de 85 aÃƒÂ±os, en Winterbrook House, Cholsey, cerca de Wallingford, Oxfordshire. EstÃƒÂ¡ enterrada en el cementerio de la iglesia de St. Mary, en Cholsey.\n\nPublicÃƒÂ³ mÃƒÂ¡s de ochenta novelas y obras de teatro, principalmente del tipo de la habitaciÃƒÂ³n cerrada y de argumentos donde interviene uno de sus personajes principales, por ejemplo Hercules Poirot o Miss Marple. Aunque le gustaba variar la forma establecida del relato de detectives (uno de sus primeros libros, &amp;#039;La muerte de Roger Ackroyd&amp;#039;, es famoso por su sorpresivo desenlace) era escrupulosa en jugar limpio con el lector al asegurarse de dar toda la informaciÃƒÂ³n para resolver el problema.\nLa mayorÃƒÂ­a de sus novelas y relatos han sido llevados al cine, programas de radio y representaciones teatrales; algunos en mÃƒÂ¡s de una ocasiÃƒÂ³n como &amp;#039;Asesinato en el Expreso de Oriente&amp;#039; y &amp;#039;Muerte en el Nilo&amp;#039;.\n\nPara mayor informaciÃƒÂ³n y una lista completa de sus escritos: &lt;a href=&quot;\nhttp://es.wikipedia.org/wiki/Agatha_Christie&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://es.wikipedia.org/wiki/Agatha_Christie&lt;/a&gt;","torrent":{"xt":"urn:btih:46ce7a2ef55c5bc8db3b9d7b5c7a26e856d56152","amp;dn":"Agatha+Christie++-+147+libros+en+castellano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46ce7a2ef55c5bc8db3b9d7b5c7a26e856d56152","infoHashBuffer":{"type":"Buffer","data":[70,206,122,46,245,92,91,200,219,59,157,123,92,122,38,232,86,213,97,82]},"announce":[],"urlList":[]}}