{"title":"Explorations - The Architecture of John Ronan (Art Ebook).pdf","uid":11802490,"size":21385064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46fa24d12d1294393a3f5244465f75cce5362f1b&amp;dn=Explorations+-+The+Architecture+of+John+Ronan+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1428444282,"description":"John Ronan, &quot;Explorations: The Architecture of John Ronan&quot; \nEnglish | ISBN: 1568988761 | 2010 | 192 pages | PDF | 20 MB\n\nIn Chicago, there is a long history of celebrating architecture as a building art--not merely a graphic one--where lofty rhetoric takes a back seat to clear-headed pragmatism. John Ronan is a leading figure of a new generation of architects that are not only steeped in the grounded, rigorous, and self-critical Chicago tradition, but are also focused on design innovation. Ronan's decade-old practice has garnered critical praise and awards inrecognition of its subtle integration of sustainable technology, spatial composition, and material detail. His beautifully simple spaces convey a recurring theme of adaptability and flexibility across multiple functions that, when activated by a specific use, do not deter from a holistic architectural intent. Explorations features twelve projects ranging in scale from private residences and adaptive renovations to large public buildings. \n\nJohn Ronan Architects' award-winning Gary Comer Youth Center was designed specifically to support the activities of Chicago's South Shore Drill Team; however, during the design process, the function of the space continued to evolve along with the client's goals, resulting in an architectural program that grew from a simple gym into a multifunctional space supporting a range of community and educational services. Explorations also features fully documented design processes for the recently completed Poetry Foundation in Chicago; the transformation of Washington, D.C.'s historic Yale Steam Laundry building into condominiums; the Urban Model High School, a new prototype school developed for the Public Building Commission of Chicago; and Precast Chapel, an economical concrete chapel for promoting interfaith dialogue and religious understanding. Explorations features a foreword by architectect Toshiko Mori; an essay by highly respected Chicago-based architect Brad Lynch; and an interview with John Ronan conducted by architectural historian Robert McAnulty","torrent":{"xt":"urn:btih:46fa24d12d1294393a3f5244465f75cce5362f1b","amp;dn":"Explorations+-+The+Architecture+of+John+Ronan+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46fa24d12d1294393a3f5244465f75cce5362f1b","infoHashBuffer":{"type":"Buffer","data":[70,250,36,209,45,18,148,57,58,63,82,68,70,95,117,204,229,54,47,27]},"announce":[],"urlList":[]}}