{"title":"The Replacements -Tim (1985) v0","uid":8323957,"size":71374728,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:479523cc63071e41d08fd592f6cd89813ab55218&amp;dn=The+Replacements+-Tim+%281985%29+v0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1364754861,"description":"- Track List ---------------------------------------------------------------- -\n\n01. Hold My Life ( 4:21)\n02. I'll Buy ( 3:25)\n03. Kiss Me On The Bus ( 2:54)\n04. Dose Of Thunder ( 2:18)\n05. Waitress In The Sky ( 2:03)\n06. Swingin Party ( 3:53)\n07. Bastards Of Young ( 3:38)\n08. Lay It Down Clown ( 2:25)\n09. Left Of The Dial ( 3:43)\n10. Little Mascara ( 3:36)\n11. Here Comes A Regular ( 5:06)\n\n\n&quot;Moving to a major label was inevitable for the Replacements: they garnered\ntoo much acclaim and attention after Let It Be to stay on Twin/Tone,\nespecially as the label faced the same distribution problems that plagued\nmany indies in the mid-'80s -- plus, the 'Mats' crosstown rivals, H?ker D?\nmade the leap to the big leagues, paving the way for their own hop over to\nSire. The Replacements may have left Twin/Tone behind but they weren't quite\nready to leave Minneapolis in the dust, choosing to record in their hometown\nwith Tommy Erdelyi -- aka Tommy Ramone -- who gives the 'Mats a big, roomy\nsound without quite giving them gloss; compared to Let It Be, Tim is\npolished, but compared to many American underground rock records of the\nmid-'80s (including those by the Ramones), it's loose and kinetic. The\nproduction -- guitars that gained muscle, drums and vocals that gained reverb\n-- is the biggest surface difference, but there aren't just changes in how\nthe Replacements sound; what they're playing is different too, as Paul\nWesterberg begins to turn into a self-aware songwriter. A large part of the\ncharm of Let It Be was how it split almost evenly between ragged vulgarity\nand open-hearted rockers, with Westerberg's best songs betraying a startling,\nbeguiling lack of affect. That's not quite the case with Tim, as Westerberg\nconsciously writes alienation anthems: the rallying cry of &quot;Bastards of\nYoung&quot; and the college radio love letter &quot;Left of the Dial,&quot; songs written\nwith a larger audience in mind -- not a popular audience, but a collection of\nmisfits across the nation, who huddled around Westerberg's raw, twitchy\nloneliness on &quot;Swingin Party&quot; and &quot;Here Comes a Regular,&quot; or the urgent and\ndirectionless &quot;Hold My Life.&quot;\n\nThese songs are Westerberg at his confessional peak, but instead of\nundercutting this ragged emotion or hiding it away, as he did on the\nTwin/Tone albums, he pairs it with the exuberance of &quot;Kiss Me on the Bus&quot; --\nan adolescent cousin to &quot;I Will Dare&quot; -- and channels his smart-ass comments\ninto the terrifically cynical rockabilly shuffle &quot;Waitress in the Sky.&quot; All\nthis eats up so much oxygen that there's not much air left for any of the\nrecklessness of the Twin/Tone LPs: there's no stumbling, no throwaway jokes,\nwith even the twin rave-ups of &quot;Dose of Thunder&quot; and &quot;Lay It Down Clown&quot;\nstraightened out, no matter how much Bob Stinson might try to pull them\napart, which is perhaps the greatest indication that the Replacements were no\nlonger the band they were just a couple years ago. Some 'Mats fans never got\nover this change, but something was gained in this loss: the Replacements\nturned into a deeper band on Tim, one that spoke, sometimes mumbled, to the\nhearts of losers and outcasts who lived their lives on the fringe. If Let It\nBe captured the spirit of the Replacements, then Tim captured their soul.","torrent":{"xt":"urn:btih:479523cc63071e41d08fd592f6cd89813ab55218","amp;dn":"The+Replacements+-Tim+%281985%29+v0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479523cc63071e41d08fd592f6cd89813ab55218","infoHashBuffer":{"type":"Buffer","data":[71,149,35,204,99,7,30,65,208,143,213,146,246,205,137,129,58,181,82,24]},"announce":[],"urlList":[]}}