{"title":"Firesign Theater - 2 Albums","uid":10394394,"size":209913391,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:479f21fe9297f96ccb69ee89e431b6370dd79596&amp;dn=Firesign+Theater+-+2+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Zoticus","files":5,"time":1403244167,"description":"2 classic comedy albums by the Firesign Theater\n\nDON'T CRUSH THAT DWARF, HAND ME THE PLIERS\n\nand\n\nWAITING FOR THE ELECTRICIAN OR SOMEONE LIKE HIM\n\nMP3 @ 320 kbps\n\nTransferred from factory-made (Columbia) cassette tapes to digital via a good cable\n\nLINER NOTES from firesigntheater.com\n\nAlbum 1\n\nDon't Crush That Dwarf, Hand Me The Pliers (1970)\nLP Columbia PC30102\n\nThis album was written and performed during April and May 1970 by\nTHE FIRESIGN THEATRE\nPHILIP PROCTOR - DAVID OSSMAN - PHILIP AUSTIN - PETER BERGMAN\n\nMusic performed by The Firesign Theatre, with THADDEUS WARRICK and The Mindermast Mental Music Hall One-Man Sympathy Orchestra, THE ST. LOUIS AQUARIUM CHORALEERS, Anna-Lee Austin, Jane Dansle, Tiny, Elisabeth Plumb, John Kinick and Cathleen O'Mara, and by THE ANDROID SISTERS, Pomona, Covina and La Verne, featuring &quot;Little Bubbles&quot; on tenor sex, all under the direction of our Mr. Procmer. Production by The Firesign Theatre with Bill Driml. Engineering by Bill Driml with Jerry Hochman and Phil, Sy, Willie, George, Ralph, Alex, Jack, Jack, Eric and Glen. &quot;Shoes for Industry&quot; produced by James William Guercio. Useful Ideas by Bill Malloch. Wake-Up Lady and Bird Stylings by Anna-Lee. AMBIENT'S NOYES CHORAL: Linda, Tiny, Carol, Steve and Charlie &quot;The Drummah&quot; HRUMAH-RUMAH. Cover by Robert Grossman. Back Cover photos by John Rose and Elisabeth Plumb. Poster photos by The Little Guys.\n\n&quot;Oh, Blinding Light,&quot; &quot;The Rough-As-A-Cob March,&quot; and &quot;Peorgie's Song&quot; (from Paranoid Pictures' &quot;High School Madness!&quot;) Â© 1970 by Espeseth Music Music Music (ASCAP).\n\nYou might not want to play this record on the radio because of the F-CC.\n\nAlbum 2\n\nWaiting For The Electrician Or Someone Like Him (1968)\nLP Columbia PC9518\n\nThe four members of the Firesign Theater look and sound alike because they are all brothers. Distantly related from birth, they were born in widely separated parts of the world. Both Peter and Phil come from Indiana and Ohio, while Phil and David are native Californians, a fact which is often overlooked.\n\nPhil, the hostile Aries, is a professional actor, as is Phil, the funny Leo. David is the intellectual and poet of the group, and Peter knows how to drive. Two of them are Sagittarians.\n\nThe four first met at the now-famous Oz Film Festival Colloquium, sponsored by KPFK. Others will remember their frequent interferences on KRLA, via Radio Free Oz, and their many tours of riots, layoffs and Love-ins throughout the state of Los Angeles. Peter attained some strictly local fame as The Wizard of Oz, while the other three are internationally unknown, except to an equally small circle of intimates. This is, however, their first appearance on Vinyl.\n\nDavid, Peter and Phil have traveled extensively, while Phil has not. Individually, The Theater has logged thousands of hours en route to the Soviet Union, India, Europe and The Middle East and West. They expect to resume their travels as soon as they can get out of the country and their contract.\n\nLiving together in an abandoned oleomargarine factory high in the Hollywood Hills (except for Phil, who doesn't), they have become the leading exponents of The Firesign Philosophy of hard work and no pay makes no Jack at all, which has swept the country under the rug.\n\nProduced by Gary Usher and The Firesign Theatre\nEngineering: Jack Lattig, Tom May","torrent":{"xt":"urn:btih:479f21fe9297f96ccb69ee89e431b6370dd79596","amp;dn":"Firesign+Theater+-+2+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479f21fe9297f96ccb69ee89e431b6370dd79596","infoHashBuffer":{"type":"Buffer","data":[71,159,33,254,146,151,249,108,203,105,238,137,228,49,182,55,13,215,149,150]},"announce":[],"urlList":[]}}