{"title":"Islam, The Misunderstood Religion","uid":7456584,"size":660440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47a27b8059bf504c3da5a8b32f654eb98384e34e&amp;dn=Islam%2C+The+Misunderstood+Religion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"iSky","files":-1,"time":1342683020,"description":"All praise is due to Allah who filled with love and glorification the hearts of His beloved servants (Awliya), and removed from the hearts of others His recognition and appreciation.\nI testify that there is no God worthy of worship except One, Allah, with whom I associate no partners. With love and reverence we worship Him, and in fear and longing we invoke His name. I testify that Muhammad is his servant, Prophet, His own beloved, best chosen and most trusted for His revelation, was sent down by Allah to save the human soul from self-indulgence and degradation, connecting it to the one who created the heavens and the earth. He was, by all means, a role model, and his message was a mercy and guidance for all mankind, giving them glad tidings and saving them from oppression. Peace and blessings be upon him.\n\n\nThe Title: Islam, The Misunderstood Religion\nAuthor: Muhammad Qutb \nLanguage: English\nFormat:   PDF\nPages:    142\nSize:     644 KB\n\nShort Description: Muhammad Qutb's popular intorduction to Islam for non-Muslims approaches the subject from a civilizational/ideological point-of-view comparing various social systems against Islam.\n\n\nTABLE OF CONTENTS 1. Is Religion Antiquated? 2. Islam and Slavery 3. Islam and Feudalsim 4. Islam and Capitalism 5. Islam and Private Ownership 6. Islam and the Class System 7. Islam and Alms 8. Islam and Woman 9. Islam and the Concept of Punishment 10. Islam and Civilization 11. Islam and Reactionism 12. Islam and Sexual Repression 13. Islam and Freedom of Thought 14. Religion: the Opium of the People? 15. Islam and Non-Muslim Communities 16. Islam and Idealism 17. Islam and Communism 18. What Next?\n\n\n\n                                Hope This Benefits You!","torrent":{"xt":"urn:btih:47a27b8059bf504c3da5a8b32f654eb98384e34e","amp;dn":"Islam%2C+The+Misunderstood+Religion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a27b8059bf504c3da5a8b32f654eb98384e34e","infoHashBuffer":{"type":"Buffer","data":[71,162,123,128,89,191,80,76,61,165,168,179,47,101,78,185,131,132,227,78]},"announce":[],"urlList":[]}}