{"title":"Novell Netware 5.1","uid":5474671,"size":679272637,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:47a92710714b769e71460e85719ab506feabfab7&amp;dn=Novell+Netware+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"seapmonkey","files":-1,"time":1270068398,"description":"NetWareÃ‚Â® 5.1 is the number one server platform for your network and your Internet-enabled business.\n\nNetWare 5.1 turns a server-class PC into a high-performance network server, providing connectivity among personal computers, printers, mass storage devices, and the Internet.\n\nNetaWare 5.1 gives you superior management and control of your entire network and Internet servers, by offering the following key advantages:\n\n    * A fast, reliable, and manageable networking platform for both network and Internet-enabled applications, including one of the fastest and most reliable Java* Virtual Machines (JVMs) for running Java applications.\n    * Support for Hypertext Transfer Protocol (HTTP), the protocol that Web servers and Web browsers use to communicate on the Internet---and now on the local network too.\n    * Full-service Directory capabilities of NDSÃ‚Â® 8 and native support for LDAP v3, the protocol that allows customers to access Directory information from many different locations.\n    * NDS management tools that help you set up, configure, and manage your network and Internet resources.\n\nWhether your network has a single NetWare 5.1 server or hundreds of NetWare, NT, and UNIX* servers located on local sites, at sites around the world, or on the Internet, NetWare 5.1 is what you need.\n\n\nNotes: This has a License included on the disc.\n!!THIS IS IN A .ISO FORMAT!!\n\nThis is old software but no has uploaded it and in my case I needed it to redo a server for a client and couldn't find a legit copy. So Happy Findings to who ever needs it.\n\n\n","torrent":{"xt":"urn:btih:47a92710714b769e71460e85719ab506feabfab7","amp;dn":"Novell+Netware+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a92710714b769e71460e85719ab506feabfab7","infoHashBuffer":{"type":"Buffer","data":[71,169,39,16,113,75,118,158,113,70,14,133,113,154,181,6,254,171,250,183]},"announce":[],"urlList":[]}}