{"title":"Prometheus: Giftbearer by Severian (FanEdit)","uid":8205413,"size":3796868877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47aca8aceaf5d76003360dc46be7e444ab331374&amp;dn=Prometheus%3A+Giftbearer+by+Severian+%28FanEdit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"semontrax","files":-1,"time":1362110932,"description":"PROMETHEUS: GIFTBEARER\n\n\n- ALL INFORMATION AND CONTENT ACQUIRED FROM: &lt;a href=&quot; http://www.fanedit.org/ifdb/component/content/article/79-fanedit-listings/fanfix/869-prometheus-giftbearer&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fanedit.org/ifdb/component/content/article/79-fanedit-listings/fanfix/869-prometheus-giftbearer&lt;/a&gt;\n\n- ALL CREDIT TO SEVERIAN &amp; FANEDIT.ORG FOR MAKING THIS GREAT CONTENT AVAILABLE\n\n\n\n\nPrometheus: Giftbearer - A Fan Edit By Severian \n\n(720x300 MP4)\n\nBrief Synopsis:\n\nIncorporated deleted, alternate and supplementary footage and made numerous edits to original scenes to strengthen story, clarify character motivation, and address some often-mentioned issues viewers had with the original theatrical release.\n\nIntention:\n\nWatching the excellent deleted and alternate scenes in the Blu-Ray extras convinced me Prometheus could be a better movie with those scenes included, and then making my own changes followed naturally from there.\n\nCuts and Additions:\n\n- Instead of starting with the engineers, we begin with the two human drivers of the mission: Weyland (his TED talk) and Shaw (her call to Weyland). New title card. Shaw's call scaled and cropped to fit film's aspect ratio, new background (generated + line animation from 'Prometheus transmission') fills sides of frame\n\n- David watching Shaw's dream now happens in the middle of the David-alone-on-the-ship sequence instead of at the beginning\n\n- Included extra dialogue in Vickers and Janek's first conversation\n\n- During the briefing, cut Weyland's &quot;what happens when we die&quot; line - nothing in what Shaw and Holloway have found on Earth has to do with the afterlife (Shaws says mentions afterlife in her call, but Weyland's stress should be different)\n\n- In theatrical release, during the briefing, Shaw states that the engineers created humans as if it's a fact, and then when asked by a fellow scientist to back that up, then gives her &quot;what I choose to believe&quot; line, which renders this important aspect of her character ridiculous. Here, she makes it as a direct \nstatement of belief straight up, which then gets mocked by Fifield.\n\n- Cut a couple of Vickers lines that were redundantly underlining bitchiness\n\n- A few small edits to Holloway dialogue to make him a bit less douche-y\n\n- Trimmed a few bits of exploration scenes to increase pace (includes removing silly &quot;it's minus 12 in here&quot; line - they'd all be putting their helmets back on in that case)\n\n- Included Millburn discovering (non-dangerous) alien lifeform scene\n\n- Included Shaw's &quot;not alone&quot; speech to crew\n\n- Shaw and Ford no longer pump the engineer head with electricity until it explodes\n\n- Stitched together new line for Fifield to explain why the keeper of the &quot;pups&quot; gets lost: &quot;I can't connect us to my pups' map&quot;\n\n- Tightened up &quot;probe picking up life form&quot; scene\n\n- Millburn no longer treats the alien worm as if it's a cute animal at a petting zoo\n\n- David now spikes Holloway's drink just before handing it to him, instead of *right* in front of his face\n\n- After Holloway's death, while out on the table, Shaw remembers the dig in Scotland with him (archeological site scene) and has a vision of the engineers on earth (the engineer-sacrifice scene)\n\n- Included Janek's talk with Vickers, which gives him a much better reason for sacrificing himself at the end. It intercuts the scene of David talking to Shaw about her pregnancy. Added music.\n\n- Additional music to second half of David talking to Shaw about her pregnancy scene\n\n- Included alternate Fifield return scene, which I think is far superior in the way \nhe looks and moves (including a hint of xenomorphism with the head elongation)\n\n- Included extended conversation between Vickers and Weyland, a good character moment for both of them, especially giving some nuance to Vickers, and also has acknowledgement that Weyland's circle is aware of Shaw's &quot;child&quot; on the ship, via Vicker's &quot;thing squealing next door&quot; line. Added music and sfx.\n\n- Included the extended conversation between the humans and the engineer. Mix of theatrical and alternate footage. Added music.\n\n- Removed Shaw's long leap across the widening plates. She's already been asked to do so much in her post-operation state\n\n- The co-pilots no longer crack a joke right before making the ultimate sacrifice\n\n- Shortened juggernaut-rolling sequence, to try to mitigate this issue: http://www.penny-arcade.com/comic/2012/06/13 (safe to say I liked the film more than they did, but they make a good point )\n\n- Included Shaw's melee with the engineer\n\n- Included alternate end conversation between Shaw and David, which is *so* much more fitting in tone given what Shaw has been through. Some theatrical footage mixed with alternate\n\n- Added bit of 'space jockey' music from original Alien and callback to the xenomorph-mural to very last scene\n\n- Small adjustments at various other places\n\n- Made color-corrections in all added footage to try to match it with theatrical\n\n\nSpecial Thanks:\n\nnjvc, white43, and darth_xenu for invaluable advice on improving important edits/scenes, Neglify for sheperding me through the submission process, and njvc again for making an awesome motion menu that will be used for an upcoming DVD version.\n\n\n","torrent":{"xt":"urn:btih:47aca8aceaf5d76003360dc46be7e444ab331374","amp;dn":"Prometheus%3A+Giftbearer+by+Severian+%28FanEdit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47aca8aceaf5d76003360dc46be7e444ab331374","infoHashBuffer":{"type":"Buffer","data":[71,172,168,172,234,245,215,96,3,54,13,196,107,231,228,68,171,51,19,116]},"announce":[],"urlList":[]}}