{"title":"Girls - comic by Jonathan and Joshua Luna","uid":4121241,"size":350749279,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4879eea5bfee160141500b945223cfc46cbd54c1&amp;dn=Girls+-+comic+by+Jonathan+and+Joshua+Luna&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"CopyCut","files":24,"time":1207569055,"description":"Monthly comic book limited series created by Jonathan and Joshua Luna, published by Image Comics between 2005 and 2007.\n\nIt tells the story of the people of Pennystown, a community of 63 who are cut off from the rest of the world and attacked by a group of naked, flesh eating, egg-laying women, as well as other bizarre dangers. The first issue was published in May 2005 and the last in April 2007, after 24 issues.\n\n\nPlot\n\nAfter a young man named Ethan Daniels is thrown out of the bar in the town of Pennystown, he meets a mysterious naked and injured woman out on the street. He takes her to his home, and after he tries unsuccessfully to get information from her, they sleep together. He leaves her in his house the next day to report the situation to the local police officer, but they return to find she has laid eggs that hatch into full-grown identical copies of her. The girls attack any other females they come across, forcing the townspeople to hide in a local farmhouse. The situation is complicated by a giant sperm-like monster in a cornfield and the discovery of an enormous dome separating Pennystown from outside aid.","torrent":{"xt":"urn:btih:4879eea5bfee160141500b945223cfc46cbd54c1","amp;dn":"Girls+-+comic+by+Jonathan+and+Joshua+Luna","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4879eea5bfee160141500b945223cfc46cbd54c1","infoHashBuffer":{"type":"Buffer","data":[72,121,238,165,191,238,22,1,65,80,11,148,82,35,207,196,108,189,84,193]},"announce":[],"urlList":[]}}