{"title":"4EXT Recovery Control for Android","uid":7755315,"size":2277041,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:48e20d5138c46ac721b011cdfc34cc98990781f4&amp;dn=4EXT+Recovery+Control+for+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"silent12233","files":3,"time":1351079770,"description":"ROOTED devices only! S-OFF or unlocked bootloader needed.I'm still working full-time on the next generation of the recovery, needed to support your HTC One / Evo LTE Series, Galaxy Nexus, SGS3 and other new devices.\n\nPlease check\n\nThank you very much for your patience!\n\nAbout requests to add new devices:\n\nAs a single developer I must concentrate on one task at a time:\n\nFeature requests for Recovery Control or 4EXT Recovery, or on adding new devices, while providing personal support to my users.\n\nThat's why it takes a longer time until I'm able to add new devices.\n\nCurrently supported devices:\n\nHTC Sensation / XE, Incredible S / 2, Desire Z / G2, Desire S, Desire, Desire HD, Inspire 4G, myTouch 4G, Nexus One, Thunderbolt, Evo 3D GSM / CDMA, Amaze\n\nBy buying this app, you not only get a feature rich application that lets you control, configure and handle the advanced features of 4EXT Recovery with comfort, you also contribute to the future of the recovery itself!\n\nThanks to the great community the project will continually improve and stay as active as possible!\n\nTranslations: it's a community project at crowdin.net. Big thanks to everyone participating!\n\nFor a fully functional 3 days preview of all features, please download &quot;Recovery Updater&quot; available on www.4ext.net.\n\nPermissions:\n\n- Start on boot:\n\n*) deactivated by default\n\n*) Needed to setup schedules in Android.\n\n(!no background process!)\n\n- Vibrate:\n\n*) haptic feedback settings for recovery\n\n- ACCESS_NETWORK_STATE:\n\n*) to not try to connect if you are offline\n\n- WAKE_LOCK:\n\n*) to stay awake while you are downloading.\n\n-INTERNET\n\nUpdates, recovery downloads\n\nPlease see www.4ext.net for a complete feature list and the recent changelog.\n\nExamples:\n\n*) Restore: Let the App do the md5sum check INSTEAD of recovery!\n\n-&gt; To make sure the backup will restore before you even reboot into recovery! This also gives you the opportunity to fix md5sums in case you really need that backup badly.\n\n-&gt; this prevents situations where you might be left with a non-bootable device.\n\n*) Start Backups, Advanced Backups, Restore, Advanced Restore directly from inside the app\n\n*) Check your backups' health to ensure they will restore later when you need them.\n\n*) Convert backups between EXT3 and EXT4\n\n*) Calculates real values for the space needed to create a new full or advanced backup\n\n-&gt; for &quot;Advanced Backups&quot;: While you are selecting / deselecting partitions, it will display and update the currently needed space to complete that custom backup set.\n\n*) Install multiple zip files at once -&gt;\n\n*) Optionally display the md5sums of all the files you are going to flash in one go!\n\n-&gt; So you can make sure all are ok before you flash them.\n\n*) Prefer to stay inside recovery after all your selected operations are done? No problem.\n\n*) Individualize your recovery: install, uninstall 4EXT Themes without the need to reboot.\n\n*) Had a bad Recovery session and didn't have the time to save the log file? No problem, let the app save it to your sdcard!\n\n*) Encountered a problem? Use the report issue button to tell me about your problem and optionally attach valuable info such as your last recovery log to help me help you much better.\n\n*) Safely online install or upgrade 4EXT Recovery (md5sums are automatically verified)\n\n*) View all changelogs or known issues of any version available to your device.\n\n*) Stay informed about any newly discovered bugs\n\n*) The following example would be possible to do in just one session (one reboot in to recovery):\n\n-&gt; Restore a backup\n\n-&gt; Create a backup or advanced backup before the restore process starts\n\n-&gt; Format all you partitions in a file system of your choice before the restore process starts\n\n-&gt; Flash as many zip files you want after the restore is complete\n\n-&gt; Fix permissions afterwards if you like\n\n-&gt; Select to stay inside recovery or reboot automatically once all actions are complete\n\n*) .. and much more! Please see www.4ext.net","torrent":{"xt":"urn:btih:48e20d5138c46ac721b011cdfc34cc98990781f4","amp;dn":"4EXT+Recovery+Control+for+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e20d5138c46ac721b011cdfc34cc98990781f4","infoHashBuffer":{"type":"Buffer","data":[72,226,13,81,56,196,106,199,33,176,17,205,252,52,204,152,153,7,129,244]},"announce":[],"urlList":[]}}