{"title":"Mead, Richelle - Georgina Kincaid 03 - Succubus Dreams-viny","uid":6424224,"size":3356359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48f2492e92101af0a359558ad4e6e6740fa4b754&amp;dn=Mead%2C+Richelle+-+Georgina+Kincaid+03+-+Succubus+Dreams-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306404269,"description":"Mead, Richelle - Georgina Kincaid 03 - Succubus Dreams-viny\n\nSome days, a girl just can't catch a break......especially when the girl in question is Georgina Kincaid, a shape-shifting succubus who gets her energy from seducing men. First there's her relationship with gorgeous bestselling writer Seth Mortensen, which is unsatisfying on a number of levels. It's not just that they can't have sex in case Georgina inadvertently kills him (generally a turn-off for most guys). Lately, even spending time together is a challenge. Seth's obsessed with finishing his latest novel, and Georgina's under demonic orders to mentor the new (and surprisingly inept) succubus on the block.Then there are the dreams. Someone, or something, is preying on Georgina at night, draining her energy, and supplying eerie visions of her future. Georgina seeks answers from Dante, a dream interpreter with ties to the underworld, but his flirtatious charm only leaves her more confused-especially as the situation with Seth reaches crisis point. Now Georgina faces a double challenge-rein in her out-of-control love life, and go toe-to-toe with an enemy capable of wreaking serious havoc among mankind. Otherwise, Georgina, and the entire mortal world, may never sleep easy again..","torrent":{"xt":"urn:btih:48f2492e92101af0a359558ad4e6e6740fa4b754","amp;dn":"Mead%2C+Richelle+-+Georgina+Kincaid+03+-+Succubus+Dreams-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48f2492e92101af0a359558ad4e6e6740fa4b754","infoHashBuffer":{"type":"Buffer","data":[72,242,73,46,146,16,26,240,163,89,85,138,212,230,230,116,15,164,183,84]},"announce":[],"urlList":[]}}