{"title":"Sean Howe - Marvel Comics, The Untold Story [m4a, mp3] Unabridge","uid":8713799,"size":742268212,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4976208b847e774a8c9fc14464a4bb304050c712&amp;dn=Sean+Howe+-+Marvel+Comics%2C+The+Untold+Story+%5Bm4a%2C+mp3%5D+Unabridge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":-1,"time":1374290627,"description":"Marvel Comics: The Untold Story [Unabridged] [Audible Audio Edition]\n\nby Sean Howe (Author), Stephen Hoye (Narrator)\n\nM4a version &amp; Mp3 [96] Version\n &lt;a href=&quot;\nhttp://www.amazon.com/Marvel-Comics-The-Untold-Story/dp/B00B03PE7K/ref=tmm_aud_title_0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Marvel-Comics-The-Untold-Story/dp/B00B03PE7K/ref=tmm_aud_title_0&lt;/a&gt;\n\nThroughout this decades-long journey to becoming a multibillion-dollar enterprise, Marvel's identity has continually shifted, careening between scrappy underdog and corporate behemoth. As the company has weathered Wall Street machinations, Hollywood failures, and the collapse of the comic book market, its characters have been passed along among generations of editors, artists, and writers - also known as the celebrated Marvel &quot;Bullpen&quot;. Entrusted to carry on tradition, Marvel's contributors - impoverished child prodigies, hallucinating peaceniks, and mercenary careerists among them - struggled with commercial mandates, a fickle audience, and, over matters of credit and control, one another.\n\nFor the first time, Marvel Comics reveals the outsized personalities behind the scenes, including Martin Goodman, the self-made publisher who forayed into comics after a get-rich-quick tip in 1939; Stan Lee, the energetic editor who would shepherd the company through thick and thin for decades; and Jack Kirby, the World War II veteran who'd co-created Captain America in 1940 and, 20 years later, developed with Lee the bulk of the company's marquee characters in a three-year frenzy of creativity that would be the grounds for future legal battles and endless debates.\n\nDrawing on more than 100 original interviews with Marvel insiders then and now, Marvel Comics is a story of fertile imaginations, lifelong friendships, action-packed fistfights, reformed criminals, unlikely alliances, and third-act betrayals - a narrative of one of the most extraordinary, beloved, and beleaguered pop-cultural entities in America's history.","torrent":{"xt":"urn:btih:4976208b847e774a8c9fc14464a4bb304050c712","amp;dn":"Sean+Howe+-+Marvel+Comics%2C+The+Untold+Story+%5Bm4a%2C+mp3%5D+Unabridge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4976208b847e774a8c9fc14464a4bb304050c712","infoHashBuffer":{"type":"Buffer","data":[73,118,32,139,132,126,119,74,140,159,193,68,100,164,187,48,64,80,199,18]},"announce":[],"urlList":[]}}