{"title":"Eric Thomas Weber - Morality, Leadership, and Public Policy. On ","uid":10316838,"size":697479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:498c635d318229c877eb5974f8c555f96986ee24&amp;dn=Eric+Thomas+Weber+-+Morality%2C+Leadership%2C+and+Public+Policy.+On+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Anette14","files":-1,"time":1402255467,"description":"Description\nProduct Details\nBook Title: Morality, Leadership, and Public Policy: On Experimentalism in Ethics (Continuum Studies in Political Philosophy)\t\nBook Author: Eric Thomas Weber\nSeries: Continuum Studies in Political Philosophy\nHardcover: 208 pages\nPublisher: Bloomsbury Academic (July 7, 2011)\nLanguage: English\nISBN-10: 1441173110\nISBN-13: 978-1441173119\n\n===================================================================================\nBook Description\nPublication Date: July 7, 2011 | ISBN-10: 1441173110 | ISBN-13: 978-1441173119\nInformed by the pragmatism of John Dewey, this book argues the practical benefits for public policy of a rigorous experimentalist approach to applying moral theory.\nExtended description:\nIn Morality, Leadership and Public Policy, Eric Weber argues for an experimentalist approach to moral theory in addressing practical problems in public policy. The experimentalist approach begins moral inquiry by examining public problems and then makes use of the tools of philosophy and intelligent inquiry to alleviate them.\nPart I surveys the uses of practical philosophy and answers criticisms - including religious challenges - of the approach, presenting a number of areas in which philosophers' intellectual efforts can prove valuable for resolving public conflicts.\nPart II presents a new approach to experimentalism in moral theory, based on the insights of John Dewey's pragmatism. Focusing on the elements of good public inquiry and the experimentalist attitude, Weber discusses ways of thinking about the effective construction and reconstruction of particular problems, including practical problems of public policy prioritization.\nFinally, in Part III the book examines real-world examples in which the experimentalist approach to ethics proves useful, including instances of &quot;bandwidth theft&quot; and the controversies surrounding activist judges in the US Supreme Court.\n\n===================================================================================\nReviews\n&quot;I cannot urge strongly enough the consideration of this ingenious, well-written study for inclusion in the policy curriculum. We seldom have a book that is both original and practical, and this work is both. We have a major problem in the world today, a shortfall in ethical understanding that is producing dire consequences for every level of government. We need to spark interest in the ethical dimensions of policy studies, and Professor Weber has provided us with both the spark and the tinder. I will make good use of his study, and hope others will too.&quot; - Dr. Paul Rich, President, Policy Studies Organization, Washington, D.C., USA\n\n&quot;If there was ever any doubt that philosophy belongs in the real world-in the realm of legislatures and leadership-Weber's book lays it to rest. By a marvelously rich development of the pragmatic experimental method, the author shows how philosophy can make central contributions to dealing with some of our most vexing moral problems. Lucid thinking and accessible style make the book's lasting insights unmistakable. A must-read for both philosophers and community leaders.&quot;- Dr. John Lachs, Centennial Professor of Philosophy at Vanderbilt University, Nashville, TN, USA\n\n&quot;Eric Weber has written a much needed book. Many commentators lament the prevalence of ideological rigidity in American politics. At the same time, defenders of ideological rigidity often defend rigidity as a consequence of a genuinely &quot;ethical&quot; approach to the great issues of public policy. They often equate compromise with ethical weakness. In Morality, Leadership and Public Policy: On Experimentalism in Ethics, Weber convincingly refutes any notion that ethical leadership need be dogmatic by appealing to the most genuinely American of philosophical traditions. Weber's book shows great sensitivity to both the complexity of public policy formation and to the subtleties of philosophical ethics. His book deserves to be read by both policy makers and philosophers.&quot;- Dr. David Schrader, Executive Director, The American Philosophical Association, Newark, DE, USA\n\n===================================================================================\nAbout the Author\nEric Thomas Weber is assistant professor of Public Policy Leadership at the University of Mississippi, USA. He has published in Human Studies, Review of Policy Research, Skepsis, William James Studies, Contemporary Pragmatism, and Transactions of the Charles S. Peirce Society. He is the author of Rawls, Dewey, and Constructivism (Continuum, 2010).\n===================================================================================","torrent":{"xt":"urn:btih:498c635d318229c877eb5974f8c555f96986ee24","amp;dn":"Eric+Thomas+Weber+-+Morality%2C+Leadership%2C+and+Public+Policy.+On+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"498c635d318229c877eb5974f8c555f96986ee24","infoHashBuffer":{"type":"Buffer","data":[73,140,99,93,49,130,41,200,119,235,89,116,248,197,85,249,105,134,238,36]},"announce":[],"urlList":[]}}