{"title":"Women Aloft - The Epic of Flight Series (History Ebook).pdf","uid":11748487,"size":20082859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a1d9c9782205d1dd1f182252c32761306434aa2&amp;dn=Women+Aloft+-+The+Epic+of+Flight+Series+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1426108364,"description":"Women Aloft (The Epic of Flight)\nTime Life Books | 1981 | ISBN: 0809432889 | PDF | 184 pages | 19.1 MB\n\nWomen Aloft is one of twenty-three volumes in the Time-Life book series The Epic of Flight. This series traces the adventure and science of aviation, from the earliest manned balloon ascension through the era of jet flight. This volume is an introduction to women aviators who flew between 1784 (when Elisabeth Thible of France flew in a hot-air balloon) and 1945 (the end of World War II). The opening chapter discusses obstacles women faced when it came to flying; this chapter also describes pioneer women fliers such as Raymonde de Laroche, Harriet Quimby, and Ruth Law. Women aviators (Ruth Nichols and Amelia Earhart being the most notable) and their attempt at crossing the Atlantic Ocean are presented in Chapter Two. Chapter Three features long distance fliers Amy Johnson and Jean Batten as well as German test pilot Hanna Reitsch. Amelia Earhart's attempt to fly around the world in 1937 is the subject of Chapter Four. The final chapter portrays the women pilots of Britain, the United States, Germany, and Russia during World War II. As with other books in this series, numerous photographs and illustrations supplement the narrative; a cut-away diagram of Amelia Earhart's famed Lockheed Electra 10E is included. In sum, author Valerie Moolman has written an excellent book about women aviators and their role in the epic of flight","torrent":{"xt":"urn:btih:4a1d9c9782205d1dd1f182252c32761306434aa2","amp;dn":"Women+Aloft+-+The+Epic+of+Flight+Series+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a1d9c9782205d1dd1f182252c32761306434aa2","infoHashBuffer":{"type":"Buffer","data":[74,29,156,151,130,32,93,29,209,241,130,37,44,50,118,19,6,67,74,162]},"announce":[],"urlList":[]}}