{"title":"Goat.Simulator.+.Install.video.Goat.of.the.Year.Edition.-The.Buz","uid":10018699,"size":619207845,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4aa9bd653581e40189591c6c1b7ee861e165f2ab&amp;dn=Goat.Simulator.%2B.Install.video.Goat.of.the.Year.Edition.-The.Buz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"The.Buzzsaw","files":-1,"time":1398182946,"description":"This is the complete Goat Simulator: Goat of the Year Edition PC Game with a step-by-step instructional Installation video to guide you through the entire install process. The video also includes a fast and easy solution to errors experienced by older laptops and desktops. This is by far the best Goat Simulator download available on the web to date.\n\n\n\nGoat Simulator is a third-person perspective simulation video game developed by Coffee Stain Studios. It was released for Microsoft Windows via Steam on 1 April 2014, while ports for Mac OS X and Linux are presently being developed.\n\nThe game has been compared by the developer as akin to skateboarding games, but where the player controls a goat aimed at doing as much damage as possible around an open-world map, without any other larger goals. The game, initially developed as a joke prototype from an internal game jam and shown in a early alpha state in YouTube videos, was met with excitement and attention, prompting the studio to build out the game into a releasable state while still retaining various non-breaking bugs and glitches to retain the game's entertainment value. (Age / PEGI 7)\n\nThe game received mixed reviews, with some reviewers praising the title for providing a humorous sandbox title to experiment with, while others criticized the game's reliance on social media to popularize the otherwise simple and buggy title.\n\nGoat Simulator is an open-ended third-person perspective game in which the player controls a goat. The player is free to explore the game's world, a suburban semi-urban setting, as a goat, and jump, run, bash things, and lick objects, which attaches the goat's tongue to the object and lets the player drag the object around until they let go. At any time, the player can let the goat drop into a ragdoll model, allowing the game's physics to take over, and another control makes the game run in slow-motion.[2] A number of environmental features allow the player to manipulate the goat into stunts such as bouncing off trampolines or launching the goat into the air through large fans. The game features a scoring system similar to skateboarding games like Tony Hawk's Pro Skater, whereby doing tricks or other actions earns points, while chaining such tricks together in sequence helps build a multiplier that applies to the total score of the tricks done in the sequence. Various in-game goals, such as achieving a certain height, completing flips, or destroying certain objects, are given to the player, but the player is not required to follow these instructions.[3]\n\nSmall golden goat statues are hidden in the game's world. Obtaining these allows the player to restart the game with various modifiers in play, such as changing the goat model to a demon goat, a giraffe, or an ostrich, or adding a jetpack to the goat that can be activated at any time.[2] Various easter eggs are scattered about the sandbox, such as a castle where one can become the King of all Goats, or where the goat character gains a move similar to Sonic the Hedgehog's spin attack.","torrent":{"xt":"urn:btih:4aa9bd653581e40189591c6c1b7ee861e165f2ab","amp;dn":"Goat.Simulator.%2B.Install.video.Goat.of.the.Year.Edition.-The.Buz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa9bd653581e40189591c6c1b7ee861e165f2ab","infoHashBuffer":{"type":"Buffer","data":[74,169,189,101,53,129,228,1,137,89,28,108,27,126,232,97,225,101,242,171]},"announce":[],"urlList":[]}}