{"title":"Calexico - The Black Light 1998","uid":3387693,"size":106365089,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ab126b3978114e87743712fdf73c50310ceb628&amp;dn=Calexico+-+The+Black+Light+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"buzzard","files":23,"time":1127641725,"description":"Calexico - The Black Light 1998\n\n\n\n\nsize:        101 mb\nbitrate:     256\n\n\nCalexico, a Tucson collective of musicians focused around Joey Burns and John Convertino, forged an eclectic identity through their exploration of Southwestern culture. Composer Ennio Morricone's spaghetti Westerns as well as Portuguese fado; Afro-Peruvian music; and '50s and '60s jazz, country, and surf music all factored into Calexico's music.\n\nBurns studied classical music at the University of California-Irvine before starting his rock career. Calexico formed after Burns met John Convertino in Los Angeles in 1990. At the time, Convertino was playing with Howe Gelb's experimental rock group Giant Sand. Burns joined the group as their upright bassist for a European tour. Burns and Convertino found their voice as a duo during a break from work with Giant Sand. They moved to Tucson in 1994 and began collecting instruments from the Chicago Store in Tucson. First, they worked with Tucson's neo-lounge combo Friends of Dean Martinez. They started to play marimba, cello, accordion, and vibraphone in addition to their usual work on bass, guitar, and drums. After a split with Friends of Dean Martinez founder Bill Elm in 1996, the duo began to get session work with Barbara Manning, Richard Buckner, Victoria Williams, Michael Hurley, Bill Janovitz, Vic Chesnutt, and with Lisa Germano (as the trio OP8). Burns &amp; Convertino experimented on their own with their new instruments in a home recording studio in 1996, releasing their debut CD, Spoke, on Germany's Haus Musik Records. After signing with Quarterstick/Touch and Go Records in Chicago, they released The Black Light in 1998 and The Hot Rail in 2000. \n\nFor their 2001 EP, Even My Sure Things Fall Through, Calexico enlisted the support of longtime members Martin Wenk, Volker Zander, and Jacob Valenzuela, as well as members of Mariachi Luz de Luna. The song &quot;The Crystal Frontier&quot; was inspired by Carlos Fuentes' novel and the Cumbia rhythms of Mexico. &quot;Sonic Wind&quot; was a remixed instrumental version of a song originally on The Hot Rail, featuring Valenzuela's trumpet solo. &quot;Untitled III&quot; was a remake of a song by the electronica group Twoloneswordsmen. &quot;Chanel No. 5&quot; was a cover of an American Music Club song. &quot;Banderilla&quot; was a reworking of an outtake from The Hot Rail. Session work with Richard Buckner and the Louvin Brothers' song &quot;Knoxville Girl&quot; inspired &quot;Crooked Road and the Briar.&quot; And &quot;Hard Hat&quot; was an ambient version of the song from The Hot Rail. \n\nEven My Sure Things Fall Through (Quarterstick), in effect, was a collection of outtakes from the group's 2000 CD release, The Hot Rail, as well as B-sides, remixes, and previously unreleased material from their European label, City Slang. In 2003, the band issued their most cohesive material to date with Feast of Wire. An EP of covers, Convict Pool, followed a year later. \n\nThe Black Light\nDeeper and richer than their debut, Spoke, Calexico's second album expands upon the sun-baked, cinematic sound of before with the addition of Latin jazz rhythms, mariachi trumpets, and pedal steel; in and of themselves, the group's songs are not exactly compelling, but they're produced with such a fine sense of texture and atmosphere that The Black Light still makes for intriguing listening. \n\n&quot;The perfect soundtrack for a summer roadtrip in an old car across Death Valley. Calexico's musical textures are woven out of a dazzling array of instruments and styles, including mariachi trumpets, countrified pedal steel, Latin jazz percussion, and carnival organ, just to name a few. The songs move at siesta speed, casually looping and loping along, never getting overheated.&quot; \n\n       1  Gypsy's Curse  Burns  4:17  \n       2  Fake Fur  Burns  2:36  \n       3  The Ride, Pt. II  Burns  3:08  \n       4  Where Water Flows  Burns, Convertino  1:56  \n       5  The Black Light  Burns, Convertino  3:20  \n       6  Sideshow  Burns, Convertino  2:02  \n       7  Chach  Burns, Convertino  3:33  \n       8  Missing  Burns  6:01  \n       9  Minas de Cobre (For Better Metal)  Burns  3:08  \n       10  Over Your Shoulder  Burns  4:10  \n       11  Vinegaroon  Burns, Convertino  1:06  \n       12  Trigger  Burns  2:33  \n       13  Sprawl  Convertino  1:27  \n       14  Stray  Burns  2:54  \n       15  Old Man Waltz  Convertino  2:29  \n       16  Bloodflow  Burns  5:10  \n       17  Frontera  Burns \nCalexico: \nJoey Burns (vocals, guitar, steel guitar, mandolin, cello, accordion, keyboards, double bass, percussion); \nJohn Convertino (accordion, vibraphone, marimba, drums, percussion). \nAdditonal personnel: \nStephanie Nelson (vocals); \nNick Luca (Spanish guitar, claves); \nGabriel Landin (gitaron); \nNeil Harry (pedal steel guitar); \nBridget Keating (violin); \nRigo Pedroza, Fernando Sanchez, Al Tapatio (trumpet); \nHowe Gelb (piano, organ); \nTasha Bundy (background vocals). \n\nProduced By Joey Burns &amp; John Convertino \nEngineered BY Craig Schumacher &amp; Nick Luca \nRecorded At Wavelab Studios, July-August 7 December '97 except 2,4 &amp; 11 -The Homes of Burns/Convertino. \nMixed At Wavelab Studios, Tucson, Arizona\n \n\n1998 CD Quarterstick 52","torrent":{"xt":"urn:btih:4ab126b3978114e87743712fdf73c50310ceb628","amp;dn":"Calexico+-+The+Black+Light+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ab126b3978114e87743712fdf73c50310ceb628","infoHashBuffer":{"type":"Buffer","data":[74,177,38,179,151,129,20,232,119,67,113,47,223,115,197,3,16,206,182,40]},"announce":[],"urlList":[]}}