{"title":"Crossing Bridges Shertupken DVD Rip HEVC AAC Esubs 1CD-DDR","uid":11855473,"size":730312190,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4aba043d6805183d8d9bb6609dc1c15b676c141d&amp;dn=Crossing+Bridges+Shertupken+DVD+Rip+HEVC+AAC+Esubs+1CD-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"SaM","files":1,"time":1430151413,"description":"Synopsis:\nThis week, we of DDR celebrate the diversity of India and bring you, apart from our regular releases, two special award winning films. The First is Jal (Water) a 2014 film from the Western most corner of India - the Raan of Kutch. Although the language is nominally Hindi, it is actually the local dialect of the Raan.\n\nThe second is Crossing Bridges, a film from the Eastern-most end, Arunachal Pradesh in the Shertupken language. Both films have English Subtitles.\n\nEach brings out vividly the beauty of the landscape and give you glimpses of the culture of the land. Each brings out conflicts that people face. Yet both films are so very different.\n\nJal is the story of Bakka, a special person in the water starved Raan of Kutch, for he is a water diviner - a man who can tell you where to find water. That makes him special, almost a god! Yet Bakka's own village has very little water, while a neighbouring enemy village has it in plenty. Then come a group of foreign environmentalists who want to save the flamingoes who migrate to the land. They drill for water but can only find it with the help of Bakka..\n\nBakka meantime is in love with Kesar, the daughter of the headman of the enemy village. Kajri of his own village loves him and apart from the threesome, there are others who are jealous of Bakka. The intrigues rise to a fever pitch with a shattering climax..\n\nCrossing Bridges on the other hand is the story of Tashi, a web designer who loses his city job and has to go back to his village. Everything there is alien, for he has lost his connect to the past. As he waits for another job to materialise, he gradually begins to rediscover his roots, He meets and falls in love with Anila, a school teacher and just as he adjusts to the village life, the city beckons again, for he gets a new job offer...\n\nComments on Crossing Bridges:\nShertupken is a language spoken in a handful of villages in the Shergaon area of West Kameng District of Arunachal Pradesh and it is surprising that a film could be made in this language. It also speaks eloquently about the cultural diversity that is India. The film deals with an issue that is typical of the North East. The tribal people leave the region and go to the cities of India to earn a living as there is little or no opportunity back home. Years of living and life outside, they find they are aliens in their own land when they return home. Tashi, the hero of the film faces just such a dilemma and slowly rediscovers his roots. There is hearbreak on the way but also the joy of finding oneself.\n\nThe film was shot on a miniscule budget with almost no professional equipment. In fact much of the filming was done on a Digital SLR still camera that was capable of 1080p film recording. Watching the film you would never believe that. It brings out the beauty of the Arunachal Pradesh countryside in such vivid detail that it leaves you awestruck. I wonder what the Director/Cinematographer duo would have achieved with proper funding!\n\nLike Jal, this is a film that you could see for the visuals alone. The story is actually quite predictable and at times it does seem like a travelogue for Arunachal,but underlying there is a sincerity that touches you. Its a bit too long and could have done with a little more editing but it still holds interest.\n\nBoth Jal &amp; Crossing Bridges are films that entertain, but are really for the discerning audience..\n\nJal (2014) is being uploaded separately.\n\nUploader's Notes:\nI have left the original DVD almost untouched, except for a mild amount of detail enhancement.\n\nBe aware that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC or Media Player Classic or SMPlayer. Earlier versions may not work\n\nIMDB Link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2271275/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2271275/&lt;/a&gt;\n\n\nSample (2 minutes): Download from here\n\n\nSeeding at 1 GBPS+\n\nripped by: Udbuddho  \n &lt;a href=&quot;\nhttp://extraimago.com/image/2wa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2wa&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2wj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2wj&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2w8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2w8&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2wt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2wt&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2w2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2w2&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/2ww&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/2ww&lt;/a&gt;","torrent":{"xt":"urn:btih:4aba043d6805183d8d9bb6609dc1c15b676c141d","amp;dn":"Crossing+Bridges+Shertupken+DVD+Rip+HEVC+AAC+Esubs+1CD-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aba043d6805183d8d9bb6609dc1c15b676c141d","infoHashBuffer":{"type":"Buffer","data":[74,186,4,61,104,5,24,61,141,155,182,96,157,193,193,91,103,108,20,29]},"announce":[],"urlList":[]}}