{"title":"The Big Butt Book","uid":14426971,"size":87536937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ad209f3b6a20b6583ef4db79cc91a7f33d9d9d3&amp;dn=The+Big+Butt+Book&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":1,"time":1461580741,"description":"The Big Butt Book\r\nBy Dian Hanson\r\nTaschen | 2010 | ISBN 978-3-8365-1115-5 | 380 pages | PDF | 83.4 mb \nhttps://www.taschen.com/page...r_more.the_big_butt_book.htm\r\n\r\nThe Kama Sutra gives detailed instructions on how to spank it. Contemporary Italians touch it for luck before placing a bet. Americans are having it cosmetically enhanced at rates approaching breast enlargement surgery. The female butt, tush, culo, or derrière has always inspired awe, fantasy, and slavish devotion.\r\nCuriously, its primary purpose is functional rather than aesthetic: butts balance our bodies while running, according to biologists. But ask any pygophiliac—as fundament fans are clinically termed—and you’ll get the same answer: female hindquarters exist to please the eye, the hands, and parts south. A pert posterior causes instant arousal, as Zora Neale Hurston observed in Their Eyes Were Watching God: &quot;The men noticed her firm buttocks like she had grape fruits in her hip pockets.&quot; Or, as rapper Sir Mix-a-lot proclaimed, &quot;My anaconda don’t want none, unless you’ve got buns, hun.&quot;\r\nHaving all but disappeared from western culture in the breast-obsessed second half of the 20th century, the fully formed fanny is currently enjoying a massive resurgence, attributed by some to American actress Jennifer Lopez, by others to the rise of booty-centric hip hop culture. Yet this rage for shapely butts is nothing new. The ancient Greeks worshipped at the temple of Aphrodite Kallipygos, Goddess of the Beautiful Buttocks, while a womanly rump has always been an object of worship in most of the southern hemisphere.\r\nThe Big Butt Book explores this perennial fascination with female booty—from small and taut to large and sumptuous—in the fourth installment of Dian Hanson’s critically acclaimed body parts series. Over 400 photos from 1900 to the present day, including works by Elmer Batters, Ellen von Unwerth, Jean-Paul Goude, Ralph Gibson, Richard Kern, Jan Saudek, Ed Fox, Terry Richardson and Sante D’Orazio, of butts ranging from petite Pam Anderson’s to sumptuous Serena Williams’, are contextualized by interviews with porn icon John (Buttman) Stagliano, filmmaker Tinto Brass, artist Robert Crumb, bootylicious butt queens Buffie The Body, Coco and Brazil’s Watermelon Woman, plus Eve Howard and her life-long spanking obsession.\r\n\r\nAbout The Author.Editor\r\nDian Hanson produced a variety of men’s magazines from 1976 to 2001, including Juggs, Outlaw Biker, and Leg Show, before becoming TASCHEN’s Sexy Book editor. Her 60+ books for TASCHEN include The Art of Pin-up and Psychedelic Sex. She lives in Los Angeles.\r\n\r\nCONTENTS\r\nINHALT/SOMMAlRE\r\n20 The Bountiful Buttocks\r\n\r\n46 The Forties-Fifties\r\n68 John Stagliano, aka Buttman\r\n\r\n106 The Sixties\r\n130 Buffie the Body\r\n164 Robert Crumb\r\n198 Watermelon Woman\r\n\r\n232 The Seventies-Eighties\r\n254 Coco\r\n290 Tinto Brass\r\n318 Eve Howard\r\n\r\n334 2001, An Ass Odyssey\r\nThe Booty Has Landed\r\n\r\nALL TEXT BY DIAN HANSON,\r\nEXCEPT AS NOTED\r\n\r\nYoutube","torrent":{"xt":"urn:btih:4ad209f3b6a20b6583ef4db79cc91a7f33d9d9d3","amp;dn":"The+Big+Butt+Book","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ad209f3b6a20b6583ef4db79cc91a7f33d9d9d3","infoHashBuffer":{"type":"Buffer","data":[74,210,9,243,182,162,11,101,131,239,77,183,156,201,26,127,51,217,217,211]},"announce":[],"urlList":[]}}