{"title":"Peter Berkowitz - Nietzsche. The Ethics of an Immoralist [1995][","uid":10142483,"size":3130565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ad4ec14d817bd4d1259b6bc25ce429f6f26ddbf&amp;dn=Peter+Berkowitz+-+Nietzsche.+The+Ethics+of+an+Immoralist+%5B1995%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1400021993,"description":"Description\nProduct Details\nBook Title: Nietzsche: The Ethics of an Immoralist\t\nBook Author: Peter Berkowitz\nHardcover: 313 pages\nPublisher: Harvard University Press; 1ST edition (May 21, 1995)\nLanguage: English\nISBN-10: 0674624424\nISBN-13: 978-0674624429\n\n===================================================================================\nBook Description\nPublication Date: May 21, 1995 | ISBN-10: 0674624424 | ISBN-13: 978-0674624429 | Edition: 1ST\nOnce regarded as a conservative critic of culture, then enlisted by the court theoreticians of Nazism, Nietzsche has come to be revered by postmodern thinkers as one of their founding fathers, a prophet of human liberation who revealed the perspectival character of all knowledge and broke radically with traditional forms of morality and philosophy.\nIn Nietzsche: The Ethics of an Immoralist, Peter Berkowitz challenges this new orthodoxy, asserting that it produces a one-dimensional picture of Nietzsche's philosophical explorations and passes by much of what is provocative and problematic in his thought. Berkowitz argues that Nietzsche's thought is rooted in extreme and conflicting opinions about metaphysics and human nature. Discovering a deep unity in Nietzsche's work by exploring the structure and argumentative movement of a wide range of his books, Berkowitz shows that Nietzsche is a moral and political philosopher in the Socratic sense whose governing question is, &quot;What is the best life?&quot;\nNietzsche, Berkowitz argues, puts forward a severe and aristocratic ethics, an ethics of creativity, that demands that the few human beings who are capable acquire a fundamental understanding of and attain total mastery over the world. Following the path of Nietzsche's thought, Berkowitz shows that this mastery, which represents a suprapolitical form of rule and entails a radical denigration of political life, is, from Nietzsche's own perspective, neither desirable nor attainable.\nOut of the colorful and richly textured fabric of Nietzsche's books, Peter Berkowitz weaves an interpretation of Nietzsche's achievement that is at once respectful and skeptical, an interpretation that brings out the love of truth, the courage, and the yearning for the good that mark Nietzsche's magisterial effort to live an examined life by giving an account of the best life.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nBerkowitz (philosophy, Harvard) gives an erudite analysis of Nietzsche's Thus Spake Zarathustra and five other major works, using &quot;God is dead&quot; as the essential viewpoint for comprehending the philosopher's new ethics of individual creativity and dynamic cosmology of eternal recurrence. Berkowitz focuses on the creative will of the future overman, a superior type of life form (artistic philosopher or godlike being) free from society and politics. He stresses the pervasive ambivalence and extreme opinions in this Nietzschean quest for the best life grounded in truth and excellence despite mediocrity and necessity. This philosophy of overcoming affirms the joy of life and self-deification of the highest type. Ultimately, the will to power challenges the solitary but noble overman to create new values and thereby master this universe. However, Berkowitz's interpretation concludes that Nietzsche himself found this end-goal to be neither obtainable nor desirable. Not all readers will be convinced. Recommended for academic philosophy collections.?H. James Birx, Canisius Coll., Buffalo, N.Y.\nCopyright 1995 Reed Business Information, Inc.\n\n===================================================================================\nReviews\nHere is an impressive and elegant exegesis of Nietzsche's major works as a unified opus. Berkowitz advances an interpretation designed to pry Nietzsche from the grip of the post-modernists and to return him to a more traditional niche in political philosophy. (Diana Coole Times Higher Education Supplement)\n\nNietzsche: The Ethics of an Immoralist is a brilliantly provocative meditation on Nietzsche as an ethical theorist committed to an account of the best life. In response to the heavy emphasis on Nietzsche's philosophical radicalism in recent decades, Berkowitz emphasizes the extent to which Nietzsche actually embraces some of the traditional conceptions he purports to reject, especially with regard to truth, nature, and morality. Berkowitz also criticizes the standard practice of making arguments about Nietzsche's thought on a given topic by 'picking and choosing...cutting and pasting words, phrases, and ideas drawn from wherever they can be found in Nietzsche's Collected Works' without reference to context. Arguing that Nietzsche wanted his books to be read as unified wholes, he builds his discussion around an analysis of six texts considered one at a time...This is an important book. It is deliberately provocative, but the high quality of so many of its provocations makes it a must for those interested in Nietzschean ethics. Berkowitz conducts a highly intelligent war against familiar positions with arguments that are always thoughtful, often convincing, and addressed to important issues. (Bruce Detwiler American Political Science Review)\n\nBerkowitz gives an erudite analysis of Nietzsche's Thus Spake Zarathustra and five other major works, using 'God is dead' as the essential viewpoint for comprehending the philosopher's new ethics of individual creativity and dynamic cosmology of eternal recurrence...Recommended for academic philosophy collection. (H. James Birx Library Journal)\n\nThis book will stand as a needed corrective to common misconceptions about Nietzsche's ethics and the beginning of what should prove to be a fruitful debate over its grounds and implications. (R. Kevin Hill Ethics)\n\nSuperb...The Nietzsche that emerges from Berkowitz's book is driven by a deep passion for the truth, his thought burning with a 'conflict or contest of extremes'...The reward of [this] important book is to reveal to us how Nietzsche's endeavor explores the limitations and terrible dangers of an all-too-human universe, a 'city of man' which flees from any constraints of a divine or natural origin. (Brian C. Anderson Crisis)\n\nPeter Berkowitz takes the field with a bold and intriguing new reading. Nietzsche: The Ethics of an Immoralist is at its best when it challenges those dogmatic pieties of postmodernists that threaten to contaminate serious inquiry...The interpretation that emerges from Berkowitz's sensible and sensitive reading always commands respect and usually elicits agreement. (Werner J. Dannhauser First Things)\n\nIn Nietzsche: The Ethics of an Immoralist, Peter Berkowitz provides us with a rarity: a clear and sober reading of Nietzsche. This book exemplifies Nietzsche scholarship at its best. It presents Nietzsche as a philosopher rooted in the traditions of the West, and as a philosopher who writes coherent books, not incoherent aphorisms. Berkowitz demonstrates that Nietzsche is not a mere negative critic as some have thought, but the author of a positive ethics of creativity, albeit as an immoralist for his rejection of conventional morality...Nietzsche: The Ethics of an Immoralist is a welcome addition to the literature. Berkowitz presents a clear account of Nietzsche's ethics, clarifies some of Nietzsche's own confusion, and leaves the reader to consider the value of Nietzsche's project. (William Irwi Journal of Value Inquiry)\n\nBerkowitz's clearly argued and absorbing book has great strengths. It offers a salutary new emphasis in Nietzsche studies by restoring a perspective that takes Nietzsche's search for truth seriously. It shows convincingly that Nietzsche should be understood as the propounder of a severe ethical vision. And its extended argument that Nietzsche's thought represents a serious rebuke to a central modern and postmodern aspiration is sure to provoke a lively and enlightening debate. (Charles Taylor, McGill University)\n\n===================================================================================\nAbout the Author\nPeter Berkowitz is Associate Professor of Government at Harvard University.\n===================================================================================","torrent":{"xt":"urn:btih:4ad4ec14d817bd4d1259b6bc25ce429f6f26ddbf","amp;dn":"Peter+Berkowitz+-+Nietzsche.+The+Ethics+of+an+Immoralist+%5B1995%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ad4ec14d817bd4d1259b6bc25ce429f6f26ddbf","infoHashBuffer":{"type":"Buffer","data":[74,212,236,20,216,23,189,77,18,89,182,188,37,206,66,159,111,38,221,191]},"announce":[],"urlList":[]}}