{"title":"A TALE OF TWO CITIES Charles Dickens. Frank Muller {FerraBit}","uid":4720437,"size":419294030,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4bc68d72dc6353eb79db2696873f938759dacef5&amp;dn=A+TALE+OF+TWO+CITIES+Charles+Dickens.+Frank+Muller+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"FerraBit","files":-1,"time":1234487698,"description":"A TALE OF TWO CITIES by Charles Dickens (1859)\n\nNarrated by Frank Muller\n12 CDs - to MP3 with iTunes 8\nBitrate: 56kbps (mono), VBR (med-high), 32,000 kHz. (avg ~68kbps)\n275 MP3's total. Tracks every 3 minutes. Unabridged.\n\nPublisher: Barnes and Noble Audio Classics (1987)\nProduced and recorded by Recorded Books LLC\nISBN-10: 0760735220\nISBN-13: 978-0760735220\n\nCover art and PDF included.\n\n&quot;It was the best of times, it was the worst of times...&quot;\n\nCheers, FerraBit\nFenruary 2009\n\nLinks &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/A_Tale_Of_Two_Cities&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/A_Tale_Of_Two_Cities&lt;/a&gt;\n____________________\n\n\n   From Wiki:\n  A Tale of Two Cities (1859) is the second historical novel by Charles Dickens, set in London and Paris before and during the French Revolution. It depicts the plight of the French proletariat under the brutal oppression of the French aristocracy in the years leading up to the revolution, and the corresponding savage brutality demonstrated by the revolutionaries toward the former aristocrats in the early years of the revolution.\n\n   Review:\n  Novel by Charles Dickens, published both serially and in book form in 1859. The story is set in the late 18th century against the background of the French Revolution. Although Dickens borrowed from Thomas Carlyle's history, The French Revolution, for his sprawling tale of London and revolutionary Paris, the novel offers more drama than accuracy. The scenes of large-scale mob violence are especially vivid, if superficial in historical understanding. The complex plot involves Sydney Carton's sacrifice of his own life on behalf of his friends Charles Darnay and Lucie Manette. While political events drive the story, Dickens takes a decidedly antipolitical tone, lambasting both aristocratic tyranny and revolutionary excess--the latter memorably caricatured in Madame Defarge, who knits beside the guillotine. The book is perhaps best known for its opening lines, &quot;It was the best of times, it was the worst of times,&quot; and for Carton's last speech, in which he says of his replacing Darnay in a prison cell, &quot;It is a far, far better thing that I do, than I have ever done; it is a far, far better rest that I go to, than I have ever known.&quot; -- The Merriam-Webster Encyclopedia of Literature\n\n","torrent":{"xt":"urn:btih:4bc68d72dc6353eb79db2696873f938759dacef5","amp;dn":"A+TALE+OF+TWO+CITIES+Charles+Dickens.+Frank+Muller+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc68d72dc6353eb79db2696873f938759dacef5","infoHashBuffer":{"type":"Buffer","data":[75,198,141,114,220,99,83,235,121,219,38,150,135,63,147,135,89,218,206,245]},"announce":[],"urlList":[]}}