{"title":"Power Rangers: Operation Overdrive (Legacy Collection and Beyond","uid":11760246,"size":13035039017,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4be2931607fcd6f701cf7703186819dfbe30be04&amp;dn=Power+Rangers%3A+Operation+Overdrive+%28Legacy+Collection+and+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"CeraKesh","files":33,"time":1426560759,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/a/a1/PROOpromo.jpg/revision/latest?cb=20130622171705[/img]\nPower Rangers Operation Overdrive is the fifteenth season of Power Rangers. It aired on ABC Kids starting on March 3, 2007 after starting on Jetix a week earlier. It is based on the 2006 Super Sentai series, GoGo Sentai Boukenger. Power Rangers Operation Overdrive celebrates the anniversary of 15 years of Power Rangers, while Boukenger celebrated 30 years of Super Sentai.\n\nMany years ago, two brothers named Flurious and Moltor try to steal a legendary crown known as the Corona Aurora and are imprisoned throughout the galaxy. Sentinel Knight scatters the crown and its jewels on the planet Earth in hopes of preventing it from falling into the wrong hands. In the present day, world renowned explorer Andrew Hartford uncovers the crown, which frees Flurious and Moltor from their imprisonment. Andrew recruits four elite teenagers to become Power Rangers and stop the Corona Aurora from falling into the wrong hands. Although Hartford is originally opposed to it, his son Mack becomes the fifth team member - the Red Ranger. The Power Rangers search ancient civilizations and all over the world to uncover the first jewel which was once used by Neptune - King of Atlantis. In the process, they encounter the illustrious Miratrix, who is determined to find the jewels and free her master Kamdor.\n\nThe early working title for the series was Power Rangers Drive Force, but was later changed to &quot;Relic Hunters&quot; and then &quot;Operation Overdrive&quot;\n\nWith the fifteenth anniversary of the series upon them, the producers elected to reward the fans and the show's legacy with a two-part anniversary special uniting Rangers from each of the previous Disney-era seasons, coupled with a popular Ranger from the show's most popular seasons during the 1990s. It had been long established that Johnny Yong Bosch had gained a noticable reputation as Adam Park amongst the fanbase, and thus was asked to be the returning veteran Ranger for the special.\n\nThis season also became the first since Power Rangers Zeo (excluding the preemption of the S.P.D episode Wormhole) to end with a one-episode finale. The season also contained one of the more thought-provoking episodes of the series run, Things Not Said, which began a darker direction for the Red Ranger Mack.\n\nJackie Marchand says Overdrive was pitched as &quot;Indiana Jones... a new exotic location every episode&quot; and Disney responded favourably - only to then give them a small budget and ask for the use of more stock footage. This made the show more of a challenge to work on","torrent":{"xt":"urn:btih:4be2931607fcd6f701cf7703186819dfbe30be04","amp;dn":"Power+Rangers%3A+Operation+Overdrive+%28Legacy+Collection+and+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be2931607fcd6f701cf7703186819dfbe30be04","infoHashBuffer":{"type":"Buffer","data":[75,226,147,22,7,252,214,247,1,207,119,3,24,104,25,223,190,48,190,4]},"announce":[],"urlList":[]}}