{"title":"Russian Strategic Nuclear Forces.pdf","uid":10752395,"size":28026742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4be5111a54bea73df662576d8525ad795813c4dd&amp;dn=Russian+Strategic+Nuclear+Forces.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tmcnl","files":-1,"time":1407889190,"description":"Russian Strategic Nuclear Forces\n\nThis encyclopedic book provides comprehensive data about Soviet and Russian strategic weapons, payloads, and delivery systems and on the nuclear complex that supports them. The data are drawn from open, primarily Russian sources. All the information is presented chronologically, arranged by individual systems and facilities, and is not available elsewhere in a single volume.Following an overview of the history of Soviet strategic forces, the book discusses the structure of the political and military leadership in the Soviet Union and Russia, the structure of the Russian military and military industry, nuclear planning procedures, and the structure of the command and control system. It describes the nuclear warhead production complex and the Soviet nuclear weapon development program. It then focuses on the individual services that constitute the so-called strategic triad -- land-based intercontinental ballistic missiles, the strategic submarine fleet, and strategic aviation. It presents an overview of Soviet strategic defense, including air defense systems, the Moscow missile defense system, the radar and space-based early warning networks, and the space surveillance system. The book also includes a description of the Soviet nuclear testing program, including information on test sites and on all Soviet nuclear tests and peaceful nuclear explosions. It concludes with a look at the future of strategic nuclear weapons in Russia.\n\nFormat: PDF\nPages: 716\nYear: 2001","torrent":{"xt":"urn:btih:4be5111a54bea73df662576d8525ad795813c4dd","amp;dn":"Russian+Strategic+Nuclear+Forces.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be5111a54bea73df662576d8525ad795813c4dd","infoHashBuffer":{"type":"Buffer","data":[75,229,17,26,84,190,167,61,246,98,87,109,133,37,173,121,88,19,196,221]},"announce":[],"urlList":[]}}