{"title":"[Som]Basic Instinct[DvdRip-DivX4-Ita- Mp3]","uid":4490875,"size":746973184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4bf149ec19eebdb299b6ba6f019bd2dfd7b5652e&amp;dn=%5BSom%5DBasic+Instinct%5BDvdRip-DivX4-Ita-+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"mitimex","files":1,"time":1225980700,"description":"A San Francisco l&amp;#039;ex musicista rock Johnny Boz viene trovato morto, ucciso con un punteruolo da ghiaccio all&amp;#039;apice di un infuocato amplesso. Il detective Nick Curran (Michael Douglas), soprannominato &quot;Shooter&quot;, il giustiziere, ÃƒÂ¨ incaricato di occuparsi del caso. I sospetti cadono sulla scrittrice e psicologa Catherine Tramell (Sharon Stone), che era con Boz nel suo locale la notte del delitto. Insieme al suo collega Gus (George Dzundza) Curran va a interrogare la Tramell e trova in casa sua Roxy (Leilani Sarelle), l&amp;#039;amante di lei, che non ha idea di dove la donna sia ma ÃƒÂ¨ sicura del fatto che lei ÃƒÂ¨ innocente. I due poliziotti, dopo aver trovato e parlato con la scrittrice nella sua villa di Stinson Beach, la seguono in auto e scoprono che in uno dei suoi libri un uomo viene ucciso nel letto con la stessa arma usata per far fuori Johnny Boz: un pugnale rompighiaccio. Alla fine Catherine accetta di venire interrogata al commissariato; durante il confronto, lei accavalla le gambe rivelando di non indossare biancheria intima catturando cosÃƒÂ¬ l&amp;#039;attenzione dei poliziotti. Quella stessa notte, al bar, Curran ha un confronto con il suo superiore Nielsen (Chelcie Ross). Subito dopo il detective accompagna la sua ex, la psicologa Beth Gardner (Jeanne Tripplehorn) a casa di lei, dove i due hanno un violento rapporto sessuale. Curran cerca di avvicinare sempre piÃƒÂ¹ la bella e fascinosa Catherine, che utilizza il suo sex-appeal per ottenere preziose informazioni dal detective. Intanto Nielsen ÃƒÂ¨ trovato morto e il primo sospetto ÃƒÂ¨ ovviamente Nick, con il quale aveva avuto una discussione. Curran, invece, include nella lista dei sospettati anche un&amp;#039;amica della Tramell, Hazel Dobkins (Dorothy Malone), che aveva assassinato la sua famiglia il giorno di Natale, nel 1950. Anche Roxy, l&amp;#039;amante della scrittrice, muore nella Lotus di quest&amp;#039;ultima, dopo un brutale inseguimento con il poliziotto. A questo punto Nick, sempre piÃƒÂ¹ attratto dalla nuova focosa amante, si convince della colpevolezza di Beth anche quando, nell&amp;#039;ascensore, qualcuno uccide il suo collega Gus. Accidentalmente il poliziotto, convinto di averla colta sul fatto, uccide la psicologa con un colpo di pistola. Nella casa di Beth, messa a soqquadro, vengono trovati indizi importantissimi che testimoniano il fatto che lei ÃƒÂ¨ l&amp;#039;assassina. La scena finale, che vede Nick e Catherine fare l&amp;#039;amore, riserva ancora qualche sorpresa...","torrent":{"xt":"urn:btih:4bf149ec19eebdb299b6ba6f019bd2dfd7b5652e","amp;dn":"%5BSom%5DBasic+Instinct%5BDvdRip-DivX4-Ita-+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf149ec19eebdb299b6ba6f019bd2dfd7b5652e","infoHashBuffer":{"type":"Buffer","data":[75,241,73,236,25,238,189,178,153,182,186,111,1,155,210,223,215,181,101,46]},"announce":[],"urlList":[]}}