{"title":"The Everything Creative Writing Book: All you need to know to wr","uid":11132796,"size":579626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c772dc7c8895992e0e0460129559b3cbdc28d07&amp;dn=The+Everything+Creative+Writing+Book%3A+All+you+need+to+know+to+wr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"machspee","files":1,"time":1412076045,"description":"The Everything Creative Writing Book: All you need to know to write novels, plays, short stories, screenplays, poems, articles, or blogs (EverythingÂ®)\n\nMany people can write. But writing well enough to get published takes hours of practice, the ability to take criticism, and expert advice. Filled with stories and tips from published authors, this easy-to-use guide teaches you the basics of the writing craft. Whether you want to create poems or plays, children's books or online blogs, romance novels or a memoir, you'll learn to write more effectively and creatively. Published author, editor, and PR consultant Wendy Burt-Thomas covers all aspects of writing, including how to: Prepare to write, from planning to research to organization; Properly structure your piece to fit your chosen genre; Stay focused during the drafting and editing processes; Work with other authors; Overcome writer's block; Market your writing; and more. Whether you're an aspiring or experienced writer, you'll find all you need to spark creativity and get your works in print. With exercises, techniques, samples, and interviews with published writers, The Everything Creative Writing Book, 2nd Edition will turn any dedicated craftsman into a great writer. ","torrent":{"xt":"urn:btih:4c772dc7c8895992e0e0460129559b3cbdc28d07","amp;dn":"The+Everything+Creative+Writing+Book%3A+All+you+need+to+know+to+wr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c772dc7c8895992e0e0460129559b3cbdc28d07","infoHashBuffer":{"type":"Buffer","data":[76,119,45,199,200,137,89,146,224,224,70,1,41,85,155,60,189,194,141,7]},"announce":[],"urlList":[]}}