{"title":"Yoga Journal USA - June 2013 (gnv64)","uid":8566287,"size":37890881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cffcfb51a5e52752065485acffb78fcbb790b0c&amp;dn=Yoga+Journal+USA+-+June+2013+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1371030920,"description":"Yoga Journal USA - June 2013\nEnglish | PDF | 108 pages | 36.1 mb\n\nYoga Journal is an American based media company that publishes a magazine, a website, DVDs, and puts on conferences all devoted to yoga, food and nutrition, fitness, wellness, and fashion and beauty.\n\non the cover\n86 | 5 moves for focused calm\n65 | 16 poses to strengthen and lengthen your back\n46 j The essential posture to build a strong upper body\n55 | How to find the courage to change your life\n74 | Beach-inspired skin care tips\n68 | Standup paddleboard yoga: Where to try the latest trend\n\nfeatures\n68 | JOY RIDE\nWater-loving yogis play with balance, focu^ and core strength by taking their practice offshore, by Lauren Ladoceour\n74 | GET THE GLOW\nBring home vacation's healthy habits for radiant skin, by Mandy Ferreira\n80 | GUIDING LIGHT\nA devoted Ashtanga practitioner celebrates the beauty of the primary series, by Kristte Kahns\n\nyoga lifestyle\n19 | OM\nBringing your practice to life - Yoga for every body; take yoga on a hike; hip-hop devotional music; nature ss, healer; high-tech yoga training; and cool frozen fruit pops.\n32 | STYLE\nOpen season - Step out in comfort with dressy summer shoes that Set you wiggle your toes.\n37 | EATING WISELY \nMovable feast - Locavores discover that yoga deepens the experience of farm-to-tabfe dining, by Kelle Walsh\n95 | REVIEWS\nNew books, CDs, and DVDs, featuring an interview with Baron Baptiste on how to live an empowered life; a review of B, K, 5. Iyengar's new book on the Yoga Sutra, Salty Kempton's book about goddesses, and more.\n\npractice\n46 | ALIGN Â± REFINE\nHover craft With focused attention, you'll glide through Chaturanga with ease, by Jason Crandell\n65 | HOME PRACTICE WITH DEBORAH BURKMAN\nBack in action Open up with a revitalizing sequence that strengthens the back body.\n86 | MASTER CLASS WITH ANNIE CARPENTER\nThe high point - Soar into Standing Splits while you train your mind to savor the present moment.\n\ninspiration\n55 | WISDOM\nSuperpowered Summon the spirit to make positive change by calling on Durgar warrior goddess of strength and protection, by SalJy Kempton\n104 | YOGA SCENE \nLiquid state An Icelandic native returns home and finds a connection between where she's from and where she's going, in Sukhasana (Easy Pose).\n\nin every issue\n10 | LETTERS\t\n14 | EDITOR'S LETTER\t\n16 | CONTRIBUTORS\n100 | YOGA PAGES\t\n102 | CLASSIFIEDS\n102 | LIVING WELL","torrent":{"xt":"urn:btih:4cffcfb51a5e52752065485acffb78fcbb790b0c","amp;dn":"Yoga+Journal+USA+-+June+2013+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cffcfb51a5e52752065485acffb78fcbb790b0c","infoHashBuffer":{"type":"Buffer","data":[76,255,207,181,26,94,82,117,32,101,72,90,207,251,120,252,187,121,11,12]},"announce":[],"urlList":[]}}