{"title":"Elvis Presley - Tupelo's Own Elvis Presley DVD","uid":3739505,"size":4150134831,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4d59e791bdad759bc77d76119fc0700b9ed1630c&amp;dn=Elvis+Presley+-+Tupelo%5C%27s+Own+Elvis+Presley+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Miguel28","files":50,"time":1184236545,"description":"The most expected release of the year for Elvis fans! \n\nThe DVD Contains: Recently discovered UNRELEASED FILM of Elvis performing 6 songs, including Heartbreak Hotel and Don?t Be Cruel, live in Tupelo Mississippi 1956. Included we see a live performance of the elusive Long Tall Sally seen here for the first time ever. \n\nFurther unseen footage contains backstage, the evening show, parade, Tupelo 57 and many more. Please note that the DVD contains specially licensed footage by Fox. \n\nInterview with Elvis at the 1957 Tupelo show NEVER BEFORE HEARD! \n\nThe DVD Audio section contains 21 tracks of the two shows from Tupelo 1956 concerts. \n\nNever before have we seen an Elvis concert from the 50&amp;#039;s with sound. Until Now! \n\nFULL DVD CONTENT PART 1: \n\nDVD- VIDEO \n\n1) Tupelo Welcomes Home Elvis Presley ? UNRELEASED footage of the Parade in Tupelo on 26th September 1956 as well as some backstage footage with Elvis. The audio accompanying the clip are the interviews with Elvis, Vernon and Gladys Presley, Nick Adams and Judy Hopper. 7 min 41 sec \n\n2) Tupelo?s Own Elvis Presley ? UNRELEASED film from the afternoon performance ?The Mississippi-Alabama Fair and Dairy Show? at the Fairgrounds in Tupelo Mississippi on 26th September 1956. \n\n13 min 09 sec \n\nNever before have we seen an Elvis concert from the 50?s with sound. Until Now! \n\nSong Performances: 1. Heartbreak Hotel 2. Long Tall Sally 3. Presentation to the City 4. I Was The One *5. I Want Need Love You &amp; I Got a Woman 6. Don?t Be Cruel *7. Hound Dog * \n\n* Songs available in parts as no footage exist \n\n3) Tupelo Evening Show Clip - UNRELEASED footage from the evening performance. 0.46 sec \n\n4) Original Fox Movie tone News Reel 1956 ? 1min 24 sec \n\n5) Elvis in Tupelo 1957 - Includes an UNRELEASED AUDIO interview with Elvis Presley and Anita Wood. The footage contains performance clips from the 27th September 1957 show as well as backstage and more. 10 mins 12 sec \n\nTotal Running Time: 33 minutes 12 seconds \n\nPART 2: DVD - AUDIO \n\n21 tracks of the Afternoon and Evening performance from the 26th September 1956 shows. \n\nAll tracks accompanied with photographs \n\nAudio Tracklisting: Total running time 51.13 Afternoon Show: 01 Heartbreak Hotel 02 Long Tall Sally 03 Presentation Key To The City 04 I Was The One 05 I Want You, I Need You , I Love You 06 Announcement 07 I Got a Woman 08 Don&amp;#039;t Be Cruel 09 Ready Teddy 10 Love Me Tender 11 Hound Dog Evening Show: 12 Love Me Tender 13 I Was The One 14 I Got a Woman 15 Dialogue 16 Don&amp;#039;t Be Cruel 17 Blue Suede Shoes18 18 Dialogue 19 Baby, Let&amp;#039;s Play House 20 Hound Dog 21 Dialogue \n\nHOW TO BURN THIS DVD \nThere are two files, the audio_ts and video_ts, both containing files. Just add the video in video file, and audio in audio file in the burning ROM Nero. \n\nEnjoy friends!","torrent":{"xt":"urn:btih:4d59e791bdad759bc77d76119fc0700b9ed1630c","amp;dn":"Elvis+Presley+-+Tupelo%5C%27s+Own+Elvis+Presley+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d59e791bdad759bc77d76119fc0700b9ed1630c","infoHashBuffer":{"type":"Buffer","data":[77,89,231,145,189,173,117,155,199,125,118,17,159,192,112,11,158,209,99,12]},"announce":[],"urlList":[]}}