{"title":"I-Doser with ALL doses including the new quickhits released 2008","uid":4475181,"size":157839137,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d781f4a0c5debe6b3bed059f98478c3c2deaab4&amp;dn=I-Doser+with+ALL+doses+including+the+new+quickhits+released+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"robwalsh1","files":185,"time":1225310217,"description":"EDIT: I HAVE NOTICED THAT I FORGOT TO INCLUDE THE ALBUM ARTWORK. SEARCH FOR I-Doser Album Artwork FOR MY TORRENT CONTAINING THEM OR HERE'S THE LINK: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4497433/I-Doser_Album_Artwork&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4497433/I-Doser_Album_Artwork&lt;/a&gt;\n\n\n-----------------------\nI-Doser Description: \n-----------------------\n\nI-Doser Labs is the leading producer of Binaural Brainwave CDs and computer applications. Using proven, scientific, and safe methods of synchronizing your brainwaves; a simulated state can be achieved through the use of our advanced audio CDs, or the I-Doser Application, and a pair of stereo headphones. Our Binaural process has been refined with years of research and development. With thousands of satisfied users, the I-Doser Labs CDs, MP3s, and the I-Doser Application for PCs continue to lead the industry as the only safe and effective method to achieve a simulated mood or experience.\n\n-----------------------\n\nThis is the ONLY torrent to have ALL the I-Doser doses including the new quickhits released in 2008 without duplicates. Over 100 unique doses!\n\nThe MP3's are for the doses that I could not get a hold of the .drg files for. The MP3's, however, are high quality (almost lossless) so should work perfectly. \n\nI have also included the Album Artwork for each dose so you can put them on your iPod/MP3 player. Search on YouTube for 'drg to mp3' to find out how.  \n\nIn this download you will find the new quickhits released in 2008. I could not find these anywhere but after a long time searching found them on some russian website, which I had to translate and sign up for etc. \nTrust me - you will not find them ANYWHERE else. I guarantee that I am the first person to upload them to a non-russian website. \n\nNote: Some people recieve an error when trying to open I-Doser reporting a missing file - COMDLG32.OCX. If you have this problem, jut download the missing file from http://windowsxp.mvps.org/comdlg32.htm and extract it to your WINDOWS/System32 folder. \n\nEnjoy!\nHappy dosing!\n\n--\nrobawalsh\n\n","torrent":{"xt":"urn:btih:4d781f4a0c5debe6b3bed059f98478c3c2deaab4","amp;dn":"I-Doser+with+ALL+doses+including+the+new+quickhits+released+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d781f4a0c5debe6b3bed059f98478c3c2deaab4","infoHashBuffer":{"type":"Buffer","data":[77,120,31,74,12,93,235,230,179,190,208,89,249,132,120,195,194,222,170,180]},"announce":[],"urlList":[]}}