{"title":"Delta Farce(2007)DVDRip.AC3(ENG)-DROCK","uid":6223937,"size":733104550,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4db5946e9a63911028ed4ce987096b552b8cf40e&amp;dn=Delta+Farce%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"drock232","files":-1,"time":1299442769,"description":"When a hard-luck blue-collar worker and his two best friends are mistaken for Army Reservists by a tough-talking Army sergeant, the plane set to fly them to the front lines of Iraq mistakenly drops them in the middle of Mexico to disastrous results in a freewheeling military comedy starring Larry the Cable Guy, Bill Engvall, and D.J. Qualls. Larry (the Cable Guy) has lost his job and his woman in the short span of 24 hours. Convinced that some suds and target shooting are just the right remedies for a broken, jobless heart, Larry sets out with his next-door neighbor Bill (Engvall) and their trigger-happy pal Everett (Qualls) in order to blast off some rounds and down some brews. Their relaxing weekend soon takes an unexpected turn, however, when hard-case Army sergeant Kilgrove (Keith David) mistakes the trio as slacking Army reservists and loads them in a plane bound for Fallujah. Subsequently air-dropped over Mexico due to pilot error, the clueless, wannabe war heroes become convinced that they're actually in the Middle East and set out to save a rural village from what they assume to be an insurgent uprising. Though the thankful locals champion the noble but dimwitted trio for their heroism, the celebration is short-lived as ruthless warlord Carlos Santana (Danny Trejo) pays a personal visit to the town with a plan to confront the fearless warriors who dared to challenge his iron-fist rule. \n\nRipped with Handbrake.\n\nLength: 1 Hour 29 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:4db5946e9a63911028ed4ce987096b552b8cf40e","amp;dn":"Delta+Farce%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4db5946e9a63911028ed4ce987096b552b8cf40e","infoHashBuffer":{"type":"Buffer","data":[77,181,148,110,154,99,145,16,40,237,76,233,135,9,107,85,43,140,244,14]},"announce":[],"urlList":[]}}