{"title":"Brian Eno-Here Come The Warm Jets (Remastered) TQMP","uid":5158064,"size":299912933,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e0c5b6469a3060f781ec0958ed71dc3d14da027&amp;dn=Brian+Eno-Here+Come+The+Warm+Jets+%28Remastered%29+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Bman8247","files":17,"time":1257971012,"description":"Brian Eno\nHere Come The Warm Jets (Remastered) \nLabel: Astralwerks\nAudio CD (June 1, 2004)\nOriginal Release Date: January 1974\n\n\n01. Needles In The Camel's Eye (2004 Digital Remaster)\n02. The Paw Paw Negro Blowtorch (2004 Digital Remaster)\n03. Baby's On Fire (2004 Digital Remaster)\n04. Cindy Tells Me (2004 Digital Remaster). \n05. Driving Me Backwards (2004 Digital Remaster)\n06. On Some Faraway Beach (2004 Digital Remaster)\n07. Blank Frank (2004 Digital Remaster)\n08. Dead Finks Don't Talk (2004 Digital Remaster)\n09. Some Of Them Are Old (2004 Digital Remaster)\n10. Here Come The Warm Jets (2004 Digital Remaster)\n\n\nCD&gt;EAC&gt;WAV&gt;Trader's Little Helper&gt;FLAC (Level 8)\n\n\nIn 1973, fed up with Bryan Ferry's domineering in Roxy Music, Eno leapt into a solo career that would find him championing the &quot;art&quot; in &quot;artifice.&quot; This record is a who's who of the then-burgeoning English art-rock scene, featuring Robert Wyatt, Robert Fripp, and every member of Roxy Music except its leader (thus answering the musical question, &quot;What if Eno had helmed the third Roxy record instead of Ferry?&quot;). Warm Jets sports a lightheartedness that was a refreshing antidote to the pomposity of Yes and ELP on the dark side of art-rock's spectrum, with nonsensical, sound-based couplets such as &quot;Oh headless chicken / How can those teeth stand so much kicking?&quot; This debut is a milestone not just for Eno, but for all rocking music. Listen to Fripp's furious guitars on &quot;Baby's On Fire&quot; and &quot;Blank Frank.&quot; It's incredible, Velvet Underground-inspired rock in a scene that had forgotten what rocking meant. --Gene Booth\n\n\nLimited Edition Japanese &quot;Mini Vinyl&quot; CD, faithfully reproduced using original LP artwork including the inner sleeve. Features most recently mastered audio including bonus tracks where applicable.\n\n_______________________________________\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                         &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\n\n","torrent":{"xt":"urn:btih:4e0c5b6469a3060f781ec0958ed71dc3d14da027","amp;dn":"Brian+Eno-Here+Come+The+Warm+Jets+%28Remastered%29+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0c5b6469a3060f781ec0958ed71dc3d14da027","infoHashBuffer":{"type":"Buffer","data":[78,12,91,100,105,163,6,15,120,30,192,149,142,215,29,195,209,77,160,39]},"announce":[],"urlList":[]}}