{"title":"Doug.Hoyte.-.Let.Over.Lambda-AMiGOS","uid":8310295,"size":11990793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e811d1e558667d51d239d5bc20d4eabc9977789&amp;dn=Doug.Hoyte.-.Let.Over.Lambda-AMiGOS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moebanzor","files":2,"time":1364465606,"description":"           Title: Let Over Lambda: 50 years of Lisp\n           Author: Doug Hoyte   \n           Source: Book\n           Year: 2008\n           Pages: 384\n \n           Desc: Let Over Lambda is one of the most hardcore \n           computer programming books out there. Starting with \n           the fundamentals, it describes the most advanced \n           features of the most advanced language: COMMON LISP. \n           The point of this book is to expose you to ideas that \n           you might otherwise never be exposed to.\n\n           This book is about macros, that is programs that write \n           programs. Macros are what make lisp the greatest \n           programming language in the world. When used properly, \n           macros enable amazing feats of abstraction, programmer \n           productivity, and code efficiency and security that \n           are unheard of elsewhere. Macros let you do things you \n           simply cannot do in other languages.\n\n           If you are looking for a dry coding manual that \n           re-hashes common-sense techniques in whatever langue\n           du jour, this book is not for you. This book is about \n           pushing the boundaries of what we know about \n           programming. While this book teaches useful macro \n           skills that can help solve your programming problems \n           today and now, it has also been designed to be \n           entertaining and inspiring. If you have ever wondered\n           what lisp or even programming itself is really about, \n           this is the book you have been looking for.\n \n           Notes: Text is a fully searchable djvu made from a\n           scan of the book. Djvu was the chosen format rather\n           than pdf, as djvu offers numerous technical\n           advantages, analogous to the shift from avi to mkv.\n           The bottom line to you is better quality and smaller\n           file sizes. On the whole, the quality of the ebook \n           is good. Pages have been deskewed, dewarped, ocred \n           text layer for searching, indexed, and bitonalized.\n\n           In the current setup, scanning books is very\n           tedious and time consuming, so don't expect a large\n           number of these book scan releases in the future,\n           only books worth the work (such as this one) will be\n           completed.","torrent":{"xt":"urn:btih:4e811d1e558667d51d239d5bc20d4eabc9977789","amp;dn":"Doug.Hoyte.-.Let.Over.Lambda-AMiGOS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e811d1e558667d51d239d5bc20d4eabc9977789","infoHashBuffer":{"type":"Buffer","data":[78,129,29,30,85,134,103,213,29,35,157,91,194,13,78,171,201,151,119,137]},"announce":[],"urlList":[]}}