{"title":"Bipolar Disorder [PDF] [StormRG]","uid":10651478,"size":1091207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ee30dd00ff0fac22abe8e03d9e41f7b412926e8&amp;dn=Bipolar+Disorder+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":-1,"time":1406621195,"description":"Author: Stephen Strakowski \nSeries: Oxford American Psychiatry Library\nPaperback: 128 pages\nPublisher: Oxford University Press; 1 edition (August 14, 2014)\nLanguage: English\nISBN-10: 0199995680\nISBN-13: 978-0199995684\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Don't hesitate to PM me if you have any questions or problem with the download,as comments on torrents are easy to miss. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nBipolar disorder is one of the most common and disabling conditions affecting humankind. It is a leading cause of disability and mortality worldwide, affecting millions of people. The illness is complex and dynamic, so that many individuals are misdiagnosed for years and clinicians struggle with identifying the most appropriate and successful treatment. Because it is complex and common, people suffering from bipolar disorder seek help from clinicians of all types - from psychiatrists, family doctors, gynecologists, and internists to psychologists, social workers and other therapists. For clinicians without significant experience with bipolar disorder, how to manage the condition can be mystifying. Even experienced psychiatrists will frequently find themselves uncertain of the best approach to a given individual with bipolar illness. This pocket-sized guide was specifically written with this diverse group of clinicians in mind. It provides a concise, practical and current overview of bipolar disorder, including making a correct diagnosis, identifying important medical and psychiatric comorbidities, and describing our current understanding of the epidemiology, genetics and neurobiology of the condition. In addition to these topics to provide context, the majority of the book is focused on a programmatic approach toward managing bipolar disorder, including discussions of specific subpopulations, such as children or women who are pregnant. The book may also be of interest for people with bipolar disorder and their families, to help guide treatment seeking and provide education about this sometimes mystifying condition. The author is an internationally recognized and trusted expert in the study and treatment of bipolar disorder, annually named a Best DoctorÂ® and recognized by US News and World ReportÂ® as a Top 1% Psychiatrist, whose own extensive clinical experience working with people with bipolar disorder guides this book.","torrent":{"xt":"urn:btih:4ee30dd00ff0fac22abe8e03d9e41f7b412926e8","amp;dn":"Bipolar+Disorder+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ee30dd00ff0fac22abe8e03d9e41f7b412926e8","infoHashBuffer":{"type":"Buffer","data":[78,227,13,208,15,240,250,194,42,190,142,3,217,228,31,123,65,41,38,232]},"announce":[],"urlList":[]}}