{"title":"Fr. Jacques Philippe - In the School of the Holy Spirit","uid":15687576,"size":634119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ef36c665476cbea3084a02be3ac1a78a4fb680c&amp;dn=Fr.+Jacques+Philippe+-+In+the+School+of+the+Holy+Spirit&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"catholicstuff","files":3,"time":1472359703,"description":"Fr. Jacques Philippe - In the School of the Holy Spirit (EPUB, MOBI, PDF)\r\n\r\nIn the prayers lives of many Christians there is one person of the Trinity that often goes overlooked - The Holy Spirit. The Holy Spirit is no less involved in our lives than the Father and the Son, yet many are unaware of this. Jesus said about the Holy Spirit, &quot;If I go, I will send you another Comforter.&quot; But are we aware of the Holy Spirit in our lives? In the School of the Holy Spirit by renowned retreat master Jacques Philippe will help. It will lead you to be more attentive to the movements of the Holy Spirit in your life as you learn to value the third person of the Trinity as the Sanctifier of your soul. Philippe explains the rewards of being attentive to the Holy Spirit and provides simple and concrete ways to grow in this inner sensitivity. In his clear and simple style, he illustrates his points with many examples from modern life. Here then is a valuable aid in your own spiritual journey.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:4ef36c665476cbea3084a02be3ac1a78a4fb680c","amp;dn":"Fr.+Jacques+Philippe+-+In+the+School+of+the+Holy+Spirit","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef36c665476cbea3084a02be3ac1a78a4fb680c","infoHashBuffer":{"type":"Buffer","data":[78,243,108,102,84,118,203,234,48,132,160,43,227,172,26,120,164,251,104,12]},"announce":[],"urlList":[]}}