{"title":"Ayaan Hirsi Ali - Nomad (mobi, epub)","uid":6926480,"size":802440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f354b3cb3be330ec010d2a9de333c2d477c0f92&amp;dn=Ayaan+Hirsi+Ali+-+Nomad+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tonn10","files":2,"time":1325523146,"description":"Nomad\n\n&quot;This woman is a major hero of our time.&quot;--Richard Dawkins\n\nAyaan Hirsi Ali captured the world's attention with Infidel, her compelling coming-of-age memoir, which spent thirty-one weeks on the New York Times bestseller list. Now, in Nomad, Hirsi Ali tells of coming to America to build a new life, an ocean away from the death threats made to her by European Islamists, the strife she witnessed, and the inner conflict she suffered. It is the story of her physical journey to freedom and, more crucially, her emotional journey to freedom--her transition from a tribal mind-set that restricts women's every thought and action to a life as a free and equal citizen in an open society. Through stories of the challenges she has faced, she shows the difficulty of reconciling the contradictions of Islam with Western values. \n\nIn these pages Hirsi Ali recounts the many turns her life took after she broke with her family, and how she struggled to throw off restrictive superstitions and misconceptions that initially hobbled her ability to assimilate into Western society. She writes movingly of her reconciliation, on his deathbed, with her devout father, who had disowned her when she renounced Islam after 9/11, as well as with her mother and cousins in Somalia and in Europe. \n\nNomad is a portrait of a family torn apart by the clash of civilizations. But it is also a touching, uplifting, and often funny account of one woman's discovery of today's America. While Hirsi Ali loves much of what she encounters, she fears we are repeating the European mistake of underestimating radical Islam. She calls on key institutions of the West--including universities, the feminist movement, and the Christian churches--to enact specific, innovative remedies that would help other Muslim immigrants to overcome the challenges she has experienced and to resist the fatal allure of fundamentalism and terrorism. \n\nThis is Hirsi Ali's intellectual coming-of-age, a memoir that conveys her philosophy as well as her experiences, and that also conveys an urgent message and mission--to inform the West of the extent of the threat from Islam, both from outside and from within our open societies. A celebration of free speech and democracy, Nomad is an important contribution to the history of ideas, but above all a rousing call to action.\n\nAuthor: Ayaan Hirsi Ali\nPublisher: Knopf Canada\nPublication Date: May 18, 2010\n\nFormats:\n.epub (compatable with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatable with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4f354b3cb3be330ec010d2a9de333c2d477c0f92","amp;dn":"Ayaan+Hirsi+Ali+-+Nomad+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f354b3cb3be330ec010d2a9de333c2d477c0f92","infoHashBuffer":{"type":"Buffer","data":[79,53,75,60,179,190,51,14,192,16,210,169,222,51,60,45,71,124,15,146]},"announce":[],"urlList":[]}}