{"title":"Selous Scouts: Rhodesian Counter-Insurgency Specialists ","uid":8794510,"size":13692357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f4d2426f2fe5be077b707a102935b49ac26f815&amp;dn=Selous+Scouts%3A+Rhodesian+Counter-Insurgency+Specialists+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1376037753,"description":"Selous Scouts: Rhodesian Counter-Insurgency Specialists \nby Peter Baxter\n\nDESCRIPTION:\n&quot;Its members consisted of some of the finest guerrilla-fighting men in the western world, unconventional in many ways, disregardful of parade-ground discipline, unorthodox in their dress, yet a force so tightly knit in the face of danger that those who knew anything about them could only marvel&quot; - The Citizen. Formed in 1973 by the legendary Lieutenant-Colonel Ron Reid-Daly at the behest of Rhodesian military supremo General Peter Walls, the Selous Scouts were to write their name into the annals of military history as one of the finest counterinsurgency units of all time, through their innovative pseudo-guerrilla tactics, brilliant reconnaissance operations into Zambia and Botswana and daring flying-column raids into Mozambique. Feared and hated by the liberation movements ZIPRA and ZANLA, the Scouts wreaked untold havoc and destruction on their Soviet- and Chinese-backed enemies, accounting for 68% of guerrilla casualties within Rhodesia alone during the bitter bush war of the 1970s. Uniquely ahead of its time, the regimen - a brotherhood of men that traversed cultural and racial barriers; their Shona motto was 'Pamwe Chete' (together only) - was to produce the type of soldier that earned for the unit one Grand Cross of Valour, nine Silver Crosses and 22 Bronze Crosses of Rhodesia.Peter Baxter is an author, amateur historian and African field, mountain and heritage travel guide. Born in Kenya, Peter has lived and travelled over much of southern and central Africa. He was educated in Rhodesia (Zimbabwe), leaving the country after independence for an extended bout of travel before returning in 1989. Since then he has guided in all the major mountain ranges south of the equator, helping develop the concept of sustainable travel, and the touring of battlefield and heritage sites in East Africa. Peter lives in the United States, working on the marketing of African heritage travel as well as a variety of book projects. His interests include British Imperial history in Africa and the East Africa campaign of the First World War in particular. He is married with three children.REVIEWS &quot;Undoubtedly one of the most, if not the most, effective counter-insurgency units in the history of warfare&quot; Lt-Col Robert Brown, Soldier of Fortune magazine&quot;Africa@War is a ground-breaking series concept, studying Africa's conflicts and military players in an informative and entertaining manner, examining some of the lesser-known campaigns and shedding new light on some of the better-known operations ... Both titles are great models of what the combination of authors and publishers can produce by way of useable case studies for the market place in a concise illustrated format. They are recommended as professional military education references.&quot;Charles D. Melson, Chief Historian, U.S. Marine Corps&quot;Each of the books in this series is a well-documented and researched synopsis of the events that they are focused upon. They layouts and presentation are logical and of a very high quality ... As an introduction to this field of operation, this series is outstanding. A definite asset for those wishing to improve their knowledge and understanding of the development of successful, multi-faceted doctrine in the fight against insurgent/assymetric war.&quot;Major Chris Buckham, Royal Canadian Air Force Journal\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Selous-Scouts-Counter-Insurgency-Specialists-ebook/dp/B007QXJ17M&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Selous-Scouts-Counter-Insurgency-Specialists-ebook/dp/B007QXJ17M&lt;/a&gt;","torrent":{"xt":"urn:btih:4f4d2426f2fe5be077b707a102935b49ac26f815","amp;dn":"Selous+Scouts%3A+Rhodesian+Counter-Insurgency+Specialists+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4d2426f2fe5be077b707a102935b49ac26f815","infoHashBuffer":{"type":"Buffer","data":[79,77,36,38,242,254,91,224,119,183,7,161,2,147,91,73,172,38,248,21]},"announce":[],"urlList":[]}}