{"title":"SOUTHLAND - THE COMPLETE FIRST SEASON UNCENSORED DVD RIP","uid":5402644,"size":2278119936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f5d238611d0bf351e4e1acebe9cde5baf5bae11&amp;dn=SOUTHLAND+-+THE+COMPLETE+FIRST+SEASON+UNCENSORED+DVD+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dman1007","files":-1,"time":1267477557,"description":"Southland takes a &quot;raw and authentic look&quot; at Los Angeles and the lives of the LAPD officers who police it. The show's seven episodes center around the experiences and interactions of LAPD patrol officers and detectives, and is more a character-driven drama than a police procedural.Among the characters are rookie Officer Ben Sherman and his training officer, John Cooper; Detective Lydia Adams, who must balance work with responsibility for her mother; Officer Chickie Brown, who aspires to be the first woman on the elite SWAT Team; and Detective Sammy Bryant, whose home life interferes with his working life.\n\n\nSOUTHLAND - THE COMPLETE FIRST SEASON UNCENSORED\n\n\nEpisode 1 - &quot;Unknown Trouble&quot; \nTo live and die in L.A.: On his first day working with Cooper, Ben faces the biggest decision a cop can make \n\nEpisode 2 - &quot;Mozambique&quot;\nLydia begins a dogged, and perhaps too personal, search for the missing mom of an infant found crawling into Hollywood traffic. \n\nEpisode 3 - &quot;See the Woman&quot;\nDewey buddies up with an obnoxious movie star. After a rocky start, Cooper and Ben forge a new relationship. \n\nEpisode 4 - &quot;Sally in the Alley&quot; \t\nA murder victim can't find rest even in death: local kids use her corpse for target practice and videotape the &quot;fun.&quot; \n\nEpisode 5 - &quot;Two Gangs&quot;\nNate and Sammy search on the QT for Sal's gun, stolen after their boss crashed his car into a light pole.\n \nEpisode 6 - &quot;Westside&quot;\nJewel thieves strike in Bel-Air, Cooper struggles with painkillers and Sammy finds Janilla a safe place to live. \n\nEpisode 7 - &quot;Derailed&quot;\nA dead banger stuffed in a trunk. A drug-ring matriarch with a hit out on Janilla. It's going to be a memorable Memorial Day weekend. \n\nSPECIAL FEATURE:\nSOUTHLAND: REDEFINING THE COP DRAMA\nProducers and Cast Reveal the Story Behind\nCreating a New Series About the LAPD\n\n\nEnjoy!!!!!\n\n-D","torrent":{"xt":"urn:btih:4f5d238611d0bf351e4e1acebe9cde5baf5bae11","amp;dn":"SOUTHLAND+-+THE+COMPLETE+FIRST+SEASON+UNCENSORED+DVD+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f5d238611d0bf351e4e1acebe9cde5baf5bae11","infoHashBuffer":{"type":"Buffer","data":[79,93,35,134,17,208,191,53,30,78,26,206,190,156,222,91,175,91,174,17]},"announce":[],"urlList":[]}}