{"title":"Don DeLillo - Zero K","uid":15288365,"size":222371519,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f966dc9dee028883e37735643aef6e9dd537100&amp;dn=Don+DeLillo+-+Zero+K&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":1,"time":1468396954,"description":"Jeffrey Lockhart's father, Ross, is a billionaire in his 60s, with a younger wife, Artis Martineau, whose health is failing. Ross is the primary investor in a remote and secret compound where death is exquisitely controlled and bodies are preserved until a future time when biomedical advances and new technologies can return them to a life of transcendent promise. Jeff joins Ross and Artis at the compound to say an uncertain farewell to her as she surrenders her body.\r\n\r\nWe are born without choosing to be. Should we have to die in the same manner? Isn't it a human glory to refuse to accept a certain fate? These are the questions that haunt the novel and its memorable characters, and it is Ross Lockhart, most particularly, who feels a deep need to enter another dimension and awake to a new world. For his son, this is indefensible. \r\n\r\nJeff, the book's narrator, is committed to living, to experiencing the mingled astonishments of our time here on Earth.\r\n\r\nDon DeLillo's seductive, spectacularly observed and brilliant new novel weighs the darkness of the world - terrorism, floods, fires, famine, plague - against the beauty and humanity of everyday life, love, awe, and the intimate touch of earth and sun.\r\n\r\nRead by Thomas Sadoski\r\nFormat: M4B\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:4f966dc9dee028883e37735643aef6e9dd537100","amp;dn":"Don+DeLillo+-+Zero+K","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f966dc9dee028883e37735643aef6e9dd537100","infoHashBuffer":{"type":"Buffer","data":[79,150,109,201,222,224,40,136,62,55,115,86,67,174,246,233,221,83,113,0]},"announce":[],"urlList":[]}}