{"title":"Thelonious Monk 24 Bit Vinyl Pack","uid":8464183,"size":12202383177,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ffd96bc43251dec3c3fe66d7ad1c1d675801765&amp;dn=Thelonious+Monk+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1368316416,"description":"\n  Thelonious Monk 24 Bit Vinyl Pack\n\n  Genre: Jazz\n  Style: Bop, Hard Bop, Modal Music, Post-Bop, Modern Big Band\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Criss-Cross\n  Brillant Corners\n  Monk's Music\n  With John Coltrane at Carnegie Hall\n  At the Blackhawk\n  Alone in San Francisco\n  The London Collection Volume 1\n  Something in Blue\n  Genius of Modern Music\n  Epistrophy\n  At the It Club\n  Mulligan Meets Monk\n  Straight, No Chaser\n  At Town Hall\n  Underground\n  Thelonious Himself \n\n  The most important jazz musicians are the ones who are successful in creating their own original world of music with its own rules, logic, and surprises. Thelonious Monk, who was criticized by observers who failed to listen to his music on its own terms, suffered through a decade of neglect before he was suddenly acclaimed as a genius; his music had not changed one bit in the interim. In fact, one of the more remarkable aspects of Monk's music was that it was fully formed by 1947 and he saw no need to alter his playing or compositional style in the slightest during the next 25 years.\n\n  Thelonious Monk grew up in New York, started playing piano when he was around five, and had his first job touring as an accompanist to an evangelist. He was inspired by the Harlem stride pianists (James P. Johnson was a neighbor) and vestiges of that idiom can be heard in his later unaccompanied solos. However, when he was playing in the house band of Minton's Playhouse during 1940-1943, Monk was searching for his own individual style. Private recordings from the period find him sometimes resembling Teddy Wilson but starting to use more advanced rhythms and harmonies. He worked with Lucky Millinder a bit in 1942 and was with the Cootie Williams Orchestra briefly in 1944 (Williams recorded Monk's &quot;Epistrophy&quot; in 1942 and in 1944 was the first to record &quot;'Round Midnight&quot;), but it was when he became Coleman Hawkins' regular pianist that Monk was initially noticed. He cut a few titles with Hawkins (his recording debut) and, although some of Hawkins' fans complained about the eccentric pianist, the veteran tenor could sense the pianist's greatness.\n\n  The 1945-1954 period was very difficult for Thelonious Monk. Because he left a lot of space in his rhythmic solos and had an unusual technique, many people thought that he was an inferior pianist. His compositions were so advanced that the lazier bebop players (although not Dizzy Gillespie and Charlie Parker) assumed that he was crazy. And Thelonious Monk's name, appearance (he liked funny hats), and personality (an occasionally uncommunicative introvert) helped to brand him as some kind of nut. Fortunately, Alfred Lion of Blue Note believed in him and recorded Monk extensively during 1947-1948 and 1951-1952. He also recorded for Prestige during 1952-1954, had a solo set for Vogue in 1954 during a visit to Paris, and appeared on a Verve date with Bird and Diz. But work was very sporadic during this era and Monk had to struggle to make ends meet.","torrent":{"xt":"urn:btih:4ffd96bc43251dec3c3fe66d7ad1c1d675801765","amp;dn":"Thelonious+Monk+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ffd96bc43251dec3c3fe66d7ad1c1d675801765","infoHashBuffer":{"type":"Buffer","data":[79,253,150,188,67,37,29,236,60,63,230,109,122,209,193,214,117,128,23,101]},"announce":[],"urlList":[]}}