{"title":"The Band - The Last Waltz 1978 (2 CD) [FLAC] - Kitlope","uid":9749622,"size":913379232,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5080dea8a5ed6b9980f22f62d0425a05d40b94dd&amp;dn=The+Band+-+The+Last+Waltz+1978+%282+CD%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Kitlope","files":36,"time":1394646622,"description":"PC Software: Windows 8.1 Pro \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nReupload of a previous torrent:\nTracker(s): udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, udp://tracker.istole.it:80\nTorrent Hash: 5080DEA8A5ED6B9980F22F62D0425A05D40B94DD\nFile Size: 871.06 MB\nYear: 1978; Reissued 2003 (2 CD version)\nLabel: Warner Bros, Rhino\nCatalog #: R2 73925\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nThe Band was a Canadian-American roots rock group that originally consisted of Rick Danko (bass guitar, double bass, fiddle, trombone, vocals), Levon Helm (drums, mandolin, guitar, vocals), Garth Hudson (keyboard instruments, saxophones, trumpet), Richard Manuel (piano, drums, baritone saxophone, vocals) and Robbie Robertson (guitar, vocals). The members of the Band first came together as they joined rockabilly singer Ronnie Hawkins' backing group the Hawks one by one between 1958 and 1963.\n\nIn 1964, they separated from Hawkins, after which they toured and released a few singles as Levon and the Hawks and the Canadian Squires. The next year, Bob Dylan hired them for his U.S. tour in 1965 and world tour in 1966.[1] Following the 1966 tour, the group moved with Dylan to Saugerties, New York, where they made the informal 1967 recordings that became The Basement Tapes, which forged the basis for their 1968 debut album Music from Big Pink. Because they were always &quot;the band&quot; to various frontmen, Helm said the name &quot;The Band&quot; worked well when the group came into its own.[2][N 1] The group began performing officially as The Band in 1968, and went on to release ten studio albums. Dylan continued to collaborate with The Band over the course of their career, including a joint 1974 tour.\n\nThe original configuration of The Band ended its touring career in 1976 with an elaborate live ballroom performance featuring numerous musical celebrities. This performance was immortalized in Martin Scorsese's 1978 documentary The Last Waltz. The Band recommenced touring in 1983 without guitarist Robbie Robertson, who had found success with a solo career and as a Hollywood music producer. Following a 1986 show, Richard Manuel was found dead of suicide, but the remaining three members continued to tour and record albums with a revolving door of musicians filling Manuel's and Robertson's respective roles, before finally settling on Richard Bell, Randy Ciarlante, and Jim Weider. Danko died of heart failure in 1999, after which the group broke up for good. Levon Helm was diagnosed with throat cancer in 1998, and after a series of treatments was able to regain use of his voice. He continued to perform and released several successful albums until he succumbed to the disease in 2012.\n\nThe group was inducted into the Canadian Music Hall of Fame in 1989[4] and the Rock and Roll Hall of Fame in 1994.[5] In 2004, Rolling Stone ranked them No. 50 on their list of the 100 Greatest Artists of All Time,[6] and in 2008, they received the Grammy's Lifetime Achievement Award.[7] In 2004, &quot;The Weight&quot; was ranked the 41st best song of all time in Rolling Stone's 500 Greatest Songs of All Time list. \n\n\n\n\n\n\nThe Last Waltz 1978 Reissued 2003\n\n\nThe Last Waltz is the thirteenth album by The Band, released on Warner Bros. Records in 1978, catalogue 3WS 3146. It is the soundtrack to the 1978 film of the same name, and the final album by the original configuration of The Band. It peaked at #16 on the Billboard 200.\n\nThe triple-album documents the Band's &quot;farewell&quot; concert which took place at Bill Graham's Winterland Ballroom on Thanksgiving Day 1976. The event included an actual Thanksgiving dinner for 5000 attendees, with ballroom dancing and a stage set for La Traviata borrowed from the San Francisco Opera.[3]\n\nThe concert featured songs by The Band interspersed with the group backing up a variety of musical guests. These included many with whom they had worked in the past, notably their previous employers Ronnie Hawkins and Bob Dylan. Van Morrison, a Woodstock neighbor, had co-written and sung on the track &quot;4% Pantomime&quot; for the Cahoots album. Individual members of the Band had played with the invitees on the following albums: in 1972 with Bobby Charles for his eponymous album; in 1973 with Ringo Starr on Ringo; in 1974 with Joni Mitchell on Court and Spark and with Neil Young for On the Beach; in 1975 with Muddy Waters and Paul Butterfield on The Muddy Waters Woodstock Album; in 1976 with Eric Clapton on No Reason to Cry and with Neil Diamond on Beautiful Noise.\n\nSides one through five of the album consisted of songs taken from the concert. Side six comprised &quot;The Last Waltz Suite,&quot; new numbers composed by Robertson and performed by the Band on an MGM soundstage.[4] The suite featured Emmylou Harris and, on a remake of &quot;The Weight,&quot; Roebuck and Mavis Staples. The music received overdubs at Village Recorders and Shangri-La Studios in post-production, owing to faults recorded during the concert.[5]\n\nOn April 16, 2002, a box set reissue of the album arrived in stores, including everything released on the original with additional tracks taken from the concert.\n\n\nTracks:\n\n\n\nDisc 1:\n\n\n1. Theme From the Last Waltz\n2. Up on Cripple Creek\n3. Who Do You Love\n4. Helpless\n5. Stagefright\n6. Coyote\n7. Dry Your Eyes\n8. It Makes No Difference\n9. Such a Night\n10. The Night They Drove Old Dixie Down\n11. Mystery Train\n12. Mannish Boy\n13. Further on up the Road\n\n\nDisc 2:\n\n\n1. Shape I'm In\n2. Down South in New Orleans\n3. Ophelia\n4. Tura-Lura-Lural (That's an Irish Lullaby)\n5. Caravan\n6. Life Is a Carnival\n7. Baby Let Me Follow You Down\n8. I Don't Believe You (She Acts Like We Never Have Met)\n9. Forever Young\n10. Baby Let Me Follow You Down (Reprise)\n11. I Shall Be Released\n12. The Well\n13. Evangeline\n14. Out of the Blue\n15. The Weight\n16. The Last Waltz Refrain\n17. Theme From the Last Waltz\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:5080dea8a5ed6b9980f22f62d0425a05d40b94dd","amp;dn":"The+Band+-+The+Last+Waltz+1978+%282+CD%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5080dea8a5ed6b9980f22f62d0425a05d40b94dd","infoHashBuffer":{"type":"Buffer","data":[80,128,222,168,165,237,107,153,128,242,47,98,208,66,90,5,212,11,148,221]},"announce":[],"urlList":[]}}