{"title":"Making Concrete Garden Ornaments","uid":4744033,"size":33576966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5094993302fac8364501736a01e9b9d7fbb55c7b&amp;dn=Making+Concrete+Garden+Ornaments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"philmccrevice","files":1,"time":1235721743,"description":"Decorated concrete figures have recently moved out of the realm of eccentric folk art and roadside religious &quot;grottoes&quot; into mainstream yards and gardens. Here are projects by several designers for making mosaic stepping stones, birdbaths, carved planters, and art figures. The projects are grouped by skill level and offer step-by-step instructions on how to mix concrete, make molds, and embed mosaics. The finished products are heavy, year-round installations intended to stay where they are placed. This is a good, practical book for public library craft and garden collections. \nCopyright 2001 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. \n\nProduct Description\nA celebrated teacher has gathered the tried-and-true techniques used by sculptors and folk artists, and tailored them for low-tech surroundings. Work with molds; form over armatures; model or carve with concrete; and treat concrete surfaces with mosaics, embedded objects, incising, and coloring. For dazzling outdoor embellishments, craft a Birdbath, Little Lady Fountain, and more. Twenty-five projects in all.\n","torrent":{"xt":"urn:btih:5094993302fac8364501736a01e9b9d7fbb55c7b","amp;dn":"Making+Concrete+Garden+Ornaments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5094993302fac8364501736a01e9b9d7fbb55c7b","infoHashBuffer":{"type":"Buffer","data":[80,148,153,51,2,250,200,54,69,1,115,106,1,233,185,215,251,181,92,123]},"announce":[],"urlList":[]}}