{"title":"Uranium Deposits of the World - Europe","uid":15550612,"size":119085711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50a872b84262865a227551ddba24408a68e62c84&amp;dn=Uranium+Deposits+of+the+World+-+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471020523,"description":"Uranium Deposits of the World - Europe - Franz J. Dahlkamp (Springer, 2016).pdf\r\n\r\nUranium Deposits of the World, in three volumes, comprises an unprecedented compilation of data and descriptions of the uranium regions in Asia, USA, Latin America and Europe structured by countries.\r\n\r\nWith the third, the Europe volume Uranium Deposits of the World presents the most extensive data collection of the set. It covers about 140 uranium regions in more than 20 European countries with nearly 1000 mentioned uranium deposits. Each country and region receives an analytical overview followed by the geologically- and economically-relevant synopsis of the individual regions and fields. The presentations are structured in three major sections: (a) location and magnitude of uranium regions, districts, and deposits, (b) principal features of regions and districts, and (c) detailed characteristics of selected ore fields and deposits. This includes sections on geology, alteration, mineralization, shape and dimensions of deposits, isotopes data, ore control and recognition criteria, and metallogenesis.\r\n\r\nBeside the main European uranium regions, for example in the Czech Republic, Eastern Germany, France, the Iberian Peninsula or Ukraine, also small regions an districts to the point of singular occurrences of interest are considered. This presumably by far the most comprehensive presentation of European uranium geology and mining would not be possible without the author’s access to extensive information covering the countries of the former Eastern Bloc states, which was partly not available before. Abundantly illustrated with information-laden maps and charts throughout, this reference work is an indispensable tool for geologists, mining companies, government agencies, and others with interest in European key natural resources. A great help for the reader’s orientation are the substantial bibliography of uranium-related publications and the indices, latter containing about 3900 entries in the geographical part alone","torrent":{"xt":"urn:btih:50a872b84262865a227551ddba24408a68e62c84","amp;dn":"Uranium+Deposits+of+the+World+-+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50a872b84262865a227551ddba24408a68e62c84","infoHashBuffer":{"type":"Buffer","data":[80,168,114,184,66,98,134,90,34,117,81,221,186,36,64,138,104,230,44,132]},"announce":[],"urlList":[]}}