{"title":"The Theory of Gambling and Statistical Logic, Second Edition","uid":8754798,"size":2925161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50c0d05bc88b4d30f50a3f08ce65ecf0af42ef09&amp;dn=+The+Theory+of+Gambling+and+Statistical+Logic%2C+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"full_s","files":1,"time":1375123078,"description":"\nThe Theory of Gambling and Statistical Logic, Second Edition [Hardcover]\nRichard A. Epstein (Author)\n4.2 out of 5 stars  See all reviews (5 customer reviews) \n\nBook Description\nPublication Date: November 15, 2012 | ISBN-10: 0123978572 | ISBN-13: 978-0123978578 | Edition: 2\n\nEarly in his rise to enlightenment, man invented a concept that has since been variously viewed as a vice, a crime, a business, a pleasure, a type of magic, a disease, a folly, a weakness, a form of sexual substitution, an expression of the human instinct. He invented gambling.\n\nRecent advances in the field, particularly Parrondo's paradox, have triggered a surge of interest in the statistical and mathematical theory behind gambling. This interest was acknowledge in the motion picture, &quot;21,&quot; inspired by the true story of the MIT students who mastered the art of card counting to reap millions from the Vegas casinos. Richard Epstein's classic book on gambling and its mathematical analysis covers the full range of games from penny matching to blackjack, from Tic-Tac-Toe to the stock market (including Edward Thorp's warrant-hedging analysis). He even considers whether statistical inference can shed light on the study of paranormal phenomena. Epstein is witty and insightful, a pleasure to dip into and read and rewarding to study. The book is written at a fairly sophisticated mathematical level; this is not &quot;Gambling for Dummies&quot; or &quot;How To Beat The Odds Without Really Trying.&quot; A background in upper-level undergraduate mathematics is helpful for understanding this work.\n\n    Comprehensive and exciting analysis of all major casino games and variants\n    Covers a wide range of interesting topics not covered in other books on the subject\n    Depth and breadth of its material is unique compared to other books of this nature\n\nRichard Epstein's website:  www.gamblingtheory.net\n","torrent":{"xt":"urn:btih:50c0d05bc88b4d30f50a3f08ce65ecf0af42ef09","amp;dn":"+The+Theory+of+Gambling+and+Statistical+Logic%2C+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50c0d05bc88b4d30f50a3f08ce65ecf0af42ef09","infoHashBuffer":{"type":"Buffer","data":[80,192,208,91,200,139,77,48,245,10,63,8,206,101,236,240,175,66,239,9]},"announce":[],"urlList":[]}}