{"title":"Ronettes - The Best of The Ronettes  FLAC","uid":5542712,"size":254838949,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:510b9eeddd9c23bd2232a55544aea3e934b2f2c8&amp;dn=Ronettes+-+The+Best+of+The+Ronettes++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"keeybee","files":23,"time":1273282957,"description":"Please seed!\n\nThe Ronettes were a 1960s girl group from New York City, best known for their work with producer Phil Spector. The group consisted of lead singer Veronica Bennett (a.k.a. Ronnie Spector); her sister, Estelle Bennett; and their\ncousin Nedra Talley. They reached the peak of their success after releasing Presenting the Fabulous Ronettes Featuring Veronica in 1964. Some of the group's most famous songs include &quot;Be My Baby,&quot; &quot;Baby, I Love You,&quot; &quot;(The Best Part Of) Breakin' Up&quot;, and &quot;(Walking) In the Rain. (Wiki) &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Ronettes#Compilations&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Ronettes#Compilations&lt;/a&gt;\n\nAll Music Guide Review: For a couple of years, the Ronettes made music that was as moving and unforgettable as any made during the rock era. Their voices merged sensuality, longing, anguish, and sentimentality, with Ronnie Spector's angelic leads framed by Phil Spector's sweeping production, and the lyrics of Ellie Greenwich, Jeff Barry, Barry Mann, Cynthia Weil, Spector, and others. While such songs as &quot;Walking in the Rain,&quot; &quot;Be My Baby,&quot; &quot;Baby, I Love You,&quot; and &quot;(The Best Part of) Breaking Up&quot; may seem hopelessly naive and possibly sexist in today's cynical world, they're still classic love poems. Ronnie Spector's voice retains its allure and appeal, and the 18 tracks on this CD will never become dated. ~ Ron Wynn, All Music Guide\n\n\n\nThe Ronettes - The Best Of The Ronettes\nThis compilation 1992\n\n01  The Ronettes - The Best Of The Ronettes - Be My Baby\n02  The Ronettes - The Best Of The Ronettes - Why Don't They Let Us Fall In Love\n03  The Ronettes - The Best Of The Ronettes - I Wonder\n04  The Ronettes - The Best Of The Ronettes - Baby, I Love You\n05  The Ronettes - The Best Of The Ronettes - (The Best Part Of)Breakin' Up\n06  The Ronettes - The Best Of The Ronettes - So Young\n07  The Ronettes - The Best Of The Ronettes - When I Saw You\n08  The Ronettes - The Best Of The Ronettes - Do I Love You?\n09  The Ronettes - The Best Of The Ronettes - You, Baby\n10  The Ronettes - The Best Of The Ronettes - How Does It Feel?\n11  The Ronettes - The Best Of The Ronettes - Walking In The Rain\n12  The Ronettes - The Best Of The Ronettes - Born To Be Together\n13  The Ronettes - The Best Of The Ronettes - Is This What I Get For Loving You?\n14  The Ronettes - The Best Of The Ronettes - Paradise\n15  The Ronettes - The Best Of The Ronettes - Here I Sit\n16  The Ronettes - The Best Of The Ronettes - I Wish I Never Saw The Sunshine\n17  The Ronettes - The Best Of The Ronettes - Everything Under The Sun\n18  The Ronettes - The Best Of The Ronettes - You Came, You Saw, You Conquered\n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dcfexq85ldfe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dcfexq85ldfe&lt;/a&gt;","torrent":{"xt":"urn:btih:510b9eeddd9c23bd2232a55544aea3e934b2f2c8","amp;dn":"Ronettes+-+The+Best+of+The+Ronettes++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510b9eeddd9c23bd2232a55544aea3e934b2f2c8","infoHashBuffer":{"type":"Buffer","data":[81,11,158,237,221,156,35,189,34,50,165,85,68,174,163,233,52,178,242,200]},"announce":[],"urlList":[]}}