{"title":"David Bowie - David Live [2CD] (1974) [EAC-FLAC]","uid":14829418,"size":695903208,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51a1a767343bcd3dd6e888b5d5a7ea9295c70b26&amp;dn=David+Bowie+-+David+Live+%5B2CD%5D+%281974%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"pucholoco","files":49,"time":1465331707,"description":"David Bowie - David Live [2CD] (1974)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 678 Mb\r\n                       Full Artwork @ 300 dpi (jpg) -&gt; 20 Mb \r\n\r\n\r\nWhen David Bowie recorded what became DAVID LIVE at Philadelphia's Tower Theatre in July 1974, he had fully made the leap from Ziggy Stardust and landed feet-first into the shoes of the Thin White Duke. Despite announcing his retirement from live performance the year before, Bowie seemed no worse for wear fronting a ten-piece directed by future LETHAL WEAPON composer Michael Kamen and featuring new guitarist Earl Slick and horn player David Sanborn. \r\n\r\nThis 2-CD set finds the chameleonic performer mixing in Ziggy-era classics such as &quot;Rock 'N' Roll Suicide&quot; with material from DIAMOND DOGS (&quot;Rebel Rebel,&quot; &quot;1984&quot;), ALADDIN SANE (&quot;Cracked Actor&quot;) and HUNKY DORY (&quot;Changes&quot;). The fullness of the horn section and the style of his back-up band give this set a soulful tilt powered by Slick's ballsy playing. This, along with a cover of the Stax nugget &quot;Knock On Wood,&quot; pointed at Bowie's immersion in a Philly soul direction that emerged full-fledged on YOUNG AMERICANS.\r\n\r\nDuring the supporting tour for 1974's Diamond Dogs, David Bowie shifted away from the arch camp of glam rock and turned toward a highly stylized variation of Philly soul – a transition captured on the 1974 double live album David Live. It's an interesting idea for a record, and certainly one that's fascinating as a historical footnote, but David Live winds up as one of the true failures in Bowie's catalog, one of the few records in his catalog that's a genuine chore to sit through from beginning to end. Part of the problem is inherent to any live Bowie LP: his concerts are equal parts visual spectacle and musical concert, so having just the aural portion of the show misses a crucial part of the story. \r\n\r\nAnother part of the problem is that the soul reworkings of Ziggy Stardust, Aladdin Sane, and Diamond Dogs material is intriguing conceptually, but the execution, at least on this record, is awkward and ham-fisted, nowhere near as sleek and sexy as the subsequent Young Americans and, especially, Station to Station albums. And that points out the real problem with David Live – the performances are stilted, lacking energy, and often degenerating into bland groove-oriented vamps. \r\n\r\nIt doesn't help that the recording is lousy and that no amount of aural tweaking – whether on Rykodisc's 1991 CD reissue or Virgin's expanded 2005 reissue, which is heavily remixed by its original producer Tony Visconti – can change the fact that this is a flat, colorless experience. [The 2005 edition contains the bonus tracks that were on the Ryko edition, but they're inserted into the running order of the album instead of being tacked onto the end, which is where they were on the 1991 edition.]\r\n\r\n\r\n01 1984\r\n02 Rebel Rebel\r\n03 Moonage Daydream \r\n04 Sweet Thing/Candidate/Sweet Thing (Reprise)\r\n05 Changes \r\n06 Suffragette City \r\n07 Aladdin Sane \r\n08 All the Young Dudes \r\n09 Cracked Actor \r\n10 Rock 'n' Roll with Me \r\n\r\nCD2\r\n01 Watch That Man \r\n02 Knock on Wood \r\n03 Here Today, Gone Tomorrow \r\n04 Space Oddity \r\n05 Diamond Dogs \r\n06 Panic in Detroit \r\n07 Big Brother \r\n08 Time \r\n09 The Width of a Circle \r\n11 The Jean Genie \r\n12 Rock 'n' Roll Suicide \r\n\r\n© 2005 EMI / Jones/Tintoretto | 7243 874307 2 3 {2005 EMI Remaster}\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!\r\n\r\n\r\n\r\nDavid Bowie - Blackstar (2016) [EAC-FLAC]:\r\n \nhttps://thepiratebay.org/torrent/13756400/David_Bowie_-_Blackstar_%282016%29_[EAC-FLAC]","torrent":{"xt":"urn:btih:51a1a767343bcd3dd6e888b5d5a7ea9295c70b26","amp;dn":"David+Bowie+-+David+Live+%5B2CD%5D+%281974%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a1a767343bcd3dd6e888b5d5a7ea9295c70b26","infoHashBuffer":{"type":"Buffer","data":[81,161,167,103,52,59,205,61,214,232,136,181,213,167,234,146,149,199,11,38]},"announce":[],"urlList":[]}}