{"title":"Snatch - Lo Strappo [XviD Ita Ac3/Eng Mp3][Nautilus-bt]","uid":6426920,"size":1171512439,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:51b03e872aa7225fd17f439cf57027b98cfb34aa&amp;dn=Snatch+-+Lo+Strappo+%5BXviD+Ita+Ac3%2FEng+Mp3%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"someuser11","files":4,"time":1306506423,"description":"[b][SIZE=16pt][color=blue] Snatch - Lo strappo [/color][/SIZE][/b]\n\n[b][color=green]~~Locandina del film~~[/color][/b]\n\n[IMG]http://filmup.leonardo.it/posters/loc/500/snatch.jpg[/IMG]\n\n[b][color=green]~~Scheda del film~~[/color][/b]\n\nTitolo originale \tSnatch\nPaese \tGran Bretagna, USA\nAnno \t2000\nDurata \t104 min\nColore \tcolore\nAudio \tsonoro\nGenere \tcommedia\nRegia \tGuy Ritchie\nSoggetto \tGuy Ritchie\nSceneggiatura \tGuy Ritchie\nProduttore \tMatthew Vaughn\nCasa di produzione \tColumbia Pictures, SKA Films\nMontaggio \tJon Harris\nMusiche \tJohn Murphy\nInterpreti e personaggi\n\n    Jason Statham: Turco\n    Stephen Graham: Tommy\n    Alan Ford:'Testarossa' Polford\n    Brad Pitt: Mickey O'Neil\n    Dennis Farina: Abraham 'Cugino Avi' Denovitz\n    Rade Serbedzija: Boris 'Lametta' Yurinov\n    Robbie Gee: Vincent\n    Lennie James: Sol\n    Vinnie Jones: 'Pallottola al dente' Tony\n    Benicio Del Toro: Franky 'Quattro dita'\n    Mike Reid: Doug 'La zucca' Denovitz\n    Jason Flemyng: Darren\n    Andy Beckwith: Errol\n    William Beck: Neil\n    Ewen Bremner: Mullet\n\nPremi\n\n    Empire Award 2001:\n        Miglior attore britannico (Vinnie Jones)\n        Miglior regista britannico\n    Golden Reel Award 2001:\n        Miglior sonoro\n\n\n\n\n\n[b][color=green]~~Trama~~[/color][/b]\n\n[spoiler=Trama]\nIl film si apre con Turco e Tommy che parlano a un uomo nell'ombra di una certa trattativa. Nel frattempo Turco, il narratore del film, racconta cosa gli ÃƒÂ¨ capitato nell'ultima settimana fino a quel punto. La scena si sposta a una settimana prima, mentre un gruppo di rabbini entra in una banca di Anversa. Ben presto questi si rivelano essere rapinatori e riescono a prendere un grosso diamante. Da qui viene mostrata la carrellata di personaggi (cugino Avi, Sol, Mickey, Vinny, Frankie 4 dita, Turco, Tommy, George, Tony, Boris, Doug e Testarossa) protagonisti del film. A questo punto Frankie, uno dei ladri, va a Londra per vendere le pietre piÃƒÂ¹ piccole e incontra Boris Lametta, detto anche &quot;Boris schivapallottole&quot;, un ex agente del kgb definito da molti dei personaggi addirittura &quot;immortale&quot;, per trattare l'acquisto di una pistola, visto che uno dei suoi complici gli ha intimato di ridargliela, ma Boris gli tiene una trappola attirandolo in una scommessa di un incontro di boxe clandestino, in quanto maniaco del gioco, per derubarlo del diamante. Contemporaneamente Turco e il suo socio Tommy, piccoli impresari della boxe clandestina, che vivono in una squallida roulotte, cercano di concludere un affare con gli zingari-irlandesi capeggiati da Mickey, un grande pugile di strada ma di cui non si capisce una parola, che dopo aver imbrogliato Tommy, dandogli una roulotte rotta, spacca la mascella a George Meraviglia, il pugile dei due imbroglioni. Siccome questi doveva partecipare a un incontro di box clandestino per conto del boss &quot;Testarossa&quot; Polford (Brick top, in inglese), un uomo sadico e crudele che possiede un allevamento di maiali coi quali fa sparire i cadaveri, ora Turco si trova in debito con lui. Non avendo piÃƒÂ¹ pugili a disposizione Turco ha in mente di utilizzare proprio Mickey per l'incontro. Come si poteva intuire lo zingaro stende con un solo pugno il suo avversario, ma l'incontro era truccato: doveva vincere il pugile avversario al quarto round. Vinny e Sol, proprietari di un banco di pegni, vengono ingaggiati da Boris per derubare Frankie 4 dita in cambio dei soldi che prenderanno dalla sala scommesse dove quest'ultimo avrebbe dovuto trovarsi. A causa dei loro modi goffi rimangono imprigionati all'interno della struttura, dopo che i sistemi d'allarme hanno fatto il loro dovere, vengono casualmente salvati da Tyrone, il loro autista. Poi i 3 scoprono che Frankie, per tutto il tempo, si trovava svenuto in un camion lÃƒÂ¬ vicino che Tyrone, con la sua guida sbandata, aveva colpito rinchiudendovi il ladro. Lo prendono per poi legarlo e imbavagliarlo, se cosÃƒÂ¬ si puÃƒÂ² dire, con un copri teiera. Mentre aspettano che arrivi Boris per consegnarglielo, scoprono che c'ÃƒÂ¨ in ballo un diamante, per questo il russo li minaccia per lasciarlo andare e uccide Frankie, tagliandogli anche il braccio perchÃƒÂ© la valigetta era legata al ladro con una manetta, e se ne va con la valigetta al cui interno si trova la pietra. &quot;Testarossa&quot; scopre che gli hanno rapinato la sala e ordina ai suoi scagnozzi di scoprire chi ÃƒÂ¨ stato. Avendo riconoscuto Tyrone in uno dei filmati della sicurezza, i gangster partono alla sua ricerca. Una volta beccato, minacciandolo di torturarlo, ucciderlo e darlo in pasto ai cani, confessa i nomi di Vinny e Sol. Intanto Turco e Tommy sono sempre piÃƒÂ¹ nei guai, in quanto Mickey non rispetta le regole e manda al tappeto tutti i pugili del boss che, stufo della situazione, fa distruggere il locale di videogiochi di Turco e quando anche Mikey si dimostra recidivo oltre ogni sopportazione fa incendiare la roulotte della madre dello zingaro, uccidendola, la sera prima dell'incontro decisivo. Intanto Doug &quot;la zucca&quot; (il quale si finge ebreo per rinvigorire gli affari), che avrebbe dovuto concludere l'affare con Frankie, contatta Avi, suo cugino che vive a New York. Per cercare il ladro, Avi arriva a Londra, convinto che Frankie si trovi in qualche &quot;casino&quot;. Entra in gioco il sicario &quot;pallottola al dente&quot; Tony, contattato da Doug per aiutare Avi a trovare Frankie o il diamante. &quot;Testarossa&quot;, nel frattempo, raggiunge Vinny e Sol, grazie alla soffiata di Tyrone, mentre questi si stanno occupando del cadavere di Frankie. Messi alle strette i due raccontano, cosa non vera, di avere un grosso diamante recuperabile in quattro giorni. &quot;Testarossa&quot; li risparmia ma concede loro solo due giorni. La ricerca di Avi e Tony va a monte, in quanto Vinny e Sol non sono nel loro negozio, i due dunque tornano da Doug per riorganizzarsi. Intanto Boris, all'oscuro di tutto, arriva proprio nella gioielleria di Doug per rivendere la pietra preziosa. Ovviamente Avi e Tony si occupano di Boris, insieme a uno scagnozzo di Doug, picchiandolo fino a quando il russo dice che il diamante si trova a casa sua, per poi ficcarlo nel portabagaglio e dirigersi verso la destinazione in macchina. Mentre Tommy e Turco vanno a casa del russo, in quanto questi gli ha venduto una pistola mal funzionate, Avi e Tony riescono a recuperare il diamante, cercando di portare Boris in un posto isolato per farlo fuori, ma Tommy, nella corsia opposta per andare a casa del russo, lancia dal finestrino una bottiglia di latte che si schianta contro il parabrezza dell'auto di Tony e Avi, facendogli fare un incidente sbattendo contro un muro, mentre Boris riesce a scappare. Anche Vinny e Sol vanno verso la casa di Boris ma lo investono dopo che Sol spara un colpo di pistola nello stesso veicolo. Dopo l'incredibile incidente Boris torna a casa, distante pochi metri, dove strizza le palle a Tommy per farlo stare zitto e prende un fucile con l'intenzione di recuperare la pietra e uccidere tutti. Vinny e Sol si riprendono dall'incidente e seguono Avi e Tony fino a un bar dove si sono fermati per ripulirsi. Qui scoppia un putiferio: Boris viene ucciso, Vinny e Sol prendono il diamante, Tyrone ÃƒÂ¨ ferito ma vivo mentre Avi e Tony partono alla loro ricerca. Ben presto li rintracciano portando Vinny e Sol nel loro locale. Avi e Tony credono che il cane abbia ingoiato il diamante ma, prima che possano uccidere l'animale, Sol recupera la pietra. Purtroppo il cane ingoia il prezioso e Avi, nella disperazione, spara dei colpi nel tentativo di uccidere il cane che scappa velocemente. Avi ha involontariamente ucciso Tony e, per la paura dell'arresto e di ulteriori conseguenze, torna subito a New York. Intanto si svolge l'incontro di boxe decisivo in cui Polford pensa di rifarsi delle scommesse vinte. Mickey perÃƒÂ², vince l'incontro, mentre i suoi amici zingari, vendicando cosÃƒÂ¬ la morte della madre, uccidono &quot;Testarossa&quot; (con una fucilata in faccia) e i suoi scagnozzi, appostati al campo nomadi con l'intento di ucciderli. Mickey, che non aveva mai perso perchÃƒÂ© si era creato un suo giro di scommesse, scappa coi soldi delle scommesse mentre Tommy e Turco rimangono di stucco. Il giorno seguente Vinny e Sol, mentre vanno al campo nomadi per recuperare il cane, poichÃƒÂ© ÃƒÂ¨ lÃƒÂ¬ che l'hanno comprato, vengono arrestati perchÃƒÂ© i poliziotti trovano nel portabaglio della loro auto, i cadaveri di Tony e Frankie. Intanto Turco e Tommy si trovano al campo nomadi per chiedere a Mickey di lavorare per loro ma scoprono che gli zingari se la sono filata e non ÃƒÂ¨ rimasta traccia del loro passaggio. I poliziotti compaiono all'improvviso e gli domandano cosa ci facciano lÃƒÂ¬, visto che indagano su una ventina di cadaveri (tutti scagnozzi di Polford). Improvvisamente compare il cane che aveva inghiottito il diamante e i due approfittano della situazione, dicendo di portare l'animale a fare una passeggiata, cosÃƒÂ¬ lo portano con loro. Dopo essersi affezionato al cane Tommy lo porta dal veterinario scoprendo che ha inghiottito tantissime cose, tra cui il diamante. La scena torna nel presente. I due sperano di ricavare parecchi soldi dandolo a &quot;uno che gli possa interessare&quot;. Si scopre che l'uomo nell'ombra dell'inizio ÃƒÂ¨ Doug il quale, contento, chiama Avi che ÃƒÂ¨ costretto a tornare a Londra.\n\nIl finale ÃƒÂ¨ piuttosto aperto e non si puÃƒÂ² dedurre una vera conclusione.\n[/spoiler]\n\n[b][color=green]~~Trailer~~[/color][/b]\t\n[youtube]Q8jbt0wBkMI[/youtube]\n\n[b][color=green]~~Screenshot~~[/color][/b]\n\n[IMG]http://i307.photobucket.com/albums/nn306/tntcj/5BDvd-Rip5D.png[/IMG]\n\n[IMG]http://i307.photobucket.com/albums/nn306/tntcj/5BDvd-Rip5D-2.png[/IMG]\n\n[IMG]http://i307.photobucket.com/albums/nn306/tntcj/5BDvd-Rip5D-1.png[/IMG]\n\n[b][color=green]~~Scheda tecnica del DivX~~[/color][/b]\n\nSottotitoli inglesi per non udenti\n\nAVI File Details\n ========================================\n[ Info sul file ]\n\nNome: [Dvd-Rip].-.Snatch.Lo.Strappo.-.Ac3.Ita.Mp3.Eng.-.g85.avi\nData: 27/04/2010 07:03:13\nDimensione: 1,171,195,904 bytes (1116.939 MB)\n\n[ Info generiche ]\n\nDurata: 01:38:34 (5914.36 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 3\nTipo stream n. 0: video\nTipo stream n. 1: audio\nTipo stream n. 2: audio\nAudio streams: 2\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: 624 x 336\nLarghezza: multipla di 16\nAltezza: multipla di 16\nDRF medio: 3.014845\nDeviazione standard: 0.687529\nMedia pesata dev. std.: 0.485037\n\n[spoiler]\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 624 x 336\nFrame aspect ratio: 13:7 = 1.857142 (~1.85:1)\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 13:7 = 1.857142 (~1.85:1)\nFramerate: 25 fps\nFrames totali: 147859\nStream size: 750,949,853 bytes\nBitrate: 1015.764820 kbps\nQf: 0.193789\nKey frames: 1677 (0; 250; 500; 750; 1000; ... 147713)\nNull frames: 0\nMin key int: 1\nMax key int: 250\nKey int medio: 88.168753\nRitardo: 0 ms\n\n[ Traccia audio n. 1 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate (contenitore): 448 kbps CBR\nCanali (contenitore): 6\nFrequenza (contenitore): 48000 Hz\nChunks: 36965\nStream size: 331,202,816 bytes\nPreload: 160 ms\nMax A/V diff: 280 ms\nAC-3 frames: 184823\nDurata: 01:38:34 (5914.336 s)\nChunk-aligned: SÃƒÂ¬\nMode: 3 front, 2 rear, 1 LFE\nRitardo: 0 ms\n\n[ Traccia audio n. 2 ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 106.672 kbps VBR\nCanali (contenitore): 2\nFrequenza (contenitore): 44100 Hz\nChunks: 226409\nStream size: 78,863,255 bytes\nPreload: 522 ms\nMax A/V diff: 1028 ms\nTipo: MPEG-1 Layer III\nEncoder: LAME3.98 (Made with BeSweet v1.5b31)\nMPEG frames: 226409\nDurata: 01:38:34 (5914.357551 s)\nBitrate (bitstream): 106.673638 kbps VBR\nChunk-aligned: SÃƒÂ¬\nEmphasis: none\nMode: joint stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: XviD0050\nPacked bitstream: No\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: MPEG\nFrames totali: 147859\nDrop/delay frames: 0\nFrames corrotti: 0\n\nI-VOPs:  1677 (  1.134 %)                          \nP-VOPs: 55192 ( 37.327 %) #########                \nB-VOPs: 90990 ( 61.538 %) ###############          \nS-VOPs:     0 (  0.000 %)                          \nN-VOPs:     0 (  0.000 %)                          \n\nMax consecutive B-VOPs: 2\n    1 consec: 15378 ( 28.915 %) #######                  \n    2 consec: 37806 ( 71.085 %) ##################       \n\n[ Analisi DRF ]\n\nDRF medio: 3.014845\nDeviazione standard: 0.687529\nDRF max: 4\n\nDRF&lt;2:     0 (  0.000 %)                          \nDRF=2: 33865 ( 22.904 %) ######                   \nDRF=3: 77934 ( 52.708 %) #############            \nDRF=4: 36060 ( 24.388 %) ######                   \nDRF&gt;4:     0 (  0.000 %)                          \n\nI-VOPs DRF medio: 2\nI-VOPs deviazione std.: 0\nI-VOPs DRF max: 2\n\nP-VOPs DRF medio: 2.416799\nP-VOPs deviazione std.: 0.493029\nP-VOPs DRF max: 3\n\nB-VOPs DRF medio: 3.396307\nB-VOPs deviazione std.: 0.489129\nB-VOPs DRF max: 4\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\nMin buffer fill: 81%\n\n[/spoiler]\n\n\n[b][color=green]~~Note~~[/color][/b]\nNon sono l'autore del rip e non mi voglio prendere nessun merito al riguardo.\nBanda max 35 kbytes 24/24 7/7 :D\n\nVisita il nostro sito www.nautilus-bt.org ( Visit our site www.nautilus-bt.org )","torrent":{"xt":"urn:btih:51b03e872aa7225fd17f439cf57027b98cfb34aa","amp;dn":"Snatch+-+Lo+Strappo+%5BXviD+Ita+Ac3%2FEng+Mp3%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b03e872aa7225fd17f439cf57027b98cfb34aa","infoHashBuffer":{"type":"Buffer","data":[81,176,62,135,42,167,34,95,209,127,67,156,245,112,39,185,140,251,52,170]},"announce":[],"urlList":[]}}