{"title":"Mahabharata [English]","uid":6924398,"size":803885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51f0c968a433767b2c40e22b3e6a44fda422b7fa&amp;dn=Mahabharata+%5BEnglish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"594mgnav","files":-1,"time":1325416912,"description":"MahaBharata - Retold By C.Rajagopalachari [English][Team Nanban][TPB]\n\n\nAbout Veda Vyasa:\n\n\nVyasa is a central and revered figure in most Hindu traditions. \n\nHe is also sometimes called Veda Vyasa , \n(the one who classified the Vedas in to four parts) \nor Krishna Dvaipayana (referring to his complexion and birthplace). \n\nHe is the author as well as a character in the Mahabharata and \nconsidered to be the scribe of both the Vedas, and the supplementary texts such as \nthe Puranas. \n\nA number of Vaishnava traditions regard him as an Avatar of Vishnu.\n\nVyasa is sometimes conflated by some Vaishnavas with Badarayana, \nthe author of the Vedanta Sutras. Vyasa is also considered to be one of the \nseven Chiranjivins (long lived, or immortals), who are still in existence according to \ngeneral Hindu belief.\n\n\nThe festival of Guru Purnima, is dedicated to him, and also known as Vyasa Purnima \nas it is the day, which is believed to be his birthday and also the day he divided \nthe Vedas.\n\n\n\n\nSHORT DESCRIPTION ON MahaBharata:\n\n\n\nThe Mahabharata is one of the two major Sanskrit epics of ancient India, \nthe other being the Ramayana. \n\nThe epic is part of itihasa.\n\nBesides its epic narrative of the Kurukshetra War and the fates of the Kauravas and \nthe Pandavas, the Mahabharata contains much philosophical and devotional material, \nsuch as a discussion of the four &quot;goals of life&quot; or purusharthas (12.161). \n\nThe latter are enumerated as dharma (right action), artha (purpose), kama (pleasure), \nand moksha (liberation). \n\nAmong the principal works and stories that are a part of the Mahabharata \nare the Bhagavad Gita, the story of Damayanti, an abbreviated version of the Ramayana, \nand the Rishyasringa, often considered as works in their own right.\n\nTraditionally, the authorship of the Mahabharata is attributed to Vyasa. \n\nThere have been many attempts to unravel its historical growth and compositional layers. \n\nThe oldest preserved parts of the text are not thought to be appreciably older than \naround 400 BCE, though the origins of the story probably fall between the 8th and \n9th centuries BCE.\n\nThe text probably reached its final form by the early Gupta period (ca. fourth century CE).\n\nThe title may be translated as &quot;the great tale of the Bharata dynasty&quot;. \n\nAccording to the Mahabharata itself, the tale is extended from a shorter version of \n24,000 verses called simply Bharata.\n\nThe mahabharata in its longest version consists of over 100000 shloka or \nover 200000 individual verse lines (each shloka is a couplet ), long prose passages, \nor about 1.8 million words in total, the Mahabharata is roughly ten times the length of \nthe Iliad and Odyssey combined, or about four times the length of the Ramayana.\n\nW. J. Johnson has compared the importance of the Mahabharata to world civilization to \nthat of the Bible, the works of Shakespeare, the works of Homer, Greek drama, \nand the Quran.\n\nDESCIPTIONS ON ALL THE PARVAS HAS BEEN GIVEN IN THE RAR FILE..CHECK IT OUT..\n\n\n\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..DONT HIT AND RUN..\n\nATLEAST SEED THIS TINY LITTLE TORRENT....\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF MAHABHARATA THROUGHOUT THE WORLD..\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..\n\n\nPLZ SEED AS MUCH AS POSSIBLE..I AM LACKING SEEDS...\n\n\nAND A VERY HAPPY NEW YEAR TO ALL.!!!","torrent":{"xt":"urn:btih:51f0c968a433767b2c40e22b3e6a44fda422b7fa","amp;dn":"Mahabharata+%5BEnglish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f0c968a433767b2c40e22b3e6a44fda422b7fa","infoHashBuffer":{"type":"Buffer","data":[81,240,201,104,164,51,118,123,44,64,226,43,62,106,68,253,164,34,183,250]},"announce":[],"urlList":[]}}