{"title":"Mythic Journeys (2009)","uid":6888994,"size":858330516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:522d633a0390fab06173b55d26ebd0e95eb11d71&amp;dn=Mythic+Journeys+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"satoriforsale","files":-1,"time":1323934173,"description":"Mythic Journeys is an inventive fusion of documentary, story, artwork and animation. Despite the fact that myth has always existed, surprisingly few people today are aware of even the classic myths or the potential myths have to impact their lives. Myths are the reservoir of human wisdom - the story and the meaning of life. Every human being has asked the questions who am I, what is my purpose, why am I here? The answers are in the myths that have been passed on from generation to generation. Mythology is a tool that can bridge cultures, communities and generations. Through this film we hope to inspire people to activism and show that by helping others we ultimately help ourselves. There is a saying, \\&quot;Love without action is meaningless, but action without love is irrelevant.\\&quot; It\\'s time to act, it\\'s time to evolve. We are the ancestors of the future. Thousands of years from now we are going to be those handprints on the cave walls...\n\n(source IMDb)\n\n\nDespite the fact that myth has always existed, surprisingly few people today are aware of even the classic myths or the potential myths have to impact their lives. Myths are the reservoir of human wisdom - the story and the meaning of life. Every human being has asked the questions who am I, what is my purpose, why am I here? The answers are in the myths that have been passed on from generation to generation. MYTHIC JOURNEYS is an inventive fusion of documentary, story, artwork and animation that shows how mythology can bridge cultures, communities and generations.\n\n(source worldoffroud.com, Brian and Wendy Froud created and performed the puppets for this documentary)","torrent":{"xt":"urn:btih:522d633a0390fab06173b55d26ebd0e95eb11d71","amp;dn":"Mythic+Journeys+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522d633a0390fab06173b55d26ebd0e95eb11d71","infoHashBuffer":{"type":"Buffer","data":[82,45,99,58,3,144,250,176,97,115,181,93,38,235,208,233,94,177,29,113]},"announce":[],"urlList":[]}}