{"title":"Banner Designer Pro 5.1.0.0 Portable","uid":6444863,"size":104529920,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5240451af6e1b5b1aaf67bd1a183cf11674eaf68&amp;dn=Banner+Designer+Pro+5.1.0.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307101624,"description":"Banner Designer Pro 5.1.0.0 Portable\n\nBanner Designer Pro is a deceptively simple banner design tool with extremely powerful features. The best part about Banner Designer Pro is that it does not require you to possess intensive Flash skills. With the simple select and drop functionality you can add different elements to your banner and create attractive banners with complete ease.\n\nProfessionally designed banner templates\nBanner Designer Pro provides a professionally designed set of attractive templates as a starting step to your banner.\n\nSelect a banner size to suit your requirement\nYou can select from a set of 11 banner size options available or design a banner of the specific size you require.\n\nAdd shapes to your banner\nSelect from a database of shapes and place them according to individual design preference on the banner.\n\nAdd images to the banner and edit them\nSimply browse through your system and add images of your choice anywhere on the banner. Further you can edit the image to scale its size, rotate and adjust its brightness and contrast.\n\nAdd Text to your banner design\nUsing the Text Tool, add text to your banner. The banner software provides you an array of font options and sizes to pick from. Also add color to your text to make it stand out.\n\nArrange element order -move objects to front or to back\nUsing the Arrange (front to back or back to front) tool, arrange the objects in your banner as per your requirement.\n\nColor &amp; Gradient Features for your banner\nBanner Designer Pro provides you excellent color and gradient features. Add background color, specify color for the shapes and the text in your banner. You can add solid color and gradient color as well.\n\nMake banners with animated Text &amp; Image Entry Effect\nThe software has preset animated entry and transition effects. Select the type of animated entry effect you want for the text and images on the banner.\n\nTime setting for effects\nSet the time for different effects happening on the banner. A range of animated effects have been provided including text entry effect, text exit effect, image entry effect or image exit effect.\n\nPre-defined Preloaders for loading banners\nBanner Designer Pro provides you a pre defined set of Preloaders so that the banner can be displayed within minimum time.\n\nCompletely optimized banner file size\nThe final banner design is optimized by Banner Designer Pro to make the file light and easy to upload.\n\nPublish banner in SWF or HTML\nThe Banner Designer Pro allows you to publish your banner as SWF or HTML so you can easily upload it online.\n\nHome page - http://www.bannerdesignerpro.com/\n\n\n","torrent":{"xt":"urn:btih:5240451af6e1b5b1aaf67bd1a183cf11674eaf68","amp;dn":"Banner+Designer+Pro+5.1.0.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5240451af6e1b5b1aaf67bd1a183cf11674eaf68","infoHashBuffer":{"type":"Buffer","data":[82,64,69,26,246,225,181,177,170,246,123,209,161,131,207,17,103,78,175,104]},"announce":[],"urlList":[]}}