{"title":"Fiber Optics - Physics and Technology 2010 (Malestrom)","uid":5286154,"size":15316070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:526091a480580ecca70218460ec3497f8dd46873&amp;dn=Fiber+Optics+-+Physics+and+Technology+2010+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"malestrom_HH","files":2,"time":1263689689,"description":" &lt;a href=&quot;http://bayimg.com/eAjodAaCL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eAjodAaCL&lt;/a&gt;\n\nFedor Mitschke, &quot;Fiber Optics: Physics and Technology&quot;\nSpringer | 2010 | ISBN: 364203702X | 324 pages | PDF \n\nTelephone, telefax, email and internet - the key ingredient of the inner workings is the conduit: the line which is designed to carry massive amounts of data at breakneck speed. In their data-carrying capacity optical fiber lines beat other technologies (copper cable, microwave beacons, satellite links) hands down, at least in the long haul.\n\nThis book is a comprehensive source about optical fibers: Their structure, their light-guiding mechanism, their material and manufacture, their use. Several effects tend to degrade the signal as it travels down the fiber: they are spelled out in detail. Nonlinear processes are given due consideration for a twofold reason: On one hand they are fundamentally different from the more familiar processes in electrical cable. On the other hand, they form the basis of particularly interesting and innovative applications, provided they are understood well enough. A case in point is the use of so-called solitons, i.e. special pulses of light which have the wonderful property of being able to heal after perturbation.\n\nThe book starts with the physical basics of ray and beam optics, explains fiber structure and the functions of optical elements, and continues to the forefront of applications. The state of the art of high speed data transmission will be described, and the use of fiber optic sensors in metrology is treated.\n\nThe book is written in a pedagogical style so that students of both physics and electrical engineering, as well as technicians and engineers involved in optical technologies, will benefit.","torrent":{"xt":"urn:btih:526091a480580ecca70218460ec3497f8dd46873","amp;dn":"Fiber+Optics+-+Physics+and+Technology+2010+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"526091a480580ecca70218460ec3497f8dd46873","infoHashBuffer":{"type":"Buffer","data":[82,96,145,164,128,88,14,204,167,2,24,70,14,195,73,127,141,212,104,115]},"announce":[],"urlList":[]}}