{"title":"PrettyDirty - Elsa Jean, Alexis Fawx (Boyfriend Bait) NEW 19 Aug","uid":15600043,"size":609901773,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:526da64c1cc07dd66d353f1265bb8999a2c876c4&amp;dn=PrettyDirty+-+Elsa+Jean%2C+Alexis+Fawx+%28Boyfriend+Bait%29+NEW+19+Aug&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1471623333,"description":"When stepmom Alexis Fawx catches Elsa Jean ditching school and messing around with her boyfriend Jessy Jones, she doesn't realize she's being made the object of a wicked lesbian sex game. Elsa's plotting to fuck her hot stepmom's pussy, and she wants to use Jessy's cock as the bait. Elsa gets Jessy to pretend he's a virgin and ask for help finding someone to practice fucking. Ms. Fawx is surprisingly easy to talk to about possible options. She advises against fucking prostitutes or fucking friends, and she's genuinely concerned that he finds the right help. When Jessy suggests maybe she could teach him about fucking, he kisses her, and she takes the bait. Suddenly, his cock is in her mouth. She's blowing him, then fucking him and taking it deep in her pussy. She can hardly believe he's a virgin the way he dominates her pussy. Alexis is in the middle of deepthroating Jessy's cock when Elsa walks in on them with the camera rolling. She encourages her hot and bothered stepmom to keep going, sucking on her big tits while Jessy pounds the MILF's pussy. Then Elsa licks her stepmom's clit, as Jessy's cock fucks Elsa's tight pussy from behind, while he watches the steamy lesbian action from the rise of her ass. The girls cum for each other in so many configurations, double teaming Jessy's probing big cock with their hot lips and wet pussy slits, till his huge load of cum explodes into their awaiting mouths.\r\nCategories Blonde, Big Tits, Threesome, MILF &amp; Mature, Tattoos, Pussy Licking, Stepmom, Family Roleplay, Blowjob, Deepthroat, Cumshot, Cum swallow, Open Mouth Facial, Big Dick, Creampie\r\n \nhttp://imgdone.com/viewer.php?file=03558501344544285135.jpg\r\n \nhttp://imgdone.com/viewer.php?file=65858524762825157019.jpg","torrent":{"xt":"urn:btih:526da64c1cc07dd66d353f1265bb8999a2c876c4","amp;dn":"PrettyDirty+-+Elsa+Jean%2C+Alexis+Fawx+%28Boyfriend+Bait%29+NEW+19+Aug","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"526da64c1cc07dd66d353f1265bb8999a2c876c4","infoHashBuffer":{"type":"Buffer","data":[82,109,166,76,28,192,125,214,109,53,63,18,101,187,137,153,162,200,118,196]},"announce":[],"urlList":[]}}