{"title":"Dead.Rising.2.Off.the.Record-SKIDROW","uid":6732460,"size":6525945744,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5298f0f68b8143e592195970c66ae6441bb3a37d&amp;dn=Dead.Rising.2.Off.the.Record-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ArkLum","files":-1,"time":1318207593,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nDead Rising 2: Off The Record (c) Capcom\n\n10-10-2011........Release Date &lt;-&gt; Protection................G4WL\nAction...............Game Type &lt;-&gt; Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nDead Rising 2: Off the Record sees Frank West - photojournalist and\noriginal hero of the Dead Rising Willamette incident - take center\nstage as players experience a reimagining of the Fortune City outbreak.\nForget what you know about Dead Rising 2, &quot;Frank West is back in the\ngame!&quot;\n\nThe new &quot;Off the Record&quot; storyline means an all new Dead Rising 2\nexperience. Frank will face off against more twisted enemies, build\nmore outrageous combo weapons, follow his own unique mission structure\nand explore brand new areas of Fortune City to get his biggest scoop\nyet. Join Frank as he indulges in the insanity of &quot;Uranus Zone&quot;,\nFortune City's very own theme park. Full of deadly rides and crazy\nattractions, the sci-fi themed Uranus Zone is a true zombie-killing\nparadise.\n\nFrank's come-back means the return of his trusty camera, with players\nable to earn Prestige Points (PP) for specific photo opportunities that\nare graded against criteria such as horror, drama, erotica and\nbrutality.\n\nIn addition to the new scenario and gameplay enhancements, Dead Rising\n2: Off the Record offers a suite of technical updates including load\ntime optimizations, improved network performance and a host of system\nupgrades to deliver a more satisfying Dead Rising experience.\n\nFeatures\n\nFrank West is back - The original Dead Rising hero returns to get the\nscoop on the Fortune City outbreak\n\nFortune City but not as you know it Experience a re-interpretation of\nthe Fortune City outbreak through the eyes and camera of\nphotojournalist Frank West:\n\nNew story and missions unique to Frank West\n\nNew environments including Fortune City's latest attraction, &quot;Uranus\nZone&quot;\n\nNew enemies and more psychotic Psychos\n\nNew crazy and hilarious combo-weapons\n\nNew items and vehicles\n\nSay &quot;Cheese!&quot; - Capture those classic, violent, scary and hilarious\nDead Rising moments, earn Prestige Points and complete all new missions\nwith Frank's new and improved camera feature.\n\nUpgraded Experience - Full of technical improvements, system\nenhancements and feature upgrades to create a faster, smoother, more\nsatisfying Dead Rising.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install using serial: xxxxx-xxxxx-xxxxx-xxxxx-xxxxx\n4. Copy everything from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:5298f0f68b8143e592195970c66ae6441bb3a37d","amp;dn":"Dead.Rising.2.Off.the.Record-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5298f0f68b8143e592195970c66ae6441bb3a37d","infoHashBuffer":{"type":"Buffer","data":[82,152,240,246,139,129,67,229,146,25,89,112,198,106,230,68,27,179,163,125]},"announce":[],"urlList":[]}}