{"title":"Windows 8.1 NON-PRO OEM 64 Bit For System Builders - Judas","uid":9135907,"size":3900069964,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52aafc9d014e491b1c46b727816ed43cf7b8e0cf&amp;dn=Windows+8.1+NON-PRO+OEM+64+Bit+For+System+Builders+-+Judas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dhjudasx","files":-1,"time":1383413380,"description":"A direct DVD Image ISO of the System Builders Microsoft Windows 8.1 64 Bit OEM.\n\nNothing modded, Nothing hacked, NO ACTIVATOR, no cd key, nothing but a genuine copy of the original Windows 8.1 DVD.\n\nThis is purchased as a Non-Pro edition, HOWEVER, it should automatically install the Pro Edition if you have a valid key.\n\nI am providing this specifically for those that already have a genuine NON PRO copy of windows 8.1, be it a key directly installed in the machine such as a dell, acer, asus, hp, gateway, toshiba, sony, compaq, emachine, etc. or if they have a valid windows 8.1 CD Key.\n\nMost if not all of the WINDOWS ISO uploads i see are usually all the pro version and majority of them appear to be hacked/modded or even activated already.\n\nThis is STRICTLY intended for Genuine Legitimate Windows 8.1 owners/users.\n\nIf you do not have a pre-installed key, this ISO will request a CD-KEY to continue installation.\n\nDO NOT REQUEST A CD KEY FROM ME, i will not provide you with one.\n\nAdditionally if you happen to have a 32bit version of Windows 8.1 on a 64bit compatible system, the key is transferable making the installation of 64bit Windows 8.1 easy without issue.\n\nISO will burn to DVD via windows 7 or windows 8/8.1 Burn Image option built into windows itself. Alternatively various burning programs that read ISO should burn it without issue.\n\nTo you 1080p folk, don't worry, just throwing this up for the few people I know have been waiting for it.\n\n\n\n\nJudas's NOTE:\n\nThis is NOT and will not work with the &quot;single Language&quot; editions of windows 8.1\n\nAdditionally, If you have a windows 8.0 cd key that you have to manually input (because the device you are using doesn't have one pre-installed on the machine itself), micrsoft in all their wisdom decided to prevent the ability to use 8.0 keys, you'll NEED a valid 8.1 key to proceed with the installation, you can then however once windows 8.1 is installed, replace a temporary 8.1 key with a 8.0 key using the &quot;change key&quot; function in the properties of &quot;this computer&quot;.\n\n\nIf you want a copy of the original Genuine system builders windows 8.0 OEM 64 bit, you can get it here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8522760/Windows_8_NON-PRO_OEM_64_Bit_For_System_Builders_-_Judas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8522760/Windows_8_NON-PRO_OEM_64_Bit_For_System_Builders_-_Judas&lt;/a&gt;","torrent":{"xt":"urn:btih:52aafc9d014e491b1c46b727816ed43cf7b8e0cf","amp;dn":"Windows+8.1+NON-PRO+OEM+64+Bit+For+System+Builders+-+Judas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52aafc9d014e491b1c46b727816ed43cf7b8e0cf","infoHashBuffer":{"type":"Buffer","data":[82,170,252,157,1,78,73,27,28,70,183,39,129,110,212,60,247,184,224,207]},"announce":[],"urlList":[]}}