{"title":"I Compagni (1963)","uid":4778814,"size":978071678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52f230d1eebceb9cb37e929b3ce87e53ceb5902f&amp;dn=I+Compagni+%281963%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Willams","files":11,"time":1237310609,"description":"I Compagni aka The Organizer (1963)\n\n\nI Compagni aka The Organizer is a 1963 Italian drama film directed by Mario Monicelli.\n\nThe script was nominated for the Academy Award.\n\nThe Organizer (I Compagni) takes a gritty, near-documentary approach to its subject matter: the exploitation of\nItalian laborers in the 19th century. Shorn of all his studio-imposed glamour, Marcello Mastrioanni plays a Genoan\npolitical refugee visiting a friend in Turin. Appalled by the horrible working conditions in the town's textile mill,\nMastrioanni stays on to organize the workers in a strike. Though he is nearly killed several times, Mastrioanni\nsurvives to set an example for the workers, who rally together into a powerful union. The fact that Marcello\nMastrioanni was bearded and bespectacled in the manner of a Bolshevist radical was enough for The Organizer to be\ncondemned by certain extreme anti-Communist elements in Hollywood--to no avail, since the film was nominated for an\nAmerican Oscar, and even given a commendation by the ultraconservative National Board of Review.\n\nIMDB: 8.1/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0056945/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0056945/&lt;/a&gt;\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n    &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\nIf we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:52f230d1eebceb9cb37e929b3ce87e53ceb5902f","amp;dn":"I+Compagni+%281963%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f230d1eebceb9cb37e929b3ce87e53ceb5902f","infoHashBuffer":{"type":"Buffer","data":[82,242,48,209,238,188,235,156,179,126,146,155,60,232,126,83,206,181,144,47]},"announce":[],"urlList":[]}}