{"title":"Introduction to Industrial Polyethylene","uid":12427433,"size":6036451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:538963c3662915c05ff0bbb53754dde6b1a683c4&amp;dn=Introduction+to+Industrial+Polyethylene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1442404006,"description":"Introduction to Industrial Polyethylene (Wiley, 2010).pdf\n\nISBN 978-0-470-62598-9\n\nDemystifies the largest volume manmade synthetic polymer by distillingthe fundamentals of what polyethylene is, how it's made and processed, and what happens to it after its useful life is over.Endorsement for &quot;Introduction to Industrial Polyethylene&quot;\n\n&quot;I found this to be a straightforward, easy-to-read, and useful introductory text on polyethylene, which will be helpful for chemists, engineers, and students who need to learn more about this complex topic. The author is a senior polyethylene specialist and I believe we can all benefit from his distillation of knowledge and insight to quickly grasp the key learnings.&quot;\n--R.E. King III; Ciba Corporation (part of the BASF group)\n\nJargon used in industrial polyethylene technology can often be bewildering to newcomers. &quot;Introduction to Industrial Polyethylene&quot; educates readers on terminology commonly used in the industry and demystifies the chemistry of catalysts and cocatalysts employed in the manufacture of polyethylene.\n\nThis concise primer reviews the history of polyethylene and introduces basic features and nomenclatures for this versatile polymer. Catalysts and cocatalysts crucial to the production of polyethylene are discussed in the first few chapters. Latter chapters provide an introduction to the processes used to manufacture polyethylene and discuss matters related to downstream applications of polyethylene such as rheology, additives, environmental issues, etc.\n\nProviding industrial chemists and engineers a valuable reference tool that covers fundamental features of polyethylene technology, &quot;Introduction to Industrial Polyethylene&quot;\n\nIdentifies the fundamental types of polyethylene and how they differ.\n\nLists markets, key fabrication methods, and the major producers of polyethylene.\n\nProvides biodegradable alternatives to polyethylene.\n\nDescribes the processes used in the manufacture of polyethylene.\n\nIncludes a thorough glossary, providing definitions of acronyms and abbreviations and also defines terms commonly used in discussions of production and properties of polyethylene.\n\nConcludes with the future of industrial polyethylene","torrent":{"xt":"urn:btih:538963c3662915c05ff0bbb53754dde6b1a683c4","amp;dn":"Introduction+to+Industrial+Polyethylene","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"538963c3662915c05ff0bbb53754dde6b1a683c4","infoHashBuffer":{"type":"Buffer","data":[83,137,99,195,102,41,21,192,95,240,187,181,55,84,221,230,177,166,131,196]},"announce":[],"urlList":[]}}