{"title":"Eagle Series - Simon Scarrow","uid":8623396,"size":4993511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:539167cc40aed0f6655a21522b399e1a33f5f3f2&amp;dn=Eagle+Series+-+Simon+Scarrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":11,"time":1372437668,"description":"The Eagle Series is a military fiction series written by Simon Scarrow. The books describe the lives of two soldiers in the Roman army- Quintus Licinius Cato and Lucius Cornelius Macro. The first 5 books in the series are set in Roman Britain, between the years AD 42 and 44. The Eagle's Prophecy starts in Ancient Rome in AD 45, and The Eagle in the Sand is set in Judea. Centurion is set in Palmyra, The Gladiator, is set on Crete with, The Legion, being set in Egypt. The latest book Praetorian is set in Rome. The 12th book which is currently unnamed and unreleased will be set in Britain\n\nThe Eagle Series centres around two main characters, who are both Roman soldiers. Macro, a veteran with nearly 16 years service with the Eagles has recently been appointed to the Centurionate. Cato is a young lad who grew up in the Imperial Palace, and at the start of the series joins the Eagles as Macro's Optio. Starting in AD 42, the books cover the experiences of the two soldiers, their experience of the wars on the Rhine, the invasion of Britain by Claudius as part of the Legio II Augusta, a mission in Judea as agents of the Emperor's secretary Tiberius Claudius Narcissus, an attempted invasion of Palmyra by Parthia, a slave revolt and natural disaster on Crete, the wars in Egypt, and with the latest book many attempts on Claudius life.","torrent":{"xt":"urn:btih:539167cc40aed0f6655a21522b399e1a33f5f3f2","amp;dn":"Eagle+Series+-+Simon+Scarrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"539167cc40aed0f6655a21522b399e1a33f5f3f2","infoHashBuffer":{"type":"Buffer","data":[83,145,103,204,64,174,208,246,101,90,33,82,43,57,158,26,51,245,243,242]},"announce":[],"urlList":[]}}