{"title":"Fast Facts for the Medical- Surgical Nurse [PDF] [StormRG]","uid":11260477,"size":1788832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53b37b0c045b1e6cd44ba23193458b35861c2293&amp;dn=Fast+Facts+for+the+Medical-+Surgical+Nurse+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":2,"time":1413957405,"description":"TITLE/EDITION Fast Facts for the Medical- Surgical Nurse: Clinical Orientation in a Nutshell \nAuthor: Margaret Ciocco\nSeries: Fast Facts\nPaperback: 184 pages\nPublisher: Springer Publishing Company; 1 edition (August 26, 2014)\nLanguage: English\nISBN-10: 0826119891\nISBN-13: 978-0826119896\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nWritten for registered nurses in orientation, this concise, user-friendly resource provides a complete picture of all components of excellent patient care on a busy medical-surgical nursing unit. It covers assessment, key clinical skills/procedures, and documentation of care in an easily digestible, bulleted format. Time-tested guidance about new nurse orientation to professional practice includes &quot;proven pearls for success.&quot; Content is current and evidence-based, and reinforces previously mastered skills in &quot;key points to remember&quot; sections. The theme of &quot;the big picture&quot; of patient care is a consistent thread throughout.\n\nClinical chapters-organized by body system for easy reference--present common conditions seen in medical-surgical nursing and unit emergencies, along with focused assessments, lab work overview, related procedures and skills, a documentation guide, and common medications including those for pain management. Chapters also cover pre-operative and post-operative care for all conditions. Several &quot;must-have sections&quot; include an orientation guide describing what new nurses can expect as they embrace their new role. This section addresses co-workers and supervisors, finding a mentor, hourly rounding, HIPAA reminders, and telephone skills/customer relations. Another section is devoted to all aspects of infection control, and an appendix provides a wealth of resources and supporting information of particular value to the new nurse.\n\nKey Features:\nProvides concise, user-friendly, evidence-based guidance about the &quot;whole picture&quot; of nursing on a medical-surgical or sub-acute unit\nPresents a unique orientation section offering &quot;proven pearls for success&quot;\nContains focused assessment guides, skills overview, documentation tips, and medications for common medical-surgical conditions and emergencies\nAddresses pre- and post-operative care and pain control\nCovers important protocols regarding infection control","torrent":{"xt":"urn:btih:53b37b0c045b1e6cd44ba23193458b35861c2293","amp;dn":"Fast+Facts+for+the+Medical-+Surgical+Nurse+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b37b0c045b1e6cd44ba23193458b35861c2293","infoHashBuffer":{"type":"Buffer","data":[83,179,123,12,4,91,30,108,212,75,162,49,147,69,139,53,134,28,34,147]},"announce":[],"urlList":[]}}