{"title":"SUU Design Video Thumbnails Maker v4.0.0.3 with Key [iahq76]","uid":7818564,"size":2300055,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53e0fafac12c564120a6deac4a52138e96e07daa&amp;dn=SUU+Design+Video+Thumbnails+Maker+v4.0.0.3+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TorDigger","files":3,"time":1352738876,"description":"Video Thumbnails Maker by Scorp\n\nVideo Thumbnails Maker allows you to make thumbnails (caps, previews, screen-lists) and screenshots of video files. The utility can be used for home-video cataloging and for network video sharing support. \n\nVideo Thumbnails Maker is coming with its own Viewer! The main advantage of the Viewer is the ability to start the related video-file right from the Viewer! The process is automatic in activated version. In usual version you can set the link between the picture and the video-file manually within the Viewer. \n\nThe main features of the program:\n\nSupports of the batch processing of videofiles.\nSupports of practically any videos-formats (even MOV, QT, FLV, SWF, RM if you have appropriate codecs). If the file can be normally played in your video-player (Windows Media Player or BSPlayer), it can be processed by the program.\nSeveral ways to choose shots manually (including crop ability), learn more.\nYou can pause/continue or stop active job at any moment.\nVisual preview of your settings right in the Options window! Momentary rendering. Never before the creation of thumbnails was so simple! Maximum freedom for your creativity.\nPossibility to save each shot in separate file.\nCommand line interface support, learn more.\nOwn Viewer allows to start the related video-file right from the picture-Viewer! The process is automatic in activated version, learn more. In usual version you can set the link between the picture and the video-file manually within the Viewer.\nImport and export options presets.\nOptions preset file format (*.vtm). After you run the preset, the program is automatically opened with the imported tuning. Very useful.\n6 interface languages (English, Belarusian, Russian, Ukranian, German, French).\n5 customizable &quot;base&quot;-presets.\nAbility to export Video and Audio technical details in CSV and XML file formats.\nStatistics of the progress of the program (F1 window).\nIf you support the project, you can receive an email stating the amount you have donated, and a special activation key for the program. The key allows you to personalize the program, and depending on the amount you donated you will receive special status (silver, gold, platinum), learn more.\nWatermarks (alpha-channels and transparency are supported). Make your own style.\nAbility to use your images as background images for preview.\nAutoadjustment of height of a shot option.\nGlobal stroke and stroke tiles options.\nFit screen option (autoadjustment of the shots to fit your screen resolution).\nSpecial effects (drop shadow, gray scale, cut edges).\nCustomizable fonts, colors, contours, shadows, frames, background, text.\nStamp time in shots option (5 different locations, transparency, contour).\nVideo information stamp option (4 different locations and customizable configurations).\n&quot;Audio/Video info&quot; option.\n&quot;Custom comment&quot; option.\nThree rendering engines (Engine 2 is recommended to be used under 64-bit OS).\n&quot;Try to substitute black frames&quot; option.\nThe program's small size.\nHot keys.\n\nSystem Requirements:\n\nWindows 7/vista/xp\nMicrosoft .NET Framework 2.0+ is required. You can download the Microsoft .NET Framework 2.0 redistributable package or allow program to download itself during installation.\n\nHomepage: http://www.suu-design.com/projects.html#VTM\n\nInstallation Instructions:\n\n1. Install program and allow program to download .Net Framework from Microsoft if not already installed.\n2. Copy content from key folder and paste into default installation directory.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:53e0fafac12c564120a6deac4a52138e96e07daa","amp;dn":"SUU+Design+Video+Thumbnails+Maker+v4.0.0.3+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53e0fafac12c564120a6deac4a52138e96e07daa","infoHashBuffer":{"type":"Buffer","data":[83,224,250,250,193,44,86,65,32,166,222,172,74,82,19,142,150,224,125,170]},"announce":[],"urlList":[]}}