{"title":"The Soy Zone - 101 Delicious and Easy-to-Prepare Recipes - Barry","uid":9450067,"size":1890429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54675e49132223739bbf892f36e83f517cd36127&amp;dn=The+Soy+Zone+-+101+Delicious+and+Easy-to-Prepare+Recipes+-+Barry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1389165748,"description":"\n\nThe Soy Zone: 101 Delicious and Easy-to-Prepare Recipes\n\nBy Barry Sears\n\nPaperback: 352 pages - Publisher: William Morrow Paperbacks; 1 edition \n(May 8, 2001) - Language: English\nISBN-10: 0060934506 - ISBN-13: 978-0060934507\n\nAs America is finding out, soy is the most complete and versatile protein in existence. It has no cholesterol or saturated fat but plenty of vitamins and fiber and offers amazing health benefits for vegetarians and non-vegetarians alike. Based on the simple idea that food is your best medicine, The Soy Zone shows you how to maintain peak mental alertness, increase your energy, and reduce the likelihood of chronic disease -- all while losing excess body fat. Dr. Barry Sears brings all the life-enhancing benefits of the Zone to a mouthwatering collection of delicious soy-based Zone meals, featuring:\n\n    Soy Zone-perfect breakfasts, lunches, appetizers, dinners, and snacks\n    Appetizing new recipes from top chefs, such as Red Bean Chill, Hong Kong Burger, and Soy Zone-friendly Vegetarian Pad Thai\n    The ultimate healthful food plan, with quick and easy fat-burning alternatives to dangerous high-carb diets\n    An exercise and longevity plan for men and women\n    Helpful recommendations for Soy Zoning your kitchen\n    A scientifically proven plan for achieving perfect hormonal balance while losing weight","torrent":{"xt":"urn:btih:54675e49132223739bbf892f36e83f517cd36127","amp;dn":"The+Soy+Zone+-+101+Delicious+and+Easy-to-Prepare+Recipes+-+Barry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54675e49132223739bbf892f36e83f517cd36127","infoHashBuffer":{"type":"Buffer","data":[84,103,94,73,19,34,35,115,155,191,137,47,54,232,63,81,124,211,97,39]},"announce":[],"urlList":[]}}