{"title":"[drums] Benny Greb - The Art and Science of GROOVE","uid":12579348,"size":7449644209,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54bd4cbace798e931ac17e751e5f533a0cb7511f&amp;dn=%5Bdrums%5D+Benny+Greb+-+The+Art+and+Science+of+GROOVE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"glan1605","files":49,"time":1444936117,"description":"The Art and Science of Groove is the first ever collection of vital tools and exercises designed specifically to enhance your playing with a positive groove, time after time. Benny Greb introduces the five core elements of Time, Feel, Sound, Body and Mind, offering straightforward solutions that can be applied to any musical style in order to generate a solid and consistent groove, leaving nothing to luck.\r\n\r\nBy applying the tools within The Art and Science of Groove and making use of Benny’s practical approach to the exercises, drummers everywhere will see an obvious transformation in their drum set playing, without question.\r\n\r\nPresented in Benny’s inimitable style, blending education with humour, the exercises are showcased with performances alongside bassist Frank Itt and with Benny’s Moving Parts trio, as well as individual performances by Benny.\r\n\r\nWith a production value totally exceptional for this genre, including illustrations and special effects, this DVD is a ‘must have’ addition to any drummer’s library. You simply cannot afford to miss the lessons that Benny teaches here. Bonus features - including a comprehensive ‘Tuning Lesson’ and ‘Making Of’ footage - provide behind the scenes insights to this truly inspirational DVD.\r\n\r\nThe Art and Science of Groove will help all drummers find that most unique and undeniable feeling that is Groove!\r\n\r\nWritten by Benny Greb, Directed by Christopher Klemme\r\nRunning time: more than 3 hours\r\n\r\nVideo: AVC 1920x1080 16:9 25fps ~4850kbps\r\nAudio: AAC 48000Hz stereo 253kbps","torrent":{"xt":"urn:btih:54bd4cbace798e931ac17e751e5f533a0cb7511f","amp;dn":"%5Bdrums%5D+Benny+Greb+-+The+Art+and+Science+of+GROOVE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54bd4cbace798e931ac17e751e5f533a0cb7511f","infoHashBuffer":{"type":"Buffer","data":[84,189,76,186,206,121,142,147,26,193,126,117,30,95,83,58,12,183,81,31]},"announce":[],"urlList":[]}}