{"title":"Alan Wilson - The Blind Owl (Edit: files renamed)","uid":16033379,"size":182221872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:550fe10d2aa4793cfb386b2257759fca2f906c38&amp;dn=Alan+Wilson+-+The+Blind+Owl+%28Edit%3A+files+renamed%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Trace-Elliott","files":30,"time":1476450918,"description":"Alan Wilson - The Blind Owl.\r\n2 CD album, 320 kbps mp3.\r\n\r\nEDIT: I renamed the files to remove the underscores. Much nicer now :-)\r\n\r\n\r\nHis was the voice of the woodstock generation who asked &quot;honey, do you want to go&quot; in the classic Canned Heat anthem &quot;Goin' Up the Country&quot;. \r\n\r\nAlan &quot;Blind Owl&quot; Wilson was the preeminent statesman of '60's blues/rock; a master harmonica player and guitarist in the Delta tradition who would forge unlikely relationships with heavyweights like Son House and John Lee Hooker (&quot;Alan plays my music better than I knows it myself&quot;) on his way toward becoming, according to Downbeat Magazine, &quot;the finest white blues harmonica man&quot; of the hippie era.\r\n\r\nNearsighted to the point of almost complete blindness, Wilson picked up the name &quot;the Blind Owl&quot; from good friend and fellow blues picker John Fahey. \r\nAs bandmate Fito de la Parra writes: &quot;Without the glasses, Alan literally could not recognize the people he played with at two feet, that's how blind the 'Blind Owl' was&quot;.\r\n\r\nThe Blind Owl features 20 songs that clock in at over 60 minutes of satisfying electric blues boogie. \r\nIn addition to the iconic &quot;Goin' Up the Country&quot; are the reflective &quot;My Time Ain't Long&quot;, Little Walter's &quot;Mean Old World&quot;, and the band's breakout recording &quot;On the Road Again&quot; from their critically acclaimed release Boogie with Canned Heat.\r\n\r\nPainfully awkward, the eccentric Wilson battled anxiety and bouts of depression as heard in &quot;My Mistake&quot; and &quot;Change My Ways&quot;. \r\nHe was keenly attuned to environmental issues and in almost prophetic foretelling wrote about man's negative impact on the planet in his lamenting &quot;Poor Moon&quot;, a theme found in many of his works.\r\n\r\nFan favorite &quot;Time Was&quot; sheds light on tensions within the band, as the upbeat &quot;Shake It and Break It&quot; adapts lyrics from a song penned by Charley Patton, another of Wilson's musical heroes.\r\n \r\nIn September of 1970 Wilson's body was found on a hillside behind bandmate Bob Hite's California home. An overdose of barbiturates cut his life short making him the tenth member of the infamous 27 Club. \r\nWho knows what might have been for the Blind Owl. All that is certain is that his legacy remains strong despite his early demise as proven in this collection of remarkable recordings","torrent":{"xt":"urn:btih:550fe10d2aa4793cfb386b2257759fca2f906c38","amp;dn":"Alan+Wilson+-+The+Blind+Owl+%28Edit%3A+files+renamed%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"550fe10d2aa4793cfb386b2257759fca2f906c38","infoHashBuffer":{"type":"Buffer","data":[85,15,225,13,42,164,121,60,251,56,107,34,87,117,159,202,47,144,108,56]},"announce":[],"urlList":[]}}