{"title":"George Orwell: A Life in Letters [Peter Davison, ed.] (2013)","uid":9249390,"size":4759619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5543e11ffb48e25801ca9df5b96df5536756c57a&amp;dn=George+Orwell%3A+A+Life+in+Letters+%5BPeter+Davison%2C+ed.%5D+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1385437921,"description":"\nGeorge Orwell: A Life in Letters (Liveright, 2013).  Selected and annotated by Peter Davison.\n\nISBN: 9780871404626 | 560 pages | EPUB\n\n\nFrom his school days to his tragic early death, George Orwell (1903 - 1950), who never wrote an autobiography, chronicled the dramatic events of his turbulent life in a profusion of powerful letters.  Indeed, one of the twentieth century's most revered icons was a lively, prolific correspondent who developed in rich, nuanced dispatches the ideas that would influence generations of writers and intellectuals. This historic work -- never before published in America and featuring many previously unseen letters -- presents an account of Orwell's interior life as personal and absorbing as readers may ever see.\n\nOver the course of a lifetime, Orwell corresponded with hundreds of people, including many distinguished political and artistic figures.  Witty, personal, and profound, the letters tell the story of Orwell's passionate first love that ended in devastation and explains how young Eric Arthur Blair chose the pseudonym &quot;George Orwell.&quot;  In missives to luminaries such as T. S. Eliot, Stephen Spender, Arthur Koestler, Cyril Connolly, and Henry Miller, he spells out his literary and philosophical beliefs.  Readers will encounter Orwell's thoughts on matters both quotidian (poltergeists and the art of playing croquet) and historical -- including his illuminating descriptions of war-shattered Barcelona and pronouncements on bayonets and the immanent cruelty of chaining German prisoners.\n\nThe letters also reveal the origins of his famous novels.  To a fan he wrote, &quot;I think, and have thought ever since the war began . . . that our cause is the better, but we have to keep on making it the better, which involves constant criticism.&quot;  A paragraph before, he explained that the British intelligentsia in 1944 were &quot;perfectly ready for dictatorial methods, secret police, systematic falsification of history,&quot; prefiguring the themes of 1984.  Entrusting the manuscript of Animal Farm to Leonard Moore, his literary agent, Orwell describes it as &quot;a sort of fairy story, really a fable with political meaning. . . This book is murder from the Communist point of view.&quot;\n\nHardly known outside a small circle of Orwell scholars, these rare letters include Orwell's message to Dwight Macdonald of 5 December 1946 explaining Animal Farm; his correspondence with his first translator, R. N. Raimbault (with English translations of the French originals); and the moving encomium written about Orwell by his BBC head of department after his service there.  The volume concludes with a fearless account of the painful illness that took Orwell's life at age forty-seven.  His last letter concerns his son and his estate and closes with the words, &quot;Beyond that I can't make plans at present.&quot;\n\nMeticulously edited and fully annotated by Peter Davison, the world's preeminent Orwell scholar, the volume presents Orwell &quot;in all his varieties&quot; and his relationships with those most close to him, especially his first wife, Eileen.  Combined with rare photographs and hand-drawn illustrations, GEORGE ORWELL: A LIFE IN LETTERS offers &quot;everything a reader new to Orwell needs to know and a great deal that diehard fans will be enchanted to have&quot; (New Statesmen).\n\n\nReviews\n\n&quot;[A] judiciously chosen selection of some of the most interesting of [his] casual writings. . . The result is a much more rounded image of Orwell and his circle.&quot; -- New York Times Book Review\n\n&quot;Orwell's keen insight and acerbic wit reverberate throughout these selected letters, culled from more than 10 volumes to offer a comprehensive view of his life and personality. . . An unusually gratifying read for Orwell enthusiasts and casual readers alike.&quot; -- Publishers Weekly\n\n&quot;Orwell the man truly emerges in these revealing letters; this essential companion volume to the Diaries will be devoured by legions of Orwell fans.&quot; -- Library Journal\n\n&quot;It is the portable Orwell, the condensed autobiography that Orwell never wrote. . . All [the letters] remain fresh, illuminating the complex paradox that was George Orwell.&quot; -- Daily Telegraph\n\n&quot;Beautifully edited. . . One of the glories of this volume is that it shows Orwell in the round, complete with all his human idiosyncracies and contradictions. [Peter Davison's] attention to detail is nothing short of heroic. . . This is the authentic Orwell voice: wonderfully clear and fresh and forthright.&quot; -- Mail on Sunday\n\n&quot;This new edition of Orwell's letters is imperative for anyone who wishes to earn a larger understanding of the twentieth century's most potent essayist.&quot; -- William Giraldi, The New Republic\n\n&quot;Any Orwell admirer will be grateful for Davison's industry in carving out manageable chunks from the millions of words Orwell wrote, and for all except the most fanatical, this will be plenty.  There are pleasures and surprises on every page.&quot; -- Andrew Ferguson, The American Spectator","torrent":{"xt":"urn:btih:5543e11ffb48e25801ca9df5b96df5536756c57a","amp;dn":"George+Orwell%3A+A+Life+in+Letters+%5BPeter+Davison%2C+ed.%5D+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5543e11ffb48e25801ca9df5b96df5536756c57a","infoHashBuffer":{"type":"Buffer","data":[85,67,225,31,251,72,226,88,1,202,157,245,185,109,245,83,103,86,197,122]},"announce":[],"urlList":[]}}