{"title":"Planet Ponzi How the World Got Into This Mess","uid":12079876,"size":1213961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55feaff7906ee4a7038a2044eef3e74a3edb2af9&amp;dn=Planet+Ponzi+How+the+World+Got+Into+This+Mess&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Djofullinn","files":1,"time":1435734574,"description":"Mitch Feierstein, &quot;Planet Ponzi: How the World Got Into This Mess, What Happens Next, How to Save Yourself&quot; \n\n2012 | ISBN: 0985036923, 0552778273, 0593069617 | 450 pages | EPUB | 1.2 MB \n\nThe world economy is now approaching the final death rattle of the greatest Ponzi scheme in history: a scheme in which politicians stood by as the financial industry and Sovereign governments created a vast overhang of debt, a mountain of low quality assets - and laid the foundations for an economic disaster which will dwarf any other in history. There are four possible outcomes for our future: Economic growth (unlikely); Stagnation (probable); Inflation (bad); and, Default (disastrous). Which of the four it will be depends on choices that are being made right now, not always wisely, by politicians, technocrats and bankers. &quot;Planet Ponzi&quot; is a provocative assessment of the state of today's global economy. Mitch Feierstein reveals the true debts of Britain, the US government and the Eurozone - the full picture, not the figures the politicians would have us believe. In &quot;Planet Ponzi&quot;, Feierstein explains clearly the background to the world's worst financial crisis for 70 years, predicts the next steps in this infinitely dangerous game and offers practical advice on measures which you personally can take to protect yourself and your family","torrent":{"xt":"urn:btih:55feaff7906ee4a7038a2044eef3e74a3edb2af9","amp;dn":"Planet+Ponzi+How+the+World+Got+Into+This+Mess","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55feaff7906ee4a7038a2044eef3e74a3edb2af9","infoHashBuffer":{"type":"Buffer","data":[85,254,175,247,144,110,228,167,3,138,32,68,238,243,231,74,62,219,42,249]},"announce":[],"urlList":[]}}