{"title":"Bridget St. John - Thank You For... (1972) [FLAC]","uid":8216894,"size":368183153,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5626eb724f1e8dfb58aca62a1c61916f4da2d5be&amp;dn=Bridget+St.+John+-+Thank+You+For...+%281972%29+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":6,"time":1362360284,"description":"Bridget St. John - Thank You For... (1972/2008)\n\nGenre: UK, Folk, Psychedelic Rock\n\nTracklist:\n\n01. Nice\n02. Thank You For\n03. Lazarus\n04. Good Baby Goodbye\n05. Love Minus Zero, No Limit\n06. Silver Coin\n07. Happy Day\n08. Fly High\n09. To Leave Your Cover\n10. Every Day\n11. A Song As Long As It Wants To Go On\n12. Nice (Recorded Live In Montreux, Switzerland On April 28, 1972)\n13. Silver Coin (Recorded Live In Montreux, Switzerland On April 28, 1972)\n14. Fly High (Recorded Live In Montreux, Switzerland On April 28, 1972)\n15. Lazarus (Recorded Live In Montreux, Switzerland On April 28, 1972)\n16. The River (Recorded Live In Montreux, Switzerland On April 28, 1972)\n17. Thank You... (Recorded Live In Montreux, Switzerland On April 28, 1972)\n18. Ask Me No Questions (Recorded Live In Montreux, Switzerland On April 28, 1972)\n19. If You've Got Money (Recorded Live In Montreux, Switzerland On April 28, 1972)\n\nBridget St John is a singer and songwriter best known for the three albums she recorded between 1969 and 1972 for John Peel's Dandelion record label. Peel produced her debut album Ask Me No Questions. She also recorded a large number of BBC and Peel sessions and toured regularly on the early UK college and festival circuit. Her popularity peaked in 1974 when she was voted fifth most popular female singer in that year's Melody Maker readers poll.\nAn accomplished guitar player, she credits John Martyn (with whom she has been friends since college) as her guitar mentor.\nThe second album Songs for the Gentle Man, was produced by Ron Geesin. St. John then recorded another album, Jumble Queen, for Chrysalis Records in 1974. She emigrated to Greenwich Village in 1976 and virtually disappeared from the public eye for over 20 years. She appeared at a Nick Drake tribute concert in New York in 1999, performing &quot;Northern Sky&quot; and &quot;One of These Things First&quot;. She toured Japan in 2006 with the minimalist French musician Colleen.\nAside from work under her own name, Bridget St John has also recorded with Mike Oldfield (on Amarok), Kevin Ayers and Robin Frederick. In 2007 she reunited with Kevin Ayers to record on his album The Unfairground in New York. They duetted on the song &quot;Baby Come Home&quot;.\n","torrent":{"xt":"urn:btih:5626eb724f1e8dfb58aca62a1c61916f4da2d5be","amp;dn":"Bridget+St.+John+-+Thank+You+For...+%281972%29+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5626eb724f1e8dfb58aca62a1c61916f4da2d5be","infoHashBuffer":{"type":"Buffer","data":[86,38,235,114,79,30,141,251,88,172,166,42,28,97,145,111,77,162,213,190]},"announce":[],"urlList":[]}}