{"title":"Hacking Exposed Wireless, 2nd Edition {BBS}","uid":6813581,"size":11616451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56d0b2df9bbf89dcee097059117f3e867ca6f116&amp;dn=Hacking+Exposed+Wireless%2C+2nd+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321116800,"description":"Protect your wireless systems from crippling attacks using the detailed security information in this comprehensive volume. Thoroughly updated to cover today's established and emerging wireless technologies, Hacking Exposed Wireless, second edition reveals how attackers use readily available and custom tools to target, infiltrate, and hijack vulnerable systems. This book discusses the latest developments in Wi-Fi, Bluetooth, ZigBee, and DECT hacking, and explains how to perform penetration tests, reinforce WPA protection schemes, mitigate packet injection risk, and lock down Bluetooth and RF devices. Cutting-edge techniques for exploiting Wi-Fi clients, WPA2, cordless phones, Bluetooth pairing, and ZigBee encryption are also covered in this fully revised guide.\n\n    * Build and configure your Wi-Fi attack arsenal with the best hardware and software tools\n    * Explore common weaknesses in WPA2 networks through the eyes of an attacker\n    * Leverage post-compromise remote client attacks on Windows 7 and Mac OS X\n    * Master attack tools to exploit wireless systems, including Aircrack-ng, coWPAtty, Pyrit, IPPON, FreeRADIUS-WPE, and the all new KillerBee\n    * Evaluate your threat to software update impersonation attacks on public networks\n    * Assess your threat to eavesdropping attacks on Wi-Fi, Bluetooth, ZigBee, and DECT networks using commercial and custom tools\n    * Develop advanced skills leveraging Software Defined Radio and other flexible frameworks \n\n\n# Paperback: 512 pages\n# Publisher: McGraw-Hill Osborne Media; 2 edition (July 9, 2010)\n# Language: English\n# ISBN-10: 0071666613\n# ISBN-13: 978-0071666619","torrent":{"xt":"urn:btih:56d0b2df9bbf89dcee097059117f3e867ca6f116","amp;dn":"Hacking+Exposed+Wireless%2C+2nd+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56d0b2df9bbf89dcee097059117f3e867ca6f116","infoHashBuffer":{"type":"Buffer","data":[86,208,178,223,155,191,137,220,238,9,112,89,17,127,62,134,124,166,241,22]},"announce":[],"urlList":[]}}