{"title":"Kingdom Come 14 Albums 1988-2011 [FLAC+.cue] {100.XY}","uid":8299944,"size":5081280695,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:57bd06d25b4b13f74a7255192615bb8f074faf8e&amp;dn=Kingdom+Come+14+Albums+1988-2011+%5BFLAC%2B.cue%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"100.XY","files":-1,"time":1364244583,"description":"Kingdom Come is a hard rock band fronted by Hamburg-born vocalist Lenny Wolf. The group's first album, Kingdom Come is to date the band's most internationally popular and biggest selling recording. The band currently consists of an entirely German line-up.he group was formed in 1987 after the breakup of Wolf's moderately successful rock project Stone Fury. Wolf recruited Pittsburgh-based lead guitarist Danny Stag, Louisvillians Rick Steier (guitar) and James Kottak (drums) and Ravenna, Ohio-born Johnny B. Frank on bass and keyboards. Stag and Frank had previously been members of the bands Industrials (CBS Int'l), produced by Kim Fowley; WWIII;[1] and Population 5, which included bassist Prescott Niles (The Knack) and future Guns n Roses and Velvet Revolver drummer Matt Sorum. Kingdom Come marked the first band where Wolf sang without playing guitar. The frontman later admitted that, for a while, it was a very awkward adjustment.\nIn 1988, the band released its debut LP, Kingdom Come. The band's first single, &quot;Get It On,&quot; was a big enough hit on AOR stations (most requested song for 6 weeks), that the band's eponymous debut went gold the day it was shipped (610,000 units sold). Their second single/video for the power ballad &quot;What Love Can Be&quot; received much airplay on US radio and MTV. By the time the single/video &quot;Loving You&quot; was released, the album had sold to platinum status in the United States, Germany and Canada, among other music markets. The band was chosen to open for the North American Monsters of Rock tour in 1988, supporting Dokken, Scorpions, Metallica and Van Halen. Following that, they were tapped to support the Scorpions on their North American &quot;Savage Amusement&quot; tour. In 1989, Kingdom Come released their next LP, called In Your Face. It had sold a hardly modest 486,000 units, only 14,000 short of achieving their second Gold LP, when the band abruptly broke up for personal reasons in August, 1989.\nIn 1992, Stag joined forces with onetime Foreigner vocalist Johnny Edwards, former Krokus drummer Jeff Klaven, and bassist David Seaton to form Royal Jelly, which got the attention of legendary A&amp;R man Denny Cordell at Island Records in 1993. Cordell signed Stag and Royal Jelly to a recording contract. The band's first single, &quot;Ceiling&quot; reached #22 with a bullet on the FM airplay charts before the band was lost in the shuffle of Cordell's untimely and tragic death from lymphoma and the purchase and restructuring of Island by Polygram. In 1995, after the demise of the band, a disillusioned Stag went back to Pittsburgh and immersed himself in the blues, to get back in touch with the source of his inspiration. Steier and Kottak went back to Kentucky and assembled the short-lived Wild Horses, who released an album on Atlantic Records. Both would later resurface in Warrant. James Kottak did not go unnoticed by the Scorpions and eventually earned a place as their permanent drummer.\nWith a new lineup, Kingdom Come managed one more international release on Polygram, an album entitled Hands of Time in 1991, co-writing with harpist/songwriter Carol Tatum (Angels Of Venice), which was recorded by with several session guitarists and drummers, including future Poison guitarist Blues Saraceno, and Dancer drummer Bam Bamm Shibley, with Lenny Wolf himself playing the bass. By 1993, Wolf had returned to Germany to regroup. With a new, mostly German lineup, Kingdom Come remains active with several subsequent releases and tours in Europe under their collective belt.\n\nCountry: USA / Germany\nGenre: Hard rock, heavy metal, glam metal, blues-rock\nQuality: FLAC\n\nAlbum List:\n\n1988 Kingdom Come\n1988 Kingdom Come [Remastered]\n1989 In Your Face\n1991 Hands Of Time\n1993 Bad Image\n1995 Twilight Cruiser\n1996 Live &amp; Unplugged [320]\n1997 Master Seven\n2000 Too\n2002 Independent\n2004 Perpetual\n2006 Ain't Crying For The Moon\n2009 Magnified\n2011 Rendered Waters","torrent":{"xt":"urn:btih:57bd06d25b4b13f74a7255192615bb8f074faf8e","amp;dn":"Kingdom+Come+14+Albums+1988-2011+%5BFLAC%2B.cue%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57bd06d25b4b13f74a7255192615bb8f074faf8e","infoHashBuffer":{"type":"Buffer","data":[87,189,6,210,91,75,19,247,74,114,85,25,38,21,187,143,7,79,175,142]},"announce":[],"urlList":[]}}