{"title":"Bad Brains - Discography 1982-2012 [FLAC]","uid":8965290,"size":5042920348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:58200f59cd901b6d2d72b4469db0d98bea9158dd&amp;dn=Bad+Brains+-+Discography+1982-2012+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"rudown78","files":376,"time":1380207826,"description":"Bad Brains - Discography 1982-2012 [FLAC]\n\n\nBy melding punk with reggae, Bad Brains became one of the definitive American hardcore punk groups of the early '80s. Although the group released only a handful of records during its peak, including the legendary cassette-only debut, Bad Brains, they developed a dedicated following, many of whom would later form their own hardcore and alternative bands. As for Bad Brains themselves, they continued to record and tour in varying lineups led by guitarist Dr. Know into the late '90s yet never managed to break out of their cult status.\n\nDr. Know (born Gary Miller), a former jazz fusion guitarist, formed Bad Brains in 1979, inspired by both the amateurish rage of the Sex Pistols and the political reggae of Bob Marley. Realizing that the lines between punk and reggae were already blurred in the U.K., he set out to replicate that situation in the U.S., and he recruited several similarly minded musicians -- vocalist H.R. (born Paul D. Hudson), bassist Darryl Aaron Jenifer, and drummer Earl Hudson -- to prove his point. Bad Brains quickly became one of the most popular punk bands on the East Coast, particularly in their hometown of Washington, D.C. Their live performances were legendary, but their recordings were difficult to find. Their debut single, &quot;Pay to Cum,&quot; was pressed in limited numbers, and their 1982 debut album was only issued in cassette form by ROIR. In addition to the Bad Brains tape, the group released a handful of other EPs in 1982, finally moving to PVC for 1983's full-length debut, Rock for Light, which was produced by Ric Ocasek.\n\nThe handful of indie recordings Bad Brains left behind, as well as their live shows, made the band legendary in American hardcore, yet few potential fans could actually hear the band due to poor distribution and erratic touring. The band took three years to deliver the follow-up to Rock for Light, finally releasing I Against I on SST in 1986. In those three years, the group developed more heavy metal leanings, and the resulting record received mixed reviews. More importantly, it divided the band, with Dr. Know and Jenifer wishing to continue to pursue heavy rock, and H.R. and Hudson wanting to devote themselves to reggae. Over the next three years, the latter pair frequently left the band to make reggae albums before finally departing in 1989. They were replaced by Israel Joseph-I (born Dexter Pinto) and Mackie Jayson, respectively.\n\nIn the wake of the alternative rock boom of the early '90s, Bad Brains were finally offered a major-label contract in 1993, releasing Rise on Epic later that year. The album bombed and the group was dropped. Maverick Records offered the group a contract in 1995, provided that the original lineup reunited. They did so and released God of Love that summer, to mixed reviews and poor sales. H.R. and Hudson left the band shortly after the album's release, and the band was dropped by Maverick. In 1998 the band again reunited and began touring under the name Soul Brains.\n\nIn 2002, Reggae Lounge compiled remixes of Bad Brains' '80s hits and released a full-length dub album titled I &amp; I Survived. The following year Caroline released Banned in DC: Bad Brains' Greatest Riffs, a solid anthology compiling songs from their first album up to Quickness. For the next few years, the group members concentrated on solo endeavors, with a few scattered guest appearances on other bands' albums or live shows. In 2006, Bad Brains reunited for a few shows at CBGB's, which quickly sold out. With a resurging interest in the band, in early 2007, Megaforce announced that they had signed them to their roster. Under Beastie Boy Adam Yauch's studio supervision, the original band went back to the studio for the first time in over a decade and recorded Build a Nation, an inspired attempt at returning to the band's hardcore roots. In early 2011 the band began work on the next record. The record was initially titled &quot;Let's Have Fun&quot;, but that title didn't stick and was changed to Into the Future, an album which saw release in November of 2012.\n\n\n1982 - Bad Brains [1996 Reissue]\n1983 - Rock for Light [1991 Reissue]\n1986 - I Against I\n1988 - Live\n1989 - Attitude: The ROIR Sessions\n1989 - Quickness\n1990 - The Youth Are Getting Restless: Live in Amsterdam\n1991 - Spirit Electricity [EP]\n1993 - Rise\n1995 - God of Love\n1996 - Black Dots\n1997 - Omega Sessions [EP]\n2001 - Soul Brains: A Bad Brains Reunion Live from Maritime Hall\n2002 - I &amp; I Survived (Dub)\n2003 - Banned in D.C.: Bad Brains Greatest Riffs\n2006 - Live at CBGB 1982 - The Audio Recordings\n2007 - Build a Nation\n2012 - Into the Future\n\n\nAlbum artwork is included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:58200f59cd901b6d2d72b4469db0d98bea9158dd","amp;dn":"Bad+Brains+-+Discography+1982-2012+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58200f59cd901b6d2d72b4469db0d98bea9158dd","infoHashBuffer":{"type":"Buffer","data":[88,32,15,89,205,144,27,109,45,114,180,70,157,176,217,139,234,145,88,221]},"announce":[],"urlList":[]}}