{"title":"Michael Cobley - The Seeds of Earth (Humanity's Fire #1)","uid":13687633,"size":531182368,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:58377273b45ce018cb6569abc10ab52b4b3e6d82&amp;dn=Michael+Cobley+-+The+Seeds+of+Earth+%28Humanity%27s+Fire+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":60,"time":1456572841,"description":"First contact: the dream that became a nightmare when the first alien life encountered swarmed locust-like through the solar system. Merciless. Relentless. Unstoppable.\r\n\r\nWith little hope of halting the invading forces, Earth's last, desperate roll of the die was to send out three colony ships - seeds of Earth - to different parts of the galaxy. Earth may perish, but the human race would live on, somewhere.\r\n\r\nFully 150 years later, the human colony on the planet Darien has established a new world for humanity and forged a peaceful relationship with the planet's indigenous race, the gentle, scholarly Uvovo. But there are secrets buried on Darien. Life is about to change for the last children of Earth, as surprises spring from below and above. How will the Darien colonists react when all they have worked for is overturned at a stroke? And what choices will the Uvovo make when their true nature is revealed - and the skies grow dark with enemies?\r\n\r\nFrom the author: &quot;Audible did a great job with the audiobooks of Seeds Of Earth and The Orphaned Worlds - and David Thorpe is one versatile guy, able to lend his vocal talents to every strange character I was able to think up. Just excellent!&quot;\r\n\r\n\r\n\r\nRead by David Thorpe\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:58377273b45ce018cb6569abc10ab52b4b3e6d82","amp;dn":"Michael+Cobley+-+The+Seeds+of+Earth+%28Humanity%27s+Fire+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58377273b45ce018cb6569abc10ab52b4b3e6d82","infoHashBuffer":{"type":"Buffer","data":[88,55,114,115,180,92,224,24,203,101,105,171,193,10,181,43,75,62,109,130]},"announce":[],"urlList":[]}}