{"title":"Reflection for Nursing Life (2016) (Epub) Gooner","uid":15802125,"size":4688099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:589872727b87daaf44f7b81010f7c78a0c8e538d&amp;dn=Reflection+for+Nursing+Life+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1473518921,"description":"Reflection for Nursing Life Principles, Process and Practice (2016) (Epub) Gooner \r\n\r\nPublisher: Routledge; 1 edition (9 Feb. 2016)\r\nLanguage: English\r\nISBN-10: 1138787590\r\nISBN-13: 978-1138787599\r\n\r\nOver the past decades, reflection has taken centre stage in nursing education but it is easy to get stuck in a superficial cycle of storytelling and self-examination, without getting any further insights into your own practice and abilities. Reflection for Nursing Life starts with a basic introduction to reflective practice and moves through to look at more critical perspectives, with guidance for reflecting on the complex realities of practice.\r\n\r\nThis accessible text is designed to support a deeper understanding of the value of reflection and its relationship with the needs of modern practice. Beginning with discussions of self-awareness and the reflective cycle, it goes on to explore ideas about critical incidents, critical reflection models and transformational learning. It integrates cutting-edge neuro-scientific research and thinking about emotional labour and intelligence in healthcare into mainstream reflective practice, drawing on both new and established ways of guiding learning and professional judgment.\r\n\r\nReflection for Nursing Life includes numerous exemplar reflective narratives, diagrams and exercises to help the reader identify their strengths and weaknesses, whilst tips for overcoming weaknesses and developing strengths are also provided. It is the ideal text for nursing students and practitioners looking to improve their reflective practice skills","torrent":{"xt":"urn:btih:589872727b87daaf44f7b81010f7c78a0c8e538d","amp;dn":"Reflection+for+Nursing+Life+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"589872727b87daaf44f7b81010f7c78a0c8e538d","infoHashBuffer":{"type":"Buffer","data":[88,152,114,114,123,135,218,175,68,247,184,16,16,247,199,138,12,142,83,141]},"announce":[],"urlList":[]}}