{"title":"The Band - The Last Waltz (1978) [MFSL 2015] 2 SACD-ISO","uid":11829565,"size":5624556671,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5a076ef1154f66ecdb0a7c3b0e935a5856ade5c3&amp;dn=The+Band+-+The+Last+Waltz+%281978%29+%5BMFSL+2015%5D+2+SACD-ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"sidmal","files":33,"time":1429588699,"description":"The Band - The Last Waltz (1978) [MFSL 2015]\n\n PS3 Rip | 2x SACD ISO | DSD64 2.0 &gt; 1-bit/2.8224 MHz | 129:50 minutes | Scans included | 3,88 GB\nMobile Fidelity Sound Lab # 2-2139\n\n\n As a film, The Last Waltz was a triumph -- one of the first (and still one of the few) rock concert documentaries that was directed by a filmmaker who understood both the look and the sound of rock &amp; roll, and executed with enough technical craft to capture all the nooks and crannies of a great live show. But as an album, The Last Waltz soundtrack had to compete with the Band's earlier live album, Rock of Ages, with which it bears a certain superficial resemblance -- both found the group trying to create something grander than the standard-issue live double, and both featured the group beefed up by additional musicians. While Rock of Ages found the Band swinging along with the help of a horn section arranged by Allen Toussaint, The Last Waltz boasts a horn section (using Toussaint's earlier arrangements on a few cuts) and more than a baker's dozen guest stars, ranging from old cohorts Ronnie Hawkins and Bob Dylan to contemporaries Joni Mitchell, Neil Young, and Van Morrison. the Band are in fine if not exceptional form here; on most cuts, they don't sound quite as fiery as they did on Rock of Ages, though their performances are never less than expert, and the high points are dazzling, especially an impassioned version of &quot;It Makes No Difference&quot; and blazing readings of &quot;Up on Cripple Creek&quot; and &quot;The Night They Drove Old Dixie Down&quot; (Levon Helm has made no secret that he felt breaking up the Band was a bad idea, and here it sounds if he was determined to prove how much they still had to offer). Ultimately, it's the Band's &quot;special guests&quot; who really make this set stand out -- Muddy Waters' ferocious version of &quot;Mannish Boy&quot; would have been a wonder from a man half his age, Van Morrison sounds positively joyous on &quot;Caravan,&quot; Neil Young and Joni Mitchell do well for their Canadian brethren, and Bob Dylan's closing set finds him in admirably loose and rollicking form. (One question remains -- what exactly is Neil Diamond doing here?) And while the closing studio-recorded &quot;Last Waltz Suite&quot; sounds like padding, the contributions from Emmylou Harris and the Staple Singers are beautiful indeed.  \n\n\nTracklist:\n\n Disc 1\n 01. Theme From The Last Waltz\n 02. Up On Cripple Creek\n 03. Who Do You Love - with Ronnie Hawkins\n 04. Helpless - with Neil Young\n 05. Stagefright\n 06. Coyote - with Joni Mitchell\n 07. Dry Your Eyes - with Neil Diamond\n 08. It Makes No Difference \n 09. Such A Night - with Dr. John\n 10. The Night They Drove Old Dixie Down\n 11. Mystery Train - with Paul Butterfield\n 12. Mannish Boy - with Muddy Waters\n 13. Further On Up The Road - with Eric Clapton\n\n Disc 2\n 01. Shape I'm In\n 02. Down South In New Orleans - with Bobby Charles\n 03. Ophelia\n 04. Tura-Lura-Lural (That's An Irish Lullaby) - with Van Morrison\n 05. Caravan - with Van Morrison\n 06. Life Is A Carnival\n 07. Baby Let Me Follow You Down - with Bob Dylan\n 08. I Don't Believe You (She Acts Like We Never Have Met) - with Bob Dylan\n 09. Forever Young - with Bob Dylan\n 10. Baby Let Me Follow You Down (Reprise) - with Bob Dylan\n 11. I Shall Be Released (Finale)\n 12. The Well\n 13. Evangeline - with Emmylou Harris\n 14. Out Of The Blue\n 15. The Weight - with The Staples\n 16. The Last Waltz Refrain\n 17. Theme From The Last Waltz - With Orchestra\n\n Mastered bu Shawn R. Britton at Mobile Fidelity Sound Lab, Sebastopol, CA.\n\nPerfectly played on Foobar2000 with &quot;foo_input_sacd&quot; plugin.\n For those Mac users wishing to play ISO, SACD format: see Audirvana Plus\n - Make sure you've configured it properly (check up the player settings).\n\nEnjoy!!!","torrent":{"xt":"urn:btih:5a076ef1154f66ecdb0a7c3b0e935a5856ade5c3","amp;dn":"The+Band+-+The+Last+Waltz+%281978%29+%5BMFSL+2015%5D+2+SACD-ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a076ef1154f66ecdb0a7c3b0e935a5856ade5c3","infoHashBuffer":{"type":"Buffer","data":[90,7,110,241,21,79,102,236,219,10,124,59,14,147,90,88,86,173,229,195]},"announce":[],"urlList":[]}}