{"title":"Oldboy [2003] [DVDRip] [ENGLISH DUBBED] [DrD]","uid":8047510,"size":1174999040,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5a1f05ab3e918d785a5edf702e6d33068dba6fe2&amp;dn=Oldboy+%5B2003%5D+%5BDVDRip%5D+%5BENGLISH+DUBBED%5D+%5BDrD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"devillain","files":-1,"time":1358784605,"description":"I realize that most people seem to prefer subtitles but for those of you who don't I thought I would release this. To be clear this is an English DUB, if you want subtitles, this is not the torrent for you. Thanks for downloading, and don't forget to seed ;)\n\n~:: DETAILS ::~\n\n:: NAME ::\n Oldboy\n:: COUNTRY ::\n South Korea\n:: CATEGORY ::\n Drama, Mystery, Thriller\n:: LENGTH ::\n 01:59:58\n:: DIRECTOR ::\n Chan-wook Park\n:: FORMAT ::\n Widescreen AVI 704x304 DVDRip\n:: LANGUAGE ::\n English\n:: RELEASE ::\n 2003\n:: SUMMARY ::\n After being kidnapped and imprisoned for 15 years, Oh Dae-Su is released, only to find that he must find his captor in 5 days.\n:: DESCRIPTION ::\nOldboy is a 2003 South Korean thriller film directed by Park Chan-wook. It is based loosely on the Japanese manga of the same name written by Nobuaki Minegishi and Garon Tsuchiya. Oldboy is the second installment of The Vengeance Trilogy, preceded by Sympathy for Mr. Vengeance and followed by Sympathy for Lady Vengeance.\n\n The film follows the story of one Oh Dae-su, who is locked in a hotel room for 15 years without knowing his captor's motives. When he is finally released, Dae-su finds himself still trapped in a web of conspiracy and violence. His own quest for vengeance becomes tied in with romance when he falls for an attractive sushi chef.\n\n The film won the Grand Prix at the 2004 Cannes Film Festival and high praise from the President of the Jury, director Quentin Tarantino. Critically, the film has been well received in the United States, with an 81% &quot;Certified Fresh&quot; rating at Rotten Tomatoes. Film critic Roger Ebert has claimed that Oldboy is a &quot;powerful film not because of what it depicts, but because of the depths of the human heart which it strips bare&quot;. In 2008, voters on CNN named it one of the ten best Asian films ever made. The film currently has a rating of 8.3 on IMDb, being the highest rated Korean film and the 86th best film of all time on IMDb Top 250.\n\n An American remake is planned for release in 2013, which will be directed by Spike Lee, which is dumb, but let's see how that goes...\n\n Anyway, thanks for downloading, now SEED FOR AS LONG AS YOU CAN!!","torrent":{"xt":"urn:btih:5a1f05ab3e918d785a5edf702e6d33068dba6fe2","amp;dn":"Oldboy+%5B2003%5D+%5BDVDRip%5D+%5BENGLISH+DUBBED%5D+%5BDrD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1f05ab3e918d785a5edf702e6d33068dba6fe2","infoHashBuffer":{"type":"Buffer","data":[90,31,5,171,62,145,141,120,90,94,223,112,46,109,51,6,141,186,111,226]},"announce":[],"urlList":[]}}