{"title":"Martian Chronicles 1980 scifi Chromecast x264 MP4","uid":11346713,"size":1278793073,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5a280d5e97e932c21b38c9f3a247b1bf8f66494c&amp;dn=Martian+Chronicles+1980+scifi+Chromecast+x264+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"kromekast","files":-1,"time":1414866646,"description":"The Martian Chronicles, a 3-part mini series adapted from book by Ray Bradbury.\n\n1980 release starring Rock Hudson and Roddy McDowell\n\nVideo files were optimized with WinFF for smooth playback via Google Chromecast. \n\nVideo: H264 ( 576 x 432 ) --- Audio: AAC (m4a) 44100\n\nEpisode 01: The Expeditions -- Episode 02: The Settlers -- Episode 03: The Martians\n\n---\n\nIMDB:\n\nEarth sends its first manned probe to Mars in 1999, and a jealous Martian murders the two astronauts when his wife has erotic dreams of meeting them. Members of a subsequent expedition are hypnotized into believing that they have landed in the childhood community of their leader and have been reunited with deceased family and friends, and they are poisoned by the Martians.\n\nCol. John Wilder leads a third expedition and learns that a chicken pox virus brought to Mars by the first two expeditions has almost eradicated the Martian population. A member of Wilder's team becomes obsessed with protecting Mars from Earthman and murders some of the others in Wilder's party, before Wilder kills him.\n\nColonists arrive on Mars to settle, among them priests seeking God, and a lone Martian masquerades as the most desired persons of various settlers. Global war on Earth reduces man's natal planet to radioactive waste, and most of the settlers returned there prior to the holocaust.\n\nWilder struggles to assemble the remaining humans on Mars, who cope with their loneliness in different ways and will not leave their piece of Mars, before Wilder meets a Martian of past or future who tells him the secret of simple Martian life and convinces him to abandon the Earth lifestyle","torrent":{"xt":"urn:btih:5a280d5e97e932c21b38c9f3a247b1bf8f66494c","amp;dn":"Martian+Chronicles+1980+scifi+Chromecast+x264+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a280d5e97e932c21b38c9f3a247b1bf8f66494c","infoHashBuffer":{"type":"Buffer","data":[90,40,13,94,151,233,50,194,27,56,201,243,162,71,177,191,143,102,73,76]},"announce":[],"urlList":[]}}