{"title":"The Battle for Middle-earth 2 + Witch King + Updates + Camera Fi","uid":6467402,"size":10758163218,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5aa28a27220f4b9ed5239008d06a9c78bd50215e&amp;dn=The+Battle+for+Middle-earth+2+%2B+Witch+King+%2B+Updates+%2B+Camera+Fi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"Sarge Is","files":12,"time":1308010845,"description":"I put it all together with a good mod. I have seen to many comments on old uploads saying this and that dont work.\n\nThis contains it all and works on XP, Vista and Windows 7. LAN Works with bfme2 and witch king. You can play online on Hamachi and so on.\n\nSEED this when you are done and leave comments :)\n\n\nIncludes a mod so the max camera distance is changed. Which makes it MUCH more comfortable to play. Using this mod could be considered cheating by other players whom have the default viewing distance. Consider you may be banned or kick from online communities with servers. Also, not sure if its 100% for all LAN and Online play. If it crashes or similar, you can still start the game without the mod.\nUploaded by me, Cornholio\n\n\nHow to Install: \nAlso on a Notepad in the torrent download files.\n\nFollow these instructions to install:\nLord of the Rings: The Battle for Middle-earth II. With latest patch 1.06\nand\nLord of the Rings: The Battle for Middle-earth II: The Rise of the Witch King. With latest patch 2.01\n\n\n---First: Lord of the Rings: The Battle for Middle-earth II\n\n1. Mount rld-bme2 with daemon-tools.\n\n2. There is a CD-Key Generator inside the iso in the folder named 'Crack'. Use one of the keys.\n\n3. Install the game on your desired location.\n\n4. Install the 'LoTR Update and Fix' (This will update BFME2 to 1.06 and apply the crack.\n\n5. Copy and Paste the 'Maps' Folder and Options.ini thats located inside File Fix Folder to:\nC:\\Users\\USERNAME\\AppData\\Roaming\\My Battle for Middle-earth(tm) II Files\nThis is for Vista and W7, for XP go:\nC:\\Users\\USERNAME\\Application Data\\Roaming\\My Battle for Middle-earth(tm) II Files\n(To see Appdata or Application Data Folders you must have 'Hidden Files Show' On.)\n\n6. OPTIONAL:  Install BFME2-WSEmod-1.0 to change your Camera Max Distance ingame.\nThe Default Camera Distance ingame is very close and makes it hard. With this mod from: http://www.widescreengamingforum.com/wiki/Battle_For_Middle_Earth_2_Camera_Fix,\nwe can change that. WSEmod-1.0 (Widescreen Enchanced is the prefered one. But you can try out THEmod-1.0 (Triplehead Enchanced)\nThis only works with the patched games and these specifics cracks included in this torrent.\n\n7. To play the game with better camera distance you must start the game with the BFME2 Widescreen Enchanced respective\nTriplehead Enchanced. Enjoy.\n\n* To change your resolution to higher or widescreen. You change this in the options.ini you copy and pasted.\n\n\n\n---Second: Lord of the Rings: The Battle for Middle-earth II: The Rise of the Witch King\n\n1. Mount Battle.For.Middle.Earth.2.The.Witch.King with Daemon Tools.\n\n2. CD-Key can be found at the notepad document 'Keygen'\n\n3. Install the game at your desired Location. (Don't put it at the same location as Lord of the Rings: The Battle for Middle-earth II)\n\n4. Install the 2.01 update with the 'LotrBfMe2EP1-131073-english' file.\n\n5. Copy paste the game.dat file inside 'The Witch King 2.01 Crack' Folder to the Destination folder for the game. Paste and Replace.\n\n6. Copy and Paste the 'Maps' Folder and Options.ini thats located inside File Fix Folder to:\nC:\\Users\\USERNAME\\AppData\\Roaming\\My The Lord of the Rings, The Rise of the Witch-king Files\nThis is for Vista and W7, for XP go:\nC:\\Users\\USERNAME\\Application Data\\Roaming\\My The Lord of the Rings, The Rise of the Witch-king Files\n(To see Appdata or Application Data Folders you must have 'Hidden Files Show' On.)\n7. OPTIONAL:  Install RotWK-WSEmod-1.0 or/and RotWK-THEmod-1.0  to change your Camera Max Distance ingame.\n\n8. To play the game with better camera distance you must start the game with the RotWK Widescreen Enchanced respective\nTriplehead Enchanced. Enjoy.\n\n* To change your resolution to higher or widescreen. You change this in the options.ini you copy and pasted.\n\nAlso! :D\nI am just an Uploader. I've put together a few torrents with the right cracks and updates that works since it was hard to get it to work with\nthe torrents that was availible. Also, I included a nice mod to get a better Camera Distance.\nBe AWARE that using the mod can cause you to get kicked banned or called cheater for online gaming. If they now realise you using the mod.\n\nCheers\n\n-Cornholio-\nUploader","torrent":{"xt":"urn:btih:5aa28a27220f4b9ed5239008d06a9c78bd50215e","amp;dn":"The+Battle+for+Middle-earth+2+%2B+Witch+King+%2B+Updates+%2B+Camera+Fi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa28a27220f4b9ed5239008d06a9c78bd50215e","infoHashBuffer":{"type":"Buffer","data":[90,162,138,39,34,15,75,158,213,35,144,8,208,106,156,120,189,80,33,94]},"announce":[],"urlList":[]}}