{"title":"Not My Father's Son: A Memoir - Alan Cumming - Audiobook MP3","uid":11196704,"size":187250309,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5aaec69ce9ec1fb19a7ef5541ac35af0835c7a03&amp;dn=Not+My+Father%27s+Son%3A+A+Memoir+-+Alan+Cumming+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1413101744,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nNot My Father's Son: A Memoir\n\nWritten by: Alan Cumming\nNarrated by: Alan Cumming\nLength: 6 hrs and 28 mins\nUnabridged Audiobook\nRelease Date:10-07-14\n\nDark, painful memories can be like a cage. Or, in the case of Alan Cumming, they can be packed away in a box, stuck in the attic to be forgotten. Until one day the box explodes and all the memories flood back in horrible detail. Alan Cumming grew up in the grip of a man who held his family hostage, someone who meted out violence with a frightening ease, who waged a silent war with himself that sometimes spilled over onto everyone around him. That man was Alex Cumming, Alan's father.\n\nWhen television producers approached Alan to appear on a popular celebrity genealogy show in 2010, he enthusiastically agreed. He hoped to solve a mystery that had long cast a shadow over his family. His maternal grandfather, Tommy Darling, had disappeared into the Far East after WWII. Alan's mother knew very little about him - he had been a courier, carrying information between battalions on his motorbike. The last time she saw her father, Alan's mother was eight years old. When she was 13, the family was informed that he had died by his own hand, an accidental shooting.\n\nBut this was not the only mystery laid before Alan's feet. His father, whom Alan had not seen or spoken to for more than a decade, reconnected just before filming for Who Do You Think You Are? began. He had a secret he had to share, one that would shock his son to his very core and set into motion a journey that would change Alan's life forever.\n\nWith ribald humor, wit, and incredible insight, Alan seamlessly moves back and forth in time, integrating stories from his childhood in Scotland and his experiences today as the celebrated actor of film, television, and stage. At times suspenseful, at times deeply moving, but always incredibly brave and honest, Not My Father's Son is a powerful story of embracing the best aspects of the past and triumphantly pushing the darkness aside.","torrent":{"xt":"urn:btih:5aaec69ce9ec1fb19a7ef5541ac35af0835c7a03","amp;dn":"Not+My+Father%27s+Son%3A+A+Memoir+-+Alan+Cumming+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aaec69ce9ec1fb19a7ef5541ac35af0835c7a03","infoHashBuffer":{"type":"Buffer","data":[90,174,198,156,233,236,31,177,154,126,245,84,26,195,90,240,131,92,122,3]},"announce":[],"urlList":[]}}