{"title":"SCORE Threesomes (The Score Group) [DVDRip]","uid":8915565,"size":1367751589,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5b0342964d997fc9d782ed19f7f8248eb2974464&amp;dn=SCORE+Threesomes+%28The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"chkm8te","files":6,"time":1379133714,"description":"SCORE Threesomes (The Score Group) [DVDRip]\n\nKelly Christiansen, Christy Marks, Eva Notty, Daylene Rio, Brittany O'Neil, Sara Jay, Amber Lynn Bach, Karen Fisher, Carmen Hayes, Sarah Satori\n\nSIX BIG-TIT THREEWAYS WITH 10 CUM-HUNGRY SCORE GIRLS\n\nTall, stacked brunette Eva Notty the 2010 Model of the Year, brings her breast friend, sexy Sarah Satori, into the studio for a wild threesome. The girls worship each other's tits, eat each other's pussy and then share a hard cock, often simultaneously sucking cock and balls. As she gets drilled by a real cock, Eva fucks Sarah from behind with a strap-on.\n\nBlonde bombshells Karen Fisher and 2011 Model of the Year Kelly Christiansen make a lucky boob-man's fantasy come true. He's sitting at home when Karen and Kelly appear before his eyes wearing barely-there lingerie. What's a guy to do? Get sucked off by both girls and take turns fucking their big tits and tight, shaved pussies before cumming on their generously offered racks.\n\nBig-assed Sara Jay and Latina MILF Daylene Rio, two of the nastiest busty porn stars ever, get together for the first time and have their way with a massive rod. Sara sucks cock while Daylene sucks balls, then Sara eats Daylene's shaved cunt while getting drilled from behind, Sara eats Daylene's asshole while Daylene gets fucked from behind, then the girls take turns getting fucked every which way before the guy empties his nuts on their faces. The girls kiss and share cum.\n\nDDD-cup housewife Amber Lynn Bach fucks two guys who definitely are not her husband. There's always a cock in this sexy blonde's mouth and hairy pussy-and usually both-and Amber even turns herself upside-down to get piledrive-fucked. She ends up with a double-dose of cum on her pretty face.\n\nBusty, blonde legend Brittany O'Neil invites two guys into her apartment for a fuck to satisfy her fantasy of having two cocks at once. Brittany changes into fuck-me lingerie that shows off her famous tan lines, then gets her mouth and pussy filled with cock before her new friends cum all over her face. The spunk drips from her chin and onto her tits.\n\nModel of the Decade Christy Marks is watching black n' stacked Carmen Hayes gag on a guy's meat-stick when she's caught in the act. Since she'd rather fuck than watch, Christy joins in, and before long,\nChristy is eating Carmen's pussy while getting fucked, and there's plenty of cock cream for both girls.\n\nThis ain't plain, ordinary bedroom sex! This is wild, raunchy, three-way action with the horniest, busty SCORE Girls. You get six tit-packed, cum-splashed scenes loaded with girls eating pussy while getting fucked, double-dick munching and splooge sharing. Brickhouse blondes Karen Fisher and Kelly Christiansen suck and fuck a hung stud. Model of the Year Eva Notty brings along her friend Sarah Satori for a horny three-way. MILFs Brittany O'Neil and Amber Lynn Bach each get double helpings of hard cock. Latina Daylene Rio and big-assed Sara Jay give a lucky dude the porn-star treatment. And Model of the Decade Christy Marks does a wild three-way with black n' stacked Carmen Hayes. It's SCORE's first threesome DVD!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=85c9gksiwoaxhi3tr162.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=85c9gksiwoaxhi3tr162.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=u4gr3jw67hlc8mjue7oo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=u4gr3jw67hlc8mjue7oo.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5b0342964d997fc9d782ed19f7f8248eb2974464","amp;dn":"SCORE+Threesomes+%28The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b0342964d997fc9d782ed19f7f8248eb2974464","infoHashBuffer":{"type":"Buffer","data":[91,3,66,150,77,153,127,201,215,130,237,25,247,248,36,142,178,151,68,100]},"announce":[],"urlList":[]}}