{"title":"Reason I Jump Naoki Higashida, David Mitchell","uid":8851490,"size":4295236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b07f8859df4a1077aee9665a12917a2c1bf7150&amp;dn=+Reason+I+Jump+Naoki+Higashida%2C+David+Mitchell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":4,"time":1377539302,"description":"A rare and important insight into the mind of an autistic child. 'Composed by a writer still with one foot in childhood, and whose autism was at least as challenging and life-defining as our son's, THE REASON I JUMP was a revelatory godsend. Reading it felt as if, for the first time, our own son was talking to us about what was happening inside his head.'\nWritten by Naoki Higishida when he was only thirteen, this remarkable book explains the often baffling behaviour of autistic children and shows the way they think and feel - such as about the people around them, time and beauty, noise, and themselves. Naoki abundantly proves that autistic people do possess imagination, humour and empathy, but also makes clear, with great poignancy, how badly they need our compassion, patience and understanding.\nDavid Mitchell and his wife have translated Naoki's book so that it might help others dealing with autism, and generally illuminate a little-understood condition. Like The Diving Bell and the Butterfly, it gives us an exceptional chance to enter the mind of another and see the world from a strange and fascinating perspective","torrent":{"xt":"urn:btih:5b07f8859df4a1077aee9665a12917a2c1bf7150","amp;dn":"+Reason+I+Jump+Naoki+Higashida%2C+David+Mitchell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b07f8859df4a1077aee9665a12917a2c1bf7150","infoHashBuffer":{"type":"Buffer","data":[91,7,248,133,157,244,161,7,122,238,150,101,161,41,23,162,193,191,113,80]},"announce":[],"urlList":[]}}