{"title":"Why Nations Fail - Daron Acemoglu and James Robinson","uid":14319503,"size":651100043,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5b09d929eb3cc632dbff234633c2ea98057a7c78&amp;dn=Why+Nations+Fail+-+Daron+Acemoglu+and+James+Robinson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Beanhh123","files":16,"time":1460596482,"description":"Is it culture, the weather, geography? Perhaps ignorance of what the right policies are? \r\n\r\nSimply, no. None of these factors is either definitive or destiny. Otherwise, how to explain why Botswana has become one of the fastest growing countries in the world, while other African nations, such as Zimbabwe, the Congo, and Sierra Leone, are mired in poverty and violence? \r\n\r\nDaron Acemoglu and James Robinson conclusively show that it is man-made political and economic institutions that underlie economic success (or lack of it). Korea, to take just one of their fascinating examples, is a remarkably homogeneous nation, yet the people of North Korea are among the poorest on earth while their brothers and sisters in South Korea are among the richest. The south forged a society that created incentives, rewarded innovation, and allowed everyone to participate in economic opportunities. The economic success thus spurred was sustained because the government became accountable and responsive to citizens and the great mass of people. Sadly, the people of the north have endured decades of famine, political repression, and very different economic institutions—with no end in sight. The differences between the Koreas is due to the politics that created these completely different institutional trajectories","torrent":{"xt":"urn:btih:5b09d929eb3cc632dbff234633c2ea98057a7c78","amp;dn":"Why+Nations+Fail+-+Daron+Acemoglu+and+James+Robinson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b09d929eb3cc632dbff234633c2ea98057a7c78","infoHashBuffer":{"type":"Buffer","data":[91,9,217,41,235,60,198,50,219,255,35,70,51,194,234,152,5,122,124,120]},"announce":[],"urlList":[]}}