{"title":"Pinback - Discography and Solo 1999 - 2012 [FLAC] - Kitlope","uid":9574703,"size":3341400328,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b3630a9c0075983841898dcacd6fdcc5eeffef3&amp;dn=Pinback+-+Discography+and+Solo+1999+-+2012+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Kitlope","files":168,"time":1391687984,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s): udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, udp://tracker.istole.it:6969\nTorrent Hash: 5B3630A9C0075983841898DCACD6FDCC5EEFFEF3\nFile Size: 3.11 GB\nLabels: Touch &amp; Go, Absolutely Kosher, Ace fu, Cutty Shark\n\n\nAlbums, Years &amp; Catalog # in this Torrent:\n\n\nPinback 1999 Ace 007 *\nSome Voices 2000 AK020 *\nBlue Screen Life 2001 Ace 015 *\nOffcell 2003 AK025 *\nSummer in Abaddon 2004 TG237CD *\nToo Many Shadows 2004 no catalog # *\nNautical Antiques  2006 ACE 033 *\nAutumn of the Seraphs 2007 TG300CD *\nInformation Retrieved (not my rip) \n\n\n\n\nRob Crow\n\nOptiganally Yours - Exclusively Talentmaker 2000 (not my rip)\nThe Ladies - They Mean Us 2006 (not my rip)\nRob Crow - He Thinks He's People 2011 (not my rip)\n\n\n\n\nArmistad Burwell Smith IV\n\nThree Mile Pilot - Chief Assasin To The Sinister 1995\n\n\n\n* Denotes My Rip\n\n\n\n\nI would like to thank the original uploader for Information Retrieved. Thanks to whoever you are! EAC/Audiochecker logs included as needed. Also to the original uploaders for the solo material, I'm not including a description for these albums. If anybody has any Three Mile Pilot, Systems Officer, Heavy Vegetable, Physics, Optiganally Yours, Thingy, Goblin Cock, The Ladies and Other Men (yes, these two have quite the solo career), please do make available in FLAC as this stuff is very difficult to find in lossless! This is an updated version of my original torrent from 5 years ago. \n\n\nKit\n\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nPinback is an indie rock band from San Diego, California The band was formed in 1998 by singers, songwriters and multi-instrumentalists Armistead Burwell Smith IV and Rob Crow, who have been its two consistent members. They have released five studio albums and several other releases. The band's moniker is a reference to a character in the 1974 film Dark Star (played by Dan O'Bannon, who also co-wrote the film), directed by John Carpenter. Audio samples from this film are used frequently in the band's early works.\n\nIn 2004, Pinback signed to Touch and Go Records.[1] They released their third album, Summer in Abaddon, later that year. Pinback's fourth full-length album, Autumn of the Seraphs, was released on September 11, 2007.[2][3] The band also recently released a collection of rarities, entitled Nautical Antiques. They appeared live in a nationally broadcast interview and played a couple of songs on NPR's Talk of the Nation on October 8, 2007. The program is available for download via NPR's website. On April 1, 2009, it was announced that Pinback was working on a new album that would be released by Temporary Residence Ltd. Their fifth studio album, Information Retrieved, was released October 16, 2012.[4] On August 15, 2012, Pinback released the song &quot;Proceed to Memory&quot; from Information Retrieved free to play through RollingStone.com.[5]\n\nSmith and Crow have been the band's two consistent members. They are typically joined by a drummer, currently Chris Prescott. Tom Zinser and Mario Rubalca have previously contributed drums. Other past members of the Pinback live band are: Erik Hoversten, Braden Diotte, Terrin Durfey, Ryan Bromley, Cameron Jones, Kenseth Thibideau, Brent Asbury, Tom Zinser, Gabriel Voiles, Dmitri Dziensuwski, Donny Van Zandt, and Thatcher Orbitashi. \n\n\n\n\n\n\nEnjoy Pinback :)\n","torrent":{"xt":"urn:btih:5b3630a9c0075983841898dcacd6fdcc5eeffef3","amp;dn":"Pinback+-+Discography+and+Solo+1999+-+2012+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b3630a9c0075983841898dcacd6fdcc5eeffef3","infoHashBuffer":{"type":"Buffer","data":[91,54,48,169,192,7,89,131,132,24,152,220,172,214,253,204,94,239,254,243]},"announce":[],"urlList":[]}}