{"title":"Clinical Consult to Psychiatric Nursing for Advanced Practice [S","uid":11253854,"size":3110509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b479042ae0852e6ea5c2652f40c1fe61d7ce9e9&amp;dn=Clinical+Consult+to+Psychiatric+Nursing+for+Advanced+Practice+%5BS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":-1,"time":1413870532,"description":"TITLE/EDITION Clinical Consult to Psychiatric Nursing for Advanced Practice \nAuthor: y Jacqueline Rhoads, Patrick Murphy \nPaperback: 648 pages\nPublisher: Springer Publishing Company; 1 edition (August 29, 2014)\nLanguage: English\nISBN-10: 0826195954\nISBN-13: 978-0826195951\nFormat: Retail PDF\n\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nThis is the only advanced practice guide to provide an overview of the major DSM-5 disorders across the lifespan and complete clinical guidelines for their psychopharmacologic management. It has been compiled by expert practitioners in psychiatric care and is designed for use by nurse practitioners and other primary caregivers in clinical practice.\n\nThe guide is organized in an easy-to-access format with disorders for which drugs can play a significant therapeutic role. The listing for each disorder includes clinical features and symptoms, as well as information about the most current and effective drugs for management. A clearly formatted table identifies the first and second lines of drug therapy along with adjunctive therapies for each disorder. Drugs are organized according to classification, and each listing provides the essential information needed to safely prescribe and monitor a patient's response to a particular drug. Brand and generic names, drug class, customary dosage, side effects, drug interactions, pharmacokinetics, precautions, and management of special populations are addressed. Convenient, practical, and portable, this guide will be a welcome and frequently used resource.\n\nKey Features:\n\nPresents psychopharmacological treatment guidelines for major DSM-5 disorders and parameters for use of each drug\nPrioritizes drugs according to their clinical efficacy and recommended treatment algorithms\nIncludes brand and generic names, customary dosages, side effects, drug interactions, pharmacokinetics, precautions, and management of special populations\nProvides easy-to-read tables for quick clinical consultation\nOffers information on clinical algorithms, lab evaluation, and preventive services","torrent":{"xt":"urn:btih:5b479042ae0852e6ea5c2652f40c1fe61d7ce9e9","amp;dn":"Clinical+Consult+to+Psychiatric+Nursing+for+Advanced+Practice+%5BS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b479042ae0852e6ea5c2652f40c1fe61d7ce9e9","infoHashBuffer":{"type":"Buffer","data":[91,71,144,66,174,8,82,230,234,92,38,82,244,12,31,230,29,124,233,233]},"announce":[],"urlList":[]}}