{"title":"The Kill Switch Tucker Wayne #1 (James Rollins) [Itzy]","uid":10141044,"size":12891677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b9c4de3899422055ce00bbafd2faa902e7be5c6&amp;dn=The+Kill+Switch+Tucker+Wayne+%231+%28James+Rollins%29+%5BItzy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Itzy","files":7,"time":1399997385,"description":"Who does the U.S. government call upon when a mission requires perfect stealth, execution, and discretion?\n\nFrom the two bestselling masters of action and political intrigue, James Rollins and Grant Blackwood, comes the first in a groundbreaking new series, featuring Captain Tucker Wayne and his stalwart military dog, Kane, both ripped from the pages of Sigma Force for their first solo adventure. It will take this uniquely talented pairing of man and beast to discover the earth-shattering truth behind . . .\n\nThe Kill Switch \n\nThe mission seems simple enough: extract a pharmaceutical magnate from Russian soil, a volatile man who holds the secret to a deadly bioweapon. But nothing is as it appears to be. A desperate call from Painter Crowe, director of Sigma Force, thrusts Tucker and Kane into a frantic race to rescue the brilliant-but-deluded Abram Bukolov from a cadre of skilled assassins, a deadly team backed by a shadowy Russian general, a figure bent on revenge and power.\n\nHunted and betrayed at every turn, Tucker and Kane must discover the truth behind a biological threat, a horror out of the ancient past that can be weaponized to terrorize the modern world. The journey of discovery will take the pair across the frozen steppes of Russia to the sun-blasted savannahs of South Africa, from the war-torn mountains of Namibia to the snowy Great Lakes of the United States.\n\nAs time rapidly runs out, the deep and intimate bond between dog and soldier will be tested to the extreme. It will take all of their skill, talent, and, most of all, trust in each other to piece together a mystery going back to the origins of life on Earth, to discover the key to an ancient peril that can destroy the heartland of America, and, with it, the world.","torrent":{"xt":"urn:btih:5b9c4de3899422055ce00bbafd2faa902e7be5c6","amp;dn":"The+Kill+Switch+Tucker+Wayne+%231+%28James+Rollins%29+%5BItzy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b9c4de3899422055ce00bbafd2faa902e7be5c6","infoHashBuffer":{"type":"Buffer","data":[91,156,77,227,137,148,34,5,92,224,11,186,253,47,170,144,46,123,229,198]},"announce":[],"urlList":[]}}