{"title":"The Politically Incorrect Guide to Islam- Robert Spencer","uid":14611603,"size":1349913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5baca8b6299bbbb5eeaf0a688f6541a025ae8d8a&amp;dn=The+Politically+Incorrect+Guide+to+Islam-+Robert+Spencer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"onh4","files":5,"time":1463157052,"description":"Islam expert Robert Spencer reveals Islam's ongoing, unshakable quest for global conquest and why the West today faces the same threat as the Crusaders did--and what we can learn from their experience. \r\n&quot;A clarion call for the defense of the West before it is too late.&quot; -- Ibn Warraq, author\r\n&quot;A much-needed antidote to the poisonous propaganda that compromises our current battle against jihadist murder.&quot; -- Bruce Thornton, historian\r\n&quot;An enormous amount of well-researched material. Throws the ball back into the camp of Arabist historians.&quot; -- Walid Phares, terror analyst \r\n&quot;Assails, with much erudition, the taboos imposed by the Politically Correct League.&quot; -- Bat Ye'or, historian \r\n&quot;The courageous Robert Spencer busts myths and tells truths about jihadists that no one else will tell.&quot; -- Michelle Malkin, bestselling author and columnist\r\n\r\n[b]Bonus book\r\nThe Complete Infidel's Guide to Isis - Robert Spencer\r\n\r\n\r\nISIS rocketed onto the world stage seemingly out of nowhere, beheading American hostages, bulldozing international borders, routing the American-trained Iraqi Army, and carving out a new state that rules eight million people. Now, after the shocking San Bernardino and Paris attacks, it has become devastatingly clear that no one is safe from the threat of ISIS. The group has managed to radicalize and recruit Muslims all over the world and is staging an all-out &quot;holy war&quot; against the West, while U.S. leaders remain stumped. In The Complete Infidel's Guide to ISIS, New York Times bestselling author Robert Spencer reveals the terrifying inner workings of the Islamic State--its successful recruitment program, how it is financing its expansion, and the ideology that is driving its success. As Spencer explains, the Islamic State has taken the first steps on the path to becoming a serious world power--steps that Osama bin Laden and al-Qaeda dreamed of but were afraid to take. The Complete Infidel's Guide to ISIS is your one-stop easy reference for all you need to know about ISIS--including how &quot;infidels&quot; can stop its reign of terror.\r\n\r\nPlease seed. Thanks","torrent":{"xt":"urn:btih:5baca8b6299bbbb5eeaf0a688f6541a025ae8d8a","amp;dn":"The+Politically+Incorrect+Guide+to+Islam-+Robert+Spencer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5baca8b6299bbbb5eeaf0a688f6541a025ae8d8a","infoHashBuffer":{"type":"Buffer","data":[91,172,168,182,41,155,187,181,238,175,10,104,143,101,65,160,37,174,141,138]},"announce":[],"urlList":[]}}