{"title":"Aaron Lewis of STAIND - Town Line (LOSSLESS)","uid":6213385,"size":349326223,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5beb0f7283aaf88cfd56b42826ccd0a054e9e417&amp;dn=Aaron+Lewis+of+STAIND+-+Town+Line+%28LOSSLESS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"nightcrawler218","files":8,"time":1299026722,"description":"\\'These songs are country in the sense of classic Americana\\', says Staind frontman Aaron Lewis of the music on his debut solo release, Town Line. \\'They\\'re simple, understandable, and founded on t quality songwriting. If you put a country accompaniment to any of the songs that I\\'ve written over the years on my acoustic, all of them would work as country tunes. I always write and play the same way. The only difference here is the accompaniment.\\'\n\nAnd country music comes naturally for Aaron Lewis. In fact, the Staind frontman never strayed very far from country. It\\'s something that he grew up with. It\\'s something that he comes back to. It\\'s something that inspires him. It\\'s something that\\'s in his blood.\n\nLewis recorded his solo debut in Nashville during early 2010, and it brandishes the singer\\'s trademark style and a distinct country soul. Produced by Grammy award winning James Stroud and Lewis, this collection proudly sits alongside Lewis\\'s numerous accolades. With Staind, he crafted the most-played rock song of the decade \\'It\\'s Been Awhile, sold 13 million albums worldwide, has four consecutive Top 3 debuts on the Billboard 200, and released multiple cross-format radio hits. Listeners, however, haven\\'t heard him like this until now.\n\nUltimately, Lewis is giving listeners something that he always does. There\\'s a tangible honestly to all of these songs, and he opens up with every guitar chord and lyric. \\'I\\'ve always stayed true to how I feel in my songs,\\' he says. \\'I love this country, and I feel like I\\'ve gotten to live the American dream. I m genuinely blessed to have this opportunity, and I m glad to celebrate that classic country spirit with this new music.\\'\n\n\nTrack List:\n1. The Story Never Ends\n2. Vicious Circles\n3. Country Boy\n4. Tangled Up In You\n5. Massachusetts\n6. Country Boy (Radio Edit)\n7. Country Boy (Acoustic Version)\n\nENJOY...!!!","torrent":{"xt":"urn:btih:5beb0f7283aaf88cfd56b42826ccd0a054e9e417","amp;dn":"Aaron+Lewis+of+STAIND+-+Town+Line+%28LOSSLESS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5beb0f7283aaf88cfd56b42826ccd0a054e9e417","infoHashBuffer":{"type":"Buffer","data":[91,235,15,114,131,170,248,140,253,86,180,40,38,204,208,160,84,233,228,23]},"announce":[],"urlList":[]}}