{"title":"Nanophysics of Solar and Renewable Energy - Edward L. Wolf","uid":12008760,"size":7161182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c2a2d4dcc3fd12fea46f439f730d086c9717427&amp;dn=Nanophysics+of+Solar+and+Renewable+Energy+-+Edward+L.+Wolf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1434044357,"description":"ISBN 9783527410521\n\nThis easy accessible textbook provides an overview of solar to electric energy conversion, followed by a detailed look at one aspect, namely photovoltaics, including the underlying principles and fabrication methods. Professor Wolf, an experienced author and teacher, reviews such green technologies as solar-heated-steam power, hydrogen, and &quot;artificial leaf&quot; approaches, as well as nuclear fusion. Throughout the book, carefully chosen, up-to-date examples are used to illustrate important concepts and research tools.\nThe opening chapters give a broad and exhaustive survey of long term energy resources, reviewing current and potential types of solar driven energy sources. The core part of the text on solar energy conversion discusses different concepts for generating electric power, followed by a profound presentation of the underlying semiconductor physics and rounded off by a look at efficiency and third-generation concepts. The concluding section offers a rough analysis of the economics relevant to the large-scale adoption of photovoltaic conversion with a discussion of such issues as durability, manufacturability and cost, as well as the importance of storage.\nThe book is self-contained so as to be suitable for students with introductory calculus-based courses in physics, chemistry, or engineering. It introduces concepts in quantum mechanics, atomic and molecular physics, plus the solid state and semiconductor junction physics needed to attain a quantitative understanding of the current status of this field. With its comments on economic aspects, it is also a useful tool for those readers interested in a career in alternative energy","torrent":{"xt":"urn:btih:5c2a2d4dcc3fd12fea46f439f730d086c9717427","amp;dn":"Nanophysics+of+Solar+and+Renewable+Energy+-+Edward+L.+Wolf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c2a2d4dcc3fd12fea46f439f730d086c9717427","infoHashBuffer":{"type":"Buffer","data":[92,42,45,77,204,63,209,47,234,70,244,57,247,48,208,134,201,113,116,39]},"announce":[],"urlList":[]}}