{"title":"The Billion Dollar Mistake: Learning the Art of Investing Throug","uid":8214596,"size":1543828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c32ab12687596073a4be93ff2cc11401ccf48dc&amp;dn=The+Billion+Dollar+Mistake%3A+Learning+the+Art+of+Investing+Throug&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1362317338,"description":"Important investment lessons gleaned from the mistakes of accomplished professional investors and billionaire businessmen\n\nThe Billion Dollar Mistake is an up-close account of the career-defining mistakes that some of the world's most brilliant billionaire investors have made, and a revealing look at what we can learn from them. Drawing on author Stephen Weiss' twenty-two years experience at some of Wall Street's most prestigious firms, the core of this book is based upon original research and interviews with these legendary investors, who discuss the most significant trade or investment that went against them, the magnitude of the loss, its effect on their businesses-and on their personal lives. To some, these fascinating accounts will read like a novel; to others, it will be a treasured and unique investment guide.\n\nThis intriguing book skillfully examines the causal relationship between the quirks of each investor's personality and the mistakes they have committed. Along the way, Weiss provides a series of compelling narrative accounts of the individuals' road to success, the particular mistakes they made, the character flaws that led to them, and the lessons learned. While some investors made errors of judgment, others made errors of perception. The Billion Dollar Mistake\n\nUncovers important lessons learned from the failures of some of the most enduring and accomplished investors, including Kirk Kerkorian, Bill Ackman, Aubrey McClendon and Leon Cooperman\nDiscusses how to incorporate these lessons into your investment discipline and avoid the same missteps\nReveals common mistakes made by bigger investors that the average investor can relate-the only difference is in magnitude with more zeros attached to the loss\nIncludes insights on improving your investment endeavors by refining your approach to today's markets\nLearning from the missteps of the best in the investment business can help you succeed. With The Billion Dollar Mistake, you'll discover how.\n","torrent":{"xt":"urn:btih:5c32ab12687596073a4be93ff2cc11401ccf48dc","amp;dn":"The+Billion+Dollar+Mistake%3A+Learning+the+Art+of+Investing+Throug","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c32ab12687596073a4be93ff2cc11401ccf48dc","infoHashBuffer":{"type":"Buffer","data":[92,50,171,18,104,117,150,7,58,75,233,63,242,204,17,64,28,207,72,220]},"announce":[],"urlList":[]}}