{"title":"Civilization V Trainer v 4.1.3","uid":6768283,"size":19492,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5cb59b632283811eabb1aa7c459f5258fa924be6&amp;dn=Civilization+V+Trainer+v+4.1.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"DelphiUniverse","files":-1,"time":1319477557,"description":"Civilization V Trainer v 4.1.3 for Civilization 5 v 1.0.1.348 ..by DelphiUniverse\n\n-------------\n4.1.3 Changes\n-------------\n\n* Tiny bug fix in about window\n* Changed font in about window\n* Changed text in about window\n\n (See Changelog.txt for all changes since version 4.0)\n\n-----\nWOW64\n-----\n\nWOW64 is an emulation software layer that emulates x86 applications on 64 bit windows.\nSome people report problems when running trainer using this layer, but I can confirm\nthat this trainer works flawlessly on win32 platforms.\n\n-------------\nAbout Trainer\n-------------\n\nThis trainer is designed to work with Civilization 5 v 1.0.1.348\nDirectX 9 and DirectX 11.\n\nDo not attempt to use it with earlier or future versions of the game.\nIt will contaminate and corrupt memory if you do.\n\nThis trainer will give you the following:\n\n* Gold\n* Golden Age Progress\n* Golden Age Turns\n* Culture\n* Strategic Resources\n* Luxury Resources\n* Clear spent resource slots\n* Great General\n* Unit Experience\n* Movement\n* Heal units\n* City Modifier\n* Full hotkey support\n* Customizable (See Settings.ini)\n\n------------\nInstallation\n------------\n\n1. Create a new folder anywhere you like.\n2. Extract archive into that folder.\n3. Done.\n\n----------\nHow to use\n----------\n\nStart Trainer or Game in any order you like\n\n--------------\nRun Priorities\n--------------\n\nHere is a detailed description of how the trainer manages priorities, both on the trainer and civilization:\n\nWhen trainer is Un-Focused:  Trainer gets a very low priority and Civilization gets the highest priority setting.\nWhen trainer is Focused: Trainer get normal priority and Civilization gets idle priority.\n\n---------------\nSwitched Cheats\n---------------\n\nBEWARE: Always turn off switched cheats before making another turn. ALT + BACKSPACE will quickly turn off all switched cheats.\n\n1: MOVEMENT SWITCH:\nThis cheat gives unlimited movement points to units. Set initial movement points in the editbox, this is not necessary as it already is set to a good initial value.\n\n2: EXPERIENCE SWITCH:\nThis cheat gives experience to units. Set the experience value you want in the editbox then click your units you want to apply this value upon, one after another. You only need to click them once, you can also scroll quickly through all units with the arrow buttons.\n\n3: HEALING SWITCH:\nThis cheat will set health points on your units. Set the health point you want in the editbox on the left side (it can be in the range of 0-10 where 0 is no health and 10 is full health) Then click all units you want to set this health value upon.\n\n4: CITY MODIFIER SWITCH:\nThis is probably the most complex cheat to use. (It's really not that complex). This cheat will set the city modifier value (it is in percentage %).\n\nIt will set the modifier value on 3 things: Production, Science and Gold. To have this cheat work you will need to buy OR sell a building that affects any of these 3 areas. Thats it.\n\nQuick hints: I recommend buying:\n\nUniversity\t(to enable modifier for science)\nFactory\t\t(to enable production modifier)\nStock Exchange\t(to enable gold modifier)\n\nYou can also sell buildings that affects these areas, the modifier will update that way too.\n\n-------\nHotkeys\n-------\n\nALT + F1\t\t= Movement Cheat\nSHIFT + ALT + F1\t= Movement Cheat with zero movement points\n\nALT + F2\t\t= Experience\nALT + F3\t\t= Healing\nALT + F5\t\t= Modifier (Science,Production and Gold)\n\nALT + F12\t\t= Shut down trainer remotely (Dropping melody will be played)\n\nALT + BACKSPACE\t\t= Turn off all cheat switches\n\nALT + INSERT\t\t= Resources\t(Set value to value found in Settings.ini)\nALT + HOME\t\t= Gold\t\t(Set value to value found in Settings.ini)\nALT + PAGEUP\t\t= Culture\t(Set value to value found in Settings.ini)\nALT + DELETE\t\t= Golden Prog\t(Set value to value found in Settings.ini)\nALT + END\t\t= Golden Turns  (Set value to value found in Settings.ini)\nALT + PGDOWN\t\t= Great General (Set value to value found in Settings.ini)\n\nSHIFT + ALT + INSERT\t= Zero out Resources\nSHIFT + ALT + HOME\t= Zero out Gold\nSHIFT + ALT + PAGEUP\t= Zero out Culture\nSHIFT + ALT + DELETE\t= Zero out Golden Progress\nSHIFT + ALT + END\t= Zero out Golden Turns\nSHIFT + ALT + PGDOWN\t= Zero out Great General Progress\n\nALT + LEFT\t\t= Free all used resource slots\nALT + RIGHT\t\t= Zero all (Will zero out the following):\n\t\t\t\t1: Gold\n\t\t\t\t2: Golden Age Progress\n\t\t\t\t3: Golden Age Turns\n\t\t\t\t4: Culture\n\t\t\t\t5: All Strategic and Luxury Resources\n\t\t\t\t6: Great General Progress\n\n---------------\nUpDown Controls\n---------------\n\nI have added Up-Down controls to all edit boxes in the program.\nYou may change values in an edit box in many ways:\n\n1: Click a button to choose a predefined value.\n2: Click the edit box and type a custom value.\n3: Click the up-down control buttons to change values.\n4: Use the up-down arrow keys on your keyboard.\n5: Use mouse wheel to change values.\n\n---------------\nTroubleshooting\n---------------\n\nQ1: Trainer doesnt work?\nA1: Use only with Civ 5 version 1.0.1.348. It will not work with other versions.\n\nQ2: Trainer still doesnt work?\nA2: Your firewall/antivirus blocked it or sandboxed it. Unblock it, shut down trainer and restart it again\n\nQ3: Trainer is still not working?\nA3: The 6 primary cheats will only update after you click a city or any operations that updates the display\n\nQ4: I use WinXP and the trainer runs and quits almost instantly?\nA4: Try to run it using Win98 Compatability mode.\n\nQ5: The trainer is running with very high cpu activity, why?\nA5: The keyboard polling routine is responsible for this, it will be lowered to 0, 1 or 2 percent cpu usage as soon as the trainer window loses focus. This is nothing to worry about. Read &quot;Run Priorities&quot; further up in this readme for more information about this.\n\n--------\nFeedback\n--------\n\nPlease report new suggestions and bug reports here on CivFanatics or on ThePirateBay.org where you can find me under\nthe name of DelphiUniverse. Send an e-mail to the address found in the .rar archive comment section.\n\n------\nAuthor\n------\n\nCoded by DelphiUniverse using Microsoft Macro Assembly.\n\nMy favorite coding equipment:\n\n* SteelSeries 7G keyboard (Nothing close to it, nothing above it)\n* 26&quot; 2ms screen for coding happiness\n","torrent":{"xt":"urn:btih:5cb59b632283811eabb1aa7c459f5258fa924be6","amp;dn":"Civilization+V+Trainer+v+4.1.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cb59b632283811eabb1aa7c459f5258fa924be6","infoHashBuffer":{"type":"Buffer","data":[92,181,155,99,34,131,129,30,171,177,170,124,69,159,82,88,250,146,75,230]},"announce":[],"urlList":[]}}