{"title":"Microemulsions - Theory and Practice - Leon M. Prince","uid":16018824,"size":4947817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cfd97c4be757ad4c0874e2180b39bc571a054d4&amp;dn=Microemulsions+-+Theory+and+Practice+-+Leon+M.+Prince&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1476320749,"description":"Microemulsions - Theory and Practice - Leon M. Prince (AP, 1977).pdf\r\n\r\nMicroemulsions: Theory and Practice covers the development of the theory and practice of microemulsion systems. This book is divided into seven chapters that explore the physics and chemistry of microemulsions. \r\nThis book deals first with the commercial history of microemulsions, from the discovery of carnauba wax emulsions to polymer emulsions. This topic is followed by discussions on the theoretical aspects of microemulsion formulation techniques and the design of other products. The subsequent chapter describes the microemulsion formulation with less solubilizer or emulsifier together with their optical properties. A chapter examines the mixed film theory that explains the dispersions, oil-water interface, and inferences in microemulsions. Another chapter considers the role of microemulsions in micellar solutions and their relations to the concentrations of different compounds. This chapter also looks into the association phenomena of three-component phase equilibria diagrams and liquids crystals to microemulsions. The concluding chapter discusses the role of the capillary and hydrostatic forces on the entrapment of oil in the reservoir and the necessary conditions for the displacement of entrapped oil. The important properties and economic aspects of a microemulsion slug required for the tertiary oil recovery are also covered in this chapter","torrent":{"xt":"urn:btih:5cfd97c4be757ad4c0874e2180b39bc571a054d4","amp;dn":"Microemulsions+-+Theory+and+Practice+-+Leon+M.+Prince","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cfd97c4be757ad4c0874e2180b39bc571a054d4","infoHashBuffer":{"type":"Buffer","data":[92,253,151,196,190,117,122,212,192,135,78,33,128,179,155,197,113,160,84,212]},"announce":[],"urlList":[]}}