{"title":"The Complete Works of William Shakespeare.epub","uid":8584771,"size":2248432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d72f16e6823c031dd86a12e74f267c3426fca90&amp;dn=The+Complete+Works+of+William+Shakespeare.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1371502761,"description":"The Complete Works of William Shakespeare is a parody of the plays written by William Shakespeare with all of them being performed (in shortened form) during the show by only three actors. Typically, the actors use their real names and play themselves rather than certain characters. The fourth wall is non existent in the performance with the actors speaking directly to the audience during much of the play, and some scenes involve audience participation. The director and stage crew may also be directly involved in the performance and become characters themselves.\n\nThe script contains many humorous footnotes on the text that are often not included in the performance. However, improvisation plays an important role and it is normal for the actors to deviate from the script and have spontaneous conversations about the material with each other or the audience. It is also common for them to make references to pop culture or to talk about local people and places in the area where performance is done. As a result, each performance can be vastly different from another, even with the same cast.\n\nThe play was written by Adam Long, Daniel Singer, and Jess Winfield, former founding members of the Reduced Shakespeare Company, and first performed at the Edinburgh Festival Fringe in 1987 and later played at the Criterion Theatre in London, where it ran for nine record-breaking years. It has become one of the world's most popular shows, playing frequently in a variety of languages. It is notable for holding the (self-proclaimed) world record for the shortest-ever performance of Hamlet, clocking in at 43 seconds, as well as the fastest performance of Hamlet backwards, at 42 seconds.","torrent":{"xt":"urn:btih:5d72f16e6823c031dd86a12e74f267c3426fca90","amp;dn":"The+Complete+Works+of+William+Shakespeare.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d72f16e6823c031dd86a12e74f267c3426fca90","infoHashBuffer":{"type":"Buffer","data":[93,114,241,110,104,35,192,49,221,134,161,46,116,242,103,195,66,111,202,144]},"announce":[],"urlList":[]}}