{"title":"Wild.At.Heart.S01E01-S01E06-Complete Season 1 (2006)","uid":4855421,"size":2223908911,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5dd44df19b95eb69c040a1ec8e47e3cc7e43a119&amp;dn=Wild.At.Heart.S01E01-S01E06-Complete+Season+1+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xWaffles","files":-1,"time":1240048152,"description":"Wild at Heart Complete Season 1\n\nThanks to sweep1978 from Demonoid for this torrent!\n\nNote: This is not a DVD Rip files are 608 x 352, 25 FPS, Xivd encoded from standard definition TV source.\n\nEpisode 1\nDanny and Sarah set out to build a new life for themselves and their children amid the teeming wildlife of the African plains.\n\nEpisode 2\nAs Danny considers signing a binding business contract, Sarah is appalled to learn the reserve would have fierce competition in the form of a nearby rival. Evan and Du Plessis accidentally run over a cheetah on the way to buy supplies - but the events of the day pale into insignificance when Olivia is bitten by a snake.\n\nEpisode 3\nThe arrival of Evan and Olivia's father throws the family into turmoil. He is determined to take his kids back to England with him and threatens to go to court to get custody. Sarah is furious - he wasn't thinking of them when he left her for his secretary. Rosie can't hide her delight that they might all be going home, but when a drunken fight breaks out in a bar, she is rescued by Tate.\n\nEpisode 4\nEvan and Olivia run away after a series of rows, leaving Sarah to search for her children alone while Danny and Du Plessis go looking for a half-drugged lioness. While tracking the animal, they crash the truck - putting the warden in need of an emergency operation.\n\nEpisode 5\nSarah is forced to ask Tate for help when the first paying guests arrive early at a chaotic Leopard's Den, but a string of unfortunate misunderstandings at the rival reserve convinces Rosie her stepmother is having an affair. A rampaging group of rogue male elephants are damaging the land, so Danny introduces an older female animal to keep them in line.\n\nEpisode 6\nDanny is concerned that poachers may be in the area and when he finds one of his zebras has been killed, he and Du Plessis stake out the grazing area. They find more dead animals, but these were not killed by poachers. Tests reveal anthrax is the cause and Danny imposes a quarantine on Leopards Den. Sarah is upset by her friend Izzy and goes looking for a missing lion cub, but she collapses. The family must wait to see whether Sarah has anthrax or is just allergic to the vaccine.","torrent":{"xt":"urn:btih:5dd44df19b95eb69c040a1ec8e47e3cc7e43a119","amp;dn":"Wild.At.Heart.S01E01-S01E06-Complete+Season+1+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dd44df19b95eb69c040a1ec8e47e3cc7e43a119","infoHashBuffer":{"type":"Buffer","data":[93,212,77,241,155,149,235,105,192,64,161,236,142,71,227,204,126,67,161,25]},"announce":[],"urlList":[]}}