{"title":"Fingertip Handstands- The One-Finger Zen Training Method","uid":9757821,"size":411955130,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5dd7b05ef7f10de45897ba044d44922e26b1c9a5&amp;dn=Fingertip+Handstands-+The+One-Finger+Zen+Training+Method&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"acer47x","files":-1,"time":1394765846,"description":"bout the Actor\nMaster Alexander Tao developed this modern art of fighting for real-life and street fighting situations. Master Tao holds a Guinness Book of World Records and is a master of Shaolin Temple Wudang Mountain and Liang Mountain. Jing Quan Dao is Master Tao's masterpiece. He devoted 20 years researching, developing and training until he arrived at Jing Quan Dao, a powerful art of kickboxing.\n\nJing Quan Dao techniques are the amalgamation of the many potent styles of Kung Fu. Master Tao's scientific research on Jing Quan Dao includes the famous eight training systems, whose purpose is to promote both a trainee's inner strong mind and outer toughness. The effectivity of five of Jing Quan Dao's features have been demonstrated in body sculpting, self-defense, kickboxing and in-ring contests, Kung Fu roles in films, high energy on-stage martial arts shows and Qi Kung treatment to disease. Not only is Jing Quan Dao noted for its elegant and quick body movement arts, it is also a powerful weapon in itself in a trainer's mind and body.\nDemonstrations of Jing Quan Dao have been performed in many countries. Not only that, Jing Quan Dao has been extensively endorsed as well as given commendation by the Kung Fu circle and produced champions. Through Jing Quan Dao, various Chinese stunts with histories that date back to over a few thousand years are being rediscovered. In addition, Jing Quan Dao has made significant contributions towards the development of Kung Fu all over the world.\n\n\nOne-finger Zen is a rare and unique skill that is used to strengthen fingertips for pressure point attacks. Legend attributes this powerful method to Shaolin Temple. Masters of One-finger Zen can perform all sorts of amazing feats, such as fingertip push-ups and even handstands. Grandmaster Alex Tao, the founder of the Chinese military fighting method Jing Quan Dao, is a leading master of One-finger Zen. His fingertip feats have earned him a place in the Guinness Book of World Records. Coupled with his highly-effective combat system, One-Finger Zen is a devastating method of self defense. ","torrent":{"xt":"urn:btih:5dd7b05ef7f10de45897ba044d44922e26b1c9a5","amp;dn":"Fingertip+Handstands-+The+One-Finger+Zen+Training+Method","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dd7b05ef7f10de45897ba044d44922e26b1c9a5","infoHashBuffer":{"type":"Buffer","data":[93,215,176,94,247,241,13,228,88,151,186,4,77,68,146,46,38,177,201,165]},"announce":[],"urlList":[]}}