{"title":"Peter Rollins - 4 books on postmodern theology","uid":8521378,"size":5078771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5deff8eb8d0bad90c9d60a64773103b10a8b30e9&amp;dn=Peter+Rollins+-+4+books+on+postmodern+theology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369926812,"description":"Four books by Peter Rollins, the Irish theologian/philosopher/provocateur.\n\nHow (Not) to Speak of God (pdf)\nThe Fidelity of Betrayal: Towards a Church Beyond Belief (pdf)\nThe Orthodox Heretic: And Other Impossible Tales (epub, mobi)\nInsurrection: To Believe Is Human to Doubt, Divine (epub, mobi)\n\n\npart of the description of his work on wikipedia:\n\nRollins' work is marked by the themes of doubt, complexity, unknowing and embracing brokenness. More than this, he has been interested in showing that these themes are central to the founding event of Christianity. He is interested in showing how the central scandal of Christianity offers us a critique of religion (including the need to believe) and tribal identity, both of which have been lost in the actually existing church; an institution that he argues represents a fundamental betrayal of the insurrectionary power of faith. His work is an attempt to show that Christianity does not rest on theistic belief, some commitment to supernaturalism or the affirmation of some set of dogmas. Rollins has named his theological program pyrotheology. The name was inspired by the Spanish anarchist Buenaventura Durruti's statement that &quot;the only church that illuminates is a burning church.&quot;\n\n\nThe wikipedia article is interesting, but makes Rollins sounds more like a Continental philosopher than he really is. Try watching some of his videos on youtube -- they're more playful, like his books.\n\nThe more I read Rollins, the more I like him.","torrent":{"xt":"urn:btih:5deff8eb8d0bad90c9d60a64773103b10a8b30e9","amp;dn":"Peter+Rollins+-+4+books+on+postmodern+theology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5deff8eb8d0bad90c9d60a64773103b10a8b30e9","infoHashBuffer":{"type":"Buffer","data":[93,239,248,235,141,11,173,144,201,214,10,100,119,49,3,177,10,139,48,233]},"announce":[],"urlList":[]}}