{"title":"Dynamic Mechanical Analysis for Plastics Engineering","uid":15552821,"size":61291231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f1676add20b9d821e6808b33fec45ab22ce3a4b&amp;dn=Dynamic+Mechanical+Analysis+for+Plastics+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471041037,"description":"Dynamic Mechanical Analysis for Plastics Engineering - Michael P. Sepe (WA, 1998).pdf\r\n\r\nThis handbook contains flexural loss and storage moduli and tan delta for over 120 commercial thermoplastics plotted against temperature. Thermoplastics are identified by trade name and grade and are classified using generic family and chemical type information available. All major generic families are present, including Polycarbonates, Nylons, and Polyesters. The data is given for temperature ranges starting with -50 C and ending at the melting/softening point of a thermoplastic. Each type of curve, e.g., loss modulus vs. temperature, can be accessed in two ways. There are graph tables that contain information about only one material. In these tables one to twelve materials can be selected and a pop up window will display the graphical information. The graph tables have hotlinks to original images, each containing a complete set of curves, loss and storage moduli, and tan delta for a given grade. The images contain additional information on test conditions and X, Y values for characteristic points, such as glass transition. The curves can also be accessed under the general graph node, which contains graph tables with information about many different materials. Up to twelve at a time can be selected for graphical comparison. The image hot links are also available in these graph tables","torrent":{"xt":"urn:btih:5f1676add20b9d821e6808b33fec45ab22ce3a4b","amp;dn":"Dynamic+Mechanical+Analysis+for+Plastics+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1676add20b9d821e6808b33fec45ab22ce3a4b","infoHashBuffer":{"type":"Buffer","data":[95,22,118,173,210,11,157,130,30,104,8,179,63,236,69,171,34,206,58,75]},"announce":[],"urlList":[]}}