{"title":"Lion King- Rhythm of the Pride Lands","uid":3814039,"size":83655698,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5f4efbd2f541f6217d66d370ccaed303583159ef&amp;dn=Lion+King-+Rhythm+of+the+Pride+Lands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"azmyst","files":1,"time":1190373304,"description":"I absolutely love this CD and have been trying to find this on torrents for some time. However, the search proved futile and I had given up hope of ever finding it when a friend lent me his CD. So I thought I&amp;#039;d share it here. If you are a fan of the music of Disney&amp;#039;s The Lion King then you will want to listen to this CD.\n\n\nRhythm of the Pride Lands: Music Inspired by Disney&amp;#039;s The Lion King [SOUNDTRACK]\n\nRhythm of the Pride Lands is an audio CD released by The Walt Disney Company, a &quot;sequel&quot; to the original motion picture soundtrack of the animated film The Lion King. The CD featured songs and performances inspired by, but not featured in the film. Most of the tracks were composed by African composer Lebo M and focused primarily on the African influences of the film&amp;#039;s original music, with most songs being sung either partially or entirely in various African languages. Several songs featured in the album would later have incarnations in other The Lion King-oriented projects, such as the stage musical or the direct-to-video sequels, such as &quot;He Lives in You&quot;.\n\n&quot;Warthog Rhapsody&quot;, which delved deeper into the origins of Pumbaa than &quot;Hakuna Matata&quot; did, was originally recorded to be included in the movie, but was cut out during storyboard and never animated. ","torrent":{"xt":"urn:btih:5f4efbd2f541f6217d66d370ccaed303583159ef","amp;dn":"Lion+King-+Rhythm+of+the+Pride+Lands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f4efbd2f541f6217d66d370ccaed303583159ef","infoHashBuffer":{"type":"Buffer","data":[95,78,251,210,245,65,246,33,125,102,211,112,204,174,211,3,88,49,89,239]},"announce":[],"urlList":[]}}