{"title":"The Myth Of the Robber Barons - Burton Folsom","uid":11707750,"size":6933089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fbc7e6e82b0f3c86cbcaf188d24b7873c6c84d1&amp;dn=The+Myth+Of+the+Robber+Barons+-+Burton+Folsom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":2,"time":1424198451,"description":"\nThe Myth of the Robber Barons describes the role of key entrepreneurs in the economic growth of the United States from 1850 to 1910. The entrepreneurs studied are Cornelius Vanderbilt, John D. Rockefeller, James J. Hill, Andrew Mellon, Charles Schwab, and the Scranton family. Most historians argue that these men, and others like them, were Robber Barons. The story, however, is more complicated. The author, Burton Folsom, divides the entrepreneurs into two groups market entrepreneurs and political entrepreneurs. The market entrepreneurs, such as Hill, Vanderbilt, and Rockefeller, succeeded by producing a quality product at a competitive price. The political entrepreneurs such as Edward Collins in steamships and in railroads the leaders of the Union Pacific Railroad were men who used the power of government to succeed. They tried to gain subsidies, or in some way use government to stop competitors. The market entrepreneurs helped lead to the rise of the U. S. as a major economic power. By 1910, the U. S. dominated the world in oil, steel, and railroads led by Rockefeller, Schwab (and Carnegie), and Hill. The political entrepreneurs, by contrast, were a drain on the taxpayers and a thorn in the side of the market entrepreneurs. Interestingly, the political entrepreneurs often failed without help from government they could not produce competitive products. The author describes this clash of the market entrepreneurs and the political entrepreneurs. In the Mellon chapter, the author describes how Andrew Mellon an entrepreneur in oil and aluminum became Secretary of Treasury under Coolidge. In office, Mellon was the first American to practice supply-side economics. He supported cuts on income tax rates for all groups. The rate cut on the wealthiest Americans, from 73 percent to 25 percent, freed up investment capital and led to American economic growth during the 1920s. Also, the amount of revenue into the federal treasury increased sharply after tax rates were cut. The Myth of the Robber Barons has separate chapters on Vanderbilt, Hill, Schwab, Mellon, and the Scrantons. The author also has a conclusion, in which he looks at the textbook bias on the subject of Robber Barons and the rise of the U. S. in the late 1800s. This chapter explores three leading college texts in U. S. history and shows how they misread American history and disparage market entrepreneurs instead of the political entrepreneurs. This book is in its fifth edition, and is widely adopted in college and high school classrooms across the U. S.\n\n\nAbout the Author:\n  Burton W. Folsom, Jr. is the Charles Kline professor of history and management at Hillsdale College in Michigan. He received his Ph. D. from the University of Pittsburgh, and has taught U. S. history at the University of Nebraska, the University of Pittsburgh, Murray State University, and Northwood University. He has also been a senior fellow at the Mackinac Center for Public Policy in Midland, Michigan; and historian in residence at the Center for the American Idea in Houston, Texas. He has written articles for the WALL STREET JOURNAL, THE AMERICAN SPECTATOR, POLICY REVIEW, and HUMAN EVENTS. Professor Folsom's first book was Urban Capitalists. His later books include Empire Builders, No More Free Markets or Free Beer: The Progressive Era in Nebraska. He has two edited books, The Spirit of Freedom and The Industrial Revolution and Free Trade. His articles have appeared in the Journal of Southern History, Pacific Historical Review, Journal of American Studies, Great Plains Quarterly, The American Spectator, and The Wall Street Journal. He is a columnist on economic history for The Freeman for Ideas on Liberty","torrent":{"xt":"urn:btih:5fbc7e6e82b0f3c86cbcaf188d24b7873c6c84d1","amp;dn":"The+Myth+Of+the+Robber+Barons+-+Burton+Folsom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fbc7e6e82b0f3c86cbcaf188d24b7873c6c84d1","infoHashBuffer":{"type":"Buffer","data":[95,188,126,110,130,176,243,200,108,188,175,24,141,36,183,135,60,108,132,209]},"announce":[],"urlList":[]}}