{"title":"TItan Quest - Immortal Throne","uid":4280895,"size":4535832263,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5fdec7038f03d6cbeba39714deadeca72efd8746&amp;dn=TItan+Quest+-+Immortal+Throne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"TheeMalevolent","files":44,"time":1215415788,"description":"*********************************************************************************** NOTE THIS IS NOT TITAN QUEST THIS IS TITAN QUEST IMMORTAL THRONE!!! THIS IS THE EXPANSION DISK TO THE GAME TITAN QUEST!!! WHICH I ALSO HAVE LISTED IN MY TORRENTS AS WELL. IT IS REQUIRED TO HAVE TITAN QUEST INSTALLED ON YOUR COMPUTER PRIOR TO INSTALLING IMMORTAL THRONE. SO WHEN IT IS TELLING YOU TO SEARCH FOR TITAN QUEST DIRECTORY ITS NOT TELLING YOU TO RENAME THE FILE THAT THIS TORRENT DOWNLOADS TO TO TITAN QUEST ITS TELLING YOU TO LOCATE THE DIRECTORY THE GAME TITAN QUEST IS LOCATED IN SO THAT IT CAN INSTALL IMMORTAL THRONE INTO IT AND ADD ON THE EXPANSION. I AM SORRY THAT I DIDNT UNDERSTAND WHAT YOUR ISSUE FROM THE START I FIGURED SINCE I HAD BOTH TORRENTS UP BOTH TITAN QUEST AND TITAN QUEST IMMORTAL THRONE AND THAT YOU WERE HAVING TO SEARCH FOR IMMORTAL THRONE THAT YOU WOULD ALREADY HAVE KNOWN THIS TO BE THE EXPANSION\n\nAGAIN SORRY FOR THE MIS-UNDERSTANDING\n***********************************************************************************\n\nYou Need A Virtual Drive Manager To Run This Game\nIf You Need One Download The One I Uploaded For You - Daemon Manager\n\n\nUsing Daemon Manager\nMount Drive by clicking on the icon in your task bar and selecting device 0 [e.] no media\n\nwhen you click on this it will have you search for the files you downloaded from me search untill you find unl-tqit with the image of a cd click on this one then open my computer. you will see an extra disk drive that does not actualy exist this is your new virtual disk drive. It will have the image of a trojan helmet this is the game. \n\nwhen you click on the disk it will open the start menu for the game. when you click on install you will be prompted to insert the disk\n\nclick the browse option and open the virtual drive you mounted and find the file setup.exe and click on this once you do this it will allow you to begin the installation of the program. \n\n","torrent":{"xt":"urn:btih:5fdec7038f03d6cbeba39714deadeca72efd8746","amp;dn":"TItan+Quest+-+Immortal+Throne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fdec7038f03d6cbeba39714deadeca72efd8746","infoHashBuffer":{"type":"Buffer","data":[95,222,199,3,143,3,214,203,235,163,151,20,222,173,236,167,46,253,135,70]},"announce":[],"urlList":[]}}