{"title":"Williams Textbook of Endocrinology,12th Edition{BBS}","uid":6963552,"size":86037786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ff92f4f70b8bdbdf07f0178534c9a535ee195e7&amp;dn=Williams+Textbook+of+Endocrinology%2C12th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1326841870,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ /                                                          \n\n****************************************************************************\n\nThe latest edition of Williams Textbook of Endocrinology edited by Drs. Shlomo Melmed, Kenneth S. Polonsky, P. Reed Larsen, and Henry M. Kronenberg, helps you diagnose and treat your patients effectively with up-to-the minute, practical know-how on all endocrine system disorders. Comprehensive yet accessible, this extensively revised 12th Edition updates you on diabetes, metabolic syndrome, obesity, thyroid disease, testicular disorders, and much more so you can provide your patients with the most successful treatments. Find scientific insight and clinical data interwoven in every chapter, reflecting advances in both areas of this constantly changing discipline, and presented in a truly accessible format. You'll also access valuable contributions from a dynamic list of expert authors and nearly 2.000 full-color images to help you with every diagnosis. Along with convenient online access at www.expertconsult.com, this title has everything you need to manage any and all the clinical endocrinopathies you may encounter.\n\n\n    * Rely on the one reference that integrates rapidly evolving basic and clinical science in a cohesive, user-friendly format, definitively addresses every topic in the field, and has remained a standard for more than half a century.\n\n    * Update your know-how and skills to diagnose and treat your patients most effectively with exhaustively revised content on diabetes, metabolic disease, thyroid cancer, fertility problems, testicular problems, weight issues, and much more.\n\n    * Apply reliable guidance on endocrine conditions of growing interest like hypothyroidism and testicular disorders, with dedicated new chapters that expound on the latest research findings.\n\n    * Overcome any clinical challenge with comprehensive and easy-to-use coverage of everything from hormone activity, diagnostic techniques, imaging modalities, and molecular genetics, to total care of the patient.\n\n    * Apply the latest practices with guidance from expert authors who contribute fresh perspectives on every topic.\n\n    * Search the full contents online, download all the images, and access hyperlinked references to PubMed at www.expertconsult.com.\n\n\n# Hardcover: 1920 pages\n# Publisher: Saunders; 12 edition (May 27, 2011)\n# Language: English\n# ISBN-10: 1437703240\n# ISBN-13: 978-1437703245\n","torrent":{"xt":"urn:btih:5ff92f4f70b8bdbdf07f0178534c9a535ee195e7","amp;dn":"Williams+Textbook+of+Endocrinology%2C12th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff92f4f70b8bdbdf07f0178534c9a535ee195e7","infoHashBuffer":{"type":"Buffer","data":[95,249,47,79,112,184,189,189,240,127,1,120,83,76,154,83,94,225,149,231]},"announce":[],"urlList":[]}}