{"title":"ExploitedCollegeGirls - VERONICA RADKE - Pinned Down Raped Hard","uid":8627343,"size":375000803,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:600ec543df306e5ed0365e1f399848327b67fe88&amp;dn=ExploitedCollegeGirls+-+VERONICA+RADKE+-+Pinned+Down+Raped+Hard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"beta2008x","files":1,"time":1372543458,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=lgp17_vro.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=lgp17_vro.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=vfliz_vro1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=vfliz_vro1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=y7bly_vro2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=y7bly_vro2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=68yrl_vro3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=68yrl_vro3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=zbb8x_exploitedcollegegirl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=zbb8x_exploitedcollegegirl.jpg&lt;/a&gt;\n\n\n\nTaylor drops a bombshell on me within the first few minutes: she's only had sex once, and never had her cherry popped. She's only had one dick in her entire life. One boyfriend who couldn't even get her off. Well she's going to have two new experiences today: a guy giving her an orgasm and having her cherry popped. In 2013, that is as close to a virgin as you are going to find outside of a convent and I am suddenly really excited. She may almost be a virgin, but watching her in action you'd be hard pressed to tell; she oozes sensuality and enthusiasm and this turns out to be a truly great update. If you've ever heard Quentin Tarantino's take on Madonna's &quot;Like a Virgin&quot; (a girl meets a guy with a big dick and he fucks her so hard, it's like the first time) you will know exactly how this shoot turns out. I have to shortcut the normal interview process with Taylor for obvious reasons. But she tells me that her favorite part of her extremely limited sexual experience was giving head, so, no reason not to put her to the test. I have her lean over in the car and start sucking. Surprisingly, she gives pretty damn good head. Technically she's maybe a 6-7 but in the enthusiasm department she's a 9+ and that counts for a lot. Eventually I pry her face off my dick and we head to the room for the shoot. Taylor is really nervous, and gets more nervous as we get closer to the room, but she doesn't chicken out of shut down, which is great. I get her settled and have her strip and we finally get a look at her body. It's fairly shocking that a girl this fine is a virgin, but I'm not going to question it. She's really my type - big, innocent smile, long slim legs, nice B cup tits, great round ass, perfect pink taco. Taylor's body is really basically perfect; I learn why later: she normally works out daily for as much as 3 hours. Damn! Can you say 'sexually frustrated'? Fortunately, she's met the right guy to cure her of that. When she starts to strip, I'm immediately excited to see her perfect little tits. She tells me she loves having them sucked on, so I'm happy to help out. She turns out to be very responsive and her nervousness fades away as she gets into it. When I have her strip and lay back, she shows off more perfection in the form of a delicious looking pussy that is already starting to get wet. I give her her first orgasm with the mini rocket vibrator, and she really gets into it. You can see how turned on she is through the whole thing. She lays back and arches her back and plays with her tits and pushes her hips at me as she cums. It's really hot. Since she loves giving head so much I have her drop to her knees again to get me hard and she attacks my cock (in a good way.) For a girl who has so little experience, she really displays some skills. As she gets into it I grab her head and face fuck her a little and she seems to love it. Eventually I just have to fuck her and I have her climb up on the bed while I grab some lube. After her first O, I'm sure she's ready for my dick, but I start off slow anyway. She's realyl into it and I work up to some serious bed banging. I try to get her off but she might be a little too nervous, but that doesn't slow me down. I let her have some of my best moves and she gets completely into it, you can hear how into it she is. Eventually I flip her over and pound her in doggy, so I can check out her fantastic ass. Be sure to check out the end of this part as she bounces her fine ass on my cock like she's auditioning for a rap video. I turn her over and press her into the bed in the classic ECG pin down and pound her hard until I manage to give her the gift of a huge creampie which she squeezes out for you. Taylor turns out to be just about the freshest girl I've ever shot for ECG, even including Claire the 18 year old high school nymph I had on the site a few months back. So if you are into seeing gorgeous brunettes getting deflowered on cam - Taylor is the girl for you. Enjoy. ","torrent":{"xt":"urn:btih:600ec543df306e5ed0365e1f399848327b67fe88","amp;dn":"ExploitedCollegeGirls+-+VERONICA+RADKE+-+Pinned+Down+Raped+Hard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"600ec543df306e5ed0365e1f399848327b67fe88","infoHashBuffer":{"type":"Buffer","data":[96,14,197,67,223,48,110,94,208,54,94,31,57,152,72,50,123,103,254,136]},"announce":[],"urlList":[]}}