{"title":"Nat King Cole 24 Bit Vinyl Pack","uid":8802161,"size":12928765253,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60247a46f0b31b9f3c41b688791eae57a9c434c8&amp;dn=Nat+King+Cole+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"politux","files":-1,"time":1376235374,"description":"\n  Nat King Cole 24 Bit Vinyl Pack\n\n  Genres: Jazz, Vocal, R&amp;B\n  Styles: Traditional Pop, Vocal Jazz, Swing, Vocal Pop\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  After Midnight\n  Just One of Those Things\n  Love is the Thing\n  St Louis Blues\n  The Magic of Christmas\n  Love is Here to Stay\n  Forever Yours\n  Unforgettable\n\n  For a mild-mannered man whose music was always easy on the ear, Nat King Cole managed to be a figure of considerable controversy during his 30 years as a professional musician. From the late '40s to the mid-'60s, he was a massively successful pop singer who ranked with such contemporaries as Frank Sinatra, Perry Como, and Dean Martin. He shared with those peers a career that encompassed hit records, international touring, radio and television shows, and appearances in films. But unlike them, he had not emerged from a background as a band singer in the swing era. Instead, he had spent a decade as a celebrated jazz pianist, leading his own small group. Oddly, that was one source of controversy. For some reason, there seem to be more jazz critics than fans of traditional pop among music journalists, and Cole's transition from jazz to pop during a period when jazz itself was becoming less popular was seen by them as a betrayal. At the same time, as a prominent African-American entertainer during an era of tumultuous change in social relations among the races in the U.S., he sometimes found himself out of favor with different warring sides. His efforts at integration, which included suing hotels that refused to admit him and moving into a previously all-white neighborhood in Los Angeles, earned the enmity of racists; once, he was even physically attacked on-stage in Alabama. But civil rights activists sometimes criticized him for not doing enough for the cause.\n\n  Such controversies do not obscure his real talent as a performer, however. The dismay of jazz fans at his abandonment of jazz must be measured against his accomplishments as a jazz musician. An heir of Earl Hines, whom he studied closely as a child in Chicago, Cole was an influence on such followers as Oscar Peterson. And his trio, emerging in the dying days of the swing era, helped lead the way in small-band jazz. The rage felt by jazz fans as he moved primarily to pop singing is not unlike the anger folk music fans felt when Bob Dylan turned to rock in the mid-'60s; in both cases, it was all the more acute because fans felt one of their leaders, not just another musician, was going over to the enemy. Less well remembered, however, are Cole's accomplishments during and after the transition. His rich, husky voice and careful enunciation, and the warmth, intimacy, and good humor of his approach to singing, allowed him to succeed with both ballads and novelties such that he scored over 100 pop chart singles and more than two dozen chart albums over a period of 20 years, enough to rank him behind only Sinatra as the most successful pop singer of his generation.","torrent":{"xt":"urn:btih:60247a46f0b31b9f3c41b688791eae57a9c434c8","amp;dn":"Nat+King+Cole+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60247a46f0b31b9f3c41b688791eae57a9c434c8","infoHashBuffer":{"type":"Buffer","data":[96,36,122,70,240,179,27,159,60,65,182,136,121,30,174,87,169,196,52,200]},"announce":[],"urlList":[]}}