{"title":"Japan Journeys: Famous Woodblock Prints of in Japan (2015)","uid":11879712,"size":10885822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61123687013e1b46bcee0669b4730a154027fa64&amp;dn=Japan+Journeys%3A+Famous+Woodblock+Prints+of+in+Japan+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1430651682,"description":"Japan Journeys: Famous Woodblock Prints of Cultural Sights in Japan\n\nepub\n\nPresenting classic Japanese woodblock prints, Japan Journeys offers a unique perspective on the country's most famous travel destinations.\n\n Art historian Andreas Marks has gathered together approximately two hundred Japanese woodblock prints depicting scenic spots and cultural icons that still delight visitors today. Many of the prints are by masters such as Utagawa Hiroshige, Kitagawa Utamaro, and Utagawa Kunisada, and currently hang in prestigious galleries and museums worldwide. Katsuhika Hokusai, the artform's most celebrated artist, is also well represented, with many prints from his &quot;Fifty-three Stations of the Tokaido Road&quot; series and &quot;Thirty-six Views of Mount Fuji&quot; series, including his world-renowned &quot;Great Wave&quot; print.\n\n In addition to prints showcasing Japan's natural beauty, Marks' carefully curated selection depicts roads and railways; favorite pastimes, such as blossom viewing and attending festivals; beloved entertainment, such as kabuki theater; the fashions they wore, and the food they ate. Marks is a leading expert on Japanese woodblock prints, and his Illuminating captions provide background context to the scenes depicted.\n\n Images of Japan are a continual source of fascination and delight for visitors and armchair travelers alike, and this original gift book also provides a valuable resource for art historians, scholars, and anyone interested in Japanese art, history, and traditional culture","torrent":{"xt":"urn:btih:61123687013e1b46bcee0669b4730a154027fa64","amp;dn":"Japan+Journeys%3A+Famous+Woodblock+Prints+of+in+Japan+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61123687013e1b46bcee0669b4730a154027fa64","infoHashBuffer":{"type":"Buffer","data":[97,18,54,135,1,62,27,70,188,238,6,105,180,115,10,21,64,39,250,100]},"announce":[],"urlList":[]}}