{"title":"Gycklarnas Afton - Ingmar Bergman - 1953","uid":3758991,"size":567973409,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:611a4ef7254717ee6b9a5b56cbb166dda88a76a0&amp;dn=Gycklarnas+Afton+-+Ingmar+Bergman+-+1953&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Deleuze","files":4,"time":1185919981,"description":"While traveling in caravan through the country of Sweden, one member of the decadent Alberti Circus tells the owner and ringmaster Albert Johansson a sad story about the clown Frost: seven years ago, his wife Alma was surprised by him bathing naked in a lake with a regiment. When the circus arrives in the town where Albert&amp;#039;s wife Agda and sons live, he decides to pay a visit with his young mistress Anne to a famous local troupe to borrow some capes, hats and vests for their tonight show. They are humiliated by the director Mr. Sjuberg, but he lends the pieces, and the lead actor Frans gives an unsuccessful pass on Anne. When Albert decides to visit Agda, the jealous Anne meets Frans, who seduces her with an apparently valuable necklace, and they have a love affair. Anne finds that the necklace is actually worthless and returns to the circus. Meanwhile, Agda refuses to accept Albert back and he sees Anne leaving the theater and going to the jewelry. During the exhibition, Albert and Anne are submitted to humiliations by Frans","torrent":{"xt":"urn:btih:611a4ef7254717ee6b9a5b56cbb166dda88a76a0","amp;dn":"Gycklarnas+Afton+-+Ingmar+Bergman+-+1953","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611a4ef7254717ee6b9a5b56cbb166dda88a76a0","infoHashBuffer":{"type":"Buffer","data":[97,26,78,247,37,71,23,238,107,154,91,86,203,177,102,221,168,138,118,160]},"announce":[],"urlList":[]}}