{"title":"El Cant Dels Ocells, Albert Serra, 2008","uid":5260359,"size":1048953686,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61225e57c5126b7934c2960983ed7c22272a2475&amp;dn=El+Cant+Dels+Ocells%2C+Albert+Serra%2C+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nandomko","files":3,"time":1262712735,"description":"IMDB: http://www.imdb.com/title/tt1143891/\n\nDirector: Albert Serra\nCountry: Spain\nYear: 2008\nColor: B&amp;W\nRuntime: 93min.\nLanguage: Catalan/Hebrew\nSubtitles: English/Portuguese-Br\n\nAlbert Serra chooses for this film another myth, really inserted in Spanish Jewish and catholic tradition: that one of the Three Magicians who goes to offer their presents to the Jesus Child. It is a trip in search of knowledge, but it doesn't mind so much the destination as the trip in itself, which means knowledge of themselves and also of the marvelous landscapes that surround them. The experience of the three old chaps is similar to one of children, of joyful surprise because they are, in their rural and land worker appearance and in their way of speaking, innocent before the world. They are still able to wonder themselves. Even if their movements are slow and clumsy, if many times they are lost in their quest, their determination is going on and after they have reached their destination, there is only one way more to follow, their departure and death. The filmmaker excels in showing nature as the keeper of spiritual essence and atavistic and hidden secrets, through beautiful images of desolation and peace. Caverns, forests, mountains, the moving sun, rain, desert, wind, mist, shadows, ruins, all these elements play their role in giving meaning to the film, with their pristine sounds. Shame that many times, the dialogues, do not suit with the global meaning of the film, and sound, in their excessive familiarity, more like nonsensical snobbery than like real talking, a default that we can find many times in films of Albert Serra's admired Russian filmmaker Aleksandr Sokurov. This film may be nearly plot less, but it conveys insightful meaning, and that is the most important for me.","torrent":{"xt":"urn:btih:61225e57c5126b7934c2960983ed7c22272a2475","amp;dn":"El+Cant+Dels+Ocells%2C+Albert+Serra%2C+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61225e57c5126b7934c2960983ed7c22272a2475","infoHashBuffer":{"type":"Buffer","data":[97,34,94,87,197,18,107,121,52,194,150,9,131,237,124,34,39,42,36,117]},"announce":[],"urlList":[]}}