{"title":"100 Per Cent Renewable - Energy Autonomy in Action","uid":12130220,"size":6795261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:613ab03602478646d24959bb9154c6b49024df97&amp;dn=100+Per+Cent+Renewable+-+Energy+Autonomy+in+Action&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1437017337,"description":"100 Per Cent Renewable - Energy Autonomy in Action - Peter Droege (Earthscan, 2009).pdf\n\nISBN: 978-1-84407-718-2\n\nThe greatest challenge of our time is to build a world based on the sustainable use of renewable power. Our massive dependence on fossil fuels has upset the very climatic system that made human evolution possible. The global economy and its financial system are in jeopardy, running hot on overtly cheap yet increasingly costly and fast depleting oil. A 100% renewable world is seen by many as an impossible dream in anything but the very long term. But not only do a growing number of initiatives and plans dare to make the change but many have already achieved it.\n\nThis rich collection presents a series of pioneering efforts and their champions, and the paths to their successes. Ranging from initiatives by individuals to visions for companies, communities and entire countries, it defeats tired economic and technical counter-arguments, showing how the schemes featured not only can and do work but do so economically and with available technology. The book is introduced by incisive writing by Peter Droege, explaining the challenges and framing a roadmap towards a 100% renewable reality","torrent":{"xt":"urn:btih:613ab03602478646d24959bb9154c6b49024df97","amp;dn":"100+Per+Cent+Renewable+-+Energy+Autonomy+in+Action","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"613ab03602478646d24959bb9154c6b49024df97","infoHashBuffer":{"type":"Buffer","data":[97,58,176,54,2,71,134,70,210,73,89,187,145,84,198,180,144,36,223,151]},"announce":[],"urlList":[]}}