{"title":"MacScan 2.9.4","uid":7525282,"size":15877550,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6160dab97b5e55975fdbfa008a069a755ca867ab&amp;dn=MacScan+2.9.4+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"openarena","files":-1,"time":1344762672,"description":"\nMacScan is the premier privacy and security suite for Mac OS X, offering spyware protection against malware such as keystroke loggers and trojan horses. Keep your system safe -- pinpoint potential problems and eliminate them with ease!\n\nProtect your privacy with MacScan. The blacklisted cookie scanner allows you to scan for tracking cookies and remove them without deleting all your saved usernames or passwords. MacScan can also clean Internet files and cookies for a variety of Web browsers, giving you the peace of mind you need to browse the Web in safety and security.\n\nStay up-to-date. With your purchase of MacScan, you will be able to download the latest version of the definitions without paying monthly contract or support fees. Stay on the cutting edge of anti-virus technology, and protect your Mac from unwanted intruders like never before.\n\nWhat's New\nVersion 2.9.4:\n\nFull OS X 10.8 Mountain Lion support as well as interface updates and enhanced support for both Firefox and SeaMonkey web browsers.\nThe latest version also adds the latest definitions to protect against the malware affecting Mac OS X\n\nRequirements\nPPC / Intel, Mac OS X 10.2.4 or later \n\nCourtesy of TOBW","torrent":{"xt":"urn:btih:6160dab97b5e55975fdbfa008a069a755ca867ab","amp;dn":"MacScan+2.9.4+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6160dab97b5e55975fdbfa008a069a755ca867ab","infoHashBuffer":{"type":"Buffer","data":[97,96,218,185,123,94,85,151,95,219,250,0,138,6,154,117,92,168,103,171]},"announce":[],"urlList":[]}}