{"title":"Sonic Youth [SY-1982,SY-Confusion is Sex+Kill Yr. Idols][FLAC]{1","uid":8928421,"size":700049448,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:623417a8b5f6127443d1d6be7f643b99d167855a&amp;dn=Sonic+Youth+%5BSY-1982%2CSY-Confusion+is+Sex%2BKill+Yr.+Idols%5D%5BFLAC%5D%7B1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"100.XY","files":-1,"time":1379411367,"description":"Sonic Youth [EP],Sonic Youth-Confusion is Sex+Kill Yr. Idols\n\n\nWikipedia:\nSonic Youth were an American alternative rock band from New York City, formed in 1981. Their most recent lineup consisted of Thurston Moore (guitar, vocals), Kim Gordon (bass guitar, vocals, guitar), Lee Ranaldo (guitar, vocals), Steve Shelley (drums) and Mark Ibold (guitar, bass guitar). In their early career, Sonic Youth was associated with the No Wave art and music scene in New York City. Part of the first wave of American noise rock groups, the band carried out their interpretation of the hardcore punk ethos throughout the evolving American underground that focused more on the DIY ethic of the genre rather than its specific sound\n\n\n\nReview:\nThese two Albums are for hardcore SY fans.\nThe first album is called simply Sonic Youth-1982 and it is very garage sound...There are few live recorded songs. You will find here the roots that make this band one of the most innovative bands in the alternative scene.\n\n\n\n\nConfusion Is Sex was recorded by Wharton Tiers in his Chelsea studio (which he had set up in the basement of a building where he worked as superintendent). It was mostly recorded during Jim Sclavunos' brief tenure as drummer for the band, and he appears on drums for most of the album. Frustrated by the unconventional recording situation in Tiers' studio and generally not clicking with the band musically, Sclavunos was ejected and Bob Bert was invited back, who recorded drums for &quot;Making the Nature Scene&quot;. Bert appears on this track and the live Stooges cover &quot;I Wanna Be Your Dog&quot; on the album. Confusion Is Sex is the only Sonic Youth album on which guitarist Lee Ranaldo plays bass, specifically on the song &quot;Protect Me You&quot;.\nThe cover image is a sketch by bassist Kim Gordon of guitarist Thurston Moore. This image was used on gig posters early in the band's career.\nThe track &quot;Lee Is Free&quot; was recorded on two tape recorders by Lee Ranaldo solo at home. The track &quot;Confusion Is Next&quot; contains lyrics sung twice by Moore. The first part of the song is slow and the second chapter everything is played twice the speed. The title was later used for the book by Alec Foege.\n\n\n\n\n\nAlbum List:\n1982 - Sonic Youth [EP]\n1983 - Confusion is Sex + Kill Yr. Idols\n\n\n\n\n\nSummary:\nCountry: USA\nGenre: Alternative Rock\nStyles: post-punk, noise rock, experimental rock, indie rock, no wave\n\n\n\nMedia Report:\nSource : CD\nFormat : MPEG Audio\nFormat version : Version 1\nFormat profile : Layer 3\nBit rate mode : Constant\nBit rate : 320 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nCompression mode : Lossy\n","torrent":{"xt":"urn:btih:623417a8b5f6127443d1d6be7f643b99d167855a","amp;dn":"Sonic+Youth+%5BSY-1982%2CSY-Confusion+is+Sex%2BKill+Yr.+Idols%5D%5BFLAC%5D%7B1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"623417a8b5f6127443d1d6be7f643b99d167855a","infoHashBuffer":{"type":"Buffer","data":[98,52,23,168,181,246,18,116,67,209,214,190,127,100,59,153,209,103,133,90]},"announce":[],"urlList":[]}}