{"title":"How to Use Adapt and Design Knitting Patterns","uid":11367487,"size":165340274,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:626520b03bc3b6bdb7118f74393711d01e898e36&amp;dn=How+to+Use+Adapt+and+Design+Knitting+Patterns&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KnitLady","files":-1,"time":1415057532,"description":"Here's an easy-to-follow self-teaching course that shows knitters how to get exactly the results they want from less-than-perfect commercial patterns. The authors begin with the basics, explaining the meanings of the symbols and abbreviations used in knitting patterns. Next they show readers how to take their own body measurements and how to identify their body landmarks--those especially important points that need to be measured in order to get good results when adapting and modifying patterns. A detailed section on the specifics of adapting patterns shows how to change necklines and sleeves, how to change a pullover sweater into a cardigan, how to transform a chunky wool pattern into a lightweight design by changing yarns, and much more. A separate chapter instructs ambitious knitters on designing their own patterns from scratch. The book concludes with seven ready-to-use knitting patterns that less-confident knitters can copy and adapt. This book, which is suited to the needs of knitters of all skill levels, features hundreds of color photos, line illustrations, and diagrams","torrent":{"xt":"urn:btih:626520b03bc3b6bdb7118f74393711d01e898e36","amp;dn":"How+to+Use+Adapt+and+Design+Knitting+Patterns","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"626520b03bc3b6bdb7118f74393711d01e898e36","infoHashBuffer":{"type":"Buffer","data":[98,101,32,176,59,195,182,189,183,17,143,116,57,55,17,208,30,137,142,54]},"announce":[],"urlList":[]}}