{"title":"Michael Jackson - The Beer Hunter (2013 Documentary) - HD","uid":8738437,"size":3863062572,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:62c4835c5ae927376213d12c48597ee7fa9ee41c&amp;dn=Michael+Jackson+-+The+Beer+Hunter+%282013+Documentary%29+-+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"aikoaiko","files":1,"time":1374726326,"description":" &lt;a href=&quot;http://www.kickstarter.com/projects/wandermedia/beer-hunter-the-movie&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.kickstarter.com/projects/wandermedia/beer-hunter-the-movie&lt;/a&gt;\n\nThis was finally released as a download for backers about a week ago. Here you go.\n\n\n\n\nAn intimate portrait of the other Michael Jackson, how he saved beer, started a revolution, and his secret struggle with Parkinson's.\n\n&quot;My name really is Michael Jackson, but I don't sing, I don't dance, and I don't drink Pepsi.&quot; So begins each episode of The Beer Hunter, the television series starring Michael Jackson. The other Michael Jackson. But who was Michael, and how did he inspire a worldwide revolution?\n\n\nBeer Hunter: The Movie is a documentary film about the British journalist and author Michael Jackson, who's books and television series about beer inspired the global phenomenon that is the craft brewing renaissance. An intimate portrait based on over 60 hours of rare, recent video footage, Beer Hunter sheds insight into the life and contributions of this brilliant and beloved man, who, while quietly battling Parkinson's, became the leading voice and inspiration behind the craft brewing movement. For those who had ever met Michael Jackson, or were deeply inspired by his work, it's hard to imagine that he is no longer with us.\n\nBased on the huge success of his books and magazine articles about beer, Michael wrote and starred in a six-part television series, called The Beer Hunter, which was released in 1989 by Channel 4 in the UK, and aired in the early 90's on the Discovery Channel in the U.S. While the show became an instant classic and has since aired in over 30 different countries, Michael was never able to get another episode produced before he passed away suddenly in 2007. Now, with the help of the international craft beer community, we can produce another beer hunting adventure in his honor.\n\nBeer Hunter: The Movie is our attempt to follow up the original Beer Hunter series with a rare library of more recent footage, showing Michael on - and &quot;off&quot; camera throughout the great beer cities, breweries, and pubs of Europe and the United States. The footage will form the basis of a movie about Michael's life, with the remaining footage edited into a series to be released as an open-source public resource. The unprecedented growth and popularity of craft brewing and distilling, and the ever-expanding field of beer and whisky writing, would never have been possible without Michael's ground-breaking efforts and uniquely engaging voice. It's important that we tell his story and recognize his contributions before his memory fades.\n\nMichael especially inspired renewed interest in the creative and complex beers of Belgium. In honor of that, and as a tribute to his inspiration, the Beer Hunter movie will incorporate never-before-seen footage of five young American brewers, who in 2006, led by Sam Calagione and the Italian beer expert Lorenzo Dabove, (and also featuring Rob Todd of Allagash Brewing, Vinnie Cilurzo from Russian River, Tomme Arthur from The Lost Abbey, and Adam Avery from Avery Brewing) visited the inspirational mecca of Belgium on a trip they dubbed &quot;Belge-a-palooza.&quot;","torrent":{"xt":"urn:btih:62c4835c5ae927376213d12c48597ee7fa9ee41c","amp;dn":"Michael+Jackson+-+The+Beer+Hunter+%282013+Documentary%29+-+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c4835c5ae927376213d12c48597ee7fa9ee41c","infoHashBuffer":{"type":"Buffer","data":[98,196,131,92,90,233,39,55,98,19,209,44,72,89,126,231,250,158,228,28]},"announce":[],"urlList":[]}}