{"title":"Key Largo (1948) Humphrey Bogart,Lauren Bacall (multi subs)","uid":4599433,"size":2465943212,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:630b6e983425eed3c4d89e7dc8b534605816c500&amp;dn=Key+Largo+%281948%29+Humphrey+Bogart%2CLauren+Bacall+%28multi+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"johnefp","files":-1,"time":1230137186,"description":"Optional subtitles in separate idx/sub files:\nCroatian (Hrvatski), Czech, Danish, Dutch , English,Finnish, Greek, Hebrew, Hungarian, Norwegian, Polish, Portuguese, Swedish, Turkish,Portugese\n   \nPlot Synopsis\tby Hal Erickson\n\nRichard Brooks and John Huston's screenplay for Huston's Key Largo eschews the lofty blank verse of Maxwell Anderson's original play, concentrating instead on the simmering tensions among the many characters. Humphrey Bogart plays Frank McCloud, an embittered war veteran who travels to Key Largo in Florida, there to meet Nora Temple (Lauren Bacall), the wife of his deceased war buddy. Arriving at a tumbledown hotel managed by Nora's father-in-law James Temple (Lionel Barrymore), McCloud discovers that the establishment has been taken over by exiled gangster Johnny Rocco (Edward G. Robinson) and what's left of his mob. Also in attendance is Gaye Dawn (Claire Trevor), Rocco's alcoholic girlfriend. While the others bristle at the thought of being held at bay by the gangsters, the disillusioned McCloud refuses to get involved: &quot;One Rocco more or less isn't worth dying for.&quot; As he awaits a contact who is bringing him enough money to skip the country, Rocco is responsible for the deaths of a deputy sheriff and two local Indian youth. Unwilling to take a stand before these tragedies, McCloud finally comes to realize that Rocco is a beast who must be destroyed. To save the others from harm, McCloud agrees to pilot Rocco's boat to Cuba through the storm-tossed waters. Just before McCloud leaves, Gaye Dawn slips him a gun -- which leads to the deadly final confrontation between McCloud and Rocco. His resolve to go on living renewed by this cathartic experience, McCloud heads back to Nora, with whom he's fallen in love. Claire Trevor's virtuoso performance as a besotted ex-nightclub singer won her an Academy Award -- as predicted by her admiring fellow actors, who watched her go through several very difficult scenes in long, uninterrupted takes. While Key Largo sags a bit during its more verbose passages, on a visual level the film is one of the best and most evocative examples of the &quot;film noir&quot; school. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0040506/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0040506/&lt;/a&gt;\n\nDirector:\nJohn Huston\n\n\n\tHumphrey Bogart\t... \tFrank McCloud\n\n\tEdward G. Robinson\t... \tJohnny Rocco\n\n\tLauren Bacall\t... \tNora Temple\n\n\tLionel Barrymore\t... \tJames Temple\n\n\tClaire Trevor\t... \tGaye Dawn\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:21:07\nMovie complete : Yes\n\n[Video]\nResolution : 720x544\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 3837 Kbps\nQuality Factor : 0,40 b/px\n\n[Audio]\nCodec : ATSC/A-52 Dolby AC3\nNumber of channels : 1\nSample Rate : 48000 Hz\nBitRate : 192 Kbps\n\n\n\nENJOY  AND  SEED\n","torrent":{"xt":"urn:btih:630b6e983425eed3c4d89e7dc8b534605816c500","amp;dn":"Key+Largo+%281948%29+Humphrey+Bogart%2CLauren+Bacall+%28multi+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"630b6e983425eed3c4d89e7dc8b534605816c500","infoHashBuffer":{"type":"Buffer","data":[99,11,110,152,52,37,238,211,196,216,158,125,200,181,52,96,88,22,197,0]},"announce":[],"urlList":[]}}