{"title":"Grape Expectations: A Familys Vineyard Adventure in France","uid":11256999,"size":1751960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63282e130cd690e814f3f0ed4f8f2ff3a825fdc3&amp;dn=Grape+Expectations%3A+A+Familys+Vineyard+Adventure+in+France&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Jallentino","files":-1,"time":1413912770,"description":"Caro Feely &quot;Grape Expectations: A Family's Vineyard Adventure in France&quot;\nSummersdale | English | October 1, 2013 | ISBN: 1849532575 | 288 pages | azw, epub, lrf, mobi | 3,4 mb\n\nIf I said `Chateau Haut Garrigue', I bet the first thing that comes to mind is French wine? How often have we all sat down of an evening on holiday, looking out over the beautiful French countryside, drinking a bottle of fruity, spicy French wine and wondered how lovely it would be to live in France, have a view like this everyday and maybe make our own wine? Grape Expectations is the book that tells the story of Caro, Sean and their two young daughters who do just that.\n\nCaro writes honestly about their experiences moving from Ireland to the Bergerac region of France to run an organic vineyard, and her passion and enthusiasm shine through. Living and making a living in France is no holiday and running an organic vineyard is about as far removed from a holiday as you can get. Nothing can quite prepare you for the bureaucracy of setting up a business in France (been there done that), so hats off to the Feely's for attempting it with the added regulations involved in organic wine production. There were times when their future seemed uncertain, but what came across in the book is that they always gave it a bloody good go. Following your dreams can sometimes feel like a nightmare and there are always dark moments. For Sean and Caro these included a couple of nasty accidents that happened to Sean, you could say lots of blood, sweat and tears go into every bottle! The fact that they have been accepted into the local community and more importantly by the local vignerons, many of whose families have been making wine for generations, is a testament to their hard work and passion for organic wine making.\n\nI'm in awe she found the time to write the book and feel very privileged to have been let into their life in France. Time must have been so pressured with two very young daughters to settle into a new life, the day to day running of the vineyard and developing the wine tourism side of the business. She seems to be good at multi-tasking as they have just won the prestigious `Best of Wine Tourism 2013' Gold award for sustainable tourism. Caro's writing style is excellent and her descriptions of the wine flavors brought the words to life so I'm sure the vineyard courses she runs will be delivered in a very engaging way","torrent":{"xt":"urn:btih:63282e130cd690e814f3f0ed4f8f2ff3a825fdc3","amp;dn":"Grape+Expectations%3A+A+Familys+Vineyard+Adventure+in+France","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63282e130cd690e814f3f0ed4f8f2ff3a825fdc3","infoHashBuffer":{"type":"Buffer","data":[99,40,46,19,12,214,144,232,20,243,240,237,79,143,47,243,168,37,253,195]},"announce":[],"urlList":[]}}