{"title":"Extreme Hauntings - Britain's Most Terrifying Ghosts (2013)","uid":11677262,"size":3326968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:634aa587c8a5e92af87e76eee0df71c939ad3149&amp;dn=Extreme+Hauntings+-+Britain%27s+Most+Terrifying+Ghosts+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"davieboy1966","files":4,"time":1422923204,"description":"Books : Horror : English\n\nThe most terrifying British ghosts are brought together in this, a unique and original compilation of spine-chilling true encounters both ancient and modern.\n\nNot for the faint of heart, this book contains over thirty compelling experiences that reveal a dark and disturbing reality to the realm of the paranormal - deadly curses and murderous ghosts, violent poltergeists, haunted relics and spirit possession - all unsettling insights into a frightening supernatural world.\n\nFrom the mysterious happenings at Hinton Ampner to the eerie Black Monk of Pontefract, the celebrated Enfield Poltergeist and the sinister power of the Hexham Heads, paranormal historian Paul Adams and writer and photographer Eddie Brazil have opened case files spanning over 250 years, from the eighteenth century to the present day, in order to carry out a detailed and chilling examination of the extreme hauntings of Britain.\n\n\nAbout the Authors:\nPaul Adams and Eddie Brazil are co-founders of The Chiltern Society for Psychical Research. They also set up the Harry Price website (www.harrypricewebsite.co.uk). They have contributed articles to such publications as Ghost Voices magazine, Vision magazine and Paranormal magazine.\n\nAlong with Peter Underwood they are the authors of The Borley Rectory Companion and Shadows in the Nave: A Guide to the Haunted Churches of England.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:634aa587c8a5e92af87e76eee0df71c939ad3149","amp;dn":"Extreme+Hauntings+-+Britain%27s+Most+Terrifying+Ghosts+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634aa587c8a5e92af87e76eee0df71c939ad3149","infoHashBuffer":{"type":"Buffer","data":[99,74,165,135,200,165,233,42,248,126,118,238,224,223,113,201,57,173,49,73]},"announce":[],"urlList":[]}}