{"title":"Standup Comedy - Todd Barry - Medium Energy","uid":4319068,"size":47201692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6358dd7bebd528cb13f016b6cf42b15403fd5dec&amp;dn=Standup+Comedy+-+Todd+Barry+-+Medium+Energy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":57,"time":1217285831,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the Ops who put these out and about.\n\nRambam1776\n\n\nTODD BARRY - MEDIUM ENERGY\n\nBiography\tby David Jeffries\nFinding it hard to apply his B.A. in English to his previous jobs ? VD clinic clerk and drummer ? the deadpan, sometimes doe-eyed Todd Barry accepted his fate and turned to standup comedy in 1987. Bronx born and bred, Barry grew up a fan of Steve Martin, George Carlin, and Andy Kaufman. After spending years touring the comedy clubs, a 1998 Jury Award for Best Stand Up Comic at the U.S. Comedy Arts Festival in Aspen welcomed him to the big leagues. After an April 1999 appearance on Late Night with Conan O&amp;#039;Brien, Barry took to the Internet newsgroup &quot;alt.fan.conan-obrien&quot; only to find one of the group&amp;#039;s regulars describing him as &quot;worst guest of the week&quot; and &quot;icky.&quot; Rankled, Barry created the one-man show Icky, which featured instrumental music from Yo La Tengo and had a successful run at the Upright Citizens Brigade Theater. The television special Comedy Central Presents: Todd Barry also appeared in 1999. In 2001 he made his debut on CD with the self-released Medium Energy. After comedian David Cross declared it one of his favorite CDs, the Sub Pop label picked up the album for distribution in 2004. That same year, Comedy Central Records issued the CD/DVD combo Falling off the Bone and a year later reissued Medium Energy. From Heaven appeared in 2007. \n\nStraight out of NYC&amp;#039;s East Village is the self-released debut from this low-key master. Includes his now cult hit jokes about Fugazi and MTV&amp;#039;s Diary. Over an hour of fantastic material previously only available at his live shows. Barry was 2003&amp;#039;s &quot;It Standup&quot; on the Entertainment Weekly &quot;It List&quot;. He&amp;#039;s appeared on Letterman, Conan, Last Call, Comedy Central&amp;#039;s Friar&amp;#039;s Roast of Chevy Chase, Space Ghost Coast-To-Coast, and in his own Comedy Central Presents special. Acting credits include The Larry Sanders Show, Sex And The City, Spin City, Chappelle&amp;#039;s Show, Road Trip, and Pootie Tang. He&amp;#039;s also done cartoon voice work on Dr. Katz: Professional Therapist, Aqua Teen Hunger Force, Home Movies, and Hey Monie. He also produced (with David Cross) the comedy/variety show Tinkle.\n\nReview\tby David Jeffries\nMedium Energy might be pushing it since the deadpan Todd Barry often sounds like he needs a good poke with a stick, but behind the weary delivery is a sharp, somewhat sick wit. Barry&amp;#039;s act has more than its fair share of filth, but with a delivery that&amp;#039;s the polar opposite of Andrew Dice Clay&amp;#039;s, his sleaze material is a fascinating kind of creepy instead of the usual brash offensiveness. Past the icky toilet humor is Barry&amp;#039;s acerbic observations on everyday life and some hilarious riffing on the music industry that suggests the comedian is well aware of the indie music scene (anyone with an overly analytical music aficionado for a friend will greatly appreciate &quot;Crazy Mixed Tape&quot;). Odd that the track listing flicks by faster than Barry&amp;#039;s pulse, but &quot;odd&quot; is something he wears like a badge. He&amp;#039;s an acquired taste, but for those who enjoy Andy Kaufman-type characters who challenge an audience rather than play to them, Medium Energy will go from endurance test to Top Ten list in about three listens. Comedy albums that demand repeat listens are rare, ones that grow with each listen even rarer. Weird, rewarding, and a funny sort of unsettling. \n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfpxqrsldse&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfpxqrsldse&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6358dd7bebd528cb13f016b6cf42b15403fd5dec","amp;dn":"Standup+Comedy+-+Todd+Barry+-+Medium+Energy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6358dd7bebd528cb13f016b6cf42b15403fd5dec","infoHashBuffer":{"type":"Buffer","data":[99,88,221,123,235,213,40,203,19,240,22,182,207,66,177,84,3,253,93,236]},"announce":[],"urlList":[]}}