{"title":"The Bridges Of Madison County - Soundtrack","uid":9403747,"size":77474015,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:639235483bd10c2c31b1bb8ff4323fb20ab682ca&amp;dn=The+Bridges+Of+Madison+County+-+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388113668,"description":"\n\n\nBy L.\n&quot;The Bridges of Madison County&quot; Soundtrack CD.....\n\nIt is not neccessary to have seen the film to appreciate what this music is about.It opens with the wonderfully romantic orchestral love theme &quot;Doe Eyes&quot;. Composed by Clint Eastwood(yet another great talent of his revealed), and conducted by Lennie Niehaus, the music fills the room with the soothing sounds, and already you are under the spell!\n\nThen ,like love letters put to music,Dinah Washington's feminine and soulful tones and Johnny Hartman's deep but docile voice exchange stories of love and romance through song. Dinah sings &quot;I'll Close My Eyes&quot;, she says&quot;through those moments, were apart, I'll close my eyes and see you with my heart&quot;.Johnny returns with &quot;Easy Living&quot; and expresses that&quot;people say you rule me with one wave of your hand...Darling it's grand..&quot;These are followed by &quot;Blue Gardenia&quot;(Washington), &quot;I see Your Face Before Me&quot;(Hartman) and &quot;Soft Winds&quot;(Washington), all expressing the fleeting affair and the lasting love.You will also be treated to some wonderful instrumental solos interwoven in the songs.\n\nA light and lively rendition of &quot;Baby, I'm Yours&quot;(Barbara Lewis) gives the sense of the time era, followed by more wonderful love songs,including artists Irene Kral with the Junior Mance Trio. There are twelve tracks in all(see buying info for complete lists), and closes with the mesmerizing &quot;Doe Eyes&quot; once more.\n\nThe CD is a great quality and sounds terrific on the stereo.\n\nThis album is for anyone who has ever loved or has ever been loved!....Close YOUR eyes and enjoy...Laurie\n\n\n\n1. Doe Eyes (Love Theme From The Bridges of Madison County) - Lennie Niehaus\n2. I'll Close My Eyes - Dinah Washington\n3. Easy Living - Johnny Hartman\n4. Blue Gardenia - Dinah Washington\n5. I See Your Face Before Me - Johnny Hartman\n6. Soft Winds - Dinah Washington\n7. Baby, I'm Yours - Barbara Lewis\n8. It's A Wonderful World - Irene Kral\n9. It Was Almost Like A Song - Johnny Hartman\n10. This Is Always - Irene Kral\n11. For All We Know - Johnny Hartman\n12. Doe Eyes (Love Theme From The Bridges of Madison County)(Reprise) - Lennie Niehaus\n","torrent":{"xt":"urn:btih:639235483bd10c2c31b1bb8ff4323fb20ab682ca","amp;dn":"The+Bridges+Of+Madison+County+-+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639235483bd10c2c31b1bb8ff4323fb20ab682ca","infoHashBuffer":{"type":"Buffer","data":[99,146,53,72,59,209,12,44,49,177,187,143,244,50,63,178,10,182,130,202]},"announce":[],"urlList":[]}}