{"title":"Cytology, 4E [Epub &amp; Mobi] [StormRG]","uid":10029845,"size":47865898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:639793ad5ec387eba37d188955d1df41847b1566&amp;dn=Cytology%2C+4E+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":-1,"time":1398320379,"description":"Author: Edmund S. Cibas , Barbara S. Ducatman \nHardcover: 576 pages\nPublisher: Saunders; 4 edition (February 18, 2014)\nLanguage: English\nISBN-10: 145574462X\nISBN-13: 978-1455744626\nFormat: Retail Epub and mobi\nReader Required: \nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle App, Calibre, MoonReader for Android\n\nNOTE: no PDF available. If you want the book to scroll like a PDF, use the mobi file in Kindle or either in Calibre\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\n\nFully updated, the 4th edition of Cytology helps you apply the latest diagnostic techniques for the interpretation of a complete range of cytological specimens. This medical reference book offers you quick access to the newest methods and adjunct tests, all in a brief, highly readable format that makes quick work of reviewing the key information available on this powerful yet minimally invasive method. It's a perfectly practical bench manual for trainees and practicing pathologists alike!\n\n* Take advantage of comprehensive yet concise coverage of nearly every type of cytology, including gynecologic, non-gynecologic, and FNA.\n\n* Understand the clinical implications of your diagnoses and better equip yourself to make effective interpretations with clinical correlations emphasized throughout.\n\n* Make the most informed reporting decisions through an in-depth analysis of common diagnostic pitfalls.\n\n* Quickly find the answers you need with succinct, bulleted text, valuable clinical pearls, and useful summaries of key points.\n\n* Gain real-life perspective on a complete range of cytologic findings with over 700 crystal-clear, full-color illustrations.","torrent":{"xt":"urn:btih:639793ad5ec387eba37d188955d1df41847b1566","amp;dn":"Cytology%2C+4E+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639793ad5ec387eba37d188955d1df41847b1566","infoHashBuffer":{"type":"Buffer","data":[99,151,147,173,94,195,135,235,163,125,24,137,85,209,223,65,132,123,21,102]},"announce":[],"urlList":[]}}