{"title":"(1986) Prince And The Revolution - Parade [VinylRip 24-192] {100","uid":10142876,"size":1654826072,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63a8c21f47b502a11d169bfa127a44a8442e5c4e&amp;dn=%281986%29+Prince+And+The+Revolution+-+Parade+%5BVinylRip+24-192%5D+%7B100&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"100.XY","files":-1,"time":1400024373,"description":"(1986) Prince And The Revolution - Parade\n\n\nWikipedia:\nParade: Music from the Motion Picture Under the Cherry Moon is the eighth studio album by American recording artist Prince and The Revolution. It was released on March 31, 1986, by Paisley Park Records and Warner Bros. Records as the soundtrack album to the 1986 film Under the Cherry Moon.\nAfter the critical disappointment of his 1985 album Around the World in a Day, Parade was released to acclaim from music critics and was named one of the best albums of 1986 by The Village Voice and NME magazine, who named it their album of the year. It also sold two million copies both in the United States and abroad.\n\n\nReview:\nUndaunted by the criticism Around the World in a Day received, Prince continued to pursue his psychedelic inclinations on Parade, which also functioned as the soundtrack to his second film, Under the Cherry Moon. Originally conceived as a double album, Parade has the sprawling feel of a double record, even if it clocks in around 45 minutes. Prince &amp; the Revolution shift musical moods and textures from song to song -- witness how the fluttering psychedelia of &quot;Christopher Tracy's Parade&quot; gives way to the spare, jazzy funk of &quot;New Position,&quot; which morphs into the druggy &quot;I Wonder U&quot; -- and they're determined not to play it safe, even on the hard funk of &quot;Girls and Boys&quot; and &quot;Mountains,&quot; as well as the stunning &quot;Kiss,&quot; which hits hard with just a dry guitar, keyboard, drum machine, and layered vocals. All of the group's musical adventures, even the cabaret-pop of &quot;Venus de Milo&quot; and &quot;Do U Lie?&quot; do nothing to undercut the melodicism of the record, and the amount of ground they cover in 12 songs is truly remarkable. Even with all of its attributes, Parade is a little off-balance, stopping too quickly to give the haunting closer, &quot;Sometimes It Snows in April,&quot; the resonance it needs. For some tastes, it may also be a bit too lyrically cryptic, but Prince's weird religious and sexual metaphors develop into a motif that actually gives the album weight. If it had been expanded to a double album, Parade would have equaled the subsequent Sign 'o' the Times, but as it stands, it's an astonishingly rewarding near-miss.\nReview by Stephen Thomas Erlewine (allmusic.com)\nRate 4.5 Stars\n\nimage\n\n\n\nTrack List:\nA1 Christopher Tracy's Parade 2:11\nA2 New Position 2:21\nA3 I Wonder U 1:40\nA4 Under The Cherry Moon 2:57\nA5 Girls &amp; Boys 5:30\nA6 Life Can Be So Nice 3:12\nA7 Venus De Milo 1:54\nB1 Mountains 3:58\nB2 Do U Lie? 2:43\nB3 Kiss 3:38\nB4 Anotherloverholenyohead 3:58\nB5 Sometimes It Snows In April 6:50\n\n\nSummary:\nCountry: USA\nGenre: Psychedelic pop, funk, baroque pop\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : 5.4 Mbps\nChannel(s) : 2 channels\nSampling rate : 192 KHz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:63a8c21f47b502a11d169bfa127a44a8442e5c4e","amp;dn":"%281986%29+Prince+And+The+Revolution+-+Parade+%5BVinylRip+24-192%5D+%7B100","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63a8c21f47b502a11d169bfa127a44a8442e5c4e","infoHashBuffer":{"type":"Buffer","data":[99,168,194,31,71,181,2,161,29,22,155,250,18,122,68,168,68,46,92,78]},"announce":[],"urlList":[]}}