{"title":"La Sera - Hour of the Dawn [2014][FLAC]","uid":10427483,"size":208487660,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63c97df940f629133cb671a081f9fc9a8265bafd&amp;dn=La+Sera+-+Hour+of+the+Dawn+%5B2014%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":-1,"time":1403723036,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Hardly Art #HAR 082CD\nCountry: USA\nYear: May 13, 2014\nGenre: pop,rock\nFormat: CD,Album\n\n\n\n\n\nLosing to the Dark\nSummer of Love\nRunning Wild\nFall in Place\nAll My Love Is for You\nHour of the Dawn\nKiss This Town Away\nControl\n10 Headed Goat Wizard\nStorm's End\n\n\n\n\nWith each La Sera album, Katy Goodman switches things up, working with new people and adjusting the sound in small increments. After debuting with a reverb-heavy girl group-inspired sound, she came back with a peppier new wave attack on 2012's excellent Sees the Light. Working with her third different guitarist/producer, Tod Wisenbaker, she's added a healthy dose of snarling punk attitude and dreamy power pop to the group's approach on Hour of the Dawn. Kicking off with a white-hot slam on a former bandmate/lover/friend called &quot;Losing to the Dark&quot; -- built around Goodman's most powerful vocals to date and Wisenbaker's squalling guitar solo -- the album splits time between charging ahead full-throttle and reflecting calmly on life and love. In that respect, it's very much like an early Pretenders album, and while Goodman can't conjure up the same kind of toughness that Chrissie Hynde could, she does transmit more hurt and swagger than ever before. Tracks like &quot;Kiss This Town Away&quot; and &quot;Running Wild&quot; take care of the latter with their street smarts and great hooks, while the aching, chiming ballads &quot;Falling in Place&quot; and &quot;All My Love Is for You&quot; take care of the former. Almost every song sounds like it could be a radio hit: they all have sharp hooks and choruses and Wisenbaker's production is clear and simple, punctuated by his alternately ripping and rippling guitar leads. His restraint behind the board allows Goodman's voice to be the star and she takes advantage to the fullest extent with a nuanced and very strong performance. With each record her songwriting has grown stronger, the overall sound of the band has grown more confident, and the finished product has become more exciting. Hour of the Dawn is great garage pop, some of the best being made in 2014, and is the best La Sera album yet.","torrent":{"xt":"urn:btih:63c97df940f629133cb671a081f9fc9a8265bafd","amp;dn":"La+Sera+-+Hour+of+the+Dawn+%5B2014%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c97df940f629133cb671a081f9fc9a8265bafd","infoHashBuffer":{"type":"Buffer","data":[99,201,125,249,64,246,41,19,60,182,113,160,129,249,252,154,130,101,186,253]},"announce":[],"urlList":[]}}