{"title":"Handbook of Medicinal Herbs (2002)","uid":5507755,"size":8089732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63e69366f49cbf12f1195a3a549f92e3ea150569&amp;dn=Handbook+of+Medicinal+Herbs+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"artpepper","files":-1,"time":1271897819,"description":"Handbook of Medicinal Herbs By James A. Duke\n\nCRC Press 2002 | 896 Pages | ISBN: 0849312841 | PDF | 7 MB\n\n\n\n\n\n\n\n\n\nStill considered the definitive work on medicinal herbs and their uses after two decades, the Handbook of Medicinal Herbs has undergone a long-anticipated revision. In the second edition, world-renowned ethnobotanist James A. Duke provides up-to-date data on over 800 of the world's most important medicinal plant species. \n\n\nThe book contains more species, phytochemicals, proven indications, folk indications, and dosage data than the first edition in a new easier to use format. The in-depth content, the addition of color plates and over 200 black and white illustrations makes this book the most comprehensive resource on medicinal herbs available.\n\n\n\n\n\nNEW IN THE SECOND EDITION:\n\n\nOver 100 color plates, 4 color maps. Over 200 black and white illustrations\n\nOver 800 medicinal plants - more than twice as many as the previous edition organized alphabetically by common name.\n\nMore herbs from the African, Ayurvedic, Chinese, and Jamu traditions\n\nEASY ACCESS TO INFORMATION YOU NEED\n\nDesigned to give you fast access to the information you need on a regular basis, this new edition is organized more systematically than any other medicinal herb publication. The entries are now arranged alphabetically by common name with the scientific name in parenthesis. \nMajor synonyms are also provided. \n\n\nIt has become increasingly clear that there are hundreds of biologically active compounds, often additive or synergistic, in all our plants, foods, spices, herbs, medicinal, and poisonous plants. The debate continues on how these plants work and how they should be used. Blending scientific fact with folk uses and the author's personal experience, Handbook of Medicinal Herbs, Second Edition provides the most well rounded discussions of safety, efficacy, toxicity, and rational use found in any herbal reference.\n\n\n","torrent":{"xt":"urn:btih:63e69366f49cbf12f1195a3a549f92e3ea150569","amp;dn":"Handbook+of+Medicinal+Herbs+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e69366f49cbf12f1195a3a549f92e3ea150569","infoHashBuffer":{"type":"Buffer","data":[99,230,147,102,244,156,191,18,241,25,90,58,84,159,146,227,234,21,5,105]},"announce":[],"urlList":[]}}