{"title":"Stanley Turrentine with Milt Jackson - 1972 - Cherry (1988) FLAC","uid":8720228,"size":259245926,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:640c00035d71bfd64a4029a9c65bc0b8a6b8c20f&amp;dn=Stanley+Turrentine+with+Milt+Jackson+-+1972+-+Cherry+%281988%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"eika256","files":-1,"time":1374366557,"description":"Stanley Turrentine with Milt Jackson - 1972 - Cherry (1988)\n\nThis 1972 CTI date by Stanley Turrentine was his third for the label, and was produced by Creed Taylor with Rudy Van Gelder at the board. Shockingly, Don Sebesky was not called in to arrange anything here. The band chosen to back up Turrentine's edgy, soulful tenor is a fine and diverse one, especially in the heyday of the fusion years: Milt Jackson on vibes, drummer Billy Cobham, pianist (electric of course) Bob James, Ron Carter on bass, and guitarist Cornell Dupree. The opener is Lee Morgan's &quot;Speedball,&quot; played as a near straight-ahead hard bop barnburner, with a killer little vamp in the melody that is accented and filled by both Bags and James alternating bars. This is followed by a fine is not exceptional read of Johnny Mercer's &quot;I'll Remember You,&quot; though Jackson's vibe solo that opens the tune and offers the lead into the melody is quite moving. Jackson's own &quot;The Rev's&quot; is a bluesed-out strut, with Turrentine, James, and Bags holding through the lead riffs before Turrentine digs deep into his soulful bag for a brilliant solo that runs over the bluesology of the old masters -- Dexter Gordon and Ben Webster most notably. But it is the last half of the album that holds the real beauty, with the title track framed by two Weldon Irvine Jr. classics, &quot;Sister Sanctified&quot; and &quot;Introspective&quot; as the closer. Irvine arranged his own tunes, and they are far more wondrous and strange than anything in the CTI catalog. &quot;Sister Sanctified,&quot; a deep gospel with repetitive choruses and assertive lead lines, has James playing a gospel piano more reminiscent of Abdullah Ibrahim than himself. Cobham shoves the beat to the margin, double- and triple-timing in places while never leaving the pocket of the groove. Turrentine's solo, especially in the bridge, is phenomenal, guttural, and nearly squalling. &quot;Introspective&quot; is a loping post-bop blues. The long, intricate melody lines are perfectly suited to the complex sense of lyricism that is Turrentine's strength. The more general figures and accents are picked up by Jackson, and Cobham slips through and around the chances in a Latin-styled dance to hold the middle and bring in the blues feel. It's phenomenal and sends this session off on a high note. Recommended. (AllMusic)\n\nTrack list:\n01 - Speedball\n02 - I Remember You\n03 - The Revs\n04 - Sister Sanctified\n05 - Cherry\n06 - Introspective\n07 - The More I See You\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:640c00035d71bfd64a4029a9c65bc0b8a6b8c20f","amp;dn":"Stanley+Turrentine+with+Milt+Jackson+-+1972+-+Cherry+%281988%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"640c00035d71bfd64a4029a9c65bc0b8a6b8c20f","infoHashBuffer":{"type":"Buffer","data":[100,12,0,3,93,113,191,214,74,64,41,169,198,91,192,184,166,184,194,15]},"announce":[],"urlList":[]}}