{"title":"The Blockade - Runners and raiders (Time-Life The Civil War Seri","uid":11559979,"size":30230270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64c1da02626505bbb166c614e820cf459a7cd598&amp;dn=The+Blockade+-+Runners+and+raiders+%28Time-Life+The+Civil+War+Seri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1416869511,"description":"Pdf / English / 1983 Time-Life / 176 pages / ISBN 10 0809447096 / 28.8 MB\n\nThis volume in the Time-Life Civil War series looks at the naval aspects of the conflict, When the war began the United States Navy was in poor shape and the Confederate States Navy nonexistent. The directions pursued by each sides' naval forces reflected their strengths: the North initiated and enforced the Blockade since the Union had more vessels, shipbuilding facilities and seamen than the South. The South in turn relied upon blockade runners to bring in vital supplies and employed privateers initially and commerce raiders later to seek out and sink Federal cargo ships, interfering with U.S. trade. Both sides used ironclads, the predecessors to modern battleships.\n\nThe book also includes a chapter on secret service efforts in Europe, which makes sense as Confederate agents bought warships there and blockade runners were secretly constructed in Europe. However, the struggle in Europe between the North and South also extended into what we would today consider Information Operations: propaganda, public relations and espionage. The author has done a good job of drawing the reader into this theater of combat.\n\nThis is a fascinating story, seeing armored warships replacing wooden sailing ships, courageous blockade runners avoiding Federal warships off the southern coast and Confederate raiders literally sailing around the world seeking out U.S. ships to attack. Sidebars include an illustration comparing different types of vessels used during the Civil War, a Federal doctor's view of blockade duty, the last fight of the CSS Alabama, Yankee monitors, the short career of the CSS Albemarle and the occupation of Port Royal.\n\nAmazon","torrent":{"xt":"urn:btih:64c1da02626505bbb166c614e820cf459a7cd598","amp;dn":"The+Blockade+-+Runners+and+raiders+%28Time-Life+The+Civil+War+Seri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64c1da02626505bbb166c614e820cf459a7cd598","infoHashBuffer":{"type":"Buffer","data":[100,193,218,2,98,101,5,187,177,102,198,20,232,32,207,69,154,124,213,152]},"announce":[],"urlList":[]}}