{"title":"Edward L. Allen's System of American Jiu-Jitsu (gnv64)","uid":9547431,"size":56800039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64cdc1420613764b1289fe78846612c3aa48a9db&amp;dn=Edward+L.+Allen%27s+System+of+American+Jiu-Jitsu+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1391156930,"description":"Edward L. Allen's System of American Jiu-Jitsu\nA Quick Way to Self Defense in All Emergencies as Taught to Civilians and Armed Forces Throughout the Country...\nby Edward L. Allen\nSun Dial Press | 1942 | ISBN-N/A | 84 pages | scanned PDF | 54.1 mb\n\nEdward L, Allen's system of Jiu-Jitsu (Now known as Judo) is one of the oldest and most basic of -the martial arts. This course is the simplest, designed for the rank amateur with no previous experience in any sort of combat. It was taught in this manner to America's service men. The idea, from the Army's point of view, was to train them fast and get them to the front. It obviously worked, as many reports came back: from the Pacific that in hand-to-hand encounters with the Japanese, the good big man was better than the good little man.\nAs was necessary in those days, this course is without frills or ceremony. Just get in there and take the man out as quickly as possible. And this is what you want, at least to start with.\nWhen the moves in this basic course are mastered, you can handle just about any situation which might put you at risk. Later, if you want to go professional, you will find it much easier to adapt: to any of the more Complex martial arts.\nI would suggest, at first, you make an agreement with a Friend to spend at least two hours a day in practice for one month. This is all the time it should take you both to master this course. Then, you and your partner will be proficient enough to start a school, There is a pressing need for this course among all classes of our population as most people who feel a need to protect themselves from muggers and such simply don't have the time...","torrent":{"xt":"urn:btih:64cdc1420613764b1289fe78846612c3aa48a9db","amp;dn":"Edward+L.+Allen%27s+System+of+American+Jiu-Jitsu+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64cdc1420613764b1289fe78846612c3aa48a9db","infoHashBuffer":{"type":"Buffer","data":[100,205,193,66,6,19,118,75,18,137,254,120,132,102,18,195,170,72,169,219]},"announce":[],"urlList":[]}}