{"title":"The Social Animal - David Brooks - Audiobook MP3","uid":10289520,"size":466927179,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:64e13827e59cf36acd7f8de0b4b2cfa5ec37a318&amp;dn=The+Social+Animal+-+David+Brooks+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Squiddy82","files":-1,"time":1401841891,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Social Animal: The Hidden Sources of Love, Character, and Achievement\n\nWritten by: David Brooks\nNarrated by: Arthur Morey\nLength: 16 hrs and 9 mins\nFormat: Unabridged\nRelease Date:03-08-11\nProgram Type: Audiobook\n\nWith unequaled insight and brio, David Brooks, the New York Times columnist and best-selling author of Bobos in Paradise, has long explored and explained the way we live. Now, with the intellectual curiosity and emotional wisdom that make his columns among the most read in the nation, Brooks turns to the building blocks of human flourishing in a multilayered, profoundly illuminating work grounded in everyday life.\n\nThis is the story of how success happens. It is told through the lives of one composite American couple, Harold and Erica - how they grow, push forward, are pulled back, fail, and succeed. Distilling a vast array of information into these two vividly realized characters, Brooks illustrates a fundamental new understanding of human nature. A scientific revolution has occurred - we have learned more about the human brain in the last 30 years than we had in the previous 3,000.\n\nThe unconscious mind, it turns out, is most of the mind - not a dark, vestigial place but a creative and enchanted one, where most of the brain's work gets done. This is the realm of emotions, intuitions, biases, longings, genetic predispositions, personality traits, and social norms: the realm where character is formed and where our most important life decisions are made. The natural habitat of The Social Animal.\n\nDrawing on a wealth of current research from numerous disciplines, Brooks takes Harold and Erica from infancy to school; from the &quot;odyssey years&quot; that have come to define young adulthood to the high walls of poverty; from the nature of attachment, love, and commitment, to the nature of effective leadership. He reveals the deeply social aspect of our very minds and exposes the bias in modern culture that overemphasizes rationalism, individualism, and IQ. Along the way, he demolishes conventional definitions of success while looking toward a culture based on trust and humility. ","torrent":{"xt":"urn:btih:64e13827e59cf36acd7f8de0b4b2cfa5ec37a318","amp;dn":"The+Social+Animal+-+David+Brooks+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e13827e59cf36acd7f8de0b4b2cfa5ec37a318","infoHashBuffer":{"type":"Buffer","data":[100,225,56,39,229,156,243,106,205,127,141,224,180,178,207,165,236,55,163,24]},"announce":[],"urlList":[]}}