{"title":"Meyl-Scalar Wave Transponder(Tesla physics)(2008)","uid":4454972,"size":1105682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64e5bc3e09a0881e9a16115a1dc471d89833702a&amp;dn=Meyl-Scalar+Wave+Transponder%28Tesla+physics%29%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"red_gonzo","files":1,"time":1224437425,"description":"This is prof. dr. Konstantin Meyl&amp;#039;s pioneer booklet Scalar Wave Transponder - Field-physical Basis for Electrically Coupled Bi-directional Far Range Transponder (2008) which is the first book that develops the theoretical foundations for a scalar wave transponders which are operable beyond the close range. With the current RFID technology the transfer of energy takes place on a chip card by means of longitudinal wave components in close range of the transmitting antenna. Those are scalar waves, which spread towards the electrical or the magnetic field pointer. In the wave equation with reference to the Maxwell field equations, these wave components are set to zero, why only postulated model computations exist, after which the range is limited to the sixth part of the wavelength. A goal of this paper is to create, by consideration of the scalar wave components in the wave equation, the physical conditions for the development of scalar wave transponders which are operable beyond the close range. The energy is transferred with the same carrier wave as the information and not over two separated ways as with RFID systems. Besides the bi-directional signal transmission, the energy transfer in both directions is additionally possible because of the resonant coupling between transmitter and receiver. First far range transponders developed on the basis of the extended field equations are already functional as prototypes. Meyl&amp;#039;s books explain in clear and mathematical correct terms the emerging new physics with most fascinating applications that jump right out of it. By extending current electromagnetics to include longitudinal/scalar waves the strange ideas of people like Nikola Tesla suddenly become not only understandable but also realizable as practical machines that will change the way we live - towards the better. 70 pages, some pictures, diagrams, drawings, etc. A must read for everyone.\n","torrent":{"xt":"urn:btih:64e5bc3e09a0881e9a16115a1dc471d89833702a","amp;dn":"Meyl-Scalar+Wave+Transponder%28Tesla+physics%29%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e5bc3e09a0881e9a16115a1dc471d89833702a","infoHashBuffer":{"type":"Buffer","data":[100,229,188,62,9,160,136,30,154,22,17,90,29,196,113,216,152,51,112,42]},"announce":[],"urlList":[]}}