{"title":"The Second Crusade 1148: Disaster Outside Damascus","uid":11783031,"size":22975116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:656801cc6f6fc111879f3f15c9ccc1a06f505b4e&amp;dn=The+Second+Crusade+1148%3A+Disaster+Outside+Damascus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427667642,"description":"After the fall of the crusader kingdom of Edessa, the Pope called for a new crusade in 1145. This new campaign by the Christian west against the forces of eastern Islam would culminate in the 1148 siege of Damascus, then the capital city of an Islamic state that had been friendly towards the crusaders. Despite the earlier successes for the crusaders at Antioch and Jerusalem, and the weak fortifications around Damascus, the siege proved a dismal and embarrassing failure for the western armies. The siege was abandoned soon after it had started and the crusaders retreated. This defeat shocked the Christian world and dealt a severe blow to the confidence of the crusading armies, while bolstering the morale of their enemies.\n\nUtilizing numerous illustrations and full-color artwork, medieval warfare expert David Nicolle analyzes the often-debated battles around Damascus, explaining how the domination of the surrounding countryside by the Islamic forces became the decisive factor, and how the besieging crusading forces found themselves under siege. He also looks at the crusade in the larger context of the battle between East and West and explains how the Second Crusade proved a turning point in this ongoing struggle","torrent":{"xt":"urn:btih:656801cc6f6fc111879f3f15c9ccc1a06f505b4e","amp;dn":"The+Second+Crusade+1148%3A+Disaster+Outside+Damascus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656801cc6f6fc111879f3f15c9ccc1a06f505b4e","infoHashBuffer":{"type":"Buffer","data":[101,104,1,204,111,111,193,17,135,159,63,21,201,204,193,160,111,80,91,78]},"announce":[],"urlList":[]}}