{"title":"COCORICO [2011][Novas Aventuras Na fazenda] - Floresta","uid":6593318,"size":627121700,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6598e22263ba9d4fac834b3985c29d0ea4858f64&amp;dn=COCORICO+%5B2011%5D%5BNovas+Aventuras+Na+fazenda%5D+-+Floresta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Floresta","files":3,"time":1312918045,"description":" Cocorico 2011 Novas Aventuras na Fazenda\n\n\n\n [Paramount Pictures / TV Cultura]\n\n\n\n Descricao/Sinopse:\n\n As aventuras comeÃƒÂ§am quando o Tio Eustaquio, irmao da avo, resolve passar as ferias na fazenda. Todos ficam empolgados com a vinda dele, mas o avo nao pode dizer o mesmo. Depois de um dia de muitas brincadeiras na fazenda, a simpatica Lilica vai atormentar toda a turma com seu medo de escuro quando chega a noite. Em outro episodio, Julio conta que a professora pede para cada aluno cuidar de um ser vivo. Agora, toda a turma do paiol quer cuidar de alguem. Julio toma conta de uma flor, Lilica de um gatinho e o inocente Alipio ira cuidar de uma pedra. Uma pedra?\n\n\n Description:\n\n The adventures begin when Uncle Eustace, grandfather\\'s brother, decides to spend the holidays on the farm. Everyone is excited about his coming, but the grandfather can not say the same. After a day of many jokes on the farm, the friendly Babs will haunt the whole class with his fear of darkness when night comes. In another episode, Jules says that the teacher asks each student to take care of a living being. Now, the whole class wants the barn to care for someone. Julio takes care of a flower, a kitten Babs and innocent Alipio will take care of a stone. A stone?\n\n\n Descripcion:\n\n Las aventuras comienzan cuando el tio Eustaquio, el hermano de su abuelo, decide pasar sus vacaciones en la granja. Todo el mundo esta muy entusiasmado con su llegada, pero el abuelo no puede decir lo mismo. Despues de un dia de muchas bromas en la granja, el Babs amigable perseguira a toda la clase con su miedo a la oscuridad cuando llega la noche. En otro episodio, Julio dice que el profesor pide a cada estudiante para cuidar de un ser vivo. Ahora, toda la clase quiere que el granero para cuidar a alguien. Julio se hace cargo de una flor, un gatito y Babs Alipio inocentes se hara cargo de una piedra. Una piedra?\n\n\n\n Episodios:\n\n 1 As Aventuras do Tio EustÃƒÂ¡quio\n\n O Tio Eustaquio, irmao da avo, resolve passar as ferias na fazenda. Todos ficam felizes e empolgados com a vinda dele e com suas historias, menos o avo que morre de ciumes.\n\n\n 2 Noite\n\n Depois de um dia cheio de brincadeiras na fazenda Cocorico, todos ficam cansados e a noite ninguem consegue dormir so porque a Lilica teve sede. No paiol todos estao dormindo quando Lilica acorda e comeÃƒÂ§a a atormentar toda a turma com seu medo de escuro. Por sorte, a vovo aparece para ajudar.\n\n\n 3 Seres Vivos\n\n O Julio contou que a professora pediu para cada aluno cuidar de alguem. Agora toda a turma do paiol tambem quer ter alguem para cuidar. Julio esta tomando conta de uma flor, Lilica de um gatinho. Alipio tambÃƒÂ©m quer um ser vivo para cuidar. Ele acha uma pedra. Uma pedra que fala!\n\n\n 4 Olfato\n\n Zaza trabalha recolhendo roupas e da um super susto na Lilica e no Julio. De repente espalha-se um cheiro horrivel pelo paiol. Todos querem descobrir quem foi. Ate o Astolfinho torna-se suspeito.\n\n\n 5 Livro\n\n Quem nao conhece a historia dos 7 anoes? A Lola contou esta historia para a turma do paiol. Enquanto isso, o Julio preparava o material para ensinar a turma a contar historias novas e ilustradas.  \n\n\n\n  INFORMACOES: [information]:\n\n\n  Titulo [name] -  CocoricÃƒÂ³ 2011 Novas Aventuras na Fazenda  \n  Ano de LanÃƒÂ§amento 2011\n  Ano de ProduÃƒÂ§ÃƒÂ£o 2010\n  Referencias [reference] - Desenho Animado,Cartoon,Brazilian,Brasil,Brazil,Movienet,Potugues.\n  Audio - PORTUGUES [PORTUGUESE] MPEG LAYER-3\n  Compactacao [Compaction] - DVIX AVI\n  Generos - [genre] Infantil \n  Estudio - [PRODUCER] [Paramount Pictures / TV Cultura]\n  Diretor [director] - Fernando Gomes    \n  Duracao Aprox 51 minutos - [Time 51 minutes]\n  TELA / IMAGEM / FORMATO: [DISPLAY / FILE / FORMAT]: 640 X 464\n\n\n  OBRIGADO POR SEU DOWNLOAD, SEJA UM SEEED.\n THANK YOU FOR ITS DOWNLOAD, IS A SEEED. STAFFING\n GRACIAS POR LA DESCARGA, ES UN SEEED.\n","torrent":{"xt":"urn:btih:6598e22263ba9d4fac834b3985c29d0ea4858f64","amp;dn":"COCORICO+%5B2011%5D%5BNovas+Aventuras+Na+fazenda%5D+-+Floresta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6598e22263ba9d4fac834b3985c29d0ea4858f64","infoHashBuffer":{"type":"Buffer","data":[101,152,226,34,99,186,157,79,172,131,75,57,133,194,157,14,164,133,143,100]},"announce":[],"urlList":[]}}