{"title":"Haydn and Boccherini - Cello Concertos","uid":5725527,"size":118830603,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:659821c49d0f629b20278482aeeaad1f3688ce98&amp;dn=Haydn+and+Boccherini+-+Cello+Concertos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":null,"files":25,"time":1280450507,"description":"Music: Classical : MP3/Variable\n\nThis is one of my favorite cello CDs. Ludovit Kanta is a real find, at the time of this recording in 1987-8 the principal cello of the Slovak Philaharmonic and a laureate of the 1982 Tchaikovsky Competition. He plays with a rich, tangy tone and especially fine articulation. He also is an especially stylish player, not only in Haydn and Boccherini's solo writing but also in the Jazz inspired cadenzas that conductor Peter Breiner has supplied for Haydn's Concertos. These might be controversial for some listeners, but I find they add a little spice to the works. I once heard a concert broadcast of Lynn Harrell playing a Haydn Concerto at the Aspen Festival, in which he used a cadenza that featured the opening cello passage of Mahler's Resurrection Symphony! The audience guffawed. Breiner's cadenzas may be a little outrageous, too, but it's hard to argue with performances that are so stylish and supple. The orchestra plays beautifully for Breiner, too, and the sound engineering, from two locales, is excellent. If you want to hear a less controversial approach to Haydn, Jan Vogler's recording is excellent, but I really find Kanta's recordings to be treasurable, comparable to Jacqueline Du Pre's more Romantic versions.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:659821c49d0f629b20278482aeeaad1f3688ce98","amp;dn":"Haydn+and+Boccherini+-+Cello+Concertos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"659821c49d0f629b20278482aeeaad1f3688ce98","infoHashBuffer":{"type":"Buffer","data":[101,152,33,196,157,15,98,155,32,39,132,130,174,234,173,31,54,136,206,152]},"announce":[],"urlList":[]}}