{"title":"Pink Floyd - The Wall - Film Soundtrack with extras (sequenced a","uid":9281674,"size":538160064,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:664b24633873427f7be80847e1119d5c8119e3be&amp;dn=Pink+Floyd+-+The+Wall+-+Film+Soundtrack+with+extras+%28sequenced+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"}{eywood","files":34,"time":1385948765,"description":"Here we have the soundtrack from the film The Wall, upgraded nicely from the DVD soundtrack.  WOW what a difference.  You can hear things that you never could before, such as: when Pink is in the bathroom before Stop the announcements coming from the hall are the intro for the Wall concerts as chronicled on &quot;Is There Anybody Out There? The Wall Live At Earl's Court 1980-1981&quot; (...flash cameras will be confiscated...I think the band is ready....no not quite yet).  I never knew that before.  So this prompted me to remake the soundtrack album I'd assembled many years ago.  I included a few snips of the final cut and the Vera Lynn songs to fill out the narrative, and I cut some silences and big spaces that only work while watching the movie\n\nTrack list and reasoning:\n\nCD 1\n\n01 The Little Boy That Santa Claus Forgot (Vera Lynn) - This is included because it opens the film, but I put the entire song in as it's more relative when you hear the end  (he hasn't got a daddy)\n\n02 In The Flesh? \n\n03 When The Tigers Broke Free - taken from the single.  I felt it fits the narrative best here, as the first thought of Pink's flashback, not broken into two parts as in the film.  That was used that way to show Pink growing up somewhat chronologically, but as a soundtrack, and since it is him remembering all of this, it works best in one piece\n\n04 The Thin Ice\n05 Another Brick In The Wall Part 1\n06 Goodbye Blue Sky\n\n07 One Of The Few - I thought this would be nice as a deeper look into the psyche of the teacher, and being in the same key as the songs it falls between it worked quite well here\n\n08 The Happiest Days Of Our Lives - I continued the music through the Money poem, as it always ran through my head while watching the film.  I felt it would stay in sync if it never stopped, and I was right\n\n09 Another Brick In The Wall Part 2\n10 Mother\n11 What Shall We Do Now\n12 Young Lust\n13 One Of My Turns\n14 Don't Leave Me Now\n\n15 Empty Spaces - This is where this was originally supposed to be placed, as evidenced by the lyric sheet in the Wall album.  Since this had no ending when cut loose from Young Lust I used the chorus of Your Possible Pasts to complete it.  I felt it was OK to use this song out of context like this because Pink recites the lyrics to it later in the film before Stop.\n\n16 Another Brick In The Wall Part 3\n17 Goodbye Cruel World\n\n\nCD 2\n\n18 We'll Meet Again (Vera Lynn) - the song quoted later in Vera\n\n19 Hey You - Although this was originally cut from the movie, it was included as a bonus feature on the DVD.  I've taken the majority of the song from the DVD soundtrack but the guitar solo is nearly obliterated with the sounds of the destruction occuring in the film, so I cut it in (properly edited to match) from the CD version.\n\n20 Is There Anybody Out There\n21 Nobody Home\n22 Vera\n23 Bring The Boys Back Home\n24 Comfortably Numb\n25 In The Flesh\n26 Run Like Hell\n27 Waiting For The Worms\n\n28 Stop - for this I decided it would be cool if Pink was imagining the music going through his head as he recited the lyrics to the songs that ended up on future albums, so I took Bob Geldof's recitations and re-timed them to more match up with the music, then put (very faintly) in the background the snips from Your Possible Pasts and The Moment Of Clarity that he is reading.  The idea is that its in his head\n\n29 The Trial\n30 Outside The Wall\n\nI hope no one thinks I ruined this and that everyone enjoys the work I've done.\n\n-}{eywood 2007\n","torrent":{"xt":"urn:btih:664b24633873427f7be80847e1119d5c8119e3be","amp;dn":"Pink+Floyd+-+The+Wall+-+Film+Soundtrack+with+extras+%28sequenced+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"664b24633873427f7be80847e1119d5c8119e3be","infoHashBuffer":{"type":"Buffer","data":[102,75,36,99,56,115,66,127,123,232,8,71,225,17,157,92,129,25,227,190]},"announce":[],"urlList":[]}}