{"title":"Slave Wife by Frances Gaines Bennett","uid":9252182,"size":260541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:677125709ed05620728882e237532b4e0c301306&amp;dn=Slave+Wife+by+Frances+Gaines+Bennett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":4,"time":1385483866,"description":"The strikingly handsome, sexy and profoundly dominant Michael is just thirty years old and insanely wealthy. Karen is a fresh-faced young cheerleader who catches his eye. Although he's struck by her beauty, the obsessed perfectionist in him sees much room for improvement. When he learns that Karen's father has stolen money from his company, he presents the man with a choice. Give up his daughter or go to jail.\nKaren is so smitten by the suave charmer that she jumps at the chance to\nhave him. Once the two are married, Michael becomes obsessed with transforming her into the perfect female. What she eats, how she dresses, her make-up, every detail of her existence falls under his unyielding oversight. The naive Karen does everything to please her husband ... but Michael is never quite satisfied.\nMichael acquires a robotics company and with it the young Ward Smith. It is Michael who spurs Ward to become the fiendish BDSM engineer from the Milk Bitch Trilogy. And it is Ward who invents the devices used to transform Karen. Michael's cunning manipulation of Karen gradually eats away at her resistance. She is no longer the vivacious young cheerleader but instead the epitome of Michael's obsession.","torrent":{"xt":"urn:btih:677125709ed05620728882e237532b4e0c301306","amp;dn":"Slave+Wife+by+Frances+Gaines+Bennett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"677125709ed05620728882e237532b4e0c301306","infoHashBuffer":{"type":"Buffer","data":[103,113,37,112,158,208,86,32,114,136,130,226,55,83,43,78,12,48,19,6]},"announce":[],"urlList":[]}}