{"title":"EXPLOITED COLLEGE GIRLS - Kylie - Persian Teen Anal Queen 720p","uid":11850898,"size":2550744702,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:67861d9f0e25e70c3f6969ffa22e5f8a0fa4cb37&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Kylie+-+Persian+Teen+Anal+Queen+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":7,"uploader":"beta2008x","files":1,"time":1430082645,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=8vfwe_ykl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=8vfwe_ykl.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=uc7da_ecg_kylie_720p_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=uc7da_ecg_kylie_720p_s.jpg&lt;/a&gt;\n\nKylie is one of the most adorable girls we've ever shot at Ex Co Gi and also happens to also be one of the filthiest, ass hungry, anal sluts we've ever run across. Many girls brag that they are anal queens and some will even suffer through an on-cam buttfucking to prove it, but little Kylie is the real deal: a full on butt slut. When you meet her during her behind the scenes interview the first thing you'll notice are her cute, slightly exotic looks. But once you get past Kylie's innocent Persian (or whatever noble culture she's bringing shame to) face and listen to what she's saying, you will be mesmerized.\n\nFirst off, we'd like to apologize for the insensitive racial language Kylie uses during her interview. We don't think it's malicious, so we didn't edit it out, but some people just don't understand the cultural significance of some terms. For example, when Kylie calls herself a &quot;bottom bitch&quot; she seems to think that the term signifies the fact that she's a submissive slut, when we know that the bottom bitch is actually the most respected and powerful ho in a pimp's stable. Jay doesn't correct her, of course, because he's whiter than the ghost of an albino Mormon. Enough political correctness, on to the butt sex.\n\nKylie plants herself on the bed and as soon as Jay breaks out the lube she's got two fingers in her ass. So all that booty talk in the intro? You should probably grab your jack lotion and buckle in for some serious D in A action. From the moment Jay finishes face fucking her until he blows his load, his dick isn't out of her ass for more than a few seconds and when it is, it's in her mouth completing the glorious ass to mouth circuit that so few mortal men get to traverse. From doggy, to Kylie on her back, to sideshow, Jay pounds her tight ass relentlessly and gives her orgasm after orgasm until he unleashes his own deep in her ass.\n\nThen shockingly, in a move we're calling either &quot;Where Eagles Dare&quot; or &quot;The World's Riskiest Creampie&quot; Jay asks Kylie to push his cum out of her ass. It turns out to be one of the best things he's ever filmed! Be sure to stay tuned after the money shot for a nice friendly goodbye with a little helpful jack off encouragement from Kylie","torrent":{"xt":"urn:btih:67861d9f0e25e70c3f6969ffa22e5f8a0fa4cb37","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Kylie+-+Persian+Teen+Anal+Queen+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67861d9f0e25e70c3f6969ffa22e5f8a0fa4cb37","infoHashBuffer":{"type":"Buffer","data":[103,134,29,159,14,37,231,12,63,105,105,255,162,46,95,138,15,164,203,55]},"announce":[],"urlList":[]}}