{"title":"Jamie Lidell - Jamie Lidell (2013) [FLAC]","uid":8170047,"size":350956767,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67d123ed2631e4c68b06ae694e99fd789b368b0b&amp;dn=Jamie+Lidell+-+Jamie+Lidell+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1361407701,"description":"\n  Jamie Lidell - Jamie Lidell (2013) [FLAC]\n\n  Released: 2013  \n  Duration: 48:24\n  Genre: Electronic\n  Style: Dance, R&amp;B\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 I'm Selfish\n  02 Big Love\n  03 What A Shame\n  04 Do Yourself A Faver\n  05 You Naked\n  06 why_ya_why\n  07 Blaming Something\n  08 You Know My Name\n  09 So Cold\n  10 Don't You Love Me\n  11 In Your Mind\n\n  For a superb soul singer, Jamie Lidell is uncommonly good at production -- and conversely, for a great producer, he has an incredible voice. Accordingly, his solo material and occasional collaborative projects always inhabit some common ground between the two. His self-titled solo album for Warp is slightly more a production album than a voice album, although all of the tracks are vocal productions. The entire affair is supercharged with the type of electro-funk that makes folks of a certain age think Bootsy and folks of a slightly younger age think of Prince (Sly Stone being the common link for both). This is definitely music that finds a home in the early '80s, with all of the slapping percussion, space-age synth, and clever meld of organic and synth that made the age of synth pop such a transition from analog to digital. \n\n  Leading up to its release, Lidell gained a new studio and a new home in Nashville, and this is probably the best production he's given a record (which is really saying something). It's also one of the least filled with special guests, although most tracks include at least one or two people helping out with live drums or synth. Considering his background in experimental techno, Jamie Lidell is surprisingly not too far away from the world of contemporary chart-bound rock, with touchstones as strange and yet apt as Maroon 5 and fun. paving the way. Granted, Lidell has more of a retro touch than any pop group would dare consider, but these songs are just an AmIdol appearance away from the commercial mainstream.","torrent":{"xt":"urn:btih:67d123ed2631e4c68b06ae694e99fd789b368b0b","amp;dn":"Jamie+Lidell+-+Jamie+Lidell+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d123ed2631e4c68b06ae694e99fd789b368b0b","infoHashBuffer":{"type":"Buffer","data":[103,209,35,237,38,49,228,198,139,6,174,105,78,153,253,120,155,54,139,11]},"announce":[],"urlList":[]}}