{"title":"Iron Maiden Flight 666 Soundtrack (Live) 320kbps","uid":8248709,"size":245495305,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68814d8da2c9078a1b246411394c858ae594724c&amp;dn=Iron+Maiden+Flight+666+Soundtrack+%28Live%29+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ironmaiden2013","files":-1,"time":1363115844,"description":"The idea behind FLIGHT 666 was seemingly birthed from a WAYNE'S WORLD fantasy sequence: the mighty Iron Maiden would embark upon a world tour of exotic locales, transported to each venue in a custom 757 jet piloted by the band's lead singer, with scores of crew, journalists, and family members in tow. Surprisingly, the band not only pulled off the mind-boggling undertaking but delivered an extraordinary live album in the process. The FLIGHT 666 soundtrack compares favorably with the band's classic in-concert disc, LIVE AFTER DEATH, and, since it is heavy on classic Maiden tracks like &quot;Run to the Hills&quot; and &quot;The Trooper,&quot; would also serve as a fine introduction for newbies. Throughout, the band's performances are spirited and joyous, showing that Iron Maiden were still the kings of British metal more than three decades into their storied career. Audio Mixer: Kevin Shirley. Audio Remasterer: Ryan Smith . Iron Maiden: Bruce Dickinson (vocals); Adrian Smith (guitar); Dave Murray , Janick Gers (guitars); Steve Harris (bass guitar); Nicko McBrain (drums). Additional personnel: Michael Kenney (keyboards).\n\nTrack listing:\n\nDisc 1:\n\n        1\tChurchill's Speech \t\t\n\t2\tAces High \n\t3       2 Minutes to Midnight\n\t4\tRevelations \t\t\t\n\t5\tThe Trooper \n\t6\tWasted Years \t\t\n\t7\tNumber of the Beast \n\t8\tCan I Play With Madness \n\t9\tRime Of The Ancient Mariner \n\nDisc 2:\n\n        1\tPowerslave \n\t2\tHeaven Can Wait \n\t3\tRun To the Hills \n\t4\tFear of the Dark \n\t5\tIron Maiden\n\t6\tMoonchild\n\t7\tThe Clairvoyant \n\t8\tHallowed Be Thy Name \n\nThis is an outstanding live album from Iron Maiden. I had the privilege to see them live on this tour In San Juan, Puerto Rico and I was totally amazed with their performance end endurance thru the whole show. This guys are incredible and very professional. All the songs in this album are flawless and most of them are much better than the studio versions. I'm not saying I don't like Maiden in studio, they are good but Live they are just something else, is almost magical. For example, listen to Rime Of The Ancient Mariner and Powerslave In studio versions and then Listen to the versions in this album and you'll know what I mean. Anyways Iron Maiden is my favorite band and in my opinion is the best and most professional band in the planet. I would buy every single album they put out there and go to every concert that I can within 3,000 miles of my city. In fact I flew From D.C. to Puerto Rico just to see them. Enjoy this great album and seed if you can so others can enjoy this great music. Support the band If you can too. Don't just download everything, band like this deserve our support. \n\nThank You and leave your comments if you like my torrents.\n\n\n","torrent":{"xt":"urn:btih:68814d8da2c9078a1b246411394c858ae594724c","amp;dn":"Iron+Maiden+Flight+666+Soundtrack+%28Live%29+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68814d8da2c9078a1b246411394c858ae594724c","infoHashBuffer":{"type":"Buffer","data":[104,129,77,141,162,201,7,138,27,36,100,17,57,76,133,138,229,148,114,76]},"announce":[],"urlList":[]}}