{"title":"[SoM]I fiumi di porpora[DvdRip-Xvid-Ita-AC3]","uid":4416582,"size":1219921920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:689367c40d105b5b29cda9af700b51c0cc61354f&amp;dn=%5BSoM%5DI+fiumi+di+porpora%5BDvdRip-Xvid-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mitimex","files":2,"time":1222547798,"description":"A trecento chilometri di distanza, due poliziotti si vedono affidare due casi singolari che sono destinati ad incrociarsi.\nPierre NiÃƒÂ©mans [Jean Reno, &quot;Ronin&quot;, &quot;Godzilla&quot;] uomo quasi infallibile nel suo lavoro ma combattuto da dolorose ossessioni, si reca a Guernon cittÃƒÂ  universitaria delle Alpi dove si ÃƒÂ¨ verificato un tremendo omicidio con tanto di mutilazione. Max KerkÃƒÂ©rian [Vincent Cassel, &quot;Giovanna d&amp;#039;Arco&quot;, &quot;Elizabeth&quot;] ÃƒÂ¨ un giovane acuto e solitario, ex ladro di macchine poi passato nel corpo della polizia per amore della notte e del pericolo. A lui tocca indagare a Sarzac sulla profanazione di una tomba di un bambino scomparso nel 1982. Le due inchieste, apparentemente lontane anni luce, presto si fondono e gli omicidi si moltiplicano. La veritÃƒÂ  ÃƒÂ¨ al di lÃƒÂ  di tutte le ipotesi e condurrÃƒÂ  i due poliziotti ad alta quota a sfidare il ghiaccio e la morte.\nTratto dal best seller di Jean-Christophe GrangÃƒÂ¨ &quot;I fiumi di porpora&quot; ÃƒÂ¨ diretto dal regista francese Mathieu Kassovitz, considerato da tutti un fenomeno dopo aver scritto e diretto &quot;L&amp;#039;odio&quot; e poi caduto in disgrazia con il successivo &quot;Assassin(s)&quot;, ma grazie a questo film sembra che anche per lui sia tornato il sereno.\nSplendida ambientazione per questo thriller mozzafiato che, prendendo lo spunto da una catena di omicidi commessi da uno spietato serial killer, arriva a toccare argomenti di estrema attualitÃƒÂ  come quello della manipolazione genetica e tutte le conseguenze che possono derivare. Per il ruolo dei due protagonisti Kassovitz si ÃƒÂ¨ affidato a due degli attori francesi piÃƒÂ¹ apprezzati in assoluto come Reno e Cassel; quest&amp;#039;ultimo ha costretto il set a bloccarsi per tre settimane a causa di un occhio nero, regalo di una delle tante scene di combattimento del film.","torrent":{"xt":"urn:btih:689367c40d105b5b29cda9af700b51c0cc61354f","amp;dn":"%5BSoM%5DI+fiumi+di+porpora%5BDvdRip-Xvid-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689367c40d105b5b29cda9af700b51c0cc61354f","infoHashBuffer":{"type":"Buffer","data":[104,147,103,196,13,16,91,91,41,205,169,175,112,11,81,192,204,97,53,79]},"announce":[],"urlList":[]}}