{"title":"Go! More Than a Game (2003) epub","uid":9750555,"size":16463179,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68c162d53cbacc7f5dfdc7a644ab6184eea9aacc&amp;dn=Go%21+More+Than+a+Game+%282003%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1394657113,"description":"Invented 2500-4000 years ago, the game of Go has enthralled hundreds of millions of people in Asia, where it is an integral part of the culture. In the West, many have learned of its pleasures, especially after the game appeared in a number of hit movies, TV series, and books, and was included on major Internet game sites. By eliciting the highest powers of rational thought, the game draws players, not just for the thrills of competition, but because they feel it enhances their mental, artistic, and even spiritual lives.\n\n Go! More Than a Game uses the most modern methods of teaching, so that, in a few minutes, anyone can understand the two basic rules that generate the game. The object of Go is surrounding territory, but the problem is that while you are doing this, the opponent may be surrounding you! In a series of exciting teaching games, you will watch as Go's beautiful complexities begin to unfold in intertwining patterns of black and white stones. These games progress from small 9x9 boards to 13x13 and then to the traditional 19x19 size.\n\n Go! More Than a Game has been completely revised by the author based on new data about the history of early go and the Confucians who wrote about it. This popular book includes updated information such as the impact of computer versions on the game, the mysterious new developments of Go combininatroics, advances in Combinatorial Game Theory and a look at the current international professional playing scene. \n\nweiqi","torrent":{"xt":"urn:btih:68c162d53cbacc7f5dfdc7a644ab6184eea9aacc","amp;dn":"Go%21+More+Than+a+Game+%282003%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68c162d53cbacc7f5dfdc7a644ab6184eea9aacc","infoHashBuffer":{"type":"Buffer","data":[104,193,98,213,60,186,204,127,93,253,199,166,68,171,97,132,238,169,170,204]},"announce":[],"urlList":[]}}