{"title":"Chris Bradford - De jonge samoerai. NL Ebook. DMT ","uid":11787307,"size":2095547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68f62f083dc7c5525e17d766b91708acf2bd6db7&amp;dn=Chris+Bradford+-+De+jonge+samoerai.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"BiWild","files":6,"time":1427800278,"description":"Chris Bradford - De jonge samoerai. NL Ebook. DMT \n\nAuteur: Chris Bradford\nPagina's:248/282/342\nTaal: Dutch/Nederlands\nUitgever: De Boekerij bv,\nJaar van uitgifte: 2010/2015\nGenre: Jeugd\n\nSamenvatting\n\nAfbeelding\n\nDe weg van de krijger\nAugustus 1611. De dertienjarige Jack Fletcher spoelt aan als drenkeling op de kust van Japan, nadat het schip waarop hij met zijn \nvader werkt wordt overvallen door ninjapiraten, die de gehele bemanning vermoorden. Hij wordt gered door de legendarische \nzwaardmeester Masamoto Takeshi. Onder leiding van Masamoto in zijn Niten Ichi-Ry, 'Een School van Twee Hemels', in Kyoto \nbegint Jacks training in het bushido - de weg van de krijger. Zijn doel: wraak nemen op de moordenaar van zijn vader, de ninja \ndie hij alleen maar kent als Drakenoog. Samen met Takeshi's dochter, de beeldschone Takiko, gaat hij op pad...\n\nAfbeelding\n\nDe weg van het zwaard\nNa een jaar training als samoerai zit Jack in de problemen. Hij bereidt zich voor op de Cirkel van Drie, een oud ritueel dat zijn moed, \nkunde en geest tot het uiterste zal testen. Tegelijkertijd heeft hij ruzie met medeleerling Kazuki en zijn bende. En zijn dodelijke rivaal, \nde ninja genaamd Drakenoog, kan elk moment toeslaan. Is hij in staat om de Weg van het Zwaard meester te worden?\n\nAfbeelding\n\nDe weg van de draak\nOnder dreiging van oorlog moet Jack laten zien uit welk hout hij gesneden is. Samoeraifamilies kiezen partij en het eerste bloed vloeit: \nJack moet alles gebruiken wat hij op de samoeraischool heeft geleerd. Zijn leven en dat van zijn vrienden hangt af van de tweezwaardenstijl, \nde geheime zwaardstijl van de legendarische Masamoto Takeshi. Maar eerst moet Jack de schat van zijn vader terugveroveren \nop de gevaarlijke ninja Drakenoog. Gaat Jack slagen, of sterft hij een pijnlijke dood? \n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:68f62f083dc7c5525e17d766b91708acf2bd6db7","amp;dn":"Chris+Bradford+-+De+jonge+samoerai.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f62f083dc7c5525e17d766b91708acf2bd6db7","infoHashBuffer":{"type":"Buffer","data":[104,246,47,8,61,199,197,82,94,23,215,102,185,23,8,172,242,189,109,183]},"announce":[],"urlList":[]}}