{"title":"The_Walking_Dead_GOTY_PS3-ANTiDOTE","uid":9295786,"size":4616923300,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:6943f264f2ad23304b535b0fbbeb974f36482da3&amp;dn=The_Walking_Dead_GOTY_PS3-ANTiDOTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"dududus","files":66,"time":1386151154,"description":"OVER 90 GAME OF THE YEAR AWARDS\nTelltale's The Walking Dead is made up of five episodes that each won numerous high-score accolades and editor's choice awards. Together, as one season, they won over 90 Game of the Year Awards from around the world, plus prestigious BAFTA Awards, proving that a zombie game didn't need to be all about guns, and that gamers would respond fanatically to a deeply emotional story that would leave them craving more.\n\nTHE BIGGEST ZOMBIE FRANCHISE THE WORLD HAS SEEN\nTelltale's The Walking Dead is set in the same world as Robert Kirkman's award-winning comic book series. This Game of the Year collection includes all five episodes of Season One of The Walking Dead and includes 400 Days', a special episode that was previously available only as downloadable content.\n\nTHE COMPLETE EXPERIENCE AT AN IMPULSE PRICE POINT\nAs Season Two of Telltale's hit game series approaches and as Walking Dead fever builds again with the fourth season of the runaway hit TV series, this is the perfect time to catch up and enter the world of The Walking Dead. As well as all five episodes of Season One and special episode 400 Days', this Game of the Year pack offers fans exclusive digital content in the form of access to the original game soundtrack and a never-before-seen behind the scenes video.\n\nSupported by multi-million dollar TV campaign running during Season 4 of The Walking Dead on AMC\n  \nAll five episodes of Season One and - for the first time - special episode 400 Days' available on disc\n\nIncludes digital access to exclusive content: original game soundtrack and behind the scenes video\n\nthx to Pulcione86","torrent":{"xt":"urn:btih:6943f264f2ad23304b535b0fbbeb974f36482da3","amp;dn":"The_Walking_Dead_GOTY_PS3-ANTiDOTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6943f264f2ad23304b535b0fbbeb974f36482da3","infoHashBuffer":{"type":"Buffer","data":[105,67,242,100,242,173,35,48,75,83,91,15,187,235,151,79,54,72,45,163]},"announce":[],"urlList":[]}}