{"title":"MSTS - Addon - SP West Colton Route [h33t] [FF_EXT]","uid":9996120,"size":786148110,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6964efd09acc2aabe2f760d1344c06b2a0e8dfde&amp;dn=MSTS+-+Addon+-+SP+West+Colton+Route+%5Bh33t%5D+%5BFF_EXT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"FrankFoo2","files":8,"time":1397923505,"description":"\nMSTS -  Addon - SP West Colton Route\n\nIncludes:\n\nRoute:\nWest Colton Route\n\nTrains:\nDW - Southern Pacific Packs 1 - 4\nDW - UP_MP15\n\nFree Acitvity pack\n\n\nInfo:\n\nSP West Colton Route is all about the operations in and around a huge classification yard. \nIn this case, SP's West Colton Yard which is one of the largest on the west coast. \nOur route encompasses about 40 square miles and includes sections of four different Subdivisions. \n\nThey are: \n1) The SP Alhambra Sub which starts at West Colton and runs west to LA. \n2) The SP Mojave Sub which starts at West Colton and runs north over the Palmdale Cutoff towards Mojave and Bakersfield. \n3) The SP Yuma Sub which starts at West Colton and runs eastward towards Indio and Yuma. \n4) The ATSF San Bernardino Sub which starts at San Bernardino and runs south/west towards West Redondo.\n\n\n\n\n\nThe circa is from the late 70's to the mid 90's, and the track charts we used were dated 1996 which is the pre merger period \nbefore Union Pacific merged with Southern Pacific, and Burlington Northern merged with Santa Fe.\n\nAnd finally, the entire route is situated next to the San Gabrial and San Bernardino mountain ranges to the north and \nnortheast of the area which provides beautiful vistas and a dramatic backdrop for this MSTS project.\n\nHistory\n\nWest Colton was built by Southern Pacific in 1972 at the junction of the lines west into Los Angeles and north over the \nColton-Palmdale Cutoff (which opened in 1968) to replace the classification yard in Los Angeles that was no longer on the \nmain route between the Sunset Route and the San Joaquin Valley line. \n\nThe yard is nearly six miles long and the recieving tracks can hold 180 car trains and the classification tracks are \nbetween 2200 ft and 3200 ft. long. \n\nThe departure tracks can hold approximately 2000 cars. \nAll departures leave from the east end of the yard, \nhowever, there is a balloon track that can turn trains west if they are headed in that direction.\n\nThe actual yard location is on the south side of the Sunset Route main line and on the south side of I-10, some 45 miles east of Los Angeles. \nA diesel locomotive maintenance facility is also located at West Colton. \nThe large yard is laid out along the south side of the main track. \nBeginning at Sierra Avenue, one sees the receiving yard (where cars are inspected and checked against wheel reports). \nThen, just east of Cedar Avenue the receiving tracks lead to the hump crest and the hump tower (administrative offices are also located south \nof the hump crest) followed by the classification bowl tracks which narrow down to pass under Riverside Avenue. \nSouthwest of the Riverside Avenue overpass is the locomotive facility and the engineering headquarters. \nEast of Riverside Avenue are the departure tracks stretching to Pepper Avenue.\n","torrent":{"xt":"urn:btih:6964efd09acc2aabe2f760d1344c06b2a0e8dfde","amp;dn":"MSTS+-+Addon+-+SP+West+Colton+Route+%5Bh33t%5D+%5BFF_EXT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6964efd09acc2aabe2f760d1344c06b2a0e8dfde","infoHashBuffer":{"type":"Buffer","data":[105,100,239,208,154,204,42,171,226,247,96,209,52,76,6,178,160,232,223,222]},"announce":[],"urlList":[]}}