{"title":"Political Ponerology {BBS}","uid":6869098,"size":4703914,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6972c44e67910a2b449866652f96fb664f333f90&amp;dn=Political+Ponerology+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1323214610,"description":"The first manuscript of this book went into the fire five minutes before the arrival of the secret police in Communist Poland. The second copy, reassembled painfully by scientists working under impossible conditions of repression, was sent via a courier to the Vatican. Its receipt was never acknowledged, no word was ever heard from the courier - the manuscript and all the valuable data was lost. The third copy was produced after one of the scientists working on the project escaped to America in the 1980s. Zbigniew Brzezinski suppressed it.\nPolitical Ponerology was forged in the crucible of the very subject it studies. Scientists living under an oppressive regime decide to study it clinically, to study the founders and supporters of an evil regime to determine what common factor is at play in the rise and propagation of man's inhumanity to man.\nShocking in its clinically spare descriptions of the true nature of evil, poignant in the more literary passages where the author reveals the suffering experienced by the researchers who were contaminated or destroyed by the disease they were studying, this is a book that should be required reading by every citizen of every country that claims a moral or humanistic foundation. For it is a certainty that morality and humanism cannot long withstand the predations of Evil. Knowledge of its nature, how it creates its networks and spreads, how insidious is its guileful approach, is the only antidote.\n\n\n# Paperback: 239 pages\n# Publisher: Red Pill Press; 2nd edition (April 4, 2007)\n# Language: English\n# ISBN-10: 1897244258\n# ISBN-13: 978-1897244258","torrent":{"xt":"urn:btih:6972c44e67910a2b449866652f96fb664f333f90","amp;dn":"Political+Ponerology+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6972c44e67910a2b449866652f96fb664f333f90","infoHashBuffer":{"type":"Buffer","data":[105,114,196,78,103,145,10,43,68,152,102,101,47,150,251,102,79,51,63,144]},"announce":[],"urlList":[]}}