{"title":"A Hundred Years of Japanese Film: A Concise History","uid":5492492,"size":41011586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:697fa3dd26dc97ae22b7a9d1bdac96095df11937&amp;dn=A+Hundred+Years+of+Japanese+Film%3A+A+Concise+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"artpepper","files":-1,"time":1271090002,"description":"A Hundred Years of Japanese Film: A Concise History, with a Selective Guide to DVDs and Videos\nBy Donald Richie\n\n\nKodansha International | English | 2 Rev Upd edition | August 1, 2005 | ISBN: \n9784770029959 \n\n329 pages | HQ PDF | 39.1 MB\n\n\n\n\n\nWidely considered the leading Western authority on Japan, Richie has a particular affinity for the nation's films, as is evident on every page of this authoritative survey. \n\n\nHe emphasizes the collaborative nature of film, which is particularly appropriate since in Japanese culture the collective usually trumps the individual, and shows how Japanese cinema largely eschewed realism and narrative until it fell under Western influence. \n\n\nThe section on the silent era, when live narrators, benshi, described films' stories to audiences, is particularly revelatory, since 90 percent of pre-1945 Japanese films haven't survived.\n \n\nRichie comments insightfully on the acknowledged masters-- Mizoguchi, Ozu, and Kurosawa--and also on other notable directors who are virtually unknown to even the most avid American cineasts. He finds less to praise about contemporary filmmakers, whose flashier, Westernized approach seems less to his liking. \n\n\nThe impressive amount of information on films renowned and obscure and Richie's enthusiasm and critical acumen make this essential for film studies collections. Brief reviews of about 200 films, with notations on video availability, top things off nicely.\n\n","torrent":{"xt":"urn:btih:697fa3dd26dc97ae22b7a9d1bdac96095df11937","amp;dn":"A+Hundred+Years+of+Japanese+Film%3A+A+Concise+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"697fa3dd26dc97ae22b7a9d1bdac96095df11937","infoHashBuffer":{"type":"Buffer","data":[105,127,163,221,38,220,151,174,34,183,169,209,189,172,150,9,93,241,25,55]},"announce":[],"urlList":[]}}