{"title":"Fallen Enchantress: Ultimate Edition (GOG)","uid":13380676,"size":7576952092,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:698cac3f151053af1d6c1c3b865c94d10e14895e&amp;dn=Fallen+Enchantress%3A+Ultimate+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"mercs215","files":13,"time":1454275435,"description":"Install instructions:\r\n- Run &quot;setup_fallen_enchantress_2.0.0.3.exe&quot;\r\n- Navigate to the DLC folder and run &quot;setup_fallen_enchantress_legendary_heroes_2.0.0.2.exe&quot;\r\n- Navigate to the DLC folder and run &quot;setup_fallen_enchantress_legendary_heroes_ultimate_dlc_2.0.0.2.exe&quot;\r\n- Navigate to the DLC folder and run &quot;setup_fallen_enchantress_map_pack_dlc_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: FALLEN ENCHANTRESS: ULTIMATE EDITION\r\nGenre: Strategy - Turn-based - Fantasy\r\nWorks on: Windows (Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nFeatures: single-player\r\nReleased: September 17, 2012\r\nCompany: Stardock Entertainment / Stardock Entertainment\r\nStore page: http://www.gog.com/game/fallen_enchantress_ultimate_edition\r\n\r\nAbout:\r\nIncludes Fallen Enchantress and the standalone expansion, Fallen Enchantress: Legendary Heroes, the Fallen Enchantress/Fallen Enchantress: Legendary Heroes Map Pack DLC, and the Fallen Enchantress: Legendary Heroes DLC: Battlegrounds, Dead World, Leader Pack, Loot Pack, and Quest Pack\r\nFallen Enchantress\r\nA World to Build… or Destroy.\r\n“A war is coming… a war between East and West - between Kingdoms and Empires, between man and Fallen. A future of blood and death, of chaos and destruction.\r\n– the Oracle Ceresa\r\nDesign your sovereign with unique talents and weapons for the trials ahead. Learn powerful spells to enchant units, summon elementals, or destroy those who oppose you. Found cities and research technologies to expand your influence. Send your champions on quests to recover ancient artifacts, gain allies, or obtain the great wealth lost during the Cataclysm.\r\nThe land is not simply waiting to be claimed; it must be conquered. Darkling camps, ogre lairs and caves waiting to be explored dot the landscape. In remote corners of the world, tireless butchermen, fell demons and legendary locations are waiting to be found. Explore Varda, a pre-Cataclysm city defended by golems that have turned on the citizens and made the city into a prison. Defeat Sarog to claim the Temple of the Dragon and recruit Ashwake Dragons to your cause. Claim the Flooded Graveyard or the Pit of Sarpah to harness the powerful magical energy of those locations.\r\nFallen Enchantress: Legendary Heroes\r\nThe Fallen Enchantress seeks to destroy the civilizations that have risen from the ashes of the Cataclysm. Fortunately, your fame has spread and great heroes have been drawn to your banner. With your new champions, you will confront new horrors like liches, brood hunters, banshees, and the dreaded hergon.\r\nFallen Enchantress: Legendary Heroes is the new standalone expansion to Stardock’s turn-based, fantasy strategy game. Players will forge a new empire in a world sundered by powerful magic, fight against terrible creatures, complete quests and rediscover lost secrets in their bid to rule the world of Elemental.\r\nRecruit Champions - Equip them with rare magical items that you create or discover. Customize your champion’s special abilities and traits as they gain levels.\r\nFight in tactical battles - Battle enemy armies or the wild creatures of the world. Command your armies directly and choose between the special attacks and spells your units have learned.\r\nDesign your units - Customize their armor and weapons. Equip units with mounts to quickly close on enemy units. Train them with specialized traits like Discipline and Ignore Pain.\r\nLiberate or Enslave - Transform Elemental into a noble kingdom, or an empire where citizens are fuel for your spells. Build studies and workshops to make your citizens more productive, or gallows and sacrificial altars to keep your citizens motivated.\r\n\r\nMinimum system requirements - Windows: Vista SP2/ 7 SP1 / 8 / 10 \r\nProcessor: 2.2 GHz Dual-Core Processor\r\nMemory: 2 GB RAM\r\nGraphics: 512 MB DirectX 9.0c Compliant Video Card w/Pixel Shader 2.0 (Radeon x1600 / GeForce 6800 or better)\r\nDirectX 9.0c\r\nHard Drive: 5 GB Space\r\nDirectX 9.0c Compatible Sound Card\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:698cac3f151053af1d6c1c3b865c94d10e14895e","amp;dn":"Fallen+Enchantress%3A+Ultimate+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"698cac3f151053af1d6c1c3b865c94d10e14895e","infoHashBuffer":{"type":"Buffer","data":[105,140,172,63,21,16,83,175,29,108,28,59,134,92,148,209,14,20,137,94]},"announce":[],"urlList":[]}}