{"title":"Buddy Rich and Gene Krupa - Drum Battle JATP","uid":7905555,"size":51465542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69aed4da429d652ecc344f59741b80d104fcc218&amp;dn=Buddy+Rich+and+Gene+Krupa+-+Drum+Battle+JATP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jazznbluz","files":-1,"time":1355085942,"description":"This set was initially issued as the 15th instalment in Norman Grantz's Jazz at the Philharmonic series of LPs, EPs, and 45s. As that highly collectible compilation of performances has been out of print since the 1960s, many of the volumes were later issued under the respective artists' name. As the title would imply, Drum Battle: Jazz at the Philharmonic features the artistry of the Gene Krupa Trio with Buddy Rich (drums) sitting in on a few numbers as well as the inimitable jazz scat vocalizations of Ella Fitzgerald on a hot steppin' and definitive &quot;Perdido.&quot; Opening the disc is Krupa's trio with Willie Smith (alto sax) and Hank Jones (piano) providing a solid and singularly swinging rhythm section. While Smith drives the band, Krupa is front and center with his antagonistic percussive prodding. &quot;Idaho&quot; is marked with Jones' rollicking post-bop mastery as he trades solos with Smith and can be heard quoting lines from Monk before yielding to Smith. The cover of Duke Ellington's &quot;Sophisticated Lady&quot; sparkles from beginning to end. Jones' opening flourish sets the tenure as Smith settles into a smoky lead, containing some nice syncopation and regal augmentation from Jones. Krupa primarily provides ample rhythm work on the emotive ballad. Smith's diversion into &quot;Stormy Weather&quot; is notable for exemplifying the lyrically improvisational nature of this combo. The tempo is significantly stepped up on a cover of Benny Goodman's &quot;Flying Home,&quot; which is full of high-spirited playing and garners a sizable reaction from the audience. The lengthy &quot;Drum Boogie&quot; is one of Krupa's signature pieces and is greeted with tremendous enthusiasm. Buddy Rich climbs on board for a one-on-one duel with Krupa, whose styles mesh into a mile-a-minute wash of profound percussion. The duet segues into an inspired and free-form jam on &quot;Perdido,&quot; with Fitzgerald belting out her lines with authority, class, and most of all, soul.","torrent":{"xt":"urn:btih:69aed4da429d652ecc344f59741b80d104fcc218","amp;dn":"Buddy+Rich+and+Gene+Krupa+-+Drum+Battle+JATP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69aed4da429d652ecc344f59741b80d104fcc218","infoHashBuffer":{"type":"Buffer","data":[105,174,212,218,66,157,101,46,204,52,79,89,116,27,128,209,4,252,194,24]},"announce":[],"urlList":[]}}