{"title":"The Illustrated Canon of Chen Family Taijiquan (DJVU) (Malestrom","uid":5676090,"size":5545201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69f2c6543f52712021ff5d345b166fb676d052e6&amp;dn=The+Illustrated+Canon+of+Chen+Family+Taijiquan+%28DJVU%29+%28Malestrom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1278530817,"description":"The Illustrated Canon of Chen Family Taijiquan By Chen Xin\nPublisher: McFarland 2007 | 750 Pages | ISBN: 5986870085 | DJVU\n\n&quot;The Illustrated Canon of Chen Family Taijiquan&quot; is universally acknowledged by Taijiquan practitioners as the seminal sourcebook of Chen Taiji philosophy and techniques. A work of intense scholarship which took over fourteen years to complete, this tome was intended by its author to be both the first ever written repository of Taiji lore, and a referential resource for Taiji instructors and practitioners for generations to follow. The English translation of this canon in its entirety was made by an experienced Taiji practitioner and scholar of Chinese culture Alex Golstein and marks the first ever attempt to translate into English Chen Xin\u001as highly esoteric and detailed technical explanations of Chen-style Taijiquan techniques, including his meticulous inscriptions for over 400 illustrations. \n\nGiven the complexity of the material, the main objectives of this translation are twofold. First, to render the work accessible to as wide an audience as possible by modernizing and simplifying the language while conserving the integrity of the author\u001as intention and instruction. To this end, the Pinyin system has been used to standardize the spelling of all Chinese nouns, and footnotes have been added wherever additional clarification was deemed necessary. \n\nThe second objective is to encourage its usage as a reference book by improving on the user-friendliness of its structure. Hence, minor adjustments were made in the order and naming of the chapters, and more importantly, the order of inscriptions explaining the illustrations have been clarified through a detailed numbering system. Detailed table of contents was also added to facilitate navigation through the 750 pages of this book. Readers will find this first edition a useful introduction into the philosophy and techniques of Chen Taijiquan and a valuable source of knowledge as their practice and understanding evolves.","torrent":{"xt":"urn:btih:69f2c6543f52712021ff5d345b166fb676d052e6","amp;dn":"The+Illustrated+Canon+of+Chen+Family+Taijiquan+%28DJVU%29+%28Malestrom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f2c6543f52712021ff5d345b166fb676d052e6","infoHashBuffer":{"type":"Buffer","data":[105,242,198,84,63,82,113,32,33,255,93,52,91,22,111,182,118,208,82,230]},"announce":[],"urlList":[]}}