{"title":"Moral Combat: A History of World War II","uid":11820840,"size":42117683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a5a900daf73a307d38f58114a91d5164a02841b&amp;dn=Moral+Combat%3A+A+History+of+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429250679,"description":"This panoramic history of the defining conflict of the last century investigates the myriad decisions that shaped World War II in order to explore the moral sentiment of both individuals and entire societies. \nWhereas previous histories of the war have tended to focus on grand strategy or major battles, Burleigh brings his astonishing scholarship and profound sensibility to bear on what shaped choices that were life and death decisions. These were made in real time, without the benefit of a philosopher's reflection, giving a moral content to the war which shaped it as decisively as any individual battle. The Nazis and the Japanese had radically different moral universes from those of their Allied opponents, as reflected in the atrocities they committed, although the western Allies found themselves aligned with a no less cruel dictatorship after rejecting the option of appeasing aggression. The war was the sum total of myriad choices made by governments, communities and individuals, leading some to enthusiastically embrace evil, and others to consciously reject it, with a range of more ambiguously human responses in between. Spanning both major theatres and ranging across these issues and more, from the 'predators' - Mussolini, Hitler and Hirohito - to appeasement, the rape of Poland, Barbarossa, strategic bombing and the complexities of justice and retribution, &quot;Moral Combat: A History of World War II&quot; sheds a revealing light on how entire nations changed under the impact of total war. Fascinating and deeply engaging, this insightful history presents readers with a fresh and powerful perspective on a conflict whose legacy haunts us to this day. Original, perceptive and astonishing in scholarship and scope, this is an unforgettable and hugely important work of Second World War history","torrent":{"xt":"urn:btih:6a5a900daf73a307d38f58114a91d5164a02841b","amp;dn":"Moral+Combat%3A+A+History+of+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a5a900daf73a307d38f58114a91d5164a02841b","infoHashBuffer":{"type":"Buffer","data":[106,90,144,13,175,115,163,7,211,143,88,17,74,145,213,22,74,2,132,27]},"announce":[],"urlList":[]}}