{"title":"Duphly - Harpsichord selections - E Joye, hpschd [Philidor]","uid":15855668,"size":507277117,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ae1e85d685d8525120ed507bac70ec317223908&amp;dn=Duphly+-+Harpsichord+selections+-+E+Joye%2C+hpschd+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Philidor","files":16,"time":1474240200,"description":"Per Allmusic:\r\n\r\n&quot;Jacques Duphly was -- like English composer Charles Avison -- among the last of his stylistic line, a French harpsichordist whose lifespan reached up to one day beyond the storming of the Bastille. Duphly's choice of instrument and approach in composing for it continued -- and apparently concluded -- a tradition that stretched back to the early seventeenth century and included among its proponents such figures as François Couperin and Jean-Philippe Rameau. Blindfolded, listeners would have a hard time telling certain works of Duphly apart from Couperin, although by comparison they are longer; Couperin's pieces average about 4-6 minutes, whereas with Duphly it's more like 6-8 minutes. It isn't just a matter of pacing or repeats; Duphly's sequences are longer, as are his harmonic projections of a given tune. Duphly published four volumes of harpsichord music and only the last one, published in 1768, shows some concessions to classical style; the rest are resolutely Baroque and show no evidence of yielding any quarter to the milieu of that upstart, the piano. Recordings of Duphly within his own context, rather than a piece or two offered within a collection or to fill out a disc of Couperin, are reasonably uncommon, although a recording of his complete output, on four discs, was made back in the 1990s. Alpha Productions' Jacques Duphly: Pièces de Clavecin, featuring harpsichordist Elisabeth Joyé, is a very good introduction to his general sound and far more accessible by virtue of its selectiveness, compiling 14 of the best of Duphly's 52 surviving compositions.&quot;\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio is enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread: \r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:6ae1e85d685d8525120ed507bac70ec317223908","amp;dn":"Duphly+-+Harpsichord+selections+-+E+Joye%2C+hpschd+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ae1e85d685d8525120ed507bac70ec317223908","infoHashBuffer":{"type":"Buffer","data":[106,225,232,93,104,93,133,37,18,14,213,7,186,199,14,195,23,34,57,8]},"announce":[],"urlList":[]}}