{"title":"Building Your Own Stanley Meyer Water Fuel Cell","uid":5265021,"size":246834682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b233c49cfaa146ae6d3e00d4600228594b1c2c3&amp;dn=Building+Your+Own+Stanley+Meyer+Water+Fuel+Cell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ryba777","files":149,"time":1262865507,"description":"Building Your Own Stanley Meyer Water Fuel Cell (Study Pack)\n\n\n\nThis torrent contains everything you need to successfully build your own Stanley Meyer water fuel cell. There's almost too much information in this torrent but like that you have the choice what kind of circuit you want to use.\n\nIt will take you around a week to construct such a device. The major time consuming factor consists of getting all the parts you need and also the fine-tuning of the device. The device as such is quite simplistic.\n\nSomeone suggested the Joe cell to be a better option, but this device can at least be understood in scientific terms. Devices based on Orgone energy are too unpredictable and unreliable in my opinion.\n\nStanley Meyer's device has been successfully demonstrated at the patent-office and he has received an amazing number of patents for it. It is simply out of question that this device won't work. It it doesn't work for you then it doesn't work because you haven't constructed it properly. Remember: You can also learn a lot from failures - other people's failures and your own ones. In science even an unsuccessful experiment is seen as information that has value. Others won't have to repeat your mistakes and therefore will save a lot of time.\n\nThe main problem with this device is that it may work too well. There are also nuclear processes involved in this device and therefore it might be somewhat risky. If I was you, I wouldn't deviate too much from tried and tested circuits. Similar devices have given off a small quantity of nuclear radiation in some cases. This is not a toy, and only experienced craftsmen and maverick inventors should delve further into the hidden secrets of this amazing project.\n\n\n\nA Brief Introduction to Stanley Meyer's WFC:\n\n\nA water molecule consists of two atoms of hydrogen and one atom of oxygen. Atoms \nconsist of electrons, protons, and even smaller particles. The protons are grouped at \nthe center of the atom in the nucleus, while the electrons orbit around the nucleus of \nthe atom. \n\nElectrons carry a negative charge. Protons carry a positive charge. Electrically stable \natoms always have the same amount of electrons and protons. When the number of \nelectrons and protons is not the same, the atom is electrically charged. This is called \nan ion. \n\nThe hydrogen atom has 1 proton and 1 electron. \nThe oxygen atom has 8 protons and 8 electrons.\n\nWhen two hydrogen atoms bond chemically with an oxygen atom, a water molecule is \nformed.\n\nWhen oxygen and hydrogen combine to make water, a covalent bond is formed \nbetween the atoms. In a covalent bond, the atoms to form a molecule with shared \nelectrons. In a water molecule the electrons are shared unequally. There are more \nelectrons occupying the space around the oxygen atom than the hydrogen atom. The \noxygen end of the molecule has a net negative charge, while the hydrogen end has a \nnet positive charge. Because of the unequal sharing of electrons opposite charges are \nproduced. The unequal electrostatic forces bond atoms of the water molecule \nchemically. \n\nThe unequal sharing of electrons produces a positive and negative side to the water \nmolecule. This is referred to as a polar or dipole. \n  \nThere are three known different forces/fields. They are gravity, magnetism, and \nvoltage. \n \nVoltage is basically the difference of electrons in two different locations. The greater \nthe difference in the number of electrons in one location compared to the second \nlocation, the higher the voltage.\n \nWhen you put the water molecule in a voltage field it will move itself to the \nappropriate positive and negative voltage fields. This happens because water is a \ndipole molecule with a positive and negative ends. \n \nElectrolysis separates water into hydrogen and oxygen. This process is done by \nconstantly introducing electrons into the water solution. \n \nThe water fuel cell uses a different process from electrolysis. In the fuel cell electrons \nare restricted, the water molecule undergoes a lot more stress, and an added sequence \nof events produce a much higher energy efficiency than electrolysis. \n \nStanley Meyer found a way to use Voltage (electrostatic force) so that hydrogen and \noxygen could be released on demand, serve our energy needs, and be sustained with \nvery minimal power requirements. \n \nStanley Meyer Identified two stages of gas production these are: \nElectrical Polarization process (Minimal Gas Yield) \nResonant gas production (High Gas Yield) \n\nElectrostatic force chemically bonds the atoms of the water molecule. Stanley knew \nthat if you raised voltage to a certain level electrons could be stripped of the water \nmolecule. During this process the bonding force between the atomic structures of \nwater is weakened. \n\nThe strong voltage force was used to strip electrons to weaken the electrostatic force \nthat holds the water molecule together. \n \nThis is only possible because electron flow was inhibited.  \nThe gap between the electrodes could be kept to a minimum (around 1-mm). This \nwas achieved because arcing could not occur with restricted electron flow. \nkeeps voltage high across the electrodes and prevents it from dropping to nothing. \n \nImagine the force of having this high voltage field with electron flow restricted. The \nwater molecule would be pretty stressed out! \n \nMaybe another way to visualize what I am saying is: Imagine a magnetic force, as the \nmagnet gets closer and closer it increases in strength. If the water molecule was \neffected by a magnetic force it would be ripped apart but the water molecule is not. \n\nThe Water molecule strongly reacts to a voltage/electrostatic force. That is why Stanley \nMeyer needed to restrict electron flow, if you bring a high voltage field closer and \ncloser together, it will get to a point when it will arc (we don't want this). When it \narcs electron flow has occurred and all that attracting force is lost. Relating this to \nthe example above, it would be as if the magnetic force was turned off... \n\n\n\n\nFiles (Folders):\n\n\npatents\n-Stanley Meyer\n-Andrija Puharich\n-other methods of hydrogen generation\n\nphysics\n-magnetism\n-parametric oscillator\n-water\n-calculations\n-coils\n-electrolysis\n\nwfc theory (important)\n\nwfc cars\n\nknowledge from forums (important)\n\nwfc circuits (most important)\n\nbasic electronic textbooks\n-All New Electronics Self-Teaching Guide (2008) - Malestrom\n-Book-7-Power-Electronics-Motor-Drives-Advances-Trends\n-EFY_2000_Projects_and_Ideas\n-Electronic-Circuits-Fundamentals-and-Applications\n-Electronics_Tutorial\n-Fundamentals-of-Analog-Electronics\n-Hands-on-Electronics\n-The-Electronics-Handbook\n\nbasic electronics circuits\n-electrostatic generator\n-electrostatic detector\n-frequency counter\n-function generators\n-power supplies\n\n\n236.3MB - 209 items - mostly pdf-files\n","torrent":{"xt":"urn:btih:6b233c49cfaa146ae6d3e00d4600228594b1c2c3","amp;dn":"Building+Your+Own+Stanley+Meyer+Water+Fuel+Cell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b233c49cfaa146ae6d3e00d4600228594b1c2c3","infoHashBuffer":{"type":"Buffer","data":[107,35,60,73,207,170,20,106,230,211,224,13,70,0,34,133,148,177,194,195]},"announce":[],"urlList":[]}}