{"title":"Oak.Tree.Natures.Greatest.Survivor.720p.HDTV.x264-MVGroup","uid":12518456,"size":1910403255,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6b291ede36a09d810b64891b2178f4bff2d9a642&amp;dn=Oak.Tree.Natures.Greatest.Survivor.720p.HDTV.x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":1,"time":1443805699,"description":"Dr George McGavin investigates the highly varied and dramatic life of oak tree. Part science documentary, part historical investigation, this film is a celebration of one of the most iconic trees in the British countryside. It aims to give viewers a sense of what an extraordinary species the oak is and provide an insight into how this venerable tree experiences life.\r\n\r\nFilmed over a year, George uncovers the extraordinary transformations the oak goes through to meet the challenges of four very different seasons.\r\n\r\nIn autumn, George goes underground, digging below an oak tree to see how its roots extract precious resource form the soil. And he sees why the oak's super-strong wood made it the perfect material for building some the most famous ships in naval history, including Nelson's flagship The Victory.\r\n\r\nIn winter, George discovers the sophisticated strategies the tree uses to survive gales and bitter frosts. He finds out about the oak's vital role in architecture, showing how some very familiar sights such as the tower of Salisbury Cathedral are in fact giant oak structures.\r\n\r\nIn spring, George investigates how the oak procreates, spreading its pollen through the countryside. He discovers the incredibly sophisticated strategies it uses to withstand savage onslaughts from predators hell-bent on eating it alive.\r\n\r\nIn summer, George uses a high-powered microscope to see the hundreds of species that regard the oak as their home. Humans too rely on the oak for their own form of 'sustenance'. Whisky gets its unique flavours from the oak wood barrels in which it's matured.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 21 (~2677Kbps)\r\nVideo Resolution: 1280x720\r\nVideo Aspect Ratio: 16:9\r\nFrame Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.45 VBR 48KHz (~128Kbps)\r\nAudio Channels: 2\r\nRun-Time: 59 mins\r\nNumber of Parts: 1\r\nPart Size: 1.78 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:6b291ede36a09d810b64891b2178f4bff2d9a642","amp;dn":"Oak.Tree.Natures.Greatest.Survivor.720p.HDTV.x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b291ede36a09d810b64891b2178f4bff2d9a642","infoHashBuffer":{"type":"Buffer","data":[107,41,30,222,54,160,157,129,11,100,137,27,33,120,244,191,242,217,166,66]},"announce":[],"urlList":[]}}