{"title":"Donald Byrd - Black Byrd (1972) [Jazz][mp3 320][h33t][schon55]","uid":4697479,"size":104350932,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ba2e97fc18179bfd4906055305ff2caa615338b&amp;dn=Donald+Byrd+-+Black+Byrd+%281972%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"schon55","files":13,"time":1233605094,"description":"Donald Byrd - Black Byrd\nOriginal Release Date: April 3, 1972 \nLabel: Blue Note Records \nBitrate: 320 kbps\n\nPurists howled with indignation when Donald Byrd released Black Byrd, a full-fledged foray into R&amp;B that erupted into a popular phenomenon. Byrd was branded a sellout and a traitor to his hard bop credentials, especially after Black Byrd became the biggest-selling album in Blue Note history. What the elitists missed, though, was that Black Byrd was e moment when Byrd's brand of fusion finally stepped out from under the shadow of his chief influence, Miles Davis, and found a distinctive voice of its own. Never before had a jazz musician embraced the celebratory sound and style of contemporary funk as fully as Byrd did here -- not even Davis, whose dark, chaotic jungle-funk stood in sharp contrast to the bright, breezy, danceable music on Black Byrd. Byrd gives free rein to producer/arranger/composer Larry Mizell, who crafts a series of tightly focused, melodic pieces often indebted to the lengthier orchestrations of Isaac Hayes and Curtis Mayfield. They're built on the most straightforward funk rhythms Byrd had yet tackled, and if the structures aren't as loose or complex as his earlier fusion material, they make up for it with a funky sense of groove that's damn near irresistible. Byrd's solos are mostly melodic and in-the-pocket, but that allows the funk to take center stage. Sure, maybe the electric piano, sound effects, and Roger Glenn's ubiquitous flute date the music somewhat, but that's really part of its charm. Black Byrd was state-of-the-art for its time, and it set a new standard for all future jazz/R&amp;B/funk fusions -- of which there were many. Byrd would continue to refine this sound on equally essential albums like Street Lady and the fantastic Places and Spaces, but Black Byrd stands as his groundbreaking signature statement. ~ Steve Huey, AMG\n\nWhile Miles Davis was making dark, brooding, introspective electric jazz,( which I love with all my heart, ) Donald Byrd decided to investigate the other end of the spectrum. \n\nThis music is light and joyous funk, with tight vocal arrngements and a fantastic session band. Byrd took the same vocal ideas he used on New Perspective, and applied them to Sly Stone grooves. This coctail resulted in sleek but subtinative music. Sweet, fat licks that you bite into like a chocolate cherry. Commercial? Yes. Top 40 material, absolutely. Right up there on 70s radio with Barry White and Steely Dan. Not bad company, right? \n\nMusic you can listen to any time of day. Perfect. ~ William R. Nicholas &quot;bill nicholas&quot;\n\nPersonnel:\nDonald Byrd ( Trumpet, Flugelhorn, Electric Trumpet and Vocals ) \nFonce Mizell ( Trumpet and Vocals ) \nRoger Glenn ( Flutes and Saxophones ) \nJoe Sample ( Piano and Electric Piano ) \nFred Perren ( Electric Piano, Synthesizers and Vocals ) \nDean Parks ( Guitar ) - 1,4 \nWilton Felder ( Bass Guitar ) - 1,4 \nHarvey Mason ( Drums ) \nBobby Porter Hall ( Percussion ) - 1,4 \nLarry Mizell ( Vocals ) \nDavid T. Walker ( Guitar ) - 2,3,5-7 \nChuck Rainey ( Bass Guitar ) - 2,3,5-7 \nStephanie Spruill ( Percussion ) - 2,3,5-7 \n\nDonald Byrd - Black Byrd Tracks:\n01  Flight Time ( Larry Mizell ) 8:31 \n02  Black Byrd ( Larry Mizell ) 7:21 \n03  Love's So Far Away ( Larry Mizell ) 6:03 \n04  Mr. Thomas ( Warren Jordan/Larry Mizell ) 5:04 \n05  Sky High ( Larry Mizell ) 5:58 \n06  Slop Jar Blues ( Larry Mizell ) 5:41 \n07  Where Are We Going? ( Edward Gordon/Larry Mizell ) 4:37","torrent":{"xt":"urn:btih:6ba2e97fc18179bfd4906055305ff2caa615338b","amp;dn":"Donald+Byrd+-+Black+Byrd+%281972%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba2e97fc18179bfd4906055305ff2caa615338b","infoHashBuffer":{"type":"Buffer","data":[107,162,233,127,193,129,121,191,212,144,96,85,48,95,242,202,166,21,51,139]},"announce":[],"urlList":[]}}