{"title":"(PSX-PSP) Final Fantasy IX converted properly by KloWn","uid":4457612,"size":1743676407,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:6baf5905a17f9a424db7539dcd96ae6d01b175dc&amp;dn=%28PSX-PSP%29+Final+Fantasy+IX+converted+properly+by+KloWn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"toxicjuggalo","files":6,"time":1224551670,"description":"Set in the fantasy world of Gaia, Final Fantasy IX&amp;#039;s plot centers on a war between several nations, sparked by an ambitious queen. Players follow a young thief named Zidane Tribal, who joins with several others to defeat the Queen. The plot shifts, however, when the characters realize that the Queen is a puppet for an arms dealer named Kuja\n\n\nI have also included the latest popsplugin and ALL sony prx which are required to play psx-psp conversions on custom firmware&amp;#039;s... To install the pops simply copy the seplugins folder to the root of your memory stick, turn off your psp, hold down the right trigger button while turning the psp back on to go into recovery mode..Select the plugins option and enable the pops...Everytime you start a new psx game it will ask you which pops you wish to use I recommend using 3.40 pops as I have personally have had no problems with ANY psx game so far.....Drag and drop the folder of the game you wish to play to the PSP--&gt;GAME folder on your memory stick and away you go..ENJOY and don&amp;#039;t forget to say thanx.....\n\n\nOn a final note, I have changed all the Save Game ID&amp;#039;s so there is no problems when switching discs.....","torrent":{"xt":"urn:btih:6baf5905a17f9a424db7539dcd96ae6d01b175dc","amp;dn":"%28PSX-PSP%29+Final+Fantasy+IX+converted+properly+by+KloWn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6baf5905a17f9a424db7539dcd96ae6d01b175dc","infoHashBuffer":{"type":"Buffer","data":[107,175,89,5,161,127,154,66,77,183,83,157,205,150,174,109,1,177,117,220]},"announce":[],"urlList":[]}}