{"title":"Free ENergy: Energy From The Vacuum Part 1, Featurng Tom Bearden","uid":3666080,"size":734988288,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6bcf4c8f414b26724168df8117cbe100bc6809d3&amp;dn=Free+ENergy%3A+Energy+From+The+Vacuum+Part+1%2C+Featurng+Tom+Bearden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Tripled","files":1,"time":1176785995,"description":"Note: Thanks to the uploader on ED2K.\n\n\n[quote]A cubic centimeter of empty space around us (about the tip of one&amp;#039;s little finger in volume) has so much raw energy in it that, if condensed into matter, there would be more matter than is observable in the universe through the largest telescope! So even a tiny efficiency of tapping could and will extract all the energy anyone could wish.[/quote]\n\nOriginally conceived as a theatrical release length documentary, and inspired by Tom Bearden&amp;#039;s book of the same name, it quickly became evident during filming that, due to the high quality of the material, only a multi-part Series would allow enough time to do the subject matter and the participants justice. This Series format also allows for the production of future segments as circumstances dictate.\n\nShot with two cameras in digital widescreen by Oscar-nominated Director William Gazecki in 2004 and 2005, this is the first ever in-depth look on film at the errors and omissions in today&amp;#039;s electrical physics and the inventors (and their devices) who have exploited these gaping holes to pioneer the production of free electrical energy from the infinite vacuum all around us. Additional filming also took place in 2006 for a total of over 100 hours of new film, plus archival footage from the past.\n\nVideo: 544x304 25.00fps XVid Mpeg4\nAudio: 48000Hz 3ch MP3\nTotal Time: 2:08:05\n\nTripled\n","torrent":{"xt":"urn:btih:6bcf4c8f414b26724168df8117cbe100bc6809d3","amp;dn":"Free+ENergy%3A+Energy+From+The+Vacuum+Part+1%2C+Featurng+Tom+Bearden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bcf4c8f414b26724168df8117cbe100bc6809d3","infoHashBuffer":{"type":"Buffer","data":[107,207,76,143,65,75,38,114,65,104,223,129,23,203,225,0,188,104,9,211]},"announce":[],"urlList":[]}}