{"title":"Schaum's Outline of Discrete Mathematics 3rd Edition","uid":8334504,"size":34216328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bd0084bf38e8bbddd5d87e6263ffc95b51c5acb&amp;dn=Schaum%27s+Outline+of+Discrete+Mathematics+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"compmix","files":-1,"time":1364957138,"description":"Found this in the corners of the Internet. Please seed.\n\n\n\n\n=========================================================================\n\nFrom the Back Cover\n\nMaster discrete mathematics and ace your exams with this easy-to-use guide that reinforces problem-solving skills and reduces your study time! Students of discrete mathematics love Schaum'sÂ­Â­--the first edition of this book was a major bestseller--Â­Â­and this edition will show you why!\n\nSchaum's Outline of Discrete Mathematics lets you focus on the problems that are at the heart of the subject. It cuts your study time by eliminating the extraneous material that clutters up so many textbooks.\n\nAs you study at your own pace, this guide shows you step by step how to solve the kind of problems you're going to find on your exams. It gives you hundreds of completely worked problems with full solutions. Hundreds of additional problems let you test your skills, then check the answers. And this edition features all the latest applications of discrete mathematics to computer science!\n\nSo if you want to get a firm handle on discrete mathematicsÂ­Â­--whether to ace your course or to build a solid basis for future work or study--Â­Â­there's no better tool than Schaum's. Schaum's is the premier college course outline-Â­Â­the one that's been trusted by generations of students--Â­Â­the one that's sold more than 30 million copies! This guide can be used as a supplement, to reinforce and strengthen the work you do with your class text. (It works well with virtually any discrete mathematics textbook.) But it is so comprehensive that it can be used alone as a text in discrete mathematics or as an independent study tool!\n\nChapters include:\n\n    Set Theory\n    Relations, Functions, and Algorithms\n    Vectors and Matrices\n    Counting Graph Theory\n    Probability Theory\n    Directed Graphs\n    Algebraic Systems\n    Ordered Sets\n    Logic and Propositional Calculus\n    Boolean Algebra\n    Binary Trees\n    Languages, Grammars, and Machines\n    Properties of the Integers \n\n--This text refers to an out of print or unavailable edition of this title.\nAbout the Author\n\nSeymour Lipschutz is a professor of mathematics at Temple University. He has written 15 Schaum's Outlines.\n\nMark Lipson is on the mathematics faculty at the University of Georgia.\n\n\nProduct Details\n\n    Paperback: 474 pages\n    Publisher: McGraw-Hill; 3 edition (June 21, 2007)\n    Language: English\n    ISBN-10: 0071470387\n    ISBN-13: 978-0071470384\n","torrent":{"xt":"urn:btih:6bd0084bf38e8bbddd5d87e6263ffc95b51c5acb","amp;dn":"Schaum%27s+Outline+of+Discrete+Mathematics+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd0084bf38e8bbddd5d87e6263ffc95b51c5acb","infoHashBuffer":{"type":"Buffer","data":[107,208,8,75,243,142,139,189,221,93,135,230,38,63,252,149,181,28,90,203]},"announce":[],"urlList":[]}}