{"title":"Ultimate Spinach The Box - All 3 CD's Plus Art EAC FLAC","uid":4636496,"size":1175809451,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c491ce19390127889b4cc330ce3ef4dad301de7&amp;dn=Ultimate+Spinach+The+Box+-+All+3+CD%5C%27s+Plus+Art+EAC+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"mkraemer55","files":57,"time":1231569672,"description":"Ultimate Spinach The Box - All 3 CD's Plus Art EAC FLAC\n\nThis is all 3 CD's by the great Boston psychedelic band Ultimate Spinach.\nAll songs are individually tracked. All art from the box including the 16&quot; x 24&quot; poster &amp; 20 page booklet are here in hi resolution. Lossless FLAC\n\n(From Fuzz, Acid &amp; Flowers)\nOriginally known as Underground Cinema, this band were discovered by producer Alan Lorber, who changed their name and signed them to MGM. Part of the emerging 'Bosstown Sound' of 1968, they were the brainchild of group member Ian Bruce-Douglas, who also wrote all the material on their first two albums. Barbara Hudson's beautiful voice gave the group a distinctive vocal sound.\n\nTheir debut album was a very trippy affair. The double fold-out cover contained highly pretentious sleeve-notes by Bruce-Douglas. This pretentiousness was evident, too, in the album's lyrics. For example, its opening track Ego Trip begins:\n\n&quot;Mindless creedence\nGropes through idiosyncrasies\nUp - rising up\nDown ... (echoes)&quot;\n(from Ego Trip)\nand again at the beginning of the Hip Death Goddess, which captures Hudson's vocals at their best:\n\n&quot;See the glazed eyes\nTouch the dead skin\nFeel the cold lips\nAnd know the warmth\nOf the Hip Death Goddess&quot;.\n(from Hip Death Goddess)\nInstrumental numbers, like Sacrifice Of The Moon, sound similar to their equivalents on the early Country Joe and The Fish albums. The album is liberally endowed with wind chimes, bells and sound effects and the lyrics are tailored with flower power mythology:\n\n&quot;I saw a funny freak parade\nMarching down the street\nThey were acting very strange\nKissing everybody they meet\nWith eyeballs hanging out of their eyes\nAnd daffodils in their hands\nSomeone asked what's happening here?&quot;\n(from Funny Freak Parade)\nThe final track, Pamela, which has a similar wind chimes intro to Country Joe's Grace, is intended to illustrate 'the intense beauty that can be seen and felt if one's senses are fully employed'. Once again acid was the inspiration behind those lyrics:\n\n&quot;Moonbeams and sapphires\nVibrate as one\nI hear prisms\nCrystal rainbows fill my sky\nShattered, they glisten\nAnd blind the sun.&quot;\n(from Pamela)\nThe album met with considerable commercial success peaking at No. 34 in the U.S. Album Charts.\n\nTheir follow-up album, Behold And See was in a similar vein. The lyrics were less impressionable, though, and their music had become more mystical, particularly on the excellent Genesis Of Beauty Suite and Fragmentary Marches Of The Green. Other tracks like Mind Flowers, may be seen as an extension of themes from their earlier album. Once again, Barbara's vocals glisten with beauty. This reached No. 198 in the Album Charts. Be aware that on the Big Beat CD the tracks are resequenced and Visions of Your Reality has been dropped, leaving this track unissued on CD. Both albums are classic acid rock period pieces and highly recommended, if one can excuse their more pretentious trappings.\n\nBruce-Douglas' departure after their second album had a profound effect on the band's musical direction. All the material on the third album, apart from the opening cut Romeo and Juliet, was written by the new band and lacked the imagination of Bruce-Douglas' work. For the third album, Jeff Baxter, who later had a spell with Steely Dan, came in on lead guitar and Ted Myers and Tony Scheuren joined from Boston label-mates Chamaeleon Church. Curiously, Mike Levine, who was listed as bassist didn't actually play on the record. Tom Caulfield who had been a lifelong pal of Mike's and who'd previously played for the soul group The Three Degrees, instead played impeccable bass and a super harp solo on Eddie's Rush, the blues jam that concludes Side One. Only Barbara Hudson remained from the original line-up, and although their final album is overall less interesting, it is still worth hearing.\n\nFans of the band may be interested in checking out neo-psych / acid-goth band Babylonian Tiles cover of Hip Death Goddess, which appears on the St. Thomas Records sampler CD Saints &amp; Sorcerers Vol. 2 - It's even been approved by Ian Bruce-Douglas as &quot;fulfilling his vision of 'Hip Death Goddess' personified&quot;... Hip Death Goddess has also been covered by Lithium X-Mas (on their Bad Karma and Helldorado CDs).\n\nUltimate Spinach also appear on a couple of compilations: the The Best Of Bosstown Sound (Dble CD) features (Ballad Of) The Hip Death Goddess, Baroque #1, Fragmentary March Of Green, The World Has Just Begun, Happiness Child and Eddie's Rush; and the Family Circle - Family Tree (CD) contains Back Door Blues and Happiness Child.\n\n(Vernon Joynson / Mark Scheuren / John Melbourne / Max Waller)\n\nPersonnel:\nIAN BRUCE-DOUGLAS vcls A\nBARBARA HUDSON vcls, kazoos, gtr A B\nKEITH LAHTEINEN vcls, drms, perc A\nRICHARD NESE bs A\nGEOFFREY WINTHROP vcls, sitar, gtr A\nJEFF BAXTER ld gtr B\nMIKE LEVINE bs B\nRUSS LEVINE drms B\nTED MYERS gtr, vcls B\nTONY SCHEUREN keyb'ds, vcls B\n(TOM CAULFIELD bs, hrmnca B)\n\n\nALBUMS:\n1(A) ULTIMATE SPINACH (MGM SE 4518) 1968 34\n2(A) BEHOLD AND SEE (MGM SE 4570) 1968 198\n3(B) ULTIMATE SPINACH III (MGM SE 4600) 1969\n\n\nNB: (1) and (2) reissued on Polygram (Greek). (1) - (3) reissued on CD by Big Beat (CDWIKD 142, 148, 165 respectively). (1) - (3) reissued on CD as a box set, The Box (Akarma AK 121-3). The CDs here are 20-bit remastered, and are re-sequenced in the original order of the tracks. On Behold And See the track Visions Of Your Reality, missing on ACE/Big Beat &quot;director's cut&quot; CD reissue, has been re-added. The box set includes a poster and a book with previously unpublished photos. (3) has also had a limited 'bootleg' vinyl repress. (1) reissued on vinyl (Akarma AK 119) 2001 with two mono tracks as bonus material. (2) reissued as a double LP with two mono tracks as bonus material (Akarma AK 120/2) 2001. (3) reissued on vinyl (Akarma AK 121) 2001.\n","torrent":{"xt":"urn:btih:6c491ce19390127889b4cc330ce3ef4dad301de7","amp;dn":"Ultimate+Spinach+The+Box+-+All+3+CD%5C%27s+Plus+Art+EAC+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c491ce19390127889b4cc330ce3ef4dad301de7","infoHashBuffer":{"type":"Buffer","data":[108,73,28,225,147,144,18,120,137,180,204,51,12,227,239,77,173,48,29,231]},"announce":[],"urlList":[]}}