{"title":"The Survival Medicine Handbook(ePUB,Retail){32Skulls}","uid":10898516,"size":13280818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c65e2b5985e41459d10384f88bba3e7638765ed&amp;dn=The+Survival+Medicine+Handbook%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409170171,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nThe Survival Medicine Handbook(tm) is a guide for those who want to be medically prepared for any disaster where help is NOT on the way. This book is written by Joe Alton, M.D. and Amy Alton, A.R.N.P., the premiere Medical Preparedness Professionals from the top ten survival website www.doomandbloom.net. This book is available in print and kindle, and print book buyers can take advantage of Kindle's matchbook program to also buy the digital version for just $2.99 (normal retail $24.99). The expanded second edition of the 3 category Amazon bestseller (Survival Skills, Disaster Relief, Safety/First Aid) is geared to enable the non-medical professional to deal with all the likely issues they will encounter in catastrophic scenarios. The Survival Medicine Handbook (tm) is not your standard first aid book. It assumes that no hospital or doctor is available in the aftermath of a catastrophic event. This book will give you the tools to handle injuries and illness for when YOU might be the end of the line with regards to your family's medical well-being. In circumstances where medical personnel are overwhelmed and access to modern technology is limited or non-existent, The Survival Medicine Handbook(tm) is the essential reference book for every library. Written in plain English, you'll find step-by-step instructions on how to identify and treat over 100 different medical issues. The second edition also covers alternative remedies for almost every possible medical condition in situations where modern healthcare is inaccessible.\n\n\nBy Joseph Alton, Amy Alton\nPublished by Doom and Bloom in 2013\nTags: nonfiction, medicine, health\nEPUB, 588 pages, English","torrent":{"xt":"urn:btih:6c65e2b5985e41459d10384f88bba3e7638765ed","amp;dn":"The+Survival+Medicine+Handbook%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c65e2b5985e41459d10384f88bba3e7638765ed","infoHashBuffer":{"type":"Buffer","data":[108,101,226,181,152,94,65,69,157,16,56,79,136,187,163,231,99,135,101,237]},"announce":[],"urlList":[]}}