{"title":"South.Park.S18E03.The.Cissy.HDTV.x264-KILLERS","uid":11179329,"size":80916289,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6cbc2a7253774dd3e96d09aaab8b69abb85f5d64&amp;dn=South.Park.S18E03.The.Cissy.HDTV.x264-KILLERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":1,"time":1412838928,"description":"[b]South Park\n\n[IMG]http://i.imgur.com/831DMaO.jpg[/IMG]\n\nGenre: Animation, Comedy \nYear: 2012 \nCountry: USA \nRuntime: 22 min \nProducer: Trey Parker, Matt Stone \nCast: Trey Parker, Matt Stone, Isaac Hayes, Mona Marshall \n\n.: Plot:. \nSouth Park is an Animated series featuring four foul-mouthed 3rd graders, Stan, Kyle, Kenny and Cartman. The show is set in the Colorado town of South Park where weird things keep happening, whether its being abducted by aliens or avoiding Kyle's little brother Ike. The Show is Based on the Short Film by Trey Parker and Matt Stone, &quot;The Spirit of Christmas&quot;. In South Park, Colorado, we Follow the adventures of four foul-Mouthed Fourth-graders: Eric Cartman, the rude, obnoxious, sadistic , racist, fat kid; Stan Marsh, a quiet kid with a huge crush on Wendy Testaberger (he usually vomits whenever he talks to her or when something gross occurs); Kyle Brofloski, the religious Jewish kid who Cartman picks on for being Jewish; and Kenny, the orange parka-hooded kid who dies every episode. Of course, most of the time, something weird usually happens including aliens planting a chip in Cartman's anus and Michael Jackson moves into the neighborhood. Other wild adventures include: the boys blaming their parents for child molestation and Cartman feeding Scott Tenorman his parents in chili. A movie was given in the early seasons in 1999. And the boys enjoy their Terrence &amp; Philip, a Canadian comedy duo (which the parents were against in the movie). [/b]\n\n[IMG]http://i.imgur.com/6LN2VrF.jpg[/IMG]","torrent":{"xt":"urn:btih:6cbc2a7253774dd3e96d09aaab8b69abb85f5d64","amp;dn":"South.Park.S18E03.The.Cissy.HDTV.x264-KILLERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cbc2a7253774dd3e96d09aaab8b69abb85f5d64","infoHashBuffer":{"type":"Buffer","data":[108,188,42,114,83,119,77,211,233,109,9,170,171,139,105,171,184,95,93,100]},"announce":[],"urlList":[]}}