{"title":"Agent Venom Issues 1 through 40","uid":8885514,"size":1196812136,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6d4a1d034a12a0287c685e64c6b5c81e8f8e693e&amp;dn=Agent+Venom+Issues+1+through+40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Tek28","files":-1,"time":1378447611,"description":"From Wikipedia (spoilers):\n\n\n\n\nIn a January 2011 interview with Newsarama, Flash Thompson was revealed &quot;by accident&quot; as the new Venom host. Marvel confirmed Flash will have his own comic as a military style Venom. He will star as a hero working for the military, and he will encounter many heroes and villains of the Marvel Universe. He made his premiere as Venom in The Amazing Spider-Man #654 (February 2011), and continues in his own Venom ongoing series following the special The Amazing Spider-Man #654.1 issue.\n\nHe cannot stay bonded to the Venom symbiote for more than 48 hours or the symbiote may gain complete control of him. The consequences of this are first seen when the suit causes Flash to go berserk and brutally slaughter a group of enemy operatives during his second mission, and again during a brawl with the Jack O'Lantern ending with the suit putting a grenade in Jack O'Lantern's mouth. While on a mission in the Savage Land, Flash finds himself being hunted by Kraven the Hunter who mistakes him for Spider-Man.\n\nDuring Spider-Island Venom is sent in to capture a spider-like beast that is fighting Firestar and Gravity. Venom manages to capture the Spider-King and discovers that he is an enslaved Captain America. Venom disguises himself as the Spider-King in order to track the infestation to its source. The Queen and Jackal send him to kill Anti-Venom because he is curing people who have gained spider-powers, but his superiors order him to take him to Mr. Fantastic to help develop a cure. Flash and the Venom-symbiote fight each other because Flash wants to bring Anti-Venom to Mr. Fantastic and the symbiote wants to kill Anti-Venom for previously rejecting it. This leads to Venom and Anti-Venom fighting. Venom wins the fight and delivers Anti-Venom to Mr. Fantastic. Venom teams up with Red Hulk, X-23, Ghost Rider, and Johnny Blaze to fight Blackheart.\n\nThompson joins the Secret Avengers as Agent Venom. As an Avenger, Flash apprehends the Human Fly, but the Human Fly escapes via a prisoner transport to The Raft when the Hobgoblin attacks the transport trying to kill the Human Fly for stealing money from the Kingpin. Flash tries to assassinate the Crime Master for threatening his family, but Eddie Brock attacks him as he is about to fire. This causes the Crime Master to have his new Savage Six attack Flash and Betty. While trying to protect Betty from Jack O'Lantern he reveals his identity to her. Thunderbolt Ross recruits Venom to be part of his Thunderbolts team.\n\nFlash relocates to Philadelphia after fighting the U-Foes there. While trying to capture a serial killer infected with some of the alien technology the U-Foes were trying to sell, so Beast could try to cure the man, he is attacked by Eddie Brock/Toxin.\n\n\n\n\nProps to the original scanners!","torrent":{"xt":"urn:btih:6d4a1d034a12a0287c685e64c6b5c81e8f8e693e","amp;dn":"Agent+Venom+Issues+1+through+40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d4a1d034a12a0287c685e64c6b5c81e8f8e693e","infoHashBuffer":{"type":"Buffer","data":[109,74,29,3,74,18,160,40,124,104,94,100,198,181,200,30,143,142,105,62]},"announce":[],"urlList":[]}}