{"title":"Trials.Fusion.Riders.of.the.Rustlands-SKIDROW","uid":10677003,"size":6388399881,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d8e799224f401b81214618cadd12edf0455ad7d&amp;dn=Trials.Fusion.Riders.of.the.Rustlands-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1406972874,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nTrials Fusion: Riders of the Rustlands (c) Ubisoft\n\n02-08-2014......Release Date - Protection..UbisoftSteamCustom\nRacer..............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nTake on an unlimited array of platform-racing challenges in the unreal\nworld of Trials Fusion. Using your skills to traverse across\nobstacle-laden, ramp-ridden courses, you must strive to set track\nrecords against the best Trials players around the globe. Whether\nyoure racing alone, with friends, or in a global tournament,\ncompetition is always around you. And racing on official courses is\njust the beginning. A rich world of custom courses  built by some of\nthe most creative and skilled content creators in gaming  awaits those\nwho are continually searching for a new, insane track to conquer. And\nwith long-term support of fresh features and content, the Trials\nexperience will continue to expand and challenge players in new and\nexhilarating ways.\n\nFeatures:\n\nBEST-IN-CLASS PLATFORM RACING\nRock-solid motocross physics and reality-bending course designs come\ntogether for an over-the-top racing experience that no other game can\nprovide. Show your fearless side with the brand new FMX tricks system,\nand choose your path towards victory on branching courses. The finish\nline is the ultimate goal, but the challenge is everything before it.\n\nUBIQUITOUS COMPETITION\nWhether youre racing alone, with friends, or in a worldwide\ntournament, competition is all around you. Its variety and depth will\noffer limitless ways to scratch your competitive itch, and the\nopportunities keep coming. With ongoing support for special tournaments\nand events, team racing, and much more coming soon, the competition is\nnever ending.\n\nVIBRANT USER-GENERATED CONTENT COMMUNITY\nImmerse yourself in a boundless Trials experience with custom track\ndesigns made possible by the in-game Editor Mode. With a user-generated\ncontent community that boasts some of the most creative and skilled\ntrack creators in the world, Trials Fusion offers new track after new\ntrack and opens the door to a world of possibilities only the crazy\nminds of Trials fans can bring.\n\nTrials Fusion: Riders of the Rustlands NOTES:\n\nGo beyond the edge of the city with the first content pack of Trials\nFusion : Riders of the Rustlands\n\nThese forgotten people live outside the elevated class region that\nFusion takes place in, and lack the wealth of the inhabitants in the\ncity area. Ignored and left to their own devices by the government,\nthey are forced to use, build and scavenge what they can to make a\nliving.\n\nThe lack of law and order makes this a dog eat dog world. Expand your\nadventure with:\n\n10 new tracks (including six Classic Trials Tracks, two new Supercross\nTracks, one Skill Game and one FMX Track).\n\n18 new track Challenges (including secret features, secret mini-games,\nand more)\n\n5 new achievements/trophies\n\nDozens of new Track Editor objects including wrecked vehicles,\nwarehouses and much more\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nThis release is made standalone and updated to latest version, as many\nof the game files are updated.\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:6d8e799224f401b81214618cadd12edf0455ad7d","amp;dn":"Trials.Fusion.Riders.of.the.Rustlands-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d8e799224f401b81214618cadd12edf0455ad7d","infoHashBuffer":{"type":"Buffer","data":[109,142,121,146,36,244,1,184,18,20,97,140,173,209,46,223,4,85,173,125]},"announce":[],"urlList":[]}}