{"title":"DEATH - THE HIGH COST OF LIVING 001-003 (1993) (digital-Empire)","uid":8096301,"size":86968189,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6dee2adb1961a8240102c6e67717b7e127eb0648&amp;dn=DEATH+-+THE+HIGH+COST+OF+LIVING+001-003+%281993%29+%28digital-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1359846131,"description":"English\nCBR\n3 Issues\n82.94 MB\n\n------\n\nWritten by Neil Gaiman\nArt by Chris Bachalo, Mark Buckingham, and Dave McKean\n\nFrom Publishers Weekly:\n\nThe High Cost of Living is a continuation of Harvey Award-winning fantasy writer Neil Gaiman's The Sandman - a series detailing the cosmic duties of a loose family of seven immortals.\n\nNot quite Gods, they embody realms of psychic experience: Dream, Desire, Despair, Destiny, Delirium, Destruction and Gaiman's very popular character, Death. Reaper, yes; but Death's not very grim as she goes about her business visiting the just-about-to-die and ushering them into their new existence. In this story she meets Sexton, a teenager contemplating suicide, and they end up searching New York City to find a witch's heart (the old hag hid it centuries ago, it's a witch tradition), so the old girl can hide it again. Up pops the Eremite, an evil wizard type, out to steal Death's mysterious necklace, who makes the usual threats against life and limb.\n\nGaiman has created a character sweetly at odds with her modbid duties; dressed like a Satanic rocker, she's as pretty as a cheerleader and even more upbeat. While Gaiman brings a gritty urban contemporaneity to the fantasy genre, the story also suffers from a TV script-like sensibility -- danger-defying quips, the good-hearted overweight black neighbor, melodramatic villain. Nevertheless the combination of wry mystic immortal and MTV slacker produces an engaging chemistry. Top-notch production, and although the illustration is a bit stiff, it's stylishly rendered and very nicely colored.\n\n------\n\nThis miniseries was torrented about 5 weeks ago on TPB, and I hesitate to post something that was posted recently ... but no offense, these 2011 digital copies are of a far higher quality.  --STFmaryville","torrent":{"xt":"urn:btih:6dee2adb1961a8240102c6e67717b7e127eb0648","amp;dn":"DEATH+-+THE+HIGH+COST+OF+LIVING+001-003+%281993%29+%28digital-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dee2adb1961a8240102c6e67717b7e127eb0648","infoHashBuffer":{"type":"Buffer","data":[109,238,42,219,25,97,168,36,1,2,198,230,119,23,183,225,39,235,6,72]},"announce":[],"urlList":[]}}