{"title":"Murdoch Mysteries - Season 06 (2013) - 13 Episodes","uid":10792788,"size":4529515135,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6df972e4d4460d1dab216d1eb28044c456e54d43&amp;dn=Murdoch+Mysteries+-+Season+06+%282013%29+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"bnaron","files":-1,"time":1408268690,"description":"Murdoch Mysteries - Season 06 (2013) - 13 Episodes\n\n\nSeries Description Courtesy of:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Murdoch_Mysteries\n\nMurdoch Mysteries is a Canadian drama television series aired on both City and CBC Television, featuring Yannick Bisson as William Murdoch, a police detective working in Toronto, Ontario, around the turn of the twentieth century. The television series is based on the series of novels by Maureen Jennings.\n\nThe series takes place in Toronto starting in 1895 and follows Detective William Murdoch (Yannick Bisson) of the Toronto Constabulary, who solves many of his cases using methods of detection that were unusual at the time. These methods include fingerprinting (referred to as &quot;finger marks&quot; in the series), blood testing, surveillance, and trace evidence.\n\nSome episodes feature anachronistic technology whereby Murdoch sometimes uses the existing technology of his time to improvise a crude prototype of a technology that would be more readily recognizable to the show's 21st-century audience. In one episode, for instance, he creates a primitive version of sonar to locate a sunken ship in Lake Ontario. In another, he effectively invents wire-tapping. In still another, a foreign police officer has a photograph which Murdoch needs as evidence, so Murdoch asks the other officer to overlay the photograph with a grid which is numerically coded for the color in each square, and then to transmit the numerical data to Murdoch via telegraph, with the end result that the foreign officer has essentially sent Murdoch a bitmap image they call a &quot;facsimile&quot;, a telefax.\n\nOn November 15, 2011 it was announced that CBC would broadcast a sixth season of Murdoch Mysteries. Filming of season six took place between May 22 and September 28, 2012. It was originally expected to be aired in the Fall of 2012, but the premiere was January 7, 2013. Alibi began showing season six in the UK, February 4, 2013.\n\nScenes from &quot;The Ghost of Queen's Park&quot; were filmed on location on July 13, 2012. David Onley, the current Lieutenant Governor of Ontario, had a cameo in season six in which he portrayed the eighth Lieutenant Governor of Ontario, Sir Oliver Mowat. Thomas Howes made a guest appearance as Winston Churchill, who asked Murdoch's help when he was accused of murder.\n\nGeorgina Reilly (Dr. Emily Grace) was promoted to series regular for the sixth season.\n\n\n\nNOTE: I normally credit www.thetvdb.com for the episode synopses, however, their descriptions were rather barren. So, credit goes to Wikipedia on this occasion.\n\n\n2013-01-07 - Murdoch Air (Video:H264 640x360, 951kbps, 24fps - Audio:AAC 44.1kHz, 104kbps)\n\nMurdoch investigates after a prototype airplane crashes and kills an innocent bystander and is soon drawn into an arms race between the Canadian and American governments. Recurring stars: Peter Keleghan as Terrence Meyers and Matthew Bennett as Allen Cleg\n\n\n2013-01-14 - Winston's Lost Night (Video:H264 640x360, 954kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nAfter hours of heavy drinking, Winston Churchill awakes at the scene of a murder with no memory of the previous night. Murdoch must piece together what happened to prove his innocence.\n\n\n2013-01-21 - Murdoch on the Corner (Video:H264 720x404, 953kbps, 24fps - Audio:AAC 44.1kHz, 104kbps)\n\nMurdoch suspects a serial killer is at work when a string of seemingly random people are murdered inside their own homes. The only apparent connection between the victims is a street corner that they all visited shortly before dying.\n\n\n2013-01-28 - A Study in Sherlock (Video:H264 624x352, 954kbps, 24fps - Audio:AAC 44.1kHz, 113kbps)\n\nAfter an armed robber is murdered by his accomplice during a heist, Murdoch's prime suspect is an incredibly perceptive man who claims to be Sherlock Holmes. Geraint Wyn Davies make a brief return appearance as Arthur Conan Doyle.\n\n\n2013-02-04 - Murdoch Au Naturel (Video:H264 624x352, 955kbps, 24fps - Audio:AAC 44.1kHz, 115kbps)\n\nMurdoch investigates a murder at a nudist community.\n\n\n2013-02-11 - Murdoch and the Cloud of Doom (Video:H264 624x352, 954kbps, 24fps - Audio:AAC 44.1kHz, 111kbps)\n\nWhen an anonymous madman threatens the citizens of Toronto with a deadly toxic gas, Murdoch must race against the clock to stop him. Recurring star: Nigel Bennett as Chief Constable Giles\n\n\n2013-02-25 - The Ghost of Queen's Park (Video:H264 720x404, 950kbps, 24fps - Audio:AAC 44.1kHz, 105kbps)\n\nWhile investigating the death of a politician, rumored to have been killed by a vengeful ghost, Crabtree's theories of the paranormal conflict with Murdoch's scientific beliefs.\n\n\n2013-03-04 - Murdoch in Ladies Wear (Video:H264 720x404, 948kbps, 24fps - Audio:AAC 44.1kHz, 107kbps)\n\nMurdoch investigates the murder of an Eaton's department store manager who was disliked by the shop girls.\n\n\n2013-03-11 - Victoria Cross (Video:H264 720x404, 949kbps, 24fps - Audio:AAC 44.1kHz, 102kbps)\n\nAn uncooperative witness impedes Murdoch's investigation into a pawnbroker's murder and Brackenreid faces resistance while looking into the prison death of an old army buddy.\n\n\n2013-03-18 - Twisted Sisters (Video:H264 720x404, 941kbps, 24fps - Audio:AAC 44.1kHz, 103kbps)\n\nA series of violent drowning deaths of university-educated unmarried career women leads Murdoch to suspect sexist and racist motives.\n\n\n2013-03-25 - Lovers in a Murderous Time (Video:H264 640x360, 953kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nDetective Murdoch and Dr. Ogden find themselves at odds when a delusional woman (Sheila McCarthy), becomes the prime suspect in the violent stabbing of her gambling fiance.\n\n\n2013-04-08 - Crime &amp; Punishment (Video:H264 640x360, 947kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nDetective Murdoch and his methods are compromised when one of his colleagues is implicated in a suspicious murder. Recurring stars: Nigel Bennett as Chief Constable Giles and Michael Seater as James Gillies\n\n\n2013-04-15 - The Murdoch Trap (Video:H264 640x360, 947kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nWith his colleague sentenced to hang for murder, Detective Murdoch races to exonerate them and steps into a trap set by the real killer. Recurring stars: Nigel Bennett as Chief Constable Giles and Michael Seater as James Gillies\n\n","torrent":{"xt":"urn:btih:6df972e4d4460d1dab216d1eb28044c456e54d43","amp;dn":"Murdoch+Mysteries+-+Season+06+%282013%29+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df972e4d4460d1dab216d1eb28044c456e54d43","infoHashBuffer":{"type":"Buffer","data":[109,249,114,228,212,70,13,29,171,33,109,30,178,128,68,196,86,229,77,67]},"announce":[],"urlList":[]}}