{"title":"Mary J  Blige - Share My World - (1997)[EAC-MP3@320KBPS]","uid":4265332,"size":189691997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e3294403d1aab879e0bd4e99efd8d1f1d1f2329&amp;dn=Mary+J++Blige+-+Share+My+World+-+%281997%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"seanprince","files":28,"time":1214668406,"description":"Mary J. Blige - Share My World\n\nTrack list\n\n01.\tIntro\t\t\t\t\t\t0124\n02.\tI Can Love You\t\t\t\t\t0446\n03.\tLove Is All We Need\t\t\t\t0414\n04.\tRound And Round\t\t\t\t\t0424\n05.\tShare My World (Interlude)\t\t\t0030\n06.\tShare My World\t\t\t\t\t0507\n07.\tSeven Days\t\t\t\t\t0509\n08.\tIt&amp;#039;s On (featuring R. Kelly)\t\t\t0441\n09.\tThank You Lord (Interlude)\t\t\t0044\n10.\tMissing You\t\t\t\t\t0416\n11.\tEverything\t\t\t\t\t0458\n12.\tKeep Your Head\t\t\t\t\t0348\n13.\tCan&amp;#039;t Get You Off My Mind\t\t\t0439\n14.\tGet To Know You Better\t\t\t\t0432\n15.\tSearching\t\t\t\t\t0505\n16.\tOur Love\t\t\t\t\t0521\n17.\tNot Gon&amp;#039; Cry\t\t\t\t\t0455\n18.\t(You Make Me Feel Like A) Natural Woman\t\t0256\n\nBiography\tby Stacia Proefrock\n\nWhen her debut album, What&amp;#039;s the 411?, hit the street in 1992, critics and fans alike were floored by its powerful combination of modern R&amp;B with an edgy rap sound that glanced off of the pain and grit of Mary J. Blige&amp;#039;s Yonkers, NY, childhood. Called alternately the new Chaka Khan or new Aretha Franklin, Blige had little in common stylistically with either of those artists, but like them, she helped adorn soul music with new textures and flavors that inspired a whole generation of musicians. With her blonde hair, self-preserving slouch, and combat boots, Blige was street-tough and beautiful all at once, and the record company execs who profited off of her early releases did little to dispel the bad-girl image that she earned as she stumbled through the dizzying first days of her career. As she exorcised her personal demons and softened her style to include sleek designer clothes, she remained a hero to thousands of girls growing up in the same kinds of rough places she came from. Blige reinvented her career again and again by shedding the bad habits and bad influences that kept her down; by the time her fourth album, Mary, was released in 1999, she had matured into an expressive singer able to put the full power of her voice behind her music, while still reflecting a strong urban style. With her fifth album, No More Drama, it wasn&amp;#039;t just Blige&amp;#039;s style that shone through the structures set up for her by songwriters and producers, it was her own vision -- spiritual, emotional, personal, and full of wisdom, it reflected an artist who was comfortable with who she was and how far she had come.\nBorn in the Bronx on January 11, 1971, Blige spent the first few years of her life in Savannah, GA, before moving with her mother and older sister to the Schlobam housing projects in Yonkers, NY. Her rough life there produced more than a few scars, physical and otherwise, and Blige dropped out of high school her junior year, instead spending time doing her friends&amp;#039; hair in her mother&amp;#039;s apartment and hanging out. When she was at a local mall in White Plains, NY, she recorded herself singing Anita Baker&amp;#039;s &quot;Caught Up in the Rapture&quot; into a karaoke machine. The resulting tape was passed by Blige&amp;#039;s stepfather to Uptown Records CEO Andre Harrell. Harrell was impressed with Blige&amp;#039;s voice and signed her to sing backup for local acts like Father MC. In 1991, however, Sean &quot;Puffy&quot; Combs took Blige under his wing and began working with her on What&amp;#039;s the 411?, her debut album. Combs had a heavy hand in What&amp;#039;s the 411?, along with producers Dave Hall, Mark Morales, and Mark Rooney, and the stylish touches that they added to Blige&amp;#039;s unique vocal style created a stunning album that bridged the gap between R&amp;B and rap in a way that no female singer had before. Uptown tried to capitalize on the success of What&amp;#039;s the 411? by issuing a remixed version of it a year later, but it was only a modest success creatively and commercially.\nHer 1995 follow-up, My Life, again featured Combs&amp;#039; handiwork, and if it stepped back stylistically from its urban roots by featuring less of a rap sound, it made up for it with its subject matter. My Life was full of ghetto pathos and Blige&amp;#039;s own personal pain shone through like a beacon. Her rocky relationship with fellow Uptown artist K-Ci Hailey likely contributed to the raw emotions on the album. The period following the recording of My Life was also a difficult time professionally for Blige, as she severed her ties with Combs and Uptown, hired Suge Knight as a financial advisor, and signed with MCA.\nReleased in 1997, Share My World marked the beginning of Blige&amp;#039;s creative partnerships with Jimmy Jam and Terry Lewis. The album was another hit for Blige and debuted at number one on the Billboard charts. Critics soured somewhat on its more conventional soul sound, but Blige&amp;#039;s fans seemed undaunted. By the time her next studio album, Mary, came out in 1999, the fullness and elegance of her new sound seemed more developed, as Blige exuded a classic soul style aided by material from Elton John and Bernie Taupin, Stevie Wonder, and Lauryn Hill. Mary made it obvious that the ghetto fabulous style and more confrontational aspects of her music were gone, while the emotive power still remained.\nThat power also helped carry the more modern-sounding 2001 release No More Drama, a deeply personal album that remained a collective effort musically yet reflected more of Blige&amp;#039;s songwriting than any of her previous efforts. The Mary J. Blige on No More Drama seemed miles away from the flashy kid on What&amp;#039;s the 411?, yet it was still possible to see the path through her music that produced an older, wiser, but still expressive artist. In 2003 she was reunited with P. Diddy, who produced the majority of that year&amp;#039;s patchy Love and Life album. The Breakthrough followed two years later and was a tremendous success, spawning a handful of major singles. By the December 2006 release of Reflections (A Retrospective), The Breakthrough&amp;#039;s lead single, &quot;Be Without You,&quot; had spent nearly a year on the R&amp;B chart, while the album&amp;#039;s fifth single, &quot;Take Me as I Am,&quot; had been on the same chart for over four months. A year later Blige came out with her eight studio album, Growing Pains, whose single &quot;Work That&quot; was featured on an iTunes commercial.\n\nReview\tby Alex Henderson\n\nThe hype that surrounded Mary J. Blige in the beginning was simply ridiculous. When What&amp;#039;s the 411? was released in 1992, she was exalted as &quot;the new Chaka Khan&quot;-- a definite exaggeration, considering how uneven that debut album was. But Blige did show promise, and by the time she recorded her third album, Share My World, she had developed into a fairly convincing soul/urban singer. Her strongest and most confident effort up to that point, Share had much more character, personality, and honesty than most of the assembly line fare dominating urban radio in 1997. For all their slickness, emotive cuts like &quot;Get to Know You Better,&quot; &quot;Love Is All We Need,&quot; and &quot;Keep Your Head&quot; left no doubt that Blige was indeed a singer of depth and substance. Although high tech, the production of everyone from R. Kelly (with whom she duets on the inviting &quot;It&amp;#039;s On&quot;) and Babyface to Jimmy Jam and Terry Lewis doesn&amp;#039;t come across as forced or robotic, but, in fact, is impressively organic. With Share My World, Blige definitely arrived. \n\nEnjoy. ","torrent":{"xt":"urn:btih:6e3294403d1aab879e0bd4e99efd8d1f1d1f2329","amp;dn":"Mary+J++Blige+-+Share+My+World+-+%281997%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3294403d1aab879e0bd4e99efd8d1f1d1f2329","infoHashBuffer":{"type":"Buffer","data":[110,50,148,64,61,26,171,135,158,11,212,233,158,253,141,31,29,31,35,41]},"announce":[],"urlList":[]}}