{"title":"Counting Crows - Hard Candy (2002) [CDRip] 320 vtwin88cube","uid":6223922,"size":141518689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e4e4239073837771896ea01d28b3d8b3a9edae2&amp;dn=Counting+Crows+-+Hard+Candy+%282002%29+%5BCDRip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299442345,"description":"Counting Crows\nHard Candy (2002)\n\n\nWith their angst-filled hybrid of Van Morrison, the Band, and R.E.M., Counting Crows became an overnight sensation in 1994. Only a year earlier, the band was a group of unknown musicians, filling in for the absent Van Morrison at the Rock &amp; Roll Hall of Fame ceremony; they were introduced by an enthusiastic Robbie Robertson. Early in 1993, the band recorded their debut album, August and Everything After, with T-Bone Burnett. Released the fall, it was a dark and somber record, driven by the morose lyrics and expressive vocals of Adam Duritz. The only up-tempo song, &quot;Mr. Jones,&quot; became their ticket to stardom, and Counting Crows enjoyed a significant amount of success throughout the '90s and beyond. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tRetail CD\nLabel:\t\t\tGeffen\n\n\nHard Candy is the sound of a band at a creative and poetic summit. Over three previous studio recordings, Counting Crows have moved through varied musical territories as a way of conveying emotion through performance, texture, and nuance, the place where the mood meets the heart meets the mind. Hard Candy is both a radical departure from the band's previous method of recording, and contextually an affirmation of what sets them apart from virtually every other band on the rock &amp; roll scene: their commitment to songwriting as craft. These 13 tracks are strongly committed to conveying a song in the hook rather than in the lyric. They are tight, crisp, and razor-sharp pop songs on a bright, shiny, rock record. Every backing vocal, every lilting string, trumpet line, or piano run, was meticulously crafted and scripted into this invigorating musical architecture -- and lyrically, Adam Duritz offers at least as much as he's given on any other album. The set opens with the title track, a wide-open 4/4 rocker illustrated by shimmering piano lines and ringing Byrds-like 12-string electric guitars punching up the middle. Duritz sings with an Allen Ginsberg-like heroic candor: &quot;On certain Sundays in November when the weather bothers me/I empty drawers of other summers/where my shadows used to be...You send your lover off to China and you wait for her to call/You put your girl up on a pedestal and you wait for her to fall/I put my summers back in a letter/All the regrets you can't forget are somehow pressed upon a picture in the face of such an ordinary girl.&quot; These lines reflect the entwined themes that run through virtually every song on the record: memory, the regret of loss due to ignorance, and pervasive loneliness in everyday life. Even the humorous songs here, such as the first single, &quot;American Girls,&quot; offer candid meditations on these subjects. Other tracks, such as &quot;Butterfly Reverse,&quot; co-written with Ryan Adams, offer stunningly textured instrumentation and wondrously pastoral pop melodies accented by a grand piano holding the middle against a huge wash of fawning strings and rim shots as the lyrics drip like dirty rainwater into a puddle in the middle of the street. Ultimately, this record, with its many seeming aberrations, will no doubt attract new fans without alienating the old. These 13 stories are as wondrously accessible in their sheeny glory, yet as moving and profound as anything pop music has to offer.  \n\n\nTrack List:\n\n01.Hard Candy\n02.American Girls\n03.Good Time\n04.If I Could Give All My Love -Or- Richard Manuel Is Dead\n05.Goodnight L.A.\n06.Butterfly In Reverse\n07.Miami\n08.New Frontier\n09.Carriage\n10.Black And Blue\n11.Why Should You Come When I Call\n12.Up All Night (Frankie Miller Goes To Hollywood)\n13.Holiday In Spain\n14.Big Yellow Taxi\n\n\n\nCheers!","torrent":{"xt":"urn:btih:6e4e4239073837771896ea01d28b3d8b3a9edae2","amp;dn":"Counting+Crows+-+Hard+Candy+%282002%29+%5BCDRip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4e4239073837771896ea01d28b3d8b3a9edae2","infoHashBuffer":{"type":"Buffer","data":[110,78,66,57,7,56,55,119,24,150,234,1,210,139,61,139,58,158,218,226]},"announce":[],"urlList":[]}}