{"title":"Fukushima and Beyond - Nuclear Power in a Low-Carbon World","uid":15560255,"size":1135172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e5772ca4370c7f884a87a394ed8f406ad0584b2&amp;dn=Fukushima+and+Beyond+-+Nuclear+Power+in+a+Low-Carbon+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471121634,"description":"Fukushima and Beyond - Nuclear Power in a Low-Carbon World - Christopher Hubbard (Ashgate, 2014).pdf\r\n\r\nThe catalyst for this study was the Fukushima-Daiichi major nuclear accident of 11 March 2011. In this event, a severe earthquake and15 metre tsunami caused serious damage and equipment failures at Japan’s Fukushima 1 Nuclear Power Plant which were judged by the International Atomic Energy Agency to be equally as serious as the Soviet Chernobyl nuclear disaster of 1986. Against a background of nuclear hesitancy and reassessment, the prospect of including or excluding nuclear power in a low-carbon twenty-first century world is now increasingly critical. It is in this emerging scenario and context that this book presents a full suite of historical, contemporary and projected data. Its use of complementary and comparative country-based case studies provides ample opportunity for developing strongly illustrative analysis of policy effectiveness in diverse polities and markets. In this way, it combines clear, comprehensive and rigorously science-based evidence, analysis and interpretation of data, all leading to conclusions and policy recommendations. Furthermore, it builds an understanding of the complexities and many challenges posed by the nuclear power option","torrent":{"xt":"urn:btih:6e5772ca4370c7f884a87a394ed8f406ad0584b2","amp;dn":"Fukushima+and+Beyond+-+Nuclear+Power+in+a+Low-Carbon+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e5772ca4370c7f884a87a394ed8f406ad0584b2","infoHashBuffer":{"type":"Buffer","data":[110,87,114,202,67,112,199,248,132,168,122,57,78,216,244,6,173,5,132,178]},"announce":[],"urlList":[]}}