{"title":"Adguard for Android (v2.7.220) [Multi] (2016)","uid":15543636,"size":7849416,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:6ef4326e52d2289bf408dbbdcb94f853ff11369c&amp;dn=Adguard+for+Android+%28v2.7.220%29+%5BMulti%5D+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Woitler","files":1,"time":1470948396,"description":"Application Name: Adguard\r\nPlatform: Android\r\nApplication Type: Web Filter, Anti-Banner, Anti-Phishing, Firewall and etc.\r\nRelease Date: August 11, 2016\r\nApplication Version: 2.7.220\r\nLanguage: English, German, French, Chinese, Japanese, Russian and etc.\r\nSystem requirements: Android 4.0.3 and higher\r\nType Installer: APK\r\nFile size: 7.48 MB\r\n----------------------------------------------------\r\nDescription\r\nAdguard - is a unique internet filter that protects you from the ubiquitous advertising, malware, and phishing sites, online tracking and more.\r\nAdguard is really cope with all kinds of completely blocking Internet advertising, pages load faster with it, it saves bandwidth and increase the protection of your device against possible threats. Adguard uses a unique technology that allows you to filter the traffic of your device, which does not require ROOT-law. The speed of the filter will not be affected by the work VPN-server, because it is located right on your device.\r\n----------------------------------------------------\r\nFunctionality\r\n1. The application does not require ROOT rights, which means that it can be used perfectly on any device;\r\n2. Adguard - the first application for Android with high quality filtration;\r\n3. Adguard able to block all kinds of advertising. Seriously, everything;\r\n4. The application is really simple, usable and intuitive;\r\n5. Protection against malware and phishing sites. Adguard prohibit downloading potentially dangerous applications and files, and will not allow you to become a victim of fraud;\r\n6. Blocking is not only in the browser, but also in games and applications!;\r\n7. The application speeds up the loading of web pages. Without further elements they open faster;\r\n8. Protection of personal data. Adguard ban tracking your online activities;\r\n9. Adguard - program, widely recognized in the world. More than 6 million people from different countries use version for Windows. And Adguard application for Android works perfectly well.\r\n----------------------------------------------------\r\nWhat's new in version 2.7.220?\r\n1. [Added] &quot;Apps &amp; Statistics&quot; settings section.\r\n2. [Added] An option to browse for a file to import user filter.\r\n3. [Added] A notification to inform user of expiring license.\r\n4. [Added] New localizations: Slovak &amp; Norwegian Bokmål.\r\n5. [Changed] Disabled vibration and sound for Adguard notifications.\r\n6. [Changed] Instead of stopping protection on settings change, a toast message is showed.\r\n7. [Changed] When user changes default firewall settings, ask him if he wants to reset per-app settings.\r\n8. [Changed] Show notification when VPN is revoked.\r\n9. [Changed] Adguard now counts DNS traffic towards a special &quot;virtual&quot; package named &quot;DNS&quot;.\r\n10. [Changed] Made some minor UI enhancements.\r\n11. [Fixed] Adguard closes if you swipe it with &quot;No icon&quot; notification setting.\r\n12. [Fixed] An issue with Samsung’s buggy firmware (messed notification sounds).\r\n13. [Improved] Premium features description.\r\n14. [Improved] UI accessibility for a visually impaired users.\r\n15. [Added] $app modifier.\r\n16. [Fixed] Detect if app targets Android N.\r\n17. [Added] RoList filter to the list of supported filters.\r\n18. [Changed] Several browsers were added to the list of filtered by default.\r\n19. [Fixed] Disabling filtering for &quot;Android OS&quot; now fully excludes OS packages from the VPN.\r\n20. [Improved] Added support for the :style pseudo class syntax. ...and etc","torrent":{"xt":"urn:btih:6ef4326e52d2289bf408dbbdcb94f853ff11369c","amp;dn":"Adguard+for+Android+%28v2.7.220%29+%5BMulti%5D+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef4326e52d2289bf408dbbdcb94f853ff11369c","infoHashBuffer":{"type":"Buffer","data":[110,244,50,110,82,210,40,155,244,8,219,189,203,148,248,83,255,17,54,156]},"announce":[],"urlList":[]}}