{"title":"Melt Yourself Down (2013) [FLAC]","uid":8601912,"size":265697079,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6f8d1ad720b798190761bff150ccec27240a315d&amp;dn=Melt+Yourself+Down+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1371907789,"description":"\n  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n\n  Melt Yourself Down (2013) [FLAC]\n\n  * Released: 2013\n  * Genres: Jazz, Pop/Rock, Electronic\n  * Styles: Jazz-Rock, Fusion\n  * Source: CD (log + cue)\n  * Codec: FLAC\n  * Bit Rate: ~ 1,000 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  Tracks:\n\n  * 01 Fix My Life\n  * 02 Release!\n  * 03 Tuna\n  * 04 We Are Enough\n  * 05 Kingdom Of Kush\n  * 07 Mouth To Mouth\n  * 08 Camel\n\n  Review: \n\n  * The self-titled debut album from Melt Yourself Down explains why the band, which combines the talents of some of the U.K.'s most boundary-pushing jazz and avant acts, is considered to be a supergroup. Brought together by former Acoustic Ladyland saxophonist Pete Wareham, who had a dream of making &quot;Nubian party punk,&quot; the act includes other members of Wareham's old band as well as players from Hello Skinny, Sons of Kemet, and Zun Zun Egui, all of which are groups that share an equal fondness for authenticity and experimentation. Members of the band have also played with Mulatu Astatke and Rokia Traore, emphasizing the passion the group has for the roots of their sound as well as the far-flung directions in which they can be taken. It's no coincidence that Melt Yourself Down shares its name with a limited-edition James Chance and the Contortions album; besides conferring no wave cred, the moniker is an apt one: Melt Yourself Down is full of face-meltingly furious performances as well as a melting pot of sounds and ideas. \n\n  * The album's first half is dominated by the band's formidable singles, including &quot;Fix My Life,&quot; which puts the spotlight on Wareham and Shabaka Hutchings' dueling saxes and the electronic trickery of producer Leafcutter John, and its irresistible, aptly named B-side &quot;Release!&quot; which showcases the strong and flexible rhythmic backbone provided by bassist Ruth Goller, percussionist Satin Singh, and drummer Tom Skinner. &quot;We Are Enough&quot; contrasts its peppy sax riffs with brash vocalizing from Kushal Gaya, who's as comfortable with this kind of punk swagger as he is with the ululating and chanting he does on &quot;Tuna&quot; and &quot;Camel.&quot; Later, Melt Yourself Down heads into more expansive realms, most notably on &quot;Free Walk,&quot; which is almost calm by the rest of the album's standards, even as it spotlights Singh's remarkable percussion work. As free-flowing and vibrant as tracks like &quot;Kingdom of Kush&quot; are, it's interesting to note that Melt Yourself Down wrote every part of the album before heading into the studio (they recorded the album on a boat, which suits its freewheeling nature). Whether or not that explains the almost impatient energy the band generates on these songs, the restlessness throughout is undeniable, infectious, and somehow welcoming. Melt Yourself Down is an exhilarating debut from a group whose members know each other well enough to head into this kind of wild territory with nothing holding them back.","torrent":{"xt":"urn:btih:6f8d1ad720b798190761bff150ccec27240a315d","amp;dn":"Melt+Yourself+Down+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f8d1ad720b798190761bff150ccec27240a315d","infoHashBuffer":{"type":"Buffer","data":[111,141,26,215,32,183,152,25,7,97,191,241,80,204,236,39,36,10,49,93]},"announce":[],"urlList":[]}}