{"title":"Paramore - Brand New Eyes [24 bit FLAC] vinyl","uid":8329774,"size":946933509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:704e1fd6051df5fbcfcd0ff5b208b9e2513087f9&amp;dn=Paramore+-+Brand+New+Eyes+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"24.96","files":-1,"time":1364861378,"description":"  Paramore - Brand New Eyes (2009) [24 bit FLAC] vinyl\n\n  Released: 2009\n  Source: 518250-1 / US\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Careful 3:52 \n  A2. Ignorance 3:41 \n  A3. Playing God 3:05 \n  A4. Brick By Boring Brick 4:16 \n  A5. Turn It Off 4:22 \n  B1. The Only Exception 4:30 \n  B2. Feeling Sorry 3:07 \n  B3. Looking Up 3:31 \n  B4. Where The Lines Overlap 3:21 \n  B5. Misguided Ghosts 3:04 \n  B6. All I Wanted 3:50\n\n  With 2007's Riot!, Paramore proved that pop hooks and a killer set of pipes can still vault a band to platinum status, economic downturn be damned. Success comes with a price, though, and Paramore struggled as media outlets reserved most of their coverage for Hayley Williams, deemed by many to be the group's leader. Rather than calling it quits, the musicians sought therapy in the studio, where tales of self-doubt and frustration were captured on tape by mega-producer Rob Cavallo. The anthemic, celebratory songs that made Riot! so appealing were largely absent, but the band found a new way to rock during those sessions, prizing catharsis and nuanced arrangements above the hooks of albums past. \n\n  Released in late 2009, Brand New Eyes presents Paramore as a stronger, leaner, and altogether more consistent band. &quot;Careful&quot; and &quot;Ignorance&quot; are two of the group's most aggressive tunes to date, and the rest of the disc follows suit, with the guitar interplay of Josh Farro and Taylor York (who makes his studio debut here, having joined the lineup after Riot! was recorded) receiving much of the spotlight. Drummer Zac Farro anchors the band with a flurry of snare hits and cymbal crashes, but the true MVP is none other than Ms. Williams, who sings with all the gusto of an angsty, 21st century Ann Wilson. She's fun, fiery, and altogether fantastic, a pint-sized powerhouse who attacks everyone from holier-than-thou naysayers (&quot;Playing God&quot;) to egocentric space cadets (&quot;Brick by Boring Brick&quot;). Williams also tones down the sonic assault whenever it's appropriate, offering a beautifully understated vocal during the album's centerpiece ballad, &quot;The Only Exception,&quot; and championing the band's longevity during songs like &quot;Where the Lines Overlap&quot; and &quot;Looking Up.&quot; &quot;God knows the world doesn't need another band,&quot; she sings during the latter track, &quot;but what a waste it would have been...I can't believe we almost hung it up. We're just getting started.&quot; Riot! explored similar thoughts with its closing track, &quot;Born for This,&quot; but &quot;Looking Up&quot; is made all the more convincing by the band's recent turmoil. Accordingly, Brand New Eyes is the band's most credible album to date, a blend of melody and muscle that packs a punch in spite of its tumultuous origin.","torrent":{"xt":"urn:btih:704e1fd6051df5fbcfcd0ff5b208b9e2513087f9","amp;dn":"Paramore+-+Brand+New+Eyes+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704e1fd6051df5fbcfcd0ff5b208b9e2513087f9","infoHashBuffer":{"type":"Buffer","data":[112,78,31,214,5,29,245,251,207,205,15,245,178,8,185,226,81,48,135,249]},"announce":[],"urlList":[]}}