{"title":"Cosmic Disclosure - Season 2 - Corey Goode - David Wilcock","uid":13347377,"size":4250437483,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:704faaa7f78c73a64821d906e2c102fd60638c9e&amp;dn=Cosmic+Disclosure+-+Season+2+-+Corey+Goode+-+David+Wilcock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Slappity Saaan","files":19,"time":1454060744,"description":"EPISODE LIST\r\nE1 Contact is Made\r\nThe blossoming of the secret space program was no accident. Corey Goode explains how initial contact was made with advanced beings and how these forces conspired to initiate humanity’s first foray into the cosmos.\r\n4.858025\r\n28 minutes\r\nE2 Agarthans: Advancing the Frontier\r\nCorey Goode recounts the earliest days of Germany’s secret space program which included collaborations with a subterranean civilization known as the Agarthans. Our initial space-bound advancements did not originate solely from extraterrestrial beings.\r\n4.846775\r\n30 minutes\r\nE3 Special Report: The Gonzales Enigma\r\nCorey Goode divulges never before exposed details concerning the extent of his contact with Lt. Colonel Gonzales and how they work together to assist the Sphere Being Alliance. The qualities which makes Gonzales and Corey ideally suited for working with ...\r\n4.843005\r\n29 minutes \r\nE4 Breakaway Begins\r\nCorey Goode describes the inception of the great military-industrial complex which endowed its power holders with the capability to form the first breakaway civilizations. Operations Paperclip and Highjump led to the consolidation of corporations which ...\r\n4.873555\r\n29 minutes\r\nE5 Raiders of Lost Technology\r\nAt last, Corey Goode exposes the secret source of information which enabled German scientists to construct the first space-bound vehicles.\r\n4.845485\r\n25 minutes\r\nE6 We Were Never Alone\r\nCorey Goode reveals a secret which shook the very foundation of the German’s burgeoning secret space program – we were never alone.\r\n4.797325\r\n32 minutes\r\nE7 Remnants of Ancient Mars\r\nLong ago, Mars was a very different world. Once readily suited for life, now only scant traces of strange lifeforms roam among the bizarre ruins which dot its surface. What they found further fueled the already enflamed rush for ancient technology.\r\n4.872295\r\n48 minutes\r\nE8 Finding Life on Mars\r\nCorey Goode reveals previously undisclosed details of the habitable zones on Mars. Barren stretches of land swath the surface of the red planet, as evidenced by the plethora of official photos released by NASA. But does it have to be completely lifeless?\r\n4.80581\r\n25 minutes\r\nE9 Colonizing Mars\r\nThe expansion of infrastructure on Mars begins in earnest as Corey Goode recounts the clandestine forces which conspired to create the largest secret economic and military industrial complex in order to fortify and expand their growing assets on Mars.\r\n4.853145\r\n30 minutes\r\nE10 Conquering the Solar System\r\nWith a solid base of operations on Mars, conquering the rest of the solar system would become just another step for the secret space program. New developments in propulsion systems enabled craft to take full advantage of the natural resources within the ...\r\n4.827345\r\n30 minutes\r\nE11 Beyond the Limits of the Sun\r\nIt was only inevitable that an international corporate conglomerate would form to take full advantage of the windfall that lie untapped within the natural resources of our solar system and beyond the limits of the sun.\r\n4.898665\r\n25 minutes\r\nE12 SSP Sciences\r\nCorey Goode exposes the details you have been waiting for pertaining age regression, zero time reference, Project Looking Glass and more.\r\n4.877865\r\n39 minutes\r\nE13 Viewer Questions Part 1\r\nCorey Goode answers some of the most burning questions posed by you, the viewer.\r\n4.83505\r\n36 minutes\r\nE14 The Threat from Artificial Intelligence\r\nContinuing his discourse of disclosure, Corey Goode openly reveals the greatest threat shared by all intelligent life in our galaxy: the rampant spread of a virulent form of artificial intelligence. As the eons passed, this A.I. transformed itself into a ...\r\n4.90927\r\n31 minutes\r\nE15 Standing Guard against the A.I.\r\nCorey Goode takes us deeper into the intricacies of the A.I. signal and how it seeks out those who can further its cause. We may not be able to halt the spread of this virulent infestation, but we can hinder its progress, and a coalition of forces are ...\r\n4.916665\r\n32 minutes\r\nE16 New Frontiers in the A.I. War\r\nThe war against the A.I. infestation has created a unified battlefront for the Secret Space Programs and the breakaway alliance. Thus, Earth’s budding collaboration with the Sphere Beings becomes all the more crucial for advancing the principles of liberty ...\r\n4.939085\r\n32 minutes\r\nE17 Viewer Questions Part 2\r\nYou raised the questions and Corey Goode has returned to answer them.\r\n4.833145\r\n31 minutes","torrent":{"xt":"urn:btih:704faaa7f78c73a64821d906e2c102fd60638c9e","amp;dn":"Cosmic+Disclosure+-+Season+2+-+Corey+Goode+-+David+Wilcock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704faaa7f78c73a64821d906e2c102fd60638c9e","infoHashBuffer":{"type":"Buffer","data":[112,79,170,167,247,140,115,166,72,33,217,6,226,193,2,253,96,99,140,158]},"announce":[],"urlList":[]}}