{"title":"A Concise Handbook of Math, Physics and Engineering Sciences","uid":6631246,"size":9315321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:709aba31d5666a5486f533e88b0a49f50c749694&amp;dn=A+Concise+Handbook+of+Math%2C+Physics+and+Engineering+Sciences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314377270,"description":"A Concise Handbook of Mathematics, Physics, and Engineering Sciences takes a practical approach to the basic notions, formulas, equations, problems, theorems, methods, and laws that most frequently occur in scientific and engineering applications and university education. The authors pay special attention to issues that many engineers and students find difficult to understand.\n\nThe first part of the book contains chapters on arithmetic, elementary and analytic geometry, algebra, differential and integral calculus, functions of complex variables, integral transforms, ordinary and partial differential equations, special functions, and probability theory. The second part discusses molecular physics and thermodynamics, electricity and magnetism, oscillations and waves, optics, special relativity, quantum mechanics, atomic and nuclear physics, and elementary particles. The third part covers dimensional analysis and similarity, mechanics of point masses and rigid bodies, strength of materials, hydrodynamics, mass and heat transfer, electrical engineering, and methods for constructing empirical and engineering formulas.\n\nThe main text offers a concise, coherent survey of the most important definitions, formulas, equations, methods, theorems, and laws. Numerous examples throughout and references at the end of each chapter provide readers with a better understanding of the topics and methods. Additional issues of interest can be found in the remarks. For ease of reading, the supplement at the back of the book provides several long mathematical tables, including indefinite and definite integrals, direct and inverse integral transforms, and exact solutions of differential equations.\n\n\n    * Hardcover: 1125 pages\n    * Publisher: CRC Press; 1 edition (October 18, 2010)\n    * Language: English\n    * ISBN-10: 143980639X\n    * ISBN-13: 978-1439806395","torrent":{"xt":"urn:btih:709aba31d5666a5486f533e88b0a49f50c749694","amp;dn":"A+Concise+Handbook+of+Math%2C+Physics+and+Engineering+Sciences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"709aba31d5666a5486f533e88b0a49f50c749694","infoHashBuffer":{"type":"Buffer","data":[112,154,186,49,213,102,106,84,134,245,51,232,139,10,73,245,12,116,150,148]},"announce":[],"urlList":[]}}