{"title":"Paris 2008 DVDRip Sonata Premiere","uid":9053074,"size":1036548753,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70d23a2db15fd8d225e3f25cf49ddecd769f2add&amp;dn=Paris+2008+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"klinho","files":4,"time":1381894129,"description":"Love and life pose dilemmas for a handful of friends in the City of Lights in this romantic drama from French filmmaker Cedric Klapisch. Pierre (Romain Duris) has enjoyed a successful career as a dancer performing in Parisian nightclubs, but when he's diagnosed with a serious heart condition, his doctor warns him that the strain of his work could kill him. Pierre must reinvent his life, and as he ponders his future and his mortality, he turns to his sister, Ã‰lise (Juliette Binoche), a social worker and single mother, for help. Ã‰lise is facing some life changes of her own; she's tired of being alone, and has developed an infatuation with Jean (Albert Dupontel), a grocer who sells his wares in the city's open-air market. But Jean is recently divorced and is still preoccupied with his former wife, Caroline (Julie Ferrier). Pierre also finds himself falling from afar for a lovely college student named Laetitia (Melanie Laurent), but he has a rival for her affections in Roland (Fabrice Luchini), one of her professors, who is considerably older than her.\n\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:70d23a2db15fd8d225e3f25cf49ddecd769f2add","amp;dn":"Paris+2008+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70d23a2db15fd8d225e3f25cf49ddecd769f2add","infoHashBuffer":{"type":"Buffer","data":[112,210,58,45,177,95,216,210,37,227,242,92,244,157,222,205,118,159,42,221]},"announce":[],"urlList":[]}}