{"title":"Matrix Energetics: The Science and Art of Transformation","uid":7791743,"size":10577267,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7115e7f8a004700744eba2f2ed6ffc337c81a4e5&amp;dn=Matrix+Energetics%3A+The+Science+and+Art+of+Transformation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352041760,"description":"Richard Bartlett - Matrix Energetics: The Science and Art of Transformation\nEnglish | 2007-04-03 | ISBN: 1582701636 | PDF | 208 pages \n\nIn 1997, Dr. Richard Bartlett experienced an event that would redirect the entire course of his life.\nHe suddenly discovered that by lightly touching his clients while at the same time applying focused intent, he could restore them to a physically, mentally, and spiritually balanced state, instantly shifting misalignments that had plagued them for years. Most astonishing of all, he could teach anyone how to do this. Now, for millions of people looking for empowerment in an age of declining and impersonal healthcare, Dr. Bartlett shares this phenomenon in a book full of explosive potential.\n\nIn Matrix Energetics, Dr. Bartlett builds upon his popular seminars to teach us how to access the discovery he has made -- a process that merges the science of subtle energy with our innate imaginations to produce measurable results. By applying forces known to modern physics, each of us can tap into states of healthy awareness from different moments -- in essence, travel in time -- and bring them into the present for immediate, profound results. As Dr. Bartlett clearly shows, this practice requires no special training, produces transformation in the blink of an eye, and is available to everyone who has a willingness to learn.","torrent":{"xt":"urn:btih:7115e7f8a004700744eba2f2ed6ffc337c81a4e5","amp;dn":"Matrix+Energetics%3A+The+Science+and+Art+of+Transformation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7115e7f8a004700744eba2f2ed6ffc337c81a4e5","infoHashBuffer":{"type":"Buffer","data":[113,21,231,248,160,4,112,7,68,235,162,242,237,111,252,51,124,129,164,229]},"announce":[],"urlList":[]}}