{"title":"Bireli Lagrene - Gipsy Trio (2009)","uid":6030941,"size":279713231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7166273920b82fd6d676699210f3bf39d0f3cdd5&amp;dn=Bireli+Lagrene+-+Gipsy+Trio+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mariorg","files":-1,"time":1292078427,"description":"BirÃƒÂ©li LagrÃƒÂ¨ne\nGipsy Trio\n2009 - Dreyfus Jazz: FDM 46050 369272 &lt;a href=&quot;\nhttp://www.disquesdreyfus.com/catalogue/369272-gipsy-trio.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.disquesdreyfus.com/catalogue/369272-gipsy-trio.html&lt;/a&gt;\n\n* BirÃƒÂ©li LagrÃƒÂ¨ne: guitare\n* Hono Winterstein: guitare\n* Diego Imbert: contrebasse\n\nReview\n~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/r1646624&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/r1646624&lt;/a&gt;\nby Michael G. Nastos\n\nBireli Lagrene's long and outstanding career as a Django Reinhardt disciple has\nbeen reinforced time and time again, while he also makes inroads to extend and\nexpand the tradition of gypsy jazz. While his acoustic guitar wizardry is\nunquestioned, his sincerity in keeping the hot swing of Reinhardt alive has been\nadopted by others, but not like Lagrene is capable of playing it. This\ndrummerless trio with veteran bassist Diego Imbert and rhythm guitarist Hono\nWinterstein -- heard in recent times with the Dorado Schmitt family band -- is\nan exciting, tasteful, and skilled combo that takes liberties in this kind of\nvintage jazz without stressing it out. Many of these tracks are familiar old\nfavorites, but a few have new twists, not to mention energy to burn. A version\nof Ahmad Jamal's &quot;Poinciana&quot; in particular has never really been done with a\nParisian flair, and it's a nice change-up. &quot;Limehouse Blues&quot; is another chestnut\ngiven new incentive to swing with Imbert's bowed lines and rhythm churning more\nthat normal. Most delightful is &quot;Singing in the Rain,&quot; already joyful but here\nhappy, over the top with an additionally whistled refrain. And &quot;Tiger Rag&quot; is\nabout as playful, fun, and vigorous as it gets. One might wonder what George\nHarrison would think of a take on his pensive classic tune &quot;Something,&quot; done in\neasy swing mode, or see George Shearing listening to a chunky, stride-filled\nversion of &quot;Lullaby of Birdland.&quot; Of the originals, &quot;New York City&quot; is a\nfast-paced metropolitan subway jam, &quot;Sir F.D.&quot; for label honcho Francis Dreyfus\nhas Lagrene in a languid solo repast, and &quot;Made in France&quot; has a choppy, 6/8\nromp. There are some patient tunes indeed, but Lagrene is at heart a speed\ndemon, ripping up the lesser-known Reinhardt tune &quot;Micro&quot; as if he's playing it\nin a vat of lit sterno. This is yet another in the long line of fine recordings\nthe virtuoso Lagrene has offered to the world, and comes easily recommended.","torrent":{"xt":"urn:btih:7166273920b82fd6d676699210f3bf39d0f3cdd5","amp;dn":"Bireli+Lagrene+-+Gipsy+Trio+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7166273920b82fd6d676699210f3bf39d0f3cdd5","infoHashBuffer":{"type":"Buffer","data":[113,102,39,57,32,184,47,214,214,118,105,146,16,243,191,57,208,243,205,213]},"announce":[],"urlList":[]}}