{"title":"Yootheme Frequency Joomla 2.5 and 3.x Theme","uid":9774162,"size":65707011,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:71fa581b21fc31bcf5ecef622f48c468dbf455a7&amp;dn=Yootheme+Frequency+Joomla+2.5+and+3.x+Theme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1395001451,"description":"Get in tune for Frequency, the March 2014 theme release. This unique theme comes with a rich, handdrawn styling that makes it a perfect base for your blog, event or any kind of quirky website creation.\n\nFrequency bursts with cool features and offers some true eye candy. Stun your visitors with an amazing full screen parallax background. Each style comes with a different moving background image for you to use in your own project. The effect also can easily be disabled. But there are still other nifty details. Check out the module edges, which vary with every style. The UI is enhanced with background textures, giving the theme a consistent, vintagy look. In addition Frequency also comes with a bonus style for the Widgetkit Slideset, which perfectly fits the theme's design.\n\nFrequency is based on Warp 7 and provides full support for LESS. The front-end is completely built with UIkit and can be modified through the Customizer. You can change colors, spacings and fonts without having to write a single line of code. To get you started, Frequency already provides 8 different style variations with parallax backgrounds to choose from for your project.","torrent":{"xt":"urn:btih:71fa581b21fc31bcf5ecef622f48c468dbf455a7","amp;dn":"Yootheme+Frequency+Joomla+2.5+and+3.x+Theme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71fa581b21fc31bcf5ecef622f48c468dbf455a7","infoHashBuffer":{"type":"Buffer","data":[113,250,88,27,33,252,49,188,245,236,239,98,47,72,196,104,219,244,85,167]},"announce":[],"urlList":[]}}