{"title":"D.Glukhovsky - Czas Zmierzchu [EPUB+MOBI+PDF] [PL]","uid":13682258,"size":8181755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:722b5dc1e3cb6e108d50e816876ff0b359657aca&amp;dn=D.Glukhovsky+-+Czas+Zmierzchu+%5BEPUB%2BMOBI%2BPDF%5D+%5BPL%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"everdarksoul","files":4,"time":1456488991,"description":"D.Glukhovsky - Czas Zmierzchu\r\nformat: EPUB+MOBI+PDF\r\njakość: bardzo dobra\r\n\r\n&quot;...gdyż nieszczęście świata w tym, że chory jest Bóg jego - stąd i świat choruje.\r\nW gorączce jest Pan i jego dzieło gorączkuje.\r\nUmiera Bóg i stworzony przez niego świat umiera.\r\nLecz nie jest jeszcze za późno...&quot;\r\n\r\nZawodowy tłumacz otrzymuje zlecenie przekładu hiszpańskiego dziennika wyprawy - która w XVI wieku z polecenia franciszkanina, Diega de Landy, wyruszyła po święte księgi Majów. Tymczasem z nagłówków gazet, z wiadomości radiowych i telewizyjnych napływają niepokojące doniesienia o kolejnych kataklizmach - w miarę jak tłumaczenie posuwa się do przodu, na świecie następują katastrofy żywiołowe: trzęsienie ziemi w Iranie, huragany w Stanach Zjednoczonych, tsunami w Indonezji, susza i pożary w Rosji... Zniszczenia są ogomne, a ofiar - tysiące...\r\nWszystkie te wydarzenia zdają się być połączone z przygodami autora tłumaczonych pamiętników, podążającego z oddziałem żołnierzy przez selwę Półwyspu Jukatan. Tłumaczowi udaje się w końcu zrozumieć proroctwa Majów o końcu świata oraz znaleźć sposób na poznanie przyszłości - a im bardziej tłumacz ulega fascynacji księgą, tym śmielej tajemnicze bóstwa Majów przenikają do współczesnej Moskwy. Duszna atmosfera tropikalnej selwy zadomawia się w arbackich zaułkach…\r\n\r\nCo łączy wierzenia Majów z naszym, zdawałoby się, postreligijnym postrzeganiem rzeczywistości?\r\nCzy jest jakiś związek między współczesnymi wydarzeniami a wyprawą opisaną na kartach tajemniczego dziennika?\r\nZwiązek ten zdaje się dostrzegać tylko jeden człowiek...\r\n______________________________________________________________\r\n\r\nJeszcze przed wydaniem książki, utwór był przyrównywany przez media do dzieł Dana Browna i Stephena Kinga (krytyk Aleksandr Gawriłow), a nawet do Nikołaja Gogola za jego poczucie stylu i umiejętność zbudowania napięcia w fabule.\r\nPowieść &quot;Czas Zmierzchu&quot; nazywana była odpowiedzią na Kod Leonarda da Vinci, zaś według słów autora: &quot;Czas Zmierzchu&quot; jest jego komentarzem do fenomenu roku 2012: \nhttps://pl.wikipedia.org/wiki/Fenomen_roku_2012","torrent":{"xt":"urn:btih:722b5dc1e3cb6e108d50e816876ff0b359657aca","amp;dn":"D.Glukhovsky+-+Czas+Zmierzchu+%5BEPUB%2BMOBI%2BPDF%5D+%5BPL%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722b5dc1e3cb6e108d50e816876ff0b359657aca","infoHashBuffer":{"type":"Buffer","data":[114,43,93,193,227,203,110,16,141,80,232,22,135,111,240,179,89,101,122,202]},"announce":[],"urlList":[]}}