{"title":"Bullying in the Arts: Vocation, Exploitation and Abuse of Power ","uid":6766991,"size":3354547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72a74634730ce21c48e65556ae980a1221b7800d&amp;dn=Bullying+in+the+Arts%3A+Vocation%2C+Exploitation+and+Abuse+of+Power+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MANTESH","files":3,"time":1319441454,"description":"[img]http://img.amazon.ca/images/I/514aa%2BN28VL._SS500_.jpg[/img]\n\n[b][quote][color=blue]\n\nBullying in the Arts: Vocation, Exploitation and Abuse of Power\n\n\nGower \nAnne-Marie Quigg\n2011 \nENGLISH\nISBN: 140940482X \n267 pages \nPDF \n3.19 MB\n\nDiva, Prima Donna, Maestro, Virtuoso: creative geniuses with the ability to deliver artistic excellence. However this perception can serve to tilt the balance of power in relationships and to substantiate the notion of artistic temperament; the Master is always right and the Diva must have her way. The artistic genius may be hell to work with but the end result (the art) is exceptional, so behaviour deemed unacceptable in normal circumstances must be tolerated. If the corporate culture in the arts is in thrall to the concept of the artistic genius, then across the various disciplines within the creative sector the prevailing mentality may be subscribing to a set of values that allows, even directly encourages, behaviour and employment conditions that are abusive. &quot;Bullying in the Arts&quot; argues that this mindset can have a profoundly negative effect in performing arts organisations, permitting managers and other staff to ignore bullying behaviour, as long as the show goes on. Researchers in a range of disciplines and fields have studied workplace bullying and, having witnessed bullying in a number of different arts organisations, Anne-Marie Quigg researched whether the behaviour represented isolated, rare occurrences in specific creative environments or if it was indicative of a more widespread problem in the arts and cultural sector. She discovered the highest level of bullying recorded in any single employment sector in the UK. &quot;Bullying in the Arts&quot; reveals Dr Quigg's findings, including the personal, organisational, legal and economic consequences of bullying behaviour. Looking at the experiences of countries such as Australia, Canada, France, Sweden, and the United States, this book challenges the notion that the arts are beyond the limitations of the ordinary milieu, exempt from the rules and regulations governing the treatment of employees. Arts managers and professionals, teachers, students and researchers in the arts world, and all those in management or management education, will find here a new model centred on management responses to bullying behaviour, which demonstrates the beneficial effect that knowledgeable, skilled action can have on the outcome of bullying incidents.\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:72a74634730ce21c48e65556ae980a1221b7800d","amp;dn":"Bullying+in+the+Arts%3A+Vocation%2C+Exploitation+and+Abuse+of+Power+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72a74634730ce21c48e65556ae980a1221b7800d","infoHashBuffer":{"type":"Buffer","data":[114,167,70,52,115,12,226,28,72,230,85,86,174,152,10,18,33,183,128,13]},"announce":[],"urlList":[]}}