{"title":"Menfis 8","uid":6158432,"size":75633611,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:72dcc8b95f3ded729c35753b160ee37ef516fa75&amp;dn=Menfis+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ppbar6","files":3,"time":1297122265,"description":"MÃƒÂ¡xima compatibilidad\n\nMenfis 8 estÃƒÂ¡ perfectamente diseÃƒÂ±ado para trabajar con el ÃƒÂºltimo sistema operativo de Microsoft, Windows 7, tanto en 32 como en 64 bits.\n\nAdaptado a la ÃƒÂºltima especificaciÃƒÂ³n FIEBDC-3 2007\n\nEl protocolo que permite al usuario intercambiar cÃƒÂ³moda y libremente informaciÃƒÂ³n entre diferentes programas de Mediciones y Presupuestos y Bases de Datos de la ConstrucciÃƒÂ³n.\n\nGestiÃƒÂ³n de Permisos y Actualizaciones a travÃƒÂ©s de Internet\n\nDe forma cÃƒÂ³moda y transparente, administre toda la informaciÃƒÂ³n referente a permisos y actualizaciones a travÃƒÂ©s de internet y benefÃƒÂ­ciese de las ventajas de ser usuario de Menfis.\n\nImportaciÃƒÂ³n web de catÃƒÂ¡logos y partidas\n\nPrÃƒÂ¡ctico y dinÃƒÂ¡mico. Acceda a los catÃƒÂ¡logos web de los proveedores y sÃƒÂ¡queles el mayor partido. Importe catÃƒÂ¡logos o partidas simplemente arrastrÃƒÂ¡ndolos a su proyecto en Menfis.\n\nCopias de seguridad automÃƒÂ¡ticas\n\nMenfis 8 incorpora un sistema de copias de seguridad que elimina el riesgo de pÃƒÂ©rdidas de trabajo, eligiendo el intervalo de tiempo con el que Menfis realizarÃƒÂ¡ copias de seguridad, el nÃƒÂºmero mÃƒÂ¡ximo de copias o de forma manual, en cualquier momento.\n\nAjuste de importes de capÃƒÂ­tulos\n\nMenfis 8 incorpora una nueva herramienta que aunque especialmente indicada para el ajuste de precios de capÃƒÂ­tulos, tiene capacidad para ajustar todo tipo de importes. Lo que unido a las funcionalidades ya existentes, cierra el cÃƒÂ­rculo de posibilidades de ajuste de precios dentro de una obra.\n\nNuevos Campos de Referencia\n\nMenfis 8 nos facilita un seguimiento mÃƒÂ¡s riguroso de nuestro presupuesto mediante la inclusiÃƒÂ³n de nuevos campos de referencia. El actual diseÃƒÂ±o de la aplicaciÃƒÂ³n permite ver el porcentaje del peso de cada concepto en su unidad del presupuesto, o verificar la informaciÃƒÂ³n contenida en archivos importados BC3, para todos los niveles de la obra y sin necesidad de recurrir a ventanas accesorias.\n\nGestiÃƒÂ³n de Pliegos\n\nLa gestiÃƒÂ³n de Pliegos de condiciones se ha agilizado. Ahora trabajamos sobre una nueva ventana independiente y mÃƒÂ¡s fÃƒÂ¡cil de usar, que muestra en una sola pantalla todas las categorÃƒÂ­as del pliego y los textos asociados a cada categorÃƒÂ­a y concepto, y desde la que ademÃƒÂ¡s puede asociar y modificar los pliegos de forma muy sencilla.\n\nAsistencia durante la certificaciÃƒÂ³n\n\nUn nuevo sistema de comprobaciÃƒÂ³n, nos informa sobre el estado de la certificaciÃƒÂ³n antes de realizar la impresiÃƒÂ³n. Incluye una serie de iconos informativos que nos indican si queda mediciÃƒÂ³n por certificar, si hemos certificado el total de la mediciÃƒÂ³n o si nos hemos excedido con respecto a la fase proyecto.\n      VÃƒÂ­deo cÃƒÂ³mo certificar\n\nAgilidad en el trabajo con paramÃƒÂ©tricos\n\nUna remodelada ventana de paramÃƒÂ©tricos nos permite visualizar toda la informaciÃƒÂ³n asociada al derivado generado de un sÃƒÂ³lo vistazo, sin necesidad de recurrir a pestaÃƒÂ±as accesorias. Cuenta ademÃƒÂ¡s con un generador que nos muestra todas las posibles combinaciones de un concepto paramÃƒÂ©trico, asÃƒÂ­ como con un apartado donde almacenar los derivados mÃƒÂ¡s utilizados, agilizando el proceso de trabajar con paramÃƒÂ©tricos.\n\nOrigen de Datos\n\nLa nueva herramienta de acceso rÃƒÂ¡pido a informaciÃƒÂ³n utiliza un sencillo sistema de navegaciÃƒÂ³n, para que usted pueda disponer en todo momento de las Bases de Precios mÃƒÂ¡s utilizadas, y moverse asÃƒÂ­ por ellas de forma rÃƒÂ¡pida, e ir elaborando nuestro proyecto simplemente arrastrando los conceptos de una ventana a otra.\n\nAyuda en Web\n\nAmpliamos los medios de ayuda. Ahora puede resolver sus dudas acerca de la aplicaciÃƒÂ³n, de manera inmediata, gracias al apoyo de nuestro sistema de ayuda en web.\n\nImportar mediciones desde plano\n\nAhora Menfis, gracias a la extensiÃƒÂ³n Medit, le permite obtener de forma automÃƒÂ¡tica las mediciones de modelos grÃƒÂ¡ficos realizados mediante Autodesk Revit. Esta herramienta establece una correspondencia entre planos y estado de mediciones con una fiabilidad nunca antes lograda.\n\nSeguimiento de conceptos\n\nUn nuevo sistema de seguimiento de conceptos, que nos permite llevar a cabo bÃƒÂºsquedas mÃƒÂ¡s exhaustivas y un mayor control sobre nuestra obra.\n\n      A todas estas novedades habrÃƒÂ­a que aÃƒÂ±adir las mejoras que han sido llevadas a cabo por el equipo de I+D de Professional Software, tanto relacionadas con el interfaz de Menfis como las referidas al desarrollo de nuevos y mejores procesos en el motor de la aplicaciÃƒÂ³n.\n &lt;a href=&quot;\nhttp://prosoft.es/productos/menfis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://prosoft.es/productos/menfis&lt;/a&gt;","torrent":{"xt":"urn:btih:72dcc8b95f3ded729c35753b160ee37ef516fa75","amp;dn":"Menfis+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72dcc8b95f3ded729c35753b160ee37ef516fa75","infoHashBuffer":{"type":"Buffer","data":[114,220,200,185,95,61,237,114,156,53,117,59,22,14,227,126,245,22,250,117]},"announce":[],"urlList":[]}}