{"title":"Flash Decompiler Trillix 5.2.1160 Multilanguage Portable [ak]","uid":6420573,"size":11999439,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:72e66e80c37942bd66b196c3d8d5d6d87c27ef42&amp;dn=Flash+Decompiler+Trillix+5.2.1160+Multilanguage+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306304888,"description":"Flash Decompiler Trillix 5.2.1160 Multilanguage Portable\n\nFlash Decompiler Trillix is a feature rich and powerful SWF to FLA converter, which will help you decompile Flash movies, convert SWF elements into multiple formats and edit SWF movies (dynamic texts, hyperlinks and more) on the go without Flash Studio installed. Moreover, you will be able to extract all elements from the SWF file and save them to your hard drive in various formats. And last, but not least, is that Flash Decompiler supports batch conversion mode. You can simply leave several files to convert and go have a cup of coffee while Flash Decompiler is working. Now Flash Decompiler fully supports Flash 5, 6, 7, 8 and Flash 9!\n\nFeatures:\nÃ‚Â» Full support of Flash 5, 6, 7, 8 and 9 including AS 2.0 and 3.0\nÃ‚Â» Extract all Flash file resources into various formats\nÃ‚Â» Extract Flash video into AVI, MPEG and other playable formats\nÃ‚Â» Batch decompilation and conversion of Flash movies\nÃ‚Â» Edit more Flash objects now without converting to FLA: images, dynamic texts, hyperlinks, sounds, colors and lines\nÃ‚Â» New scalable shining interface with ribbon bar\nÃ‚Â» Advanced built-in Flash player to preview and playback your Flash movies\nÃ‚Â» ASCII, Hex, Pi-code and common ActionScripts representation\nÃ‚Â» Detailed configuration of SWF to FLA conversion (motion tweens, library, FLA format, AS and other settings)\nÃ‚Â» Take screenshots of Flash file played\nÃ‚Â» Unique global ActionScripts search in all tasks simultaneously\nÃ‚Â» Simple and effective adding of multiple files or folders to the Tasks list\nÃ‚Â» Easily change the background color of any SWF file\nÃ‚Â» Detailed tag information panel\nÃ‚Â» Save Flash Movie in Internet Explorer and FireFox plug-ins are supplied for simple saving of SWF movies online\nÃ‚Â» The software is digitally signed to verify Eltima quality and software authenticity\nÃ‚Â» Many other convenient features for professional Flash decompilation\n\nHome Page - http://www.eltima.com/\n\n","torrent":{"xt":"urn:btih:72e66e80c37942bd66b196c3d8d5d6d87c27ef42","amp;dn":"Flash+Decompiler+Trillix+5.2.1160+Multilanguage+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72e66e80c37942bd66b196c3d8d5d6d87c27ef42","infoHashBuffer":{"type":"Buffer","data":[114,230,110,128,195,121,66,189,102,177,150,195,216,213,214,216,124,39,239,66]},"announce":[],"urlList":[]}}