{"title":"Public Health Nursing, Thornbory [PDF][StormRG]{HTD15}","uid":11785131,"size":2828305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73174d2f1d9578660dfe06273917e6a81e79dabf&amp;dn=Public+Health+Nursing%2C+Thornbory+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":3,"time":1427726090,"description":"TITLE/EDITION Public Health Nursing: A Textbook for Health Visitors, School Nurses and Occupational Health Nurses\nBy: Greta Thornbory\nPaperback: 256 pages\nPublisher: Wiley-Blackwell; 1 edition (August 17, 2009)\nLanguage: English\nISBN-10: 1405180072\nISBN-13: 978-1405180078\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nPublic Health Nursing is an essential resource for all health visiting students, school nursing students, and occupational health nursing students, that reflects the current key changes in community public health nursing. It is a key textbook for specialist practitioner programmes, and those new to the public health arena. Written by relevant experts in the field, this practical textbook uniquely explores the three main specialties of Public Health Nursing: Health Visiting, School Nursing and Occupational Health Nursing. A particular strength of the book is the way it shows the diversity of each discipline and how they each address Public Health in vastly different ways according to the needs of their relevant population. This will be essential reading for all students on the Specialist Community Public Health Nursing (SCPHN) programmes offered across the UK. Key features: Focuses on the specialist community public health nursing part of the NMC register Multidisciplinary, with contributors from all three specialisms Concerned with improving the health of the population, rather than treating the diseases of individual patients Focuses on practice and competencies","torrent":{"xt":"urn:btih:73174d2f1d9578660dfe06273917e6a81e79dabf","amp;dn":"Public+Health+Nursing%2C+Thornbory+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73174d2f1d9578660dfe06273917e6a81e79dabf","infoHashBuffer":{"type":"Buffer","data":[115,23,77,47,29,149,120,102,13,254,6,39,57,23,230,168,30,121,218,191]},"announce":[],"urlList":[]}}