{"title":"Fundamentals of Electric Circuits 4th Edition{BBS}","uid":6640226,"size":15938882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7319176da13291603ab74317d4428e9f6ebb8ff8&amp;dn=Fundamentals+of+Electric+Circuits+4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314715621,"description":"Alexander and Sadiku's fourth edition of Fundamentals of Electric Circuits continues in the spirit of its successful previous editions, with the objective of presenting circuit analysis in a manner that is clearer, more interesting, and easier to understand than other, more traditional texts. Students are introduced to the sound, six-step problem solving methodology in chapter one, and are consistently made to apply and practice these steps in practice problems and homework problems throughout the text.\n\nA balance of theory, worked examples and extended examples, practice problems, and real-world applications, combined with over 350 new homework problems for the fourth edition and robust media offerings, renders the fourth edition the most comprehensive and student-friendly approach to linear circuit analysis.\n\nThis edition adds the Design a Problem feature which helps students develop their design skills by having the student develop the question as well as the solution. There are over 100 Design a Problem exercises integrated into the problem sets in the book.\n\nAlexander/Sadiku also offers you the convenience of ARIS -- the text-specific web site -- which allows you to assign homework online or create printed homework sets and solutions to your students. The website also features solutions and KCIDE software, which reinforces the books problem-solving approach.\nAbout the Author\nDr. Charles K. Alexander (Athens, OH) is a Professor of Electrical Engineering and Computer Science at the University of Ohio and served as the President and CEO of the IEEE from 1996-1999.\nProduct Details\n\n    * Hardcover: 1056 pages\n    * Publisher: McGraw-Hill Science/Engineering/Math; 4 edition\n    * Language: English\n    * ISBN-10: 0077263197\n    * ISBN-13: 978-0077263195","torrent":{"xt":"urn:btih:7319176da13291603ab74317d4428e9f6ebb8ff8","amp;dn":"Fundamentals+of+Electric+Circuits+4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7319176da13291603ab74317d4428e9f6ebb8ff8","infoHashBuffer":{"type":"Buffer","data":[115,25,23,109,161,50,145,96,58,183,67,23,212,66,142,159,110,187,143,248]},"announce":[],"urlList":[]}}