{"title":"Radical Self-Acceptance - Tara Brach","uid":7991717,"size":190016599,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:73867a8ffafe146f881fe8f70c971971d0aa1c25&amp;dn=Radical+Self-Acceptance+-+Tara+Brach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"levijk","files":-1,"time":1357440104,"description":"Course objectives:\n\n\nExplain how feelings of shame and unworthiness are the source of many problems we experience with our relationships, careers, creative endeavors, and most fundamentally, our spiritual unfolding.\n\nDiscuss Radical Self-Acceptance and how to free yourself from the grip of your insecurities about being good enough.\n\nPractice Radical Self-Acceptance as a way to discover the freedom that comes with kindness and true appreciation of yourself and others.\n\nUtilize insights from both Eastern contemplative traditions and Western psychotherapies to guide you through a full program of meditations and skills you need to become more compassionate toward the unforgivable parts of your Self.\n\n\nHow would your life change if you genuinely accepted yourself, just the way you are? According to Dr. Tara Brach, feelings of shame and unworthiness are the source of many problems we experience with our relationships, careers, creative endeavors, and most fundamentally, our spiritual unfolding.\n\n \n\nOnRadical Self-Acceptance, this respected clinical psychologist and Buddhist meditation teacher shows you how to free yourself from the grip of your insecurities about being good enough.\n\nWith insights from both Eastern contemplative traditions and Western psychotherapies, Dr. Brach guides you through a full program of meditations and skills you need to become more compassionate toward the unforgivable parts of your Self.\n\nAs Dr. Brach says, the most difficultand pervasivechallenge to Westerners today is the suffering caused by our feelings of unworthiness and self-aversion.Radical Self-Acceptance offers a way to break out of this emotional prison, so you can discover the freedom that comes with kindness and true appreciation of yourself and others.","torrent":{"xt":"urn:btih:73867a8ffafe146f881fe8f70c971971d0aa1c25","amp;dn":"Radical+Self-Acceptance+-+Tara+Brach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73867a8ffafe146f881fe8f70c971971d0aa1c25","infoHashBuffer":{"type":"Buffer","data":[115,134,122,143,250,254,20,111,136,31,232,247,12,151,25,113,208,170,28,37]},"announce":[],"urlList":[]}}