{"title":"Heterogeneous Catalytic Materials - Solid State Chemistry, Surfa","uid":15878045,"size":17803903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73a7c4b5edd4a286ec94fd494b9cfa568054b5a8&amp;dn=Heterogeneous+Catalytic+Materials+-+Solid+State+Chemistry%2C+Surfa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"clouderone","files":1,"time":1474551411,"description":"Heterogeneous Catalytic Materials - Solid State Chemistry, Surface Chemistry and Catalytic Behaviour - Guido Busca (Elsevier, 2014).pdf\r\n\r\nHeterogeneous Catalytic Materials discusses experimental methods and the latest developments in three areas of research: heterogeneous catalysis; surface chemistry; and the chemistry of catalysts. Catalytic materials are those solids that allow the chemical reaction to occur efficiently and cost-effectively.\r\n\r\nThis book provides you with all necessary information to synthesize, characterize, and relate the properties of a catalyst to its behavior, enabling you to select the appropriate catalyst for the process and reactor system. Oxides (used both as catalysts and as supports for catalysts), mixed and complex oxides and salts, halides, sulfides, carbides, and unsupported and supported metals are all considered. The book encompasses applications in industrial chemistry, refinery, petrochemistry, biomass conversion, energy production, and environmental protection technologies.\r\n\r\n\r\n\r\nProvides a systematic and clear approach of the synthesis, solid state chemistry and surface chemistry of all solid state catalysts\r\nCovers widely used instrumental techniques for catalyst characterization, such as x-ray photoelectron spectroscopy, scanning electron microscopy, and more\r\nIncludes characterization methods and lists all catalytic behavior of the solid state catalysts\r\nDiscusses new developments in nanocatalysts and their advantages over conventional catalysts","torrent":{"xt":"urn:btih:73a7c4b5edd4a286ec94fd494b9cfa568054b5a8","amp;dn":"Heterogeneous+Catalytic+Materials+-+Solid+State+Chemistry%2C+Surfa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a7c4b5edd4a286ec94fd494b9cfa568054b5a8","infoHashBuffer":{"type":"Buffer","data":[115,167,196,181,237,212,162,134,236,148,253,73,75,156,250,86,128,84,181,168]},"announce":[],"urlList":[]}}