{"title":"Hound Dog Taylor-9 cd","uid":5235813,"size":856566162,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:741349c977386303d853e37886a14e61fd77c9df&amp;dn=Hound+Dog+Taylor-9+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"flitigalisa","files":135,"time":1261526047,"description":"Theodore Roosevelt &quot;Hound Dog&quot; Taylor, fÃƒÂ¶dd 12 april 1915 i Natchez, Mississippi, dÃƒÂ¶d 17 december 1975 i Chicago, Illinois, var en amerikansk bluesgitarrist och sÃƒÂ¥ngare.\nHound Dog Taylor bÃƒÂ¶rjade spela gitarr som 20-ÃƒÂ¥ring. Han flyttade 1942 till Chicago och blev musiker pÃƒÂ¥ heltid 1957. Hans kompband gick under namnet The HouseRockers och bestod av andregitarristen Brewer Phillips och trummisen Ted Harvey.\nDe upptÃƒÂ¤cktes sÃƒÂ¥ smÃƒÂ¥ningom av Bruce Iglauer, en anstÃƒÂ¤lld pÃƒÂ¥ Delmark Records, som efter att ha misslyckats med att fÃƒÂ¥ sin arbetsgivare att ge dem kontrakt grundade skivbolaget Alligator Records och gav ut deras debutalbum Hound Dog Taylor and the HouseRockers 1971. Ytterligare ett album fÃƒÂ¶ljde 1973, Natural Boogie. Efter Taylors bortgÃƒÂ¥ng 1975 har ytterligare ett antal album getts ut postumt.\nHound Dog Taylor valdes in i Blues Hall of Fame 1984.\nHound Dog Taylor fÃƒÂ¶ddes med sex fingrar pÃƒÂ¥ varje hand. Han skar sjÃƒÂ¤lv bort det sjÃƒÂ¤tte fingret pÃƒÂ¥ hans hÃƒÂ¶gra hand med ett rakblad fÃƒÂ¶r att det stÃƒÂ¶rde hans gitarrspel.\n\nTaylor was born in Natchez, Mississippi, in 1915 (although some sources say 1917). He originally played piano, but began playing guitar when he was 20 and moved to Chicago in 1942.\nHe became a full-time musician around 1957 but remained unknown outside of the Chicago area, where he played small clubs in the black neighborhoods and also at the open-air Maxwell Street Market. He was known for his electrified slide guitar playing, his cheap Japanese guitars, and his raucous boogie beats. He was also famed among guitar players for having six fingers on his left hand.\nAfter hearing Taylor with his band, the HouseRockers (Brewer Phillips on second guitar and Ted Harvey on drums) in 1970 at Florence's Lounge on Chicago's South Side, Bruce Iglauer - at the time a shipping clerk for Delmark Records - tried to get him signed by his employer. Having no success getting Delmark to sign Taylor, Iglauer formed a small record label with a $2500 inheritance and recorded Taylor's debut album, Hound Dog Taylor and the HouseRockers, on his fledgling Alligator Records in 1971. It was the first release on Alligator records, now a major blues label. It was recorded live in a studio in just two nights. Iglauer began managing and booking the band, which toured nationwide and performed with Muddy Waters and Big Mama Thornton. The band became particularly popular in the Boston area, where Taylor inspired a young protege named George Thorogood.\nTheir second release, Natural Boogie, was recorded in late 1973, and led to greater acclaim and touring. In 1975, Taylor and his band toured Australia and New Zealand with Freddie King and Sonny Terry and Brownie McGhee. His third Alligator album, Beware of the Dog, was recorded live in 1974 but was only released after his death. More posthumous releases occurred as well, including Genuine Houserocking Music and Release the Hound, on the Alligator label as well as some bootleg live recordings.\nTaylor died of lung cancer in 1975, and was buried in Restvale Cemetery in Alsip, Illinois. Taylor was posthumously inducted into the Blues Hall of Fame in 1984\n","torrent":{"xt":"urn:btih:741349c977386303d853e37886a14e61fd77c9df","amp;dn":"Hound+Dog+Taylor-9+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"741349c977386303d853e37886a14e61fd77c9df","infoHashBuffer":{"type":"Buffer","data":[116,19,73,201,119,56,99,3,216,83,227,120,134,161,78,97,253,119,201,223]},"announce":[],"urlList":[]}}