{"title":"MomsTeachSex - Audrey Show, Marry Lynn NEW 08 June 2015","uid":12000025,"size":258977365,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7447c40edce76cb0ed8bf1c5db7dc41e25148f2c&amp;dn=MomsTeachSex+-+Audrey+Show%2C+Marry+Lynn+NEW+08+June+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1433758048,"description":"Athletic hotties Audrey Show and her stepdaughter Marry Lynn are doing their daily workout with the help of Jake Taylor. Audrey decides to help hook Marry up with Jake, and thanks to a few pointed questions she makes her intentions clear.Jake is uncomfortable with the conversation and he tries to go back to the workout, but after he helps Marry perform a handstand he has an obvious erection! Audrey is all too willing to help Jake out with his little problem, and Marry is happy to follow her stepmom's lead.Sitting Jake down, the girls take turns wrapping their lips around his hard dick and sucking him down until they are deep throating. As Marry works her mouth over Jake's manhood, Audrey gets all three of them naked and ready to move on to something even hotter.Laying Jake down exactly the way they want him, Audrey and Marry get ready to double team him! Marry slides down on Jake's fuck stick for a bouncing stiffie ride, while Audrey plants her creamy pussy over Jake's mouth so that he can eat out her cock hungry slit.Getting creative with the workout equipment, the girls position themselves so that they are poised to do a lesbian 69. Jake presses his dick deep into Audrey's snatch so that he can fuck her doggy style while she licks and fondles Marry's puss.Marry gets one more pussy pounding courtesy of Jake while she buries her moans in Audrey's twat. As Marry is moaning her orgasmic delight, Jake reaches the end of his endurance. Fortunately Audrey is there to pull him out so that he jizzes all over Marry's bare mound, leaving plenty of cum for Audrey to lick up and enjoy.\nCategories: Small Boobs Big Boobs Puffy Nipples Shaved Pussy Short Girls Tall Girls Brunette Blonde Long hair Athlete Hardcore Lesbian Tan Petite Camel Toe Natural Milf Girl-Girl-Boy Super Skinny Girls Finishing the Job Pussy Licking\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=89782759172080566992.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=89782759172080566992.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=51438601307705431219.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=51438601307705431219.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7447c40edce76cb0ed8bf1c5db7dc41e25148f2c","amp;dn":"MomsTeachSex+-+Audrey+Show%2C+Marry+Lynn+NEW+08+June+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7447c40edce76cb0ed8bf1c5db7dc41e25148f2c","infoHashBuffer":{"type":"Buffer","data":[116,71,196,14,220,231,108,176,237,139,241,197,219,125,196,30,37,20,143,44]},"announce":[],"urlList":[]}}