{"title":"Crafting a Compiler (2009) [PDF]","uid":10404919,"size":4801709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74ba51048c5730138c186640a2d93cb7a8d65fde&amp;dn=Crafting+a+Compiler+%282009%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bey0nd","files":-1,"time":1403442002,"description":"Much has changed since Crafting a Compiler, by Fischer and LeBlanc, was published in 1988. While instructors may remember the 5.25-inch floppy disk of software that accompanied that text, most students today have neither seen nor held such a disk. Many changes have occurred in the programming languages that students experience in class and in the marketplace.\n\nWhile much has changed, students and faculty alike continue to study and teach the subject of compiler construction. Research in the area of compilers and programing language translation continues at a brisk pace, as compilers are tasked with accommodating an increasing diversity of architectures and programming languages. Software development environments depend on compilers interacting successfully with a variety of software toolchain components such as syntax-informed editors, performance profilers, and debuggers. All modern software efforts rely on their compilers to check vigorously for errors and to translate programs faithfully.\n\nThis book reflects a substantive revision of the material from 1988 and 1991. While the focus of this text remains on teaching the fundamentals of compiler construction, the algorithms and approaches have been brought into modern practice:\n\n    Algorithms are presented in a pseudocode style that should be familiar to students who have studied the fundamental algorithms of our discipline. Pseudocode enables a concise formulation of an algorithm and a rational discussion of the algorithm's purpose and construction.\n\n    The details of implementation in a particular language have been relegated to this web site.\n\n    Parsing theory and practice are organized to facilitate a variety of pedagogical approaches. Some may study the material at a high level to gain a broad view of top-down and bottom-up parsing. Others may study a particular approach in greater detail.\n\n    The front- and back-end phases of a compiler are connected by the Abstract Syntax Tree (AST), which is created as the primary artifact of parsing. Most compilers build an AST, but relatively few texts articulate its construction and use. The visitor pattern is introduced for traversing the AST during semantic analysis and code generation.\n\n    Laboratory and studio exercises are available to instructors via this web site. Instructors can assign some components as exercises for the students while other components are supplied from our course-support Web site.\n\nSome texts undergo revision by the addition of more graduate-level material. While such information may be useful in an advanced course, the focus of Crafting a Compiler remains on the undergraduate-level study of compiler construction. A graduate course could be offered using Chapters 13 and 14, with the earlier portions of the text serving as reference material. \n\nAuthors:\n    Charles N. Fischer\n    Ron K. Cytron\n    Richard LeBlanc, Jr.\n\nHardcover: 720 pages\nPublisher: Addison-Wesley\nISBN-10: 0136067050\nISBN-13: 978-0136067054\n &lt;a href=&quot;\nhttp://www.cs.wustl.edu/~cytron/cacweb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cs.wustl.edu/~cytron/cacweb/&lt;/a&gt;","torrent":{"xt":"urn:btih:74ba51048c5730138c186640a2d93cb7a8d65fde","amp;dn":"Crafting+a+Compiler+%282009%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74ba51048c5730138c186640a2d93cb7a8d65fde","infoHashBuffer":{"type":"Buffer","data":[116,186,81,4,140,87,48,19,140,24,102,64,162,217,60,183,168,214,95,222]},"announce":[],"urlList":[]}}