{"title":"Gardening, Farming, Ecology and the Environment Mini-pack Update","uid":6075023,"size":1717069183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74d9b2505ba59c16df51a5f3b28e4d3b0d4e7e9f&amp;dn=Gardening%2C+Farming%2C+Ecology+and+the+Environment+Mini-pack+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Supaiku","files":267,"time":1293790926,"description":"Books include how to, analysis, and research for ecological and food growing systems. \nI recommend NOT downloading the whole package, but selecting the books you desire as some books have two versions: A complete PDF (of higher quality, potentially for printing), and one that is OCRed (but not proofread, hence \\&quot;UNEDITED\\&quot;)\n\n\nGardening, Environmental and Ecology Books\\\\Architecture\nGardening, Environmental and Ecology Books\\\\Architecture\\\\Eco Redux.pdf\nGardening, Environmental and Ecology Books\\\\Architecture\\\\Territory__Architecture_Beyond_Environment__Architectural_Design_-_David_Gissen_1.pdf\n\nGardening, Environmental and Ecology Books\\\\Fungus\nOn fugi and their uses for agriculture (and bioremediation).\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Bioremediation.pdf\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Bioremediation of Aquatic and Terrestial Ecosystems.pdf\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Fungi_in_Bioremediation.pdf\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Methods in Molecular Biology, vol.599 - Bioremediation - Methods and Protocols (Humana, 2009).pdf\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Mycoremediation - Fungal Bioremediation.pdf\n\tVery academic like.^^^\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Oyster\\\\Oyster.zip\nGardening, Environmental and Ecology Books\\\\Fungus\\\\Shitake\\\\Shitake.zip\n\tStudy and How to on growing these mushrooms.\n\t\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\n\tMisc Permaculture related resources. Largely pamphlets.\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Indian Permaculture - 1491 - Magazine - The Atlantic_files\n\tSuper article from the Atlantic.\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Forests_in_Permaculture.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Indian Permaculture - 1491 - Magazine - The Atlantic.htm\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Our_Home_Flowering_Tree.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Permaculture_in_Arid_Landscapes.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Permaculture_in_Humid_Landscapes.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Permaculture_on_Islands.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\Permaculture_Techniques.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\The_Solomon_Islands_in_the_South_Pacific.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\water_in_permaculture.pdf\nGardening, Environmental and Ecology Books\\\\Misc Permaculture\\\\waterharv_traditions.pdf\n\n\nGardening, Environmental and Ecology Books\\\\agronomy-thematic-file.pdf\nGardening, Environmental and Ecology Books\\\\Create an Oasis with Greywater UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Blue Valley - An Ecological Memoir Complete.pdf\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Vol.1 Vision and Theory Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Vol.1 Vision and Theory Complete UNEDITED.doc\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Vol.2 Design and Practice Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Vol.2 Design and Practice UNEDITED.doc\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Volume 1 UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Edible Forest Gardens Volume 2 UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Greywater Complete.pdf\nGardening, Environmental and Ecology Books\\\\Humanuer Handbook Complete.pdf\nGardening, Environmental and Ecology Books\\\\Humanuer Handbook UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\PERMACULTURE A Designers Manual Bill Mollison.pdf\nGardening, Environmental and Ecology Books\\\\Plants of Northern China Complete Opt.pdf\nGardening, Environmental and Ecology Books\\\\Plants of Northern China UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Rainwater Harvesting for Drylands and Beyond Volume 1 Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Rainwater Harvesting for Drylands and Beyond Volume 1 UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Rainwater Harvesting for Drylands and Beyond Volume 2 Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Silenced Rivers Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Silenced Rivers UNEDITED.pdf\n\tAbout large scale dams and their many problems.\nGardening, Environmental and Ecology Books\\\\Systems Science and modeling for Ecological Economics Complete OPT.pdf\nGardening, Environmental and Ecology Books\\\\Systems Science and modeling for Ecological Economics UNEDITED.doc\nGardening, Environmental and Ecology Books\\\\Systems Science and Modeling for Ecological Economics UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Systems Science and Modeling for Ecological Economics.pdf\n\tPart of an internet course at: http://www.likbez.com/AV/Simmod.html\nGardening, Environmental and Ecology Books\\\\The Worm Book UNEDITED.pdf\n\n\nGardening, Environmental and Ecology Books\\\\Urban\n\tAbout urban food growing etc.\nGardening, Environmental and Ecology Books\\\\Urban\\\\Agropolis.pdf\n\tFancy PDF version.\nGardening, Environmental and Ecology Books\\\\Urban\\\\Agropolis2.pdf\n\tInternetcore version.\nGardening, Environmental and Ecology Books\\\\Urban\\\\Complete Guide to Indoor Gardening (in pots) Complete.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\Complete Guide to Indoor Gardening (in Pots) UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\Gardening Indoors with soil and hydroponics UNEDITED.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\NYCGreenInfrastructurePlan_ExecutiveSummary.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\NYCGreenInfrastructurePlan_LowRes.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\Toolbox For Sustainable City Living Complete.pdf\nGardening, Environmental and Ecology Books\\\\Urban\\\\Toolbox For Sustainable City Living UNEDITED.pdf\n\tFrom Rhizome Collective. Mostly great ideas. No solid how-to\\'s. Good inspiration.\nGardening, Environmental and Ecology Books\\\\Urban\\\\Green Roofs\nGardening, Environmental and Ecology Books\\\\Urban\\\\Green Roofs\\\\Toronto Green Roofs - fullreport103105.pdf\n\n","torrent":{"xt":"urn:btih:74d9b2505ba59c16df51a5f3b28e4d3b0d4e7e9f","amp;dn":"Gardening%2C+Farming%2C+Ecology+and+the+Environment+Mini-pack+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d9b2505ba59c16df51a5f3b28e4d3b0d4e7e9f","infoHashBuffer":{"type":"Buffer","data":[116,217,178,80,91,165,156,22,223,81,165,243,178,142,77,59,13,78,126,159]},"announce":[],"urlList":[]}}