{"title":"James Brown, The Godfather of Soul [PDF] [StormRG]","uid":11256488,"size":3524457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74f3ce95b9a839fa441ccb355bdcd08fa6a283cf&amp;dn=James+Brown%2C+The+Godfather+of+Soul+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"krystine","files":-1,"time":1413905660,"description":"James Brown: The Godfather of Soul\nAuthor: James Brown\nPublished: 2014\nPublisher: Head of Zeus\nASIN: B00MGQ7ZBS\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\n\nJames Brown's explosive biography is now the major Hollywood film directed by Tate Taylor (THE HELP) and produced by Mick Jagger, GET ON UP.\n\nJames Brown: A man who played 350 shows a year at his peak. Who broke the colour barrier of 1950s and '60s pop. Who supported the Civil Rights movement through his music, playing a racially charged Boston in the hours after Martin Luther King, Jr.'s assassination and travelling to Vietnam to support black troops. Who won and lost several fortunes. And who became one of the greatest musical innovators of all time...\n\nIn his own words, this is the incredible life story of the Godfather of Soul, giving the inside story of his life and music, taking the reader on a journey from his impoverished childhood to his evolution into one of the most influential figures of the 20th century.\n\nWith photos, unmissableabout Little Richard, Elvis, Tina Turner, Otis Redding, Tammi Terrell, Michael Jackson, and many others, plus an updated introduction and epilogue and an exhaustive discography","torrent":{"xt":"urn:btih:74f3ce95b9a839fa441ccb355bdcd08fa6a283cf","amp;dn":"James+Brown%2C+The+Godfather+of+Soul+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f3ce95b9a839fa441ccb355bdcd08fa6a283cf","infoHashBuffer":{"type":"Buffer","data":[116,243,206,149,185,168,57,250,68,28,203,53,91,220,208,143,166,162,131,207]},"announce":[],"urlList":[]}}