{"title":"Mary Higgins Clark-The Melody Lingers On","uid":15427641,"size":203158317,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75112de3a24ad4a857d1b3fa71d0a320467a557c&amp;dn=Mary+Higgins+Clark-The+Melody+Lingers+On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"twocows","files":9,"time":1469684423,"description":"\nFrom #1 New York Times bestselling &quot;Queen of Suspense&quot; comes a thrilling novel about missing billions, a disgraced financier, and those determined to learn the truth at any cost...\r\nAs the sole assistant to a famous upscale interior designer, Lane Harmon, mother to five-year-old Katie, is accustomed to visiting opulent homes around the tri-state area. A born optimist, Lane finds the glimpse into these gilded worlds fascinating, and loves the reward of exceeding the expectations of their often-demanding owners. When she is called to assist in redecorating a modest townhouse in Bergen County, she knows the job is unusual. Then she learns the home belongs to the wife of a notorious and disgraced financier named Parker Bennett.\r\n\r\nParker Bennett has been missing for two years. He dropped out of sight just before it was discovered that the $5 billion dollars in the fund he had been managing had vanished. Bennett had gone out on his sailboat in the Caribbean. Was it suicide or had he staged his disappearance? The scandal around his name has not died down. His clients and the federal government all want to trace the money and find Bennett if he is still alive","torrent":{"xt":"urn:btih:75112de3a24ad4a857d1b3fa71d0a320467a557c","amp;dn":"Mary+Higgins+Clark-The+Melody+Lingers+On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75112de3a24ad4a857d1b3fa71d0a320467a557c","infoHashBuffer":{"type":"Buffer","data":[117,17,45,227,162,74,212,168,87,209,179,250,113,208,163,32,70,122,85,124]},"announce":[],"urlList":[]}}