{"title":"Insecure in Love (2014).pdf Gooner","uid":13239675,"size":3109334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7524f4146b5e62c438d63af0a6a42da2de805712&amp;dn=Insecure+in+Love+%282014%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1453042151,"description":"Insecure in Love - How Anxious Attachment Can Make You Feel Jealous, Needy and Worried and What You Can Do About It (2014).pdf Gooner\r\n\r\nPublisher: New Harbinger Publications (June 1, 2014)\r\nLanguage: English\r\nISBN-10: 1608828158\r\nISBN-13: 978-1608828159\r\n\r\nHas your romantic partner called you clingy, insecure, desperate, or jealous? No one wants to admit that they possess these qualities; but if you find yourself constantly on the alert, anxious, or worried when it comes to your significant other, you may suffer from anxious attachment, a fear of abandonment that is often rooted in early childhood experiences.\r\n\r\nIn Insecure in Love, you'll learn how to overcome attachment anxiety using compassionate self-awareness, a technique that can help you recognize your negative thoughts or unhealthy behavior patterns and respond to them in a nurturing way—rather than beating yourself up. You’ll also learn how insecurity can negatively affect healthy dialog between you and your partner (or potential partners) and develop the skills needed to stop you from reverting back to old patterns of neediness and possessiveness.\r\nIf you suffer from anxious attachment, you probably know that you need to change, and yet you have remained stuck. With compassionate self-awareness, you can successfully explore old anxiety-perpetuating perceptions and habits without being overwhelmed or paralyzed by them. By understanding the psychological factors at the root of your attachment anxiety, you will learn to cultivate secure, healthy relationships to last a lifetime.\r\nIf you’re ready to stop getting stuck in the same hurtful relationship patterns and finally break the cycle of heartache, this book can show you how to get the love you deserve—and keep it!","torrent":{"xt":"urn:btih:7524f4146b5e62c438d63af0a6a42da2de805712","amp;dn":"Insecure+in+Love+%282014%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7524f4146b5e62c438d63af0a6a42da2de805712","infoHashBuffer":{"type":"Buffer","data":[117,36,244,20,107,94,98,196,56,214,58,240,166,164,45,162,222,128,87,18]},"announce":[],"urlList":[]}}