{"title":"THE POWER PUFF GIRLS [COMPLETE][VERIFIED-VIDZ]","uid":7979670,"size":2224807936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:756cead11e16629c6c3a671918410730c7fd6721&amp;dn=THE+POWER+PUFF+GIRLS+%5BCOMPLETE%5D%5BVERIFIED-VIDZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"mike3313","files":-1,"time":1357136393,"description":"THE POWER PUFF GIRLS [SEASONS 1-6]\nSEED AND COMMENT\nIF YOU HAVE A REQUEST LET ME KNOW AND ILL TRY!!\n\nThe Powerpuff Girls is an American animated television series created by animator Craig McCracken and produced by Hanna-Barbera (later Cartoon Network Studios) for Cartoon Network. The show centers on Blossom, Bubbles, and Buttercup, three kindergarten-aged girls with superpowers, as well as their &quot;father&quot;, the brainy scientist Professor Utonium, who all live in the fictional city of Townsville, USA. The girls are frequently called upon by the town's childlike mayor to help fight nearby criminals using their powers.\n\nMcCracken originally developed the show in 1992 as a cartoon short entitled Whoopass Stew! while in his second year at CalArts. Following a name change, Cartoon Network featured the first Powerpuff Girls pilots in its animation showcase program World Premiere Toons in 1995 and 1996. The series made its official debut as a Cartoon Cartoon on November 18, 1998, with the final episode airing on March 25, 2005. A total of 78 episodes were aired in addition to two shorts, a Christmas special, a feature film, and a tenth anniversary special. Additionally, the series has been nominated for six Emmy Awards, nine Annie Awards, and a Kids' Choice Award during its run. Spin-off media include an anime, three CD soundtracks, a home video collection, and a series of video games, as well as various licensed merchandise.","torrent":{"xt":"urn:btih:756cead11e16629c6c3a671918410730c7fd6721","amp;dn":"THE+POWER+PUFF+GIRLS+%5BCOMPLETE%5D%5BVERIFIED-VIDZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"756cead11e16629c6c3a671918410730c7fd6721","infoHashBuffer":{"type":"Buffer","data":[117,108,234,209,30,22,98,156,108,58,103,25,24,65,7,48,199,253,103,33]},"announce":[],"urlList":[]}}