{"title":"P.S I Love You - Cecelia Ahern.epub","uid":7485501,"size":464050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76399df2a3ce4674c4f5813c3a7c8652032a319c&amp;dn=P.S+I+Love+You+-+Cecelia+Ahern.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"princerajgor","files":1,"time":1343574790,"description":"Author: Cecelia Ahern\n\nName of Book: P.S. I Love You \n\nFormat: Epub\n\nSize: 453 Kb\n\n\n\n\nPlot:\n\n A young widow discovers that her late husband has left her 10 messages intended to help ease her pain and start a new life.\n\n A grieving widow finds her husband's warmth radiating from the afterlife when she discovers that he left her a series of tasks to be revealed in ten monthly messages and designed to help her overcome her sorrow while gradually making the transition into a new life. Holly Kennedy (Hilary Swank) is a New York real estate broker whose good-humored husband, Irishman Gerry (Gerard Butler), always stood by her side. Suddenly, and seemingly out of nowhere, Gerry succumbs to a brain tumor and Holly is left to face an uncertain future. No one in the world knows Holly better than Gerry, not even her mother (Kathy Bates) or her best friends, Sharon (Gina Gershon) and Denise (Lisa Kudrow). But while Holly remains unsure if she can go on without the love of her life to help guide her, Gerry has planned ahead. On Holly's 30th birthday, she receives a cake and a special tape recording from Gerry that implores her to get out and celebrate instead of staying in and mourning. Later, as the months wear on, a series of additional messages arrive from Gerry -- always delivered in the most remarkable and surprising of ways. With each new message comes a new adventure, and each letter signs off in the same familiar way: &quot;P.S. I love you.&quot; Despite the fact that Holly's mother and friends think these humorous, posthumous messages are keeping Holly bound to the past, the truth is that they are lovingly guiding her into the future while proving that sometimes death isn't just the end, but a new beginning as well. Director Richard LaGravenese teams with screenwriter Steve Rogers to adapt author Cecelia Ahern's best-selling novel. \n\n Thank you Author for Amazing BOOK :)","torrent":{"xt":"urn:btih:76399df2a3ce4674c4f5813c3a7c8652032a319c","amp;dn":"P.S+I+Love+You+-+Cecelia+Ahern.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76399df2a3ce4674c4f5813c3a7c8652032a319c","infoHashBuffer":{"type":"Buffer","data":[118,57,157,242,163,206,70,116,196,245,129,60,58,124,134,82,3,42,49,156]},"announce":[],"urlList":[]}}