{"title":"Dick Sundevall - Peter Ratz - 2010 - Daisy","uid":6789024,"size":217721131,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:766f4e943e3506ed7f9c1aac76b320d521d08c16&amp;dn=Dick+Sundevall+-+Peter+Ratz+-+2010+-+Daisy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Gasoler","files":-1,"time":1320199737,"description":"Sveriges mest framgangsrike infiltrator berattar om sin tid inuti Hells Angels, Bandidos och Brodrarskapet MC. Med nytt slutord.\n\nInfiltratorer avslojas och mordas.\n\nEller forsvinner sparlost.\n\nMen Peter Ratz dog inte.\n\nHan overlever i nio ar pa insidan av gangen.\n\nNar han avslojas gar han under jorden\n\noch forsoker starta ett nytt liv med sin familj.\n\nDa borjar de verkliga problemen for honom.\n\nOch for den svenska rattvisan.\n\nPeter Ratz varvas 1995 och stiger snabbt i graderna: Sergeant at Arms i Bandidos, ansvarig for sakerhet och vapen, inblandad i knarkaffarer, vapen- och manniskohandel. Som livvakt at Hells Angels president blir han skjuten i benet. Allt med svensk polis goda minne. Peter Ratz information leder till over hundra fallande domar. Men ar 2004 forandras allt i ett slag nar hans tackmantel avslojas.\n-- Eskilstunapolisen lackte till en journalist, sager han.\nDarmed blir han \\&quot;levande dod\\&quot;. Han kan aldrig mer atervanda till Sverige. Hans lille son vet inte att hans foraldrar ar svenskar, vet inte ens vad dom egentligen heter. Det ar som taget ur en thriller. Men vartenda ord ar sant. Sa har ser verklighetens kamp mot den svenska maffian ut. Med minst tva kontrakt pa sitt huvud gommer han sig nagonstans i varlden. Det har ar Peter Ratz historia.\n\nFlerfaldigt prisbelonade journalisten Dick Sundevall fortsatter att grava i polisens arbete med infiltratorer. Verksamheten ar popular bland hoga polischefer, da den framstar som billig och effektiv. Men priset ar hogt, raknat i manniskoliv och rattssakerhet. Infiltratorer utsatts fran dag ett for livsfara. Polisens uppgift ar den motsatta - att skydda landets medborgare.\n\nSveriges mest framgangsrike infiltrator berattar om sin tid inuti gangen. \n\n\n\nUpplasare: Hans Sandquist","torrent":{"xt":"urn:btih:766f4e943e3506ed7f9c1aac76b320d521d08c16","amp;dn":"Dick+Sundevall+-+Peter+Ratz+-+2010+-+Daisy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"766f4e943e3506ed7f9c1aac76b320d521d08c16","infoHashBuffer":{"type":"Buffer","data":[118,111,78,148,62,53,6,237,127,156,26,172,118,179,32,213,33,208,140,22]},"announce":[],"urlList":[]}}