{"title":"Sodom - Sacred Warpath [EP] (2014)","uid":11587212,"size":40332011,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:76fb4c8b7e39f1b786b987e5859255cf13d3d94f&amp;dn=Sodom+-+Sacred+Warpath+%5BEP%5D+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"analogkid6103","files":4,"time":1417187246,"description":"\nSo decreed by Tom Angelripper of SODOM. While some may seek to dissect and even scrutinize this statement as farce, those who have been following this act throughout their decades-long history will agree Angelripper's in earnest. For a band making its name off of death metal and once churning out songs called &quot;Volcanic Slut&quot; and &quot;Witching Metal&quot; plus having its cover art banned for a gratuitous orgy scene (including bestiality), SODOM is at-heart, a protest band. By now it's hardly a secret.\n\nTargeting their venom against war, politics and hate mongers, the trio issues &quot;Sacred Warpath&quot;, a four-track EP including one new cut and three live tracks. &quot;Sacred Warpath&quot; was intended for SODOM's upcoming full-length, but Tom Angelripper and the band decided to issue it alone with cover art Angelripper did back in the Eighties for a demo, now given an oil paint upgrade by Christian Emmel.\n\nThus the intent of &quot;Sacred Warpath&quot; is to go old school, much as SODOM did with the rebranded overhaul &quot;The Final Sign of Evil&quot; album and its successor, &quot;In War and Pieces&quot;. The good news for SODOM fans is that &quot;Sacred Warpath&quot; is a hell of a song and well-worth the grab.\n\nThe 5:47 track sounds like KREATOR and SLAYER and, of course, SODOM themselves. &quot;Sacred Warpath&quot; seldom hits thrash speed, but from the scorching intro yell of Tom Angelripper to the steady, banging clout from Markus &quot;Makka&quot; Freiwald, the dirty choke of the song feels cooked upon the same embers as &quot;Persecution Mania&quot;, but with more of the explorative progressions of &quot;Agent Orange&quot;. All while keeping an intentionally raw feel and sicko screeches from Angelripper tapped out of the &quot;Obsessed by Cruelty&quot; days. When SODOM accelerates the tempo on the choruses, Angelripper hits an undeniable impression of Tom Araya. Bernd &quot;Bernemann&quot; Kost, who has been doing this band honor since the mid-Nineties, is a one-man clean-up crew as his tight riffs and superb guitar solo keep the song's ire from exploding.\n\nThere's so much going on in this song you'll want to back it up a few times before letting the live tracks &quot;The Saw is the Law&quot;, &quot;City of God&quot; and &quot;Stigmatized&quot; roll out. This is no longer a Tom Angelripper who wants to masturbate so hard as to kill himself, but that vicious, sinewy slaver from long ago makes its return here and &quot;Sacred Warpath&quot; is a monster cut. Lick your chops, fans. If this is any indication of what's coming next from SODOM, it could get deadly. The vinyl edition is limited to a thousand copies. Snag it while you can.\n\nAuthor: Ray Van Horn, Jr.\nCode\nCurrent Line-up:\n\n\n   - Tom Angelripper: Bass, Vocals\n\n   - Bernemann: Guitars\n\n   - Makka: Drums\n\n\n   1. Sacred Warpath (05:45)\n\n   2. The Saw Is the Law (Live) (04:55)\n\n   3. City of God (Live) (02:48)\n\n   4. Stigmatized (Live) 05:35)\n\nDigital Download VBR256, properly tagged (iTunes ready) + 700x700 HQ album cover attached to mp3 files.\nGenre:\tThrash\nBitrate:\tVbr\nSize:\t38.46 MB\nShow/Hide Files: \t\n4 files","torrent":{"xt":"urn:btih:76fb4c8b7e39f1b786b987e5859255cf13d3d94f","amp;dn":"Sodom+-+Sacred+Warpath+%5BEP%5D+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76fb4c8b7e39f1b786b987e5859255cf13d3d94f","infoHashBuffer":{"type":"Buffer","data":[118,251,76,139,126,57,241,183,134,185,135,229,133,146,85,207,19,211,217,79]},"announce":[],"urlList":[]}}