{"title":"The Dead Sea Scrolls Bible (Abegg, Flint &amp; Ulrich, trans.)","uid":9378969,"size":1700274,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77ff3e580c005d571584ee25ac49752029d3a73f&amp;dn=The+Dead+Sea+Scrolls+Bible+%28Abegg%2C+Flint+%26amp%3B+Ulrich%2C+trans.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1387679670,"description":"\nThe Dead Sea Scrolls Bible: The Oldest Known Bible Translated for the First Time into English (HarperCollins, 1999).  Translated with commentary by Martin G. Abegg, Jr., Peter Flint, and Eugene Ulrich.\n\nISBN: 9780060600648 | 672 pages | EPUB\n\n\nTHE DEAD SEA SCROLLS BIBLE is the first full English translation of the Hebrew scriptures used by the Essene sect at Qumran.  It includes the biblical manuscripts, including many new Psalms, Apocryphal books, and previously unknown readings of Deuteronomy and Isaiah (which appear to have been among the most important books of the Bible to this group of Essenes).  The translation of each book is preceded by an introduction that describes the text's importance to the Essenes, their distinctive interpretations of the text, and suggestions of how historical and political events may have shaped these interpretations. \n\nTranslators Martin Abegg Jr., Peter Flint, and Eugene Ulrich have loaded this volume with scholarly notes and commentary, but their interpretations are formatted in a way that does not impede the general reader's enjoyment of the book.  The Dead Sea Scrolls Bible breathes new life into scripture by delving into the earliest source material yet discovered.  It is a crucial work to reckon with for anyone interested in Jewish life around the time of Jesus.\n\n\nReviews\n\n&quot;Here is a book we will soon wonder how we did without.  Bible scholars will find it essential; students will find it stimulating and exciting; anyone interested in the beginnings of Judaism and Christianity will find it fascinating.  This is a book many have been awaiting since the Dead Sea Scrolls were first discovered half a century ago.&quot; -- N. T. Wright, author of The Meaning of Jesus\n\n&quot;A welcome and exciting work. Now readers have a chance to get closer to the original words of the Bible. Read this book with a Bible alongside it, and you'll get a sense of how intriguing, instructive, and revealing it can be to explore the Bible in its earliest form.&quot; -- Richard Elliot Friedman, author of Who Wrote the Bible\n\n&quot;The biblical Dead Sea Scrolls have revolutionized our understanding of the Jewish scriptures, their origin, formation and role. Yet they remain largely ignored by the wider public that has devoured book after book on the non-biblical texts. Scholars, too, will find this volume invaluable. I have long wished for a resource such as this.&quot; -- Philip R. Davies, Professor of Biblical Studies, University of Sheffield\n","torrent":{"xt":"urn:btih:77ff3e580c005d571584ee25ac49752029d3a73f","amp;dn":"The+Dead+Sea+Scrolls+Bible+%28Abegg%2C+Flint+%26amp%3B+Ulrich%2C+trans.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77ff3e580c005d571584ee25ac49752029d3a73f","infoHashBuffer":{"type":"Buffer","data":[119,255,62,88,12,0,93,87,21,132,238,37,172,73,117,32,41,211,167,63]},"announce":[],"urlList":[]}}