{"title":"Dialogues Concerning Natural Religion by David Hume","uid":8371870,"size":556590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:783d2ea866961f622a6c2cba09ee4a522bcdf0fe&amp;dn=Dialogues+Concerning+Natural+Religion+by+David+Hume&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"imarion","files":-1,"time":1365898087,"description":"David Hume, the 18th century philosopher, economist, and historian, uses a lively Socratic discussion by three characters to explore the nature of religion and God, particularly whether and how one can know that God exists.\n\nHaving been accused of heresy during his lifetime, Hume knew not to publish this book until after his death, so he bequeathed the manuscript, a few days before his death, to his printer, but if the printer didn't publish it within 2 years, the manuscript would go to Hume's nephew, also named David Hume, which it did and the nephew did publish it.\n\nOne of the oldest and most popular arguments for the existence of God is the design argument, that order and &quot;purpose&quot; in the world must be proof of a divine origin: Where one sees a watch, one may infer the existence of the watchmaker. Here Philo, Cleanthes, and Demea volley their arguments back and forth. Cleanthes advocates for the existence of God based upon observed design in the world, Philo counters that argument, and Demea represents rigid orthodoxy. The dialogues continue for a total of 12 parts, exploring many ideas such as that there may be more than one supreme God, that our universe may have been spawned without a creator from an older one as a plant procreates by spreading its seeds, and other questions about the natural world and the concept of the Deity.\n\nScholars disagree regarding which character most closely represents Hume's own voice in the dialogues, but most say that Philo speaks for Hume. The Dialogues and Hume's other philosophical writings about the nature of &quot;knowing&quot; would lead one to a conclusion that Hume was an agnostic, not an atheist.\n\nIn the introduction, as a letter from Pamphilus to Hermippus, Hume explains his choice of the dialogue as the style for this presentation: &quot;Any question of philosophy ... which is so OBSCURE and UNCERTAIN, that human reason can reach no fixed determination with regard to it; if it should be treated at all, seems to lead us naturally into the style of dialogue and conversation. Reasonable men may be allowed to differ, where no one can reasonably be positive. Opposite sentiments, even without any decision, afford an agreeable amusement; and if the subject be curious and interesting, the book carries us, in a manner, into company; and unites the two greatest and purest pleasures of human life, study and society.&quot;\n\nOpen this eBook and you will find yourself in Cleanthes' library alongside Pamphilus, the pupil of Cleanthes, as he silently audits these dialogues concerning natural religion among Cleanthes, the precise philosopher, Philo, the sceptic, and Demea, the inflexibly orthodox believer.\n\nImages of the actual hand-written manuscript and editorial notes about this and all of Hume's published writings are available at the website http://www.davidhume.org/.\n\n(Sources: Wikipedia and www.davidhume.org, which is a website created and maintained by Amyas Merivale, University of Leeds, and Peter Millican, Hertford College, University of Oxford.) ","torrent":{"xt":"urn:btih:783d2ea866961f622a6c2cba09ee4a522bcdf0fe","amp;dn":"Dialogues+Concerning+Natural+Religion+by+David+Hume","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"783d2ea866961f622a6c2cba09ee4a522bcdf0fe","infoHashBuffer":{"type":"Buffer","data":[120,61,46,168,102,150,31,98,42,108,44,186,9,238,74,82,43,205,240,254]},"announce":[],"urlList":[]}}