{"title":"Veronika Decides to Die - Paulo Coelho","uid":8828828,"size":445869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78418254c195ab0cee8e09cedbbcd5889e6be844&amp;dn=Veronika+Decides+to+Die+-+Paulo+Coelho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"vermajai","files":1,"time":1376912223,"description":"This is a corrected version of a pdf file I found online. It is the full version of the book that contains all the chapters and pages. I have corrected it to make it viewable in apps like Google play books, Amazon Kindle, etc. It should work in all the ebook reader apps.\n\nTo read this book in Google play book app simply visit play store on your windows then upload this file manually and you done!\n\nPlease seed this torrent as much as you can! Cheers!\n\n\n\n\n\nBook Description\n\nTwenty-four-year-old Veronika seems to have everything -- youth and beauty, boyfriends and a loving family, a fulfilling job. But something is missing in her life. So, one cold November morning, she takes a handful of sleeping pills expecting never to wake up. But she does -- at a mental hospital where she is told that she has only days to live.\nInspired by events in Coelho's own life, Veronika Decides to Die questions the meaning of madness and celebrates individuals who do not fit into patterns society considers to be normal. Bold and illuminating, it is a dazzling portrait of a young woman at the crossroads of despair and liberation, and a poetic, exuberant appreciation of each day as a renewed opportunity.\n\nAbout the Author\nPaulo Coelho, born in Rio de Janeiro in 1947, is one of the bestselling and most influential authors in the world. The Alchemist, The Pilgrimage, The Valkyries,Brida, Veronika Decides to Die, Eleven Minutes, The Zahir, The Witch of Portobello, and The Winner Stands Alone, among others, have sold 115 million copies in more than 160 countries.\n\nAdditional information\nBest for- Web, Tablet, Phone, eReader \nGenres- Fiction / Literary\nBody, Mind &amp; Spirit / General","torrent":{"xt":"urn:btih:78418254c195ab0cee8e09cedbbcd5889e6be844","amp;dn":"Veronika+Decides+to+Die+-+Paulo+Coelho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78418254c195ab0cee8e09cedbbcd5889e6be844","infoHashBuffer":{"type":"Buffer","data":[120,65,130,84,193,149,171,12,238,142,9,206,219,188,213,136,158,107,232,68]},"announce":[],"urlList":[]}}