{"title":"The PR Professional's Handbook- Black [PDF] [StormRG]","uid":10073444,"size":1906536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78b2db4f96dd86668982352f3bf10eadf3b8b721&amp;dn=The+PR+Professional%27s+Handbook-+Black+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"steelballz","files":-1,"time":1398884213,"description":"Description\nPR Professional's Handbook, The\nAuthor: Black, Caroline\nPublished:April 28 2014\nPublisher:Kogan Page\nISBN-10:0749468424\nISBN-13:9780749468422\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\n\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\n\nPublication Date: April 28 2014 | Series: PR in Practice\n\nRapid changes in technology are having a major impact on the way businesses choose to reach their audience. As a result, an increasing number of people need a better understanding of modern PR and how its principles can underpin effective business management. Keeping track of the best PR practices, as well as the new communications channels that arise can be overwhelming for professionals new to the PR function.\n\nWith practical advice and solutions, The PR Professional's Handbook is a complete introductory text that provides a full breakdown of the skills required in communications, including briefing, listening, questioning, writing, selling and presenting. Highlighting international case studies throughout the text, Black offers a fresh interpretation of the basics, combined with the latest information on technology and social media.\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:78b2db4f96dd86668982352f3bf10eadf3b8b721","amp;dn":"The+PR+Professional%27s+Handbook-+Black+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b2db4f96dd86668982352f3bf10eadf3b8b721","infoHashBuffer":{"type":"Buffer","data":[120,178,219,79,150,221,134,102,137,130,53,47,59,241,14,173,243,184,183,33]},"announce":[],"urlList":[]}}