{"title":"Microsoft Pinball Arcade","uid":3267695,"size":33884863,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:78bde56847b4874612b27d33ef844c60dd1f0d56&amp;dn=Microsoft+Pinball+Arcade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"fcjr","files":5,"time":1103679513,"description":"\nMicrosoft Pinball is a collection of seven licensed tables that represent the \nevolution of pinball in America. A state of the art physics model and realistic \ngraphics make for the most authentic pinball simulation on the PC ever.\n\nThe appeal of pinball is universal, it pits man against nature in a stroggle to \nkeep a solid stell ball from rolling downhill towards the inevitable. Now, for \nthe first time ever, you can trace the evolution of a pinball by playing seven \nof your all-time favorite pinball tables on your PC. The widest variety of \ntables, realistic ball physics, and add up to wickedly fast action for currect \nand prospective pinball\nwizards.\n\nFeatures:\n\n* Seven real tables. Features seven real tables licensed by Gottlieb and exactly \n  replicated like the original arcade version.\n\n* Superb physics model. Stellar flipper, bumper, ramps, ball and tilt physics \n  give players the sensation they are playing the real tables. Ball reacts to \n  envorionment with absolute precision.\n\n* Superior graphics. Perfectly rendered and beautifully modeled tables look like \n  real photographic images. Table design is seamless.\n\n* Real arcade look and fell. The tables are exactly replicated from the original \n  arcade classics. Feel slike real arcade pinball, without plugging quarter after \n  quarter! Full table view increases the arcade ambiance. So authentic that a \n  supple wrist or table nudge can boost your score.\n\n* Complete evolution of the pinball classics. Tables represent the evolution of \n  pinball through the 20th Centuty. Tables for each decade portray the different \n  milestones in pinball history.\n\n\nINSTALL NOTES:\n===============\nRun SETUP.EXE to install.\nThe Intro AVI (6MB) of a rolling ball and a bunch of Demos from the CD were ripped.\nEverything else is here.","torrent":{"xt":"urn:btih:78bde56847b4874612b27d33ef844c60dd1f0d56","amp;dn":"Microsoft+Pinball+Arcade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78bde56847b4874612b27d33ef844c60dd1f0d56","infoHashBuffer":{"type":"Buffer","data":[120,189,229,104,71,180,135,70,18,178,125,51,239,132,76,96,221,31,13,86]},"announce":[],"urlList":[]}}