{"title":"Duke Nukem Forever *2011* [ENG] [ISO] [SKIDROW] [FULL]","uid":6472254,"size":4479141671,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:78c0387f1371210825ba748947ea0ab9a4c21af6&amp;dn=Duke+Nukem+Forever+%2A2011%2A+%5BENG%5D+%5BISO%5D+%5BSKIDROW%5D+%5BFULL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"miguel1983","files":-1,"time":1308181667,"description":" &lt;a href=&quot;http://img843.imageshack.us/img843/117/dukenukemforevercoverpo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img843.imageshack.us/img843/117/dukenukemforevercoverpo.jpg&lt;/a&gt;\n\nManufacturer: Gearbox Software\nPublisher: Take 2 Interactive\nGenre: Action (FPS)\nRelease Date: June 10, 2011\n\nDescription:\nDuke Nukem Forever is another action game with FPS Duke Nukem series, developed by Gearbox Software (previously worked on a game studio 3D Realms). The essential principle of the game have not been much change - we still have to deal with first person shooting, based primarily on the rapid and spectacular eliminating aliens.\nAmong strangers appear in both &quot;old friends&quot; (eg pigs in uniforms and Octabrainy) and entirely new foes. The Duke Nukem Forever is also no shortage of powerful bosses. Fight with them, however, were varied in comparison to the original, which is reflected inter alia in the spectacular scenes of powerful opponents knocking. Along the way we visit various locations, from cities, through canyons, desert, but also in industrial areas. Some sites overcome on their own feet, and sometimes we use different vehicles. There were also the sequence in which using weapons of massive fixed we repel the attacks of enemies.\nThis time, instead of the traditional life of the Duke was equipped with a pointer ego. It works the same way as life, or fall to zero results in death, but this solution fits perfectly into our hero. Tough likes of Duke does not get injuries, opponents are able only to hurt his pride. As with most of today's shootings, the ego is regenerated automatically, in the intervals between battles.\nAmong the arsenal of what goes into the hands of the prince, there were a few new weapons. So we have pistols, rifles and machine guns, and also known from the first part of fighting gloves that discharge missiles (Devastator), &quot;pomniejszacz&quot; enemies (Shrink Ray) and remotely detonated explosives (Pipe Bombs). Among the new tools for destruction was a sniper rifle, which allows for very effective fight for greater distance. As befits a Duke, a weapon that has a tremendous firepower. Exploding body shot headshots breaking limbs and head with necks, in this case the norm.\nAs in the first part of 1996, much attention was paid to interaction with the environment. These days, breaking the walls, smashing windows and mirrors no longer a rarity. Few, however, that the hero can draw something on the whiteboard marker or use the urinal.\nDevelopers definitely want to get a similar climate as the one for which fans will love the Duke several years ago. So we have a lot of boorish humor, and lyrics dripping with testosterone prince. Invariably, the primary goal of our hero's crusade is to provide help sexy the representatives of the fair sex, which, moreover, when we encounter quite a bit of adventure. Our hero is also much more talkative than in the first game. Duke sensational voice speaks again Jon St. John, known for Duke Nukem 3D.\n\nRequirements:\nCore 2 Duo 2.4 GHz,\n2 GB RAM (4 GB RAM - Vista / 7)\n512 MB graphics card (GeForce 8800 GTS or better)\n10 GB HDD,\nWindows XP/Vista/7\n\nInstallation:\n1st Mount the disk image program Daemon Tools\n2nd Install\n3rd Copy all files from the SKIDROW folder is the game installation\n4th Play\n5th Support the companies, Which software do you enjoy Actually\n6th Bonus Duke Nukem Forever 2011 CrackOnly SKIDROW.rar\n7th Bonus DKF Multiplayer.rar\n\nScreen: &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/4308/image74bf4de95db2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/4308/image74bf4de95db2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img710.imageshack.us/img710/7992/imageae224df1e2b4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img710.imageshack.us/img710/7992/imageae224df1e2b4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img863.imageshack.us/img863/7154/image5e504de95db2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img863.imageshack.us/img863/7154/image5e504de95db2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img845.imageshack.us/img845/8093/image21ea4de95ce3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img845.imageshack.us/img845/8093/image21ea4de95ce3.jpg&lt;/a&gt;\n\nAvira AntiVir scan 100% clean : &lt;a href=&quot;\nhttp://img191.imageshack.us/img191/2619/dukenukemforever2011sca.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img191.imageshack.us/img191/2619/dukenukemforever2011sca.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:78c0387f1371210825ba748947ea0ab9a4c21af6","amp;dn":"Duke+Nukem+Forever+%2A2011%2A+%5BENG%5D+%5BISO%5D+%5BSKIDROW%5D+%5BFULL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c0387f1371210825ba748947ea0ab9a4c21af6","infoHashBuffer":{"type":"Buffer","data":[120,192,56,127,19,113,33,8,37,186,116,137,71,234,10,185,164,194,26,246]},"announce":[],"urlList":[]}}