{"title":"Cauldron of Ghosts (Crown... #3) (ARC) (2014) David Weber (multi","uid":9549179,"size":3397997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78ca5bc5fe306917a0c33730f3faa4967876bc3c&amp;dn=Cauldron+of+Ghosts+%28Crown...+%233%29+%28ARC%29+%282014%29+David+Weber+%28multi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"7","files":-1,"time":1391202988,"description":"Cauldron of Ghosts (Crown of Slaves #3) (ARC) by David Weber and Eric Flint\n\n\nFormat: mobi/epub/azw3\nLength: 448 pages\nGenre: Sci-Fi\nDate: 1 April 2014 (ARC)*\n\nThe Mesan Alignment: a centuries-old cabal that seeks to impose its vision of a society dominated by genetic rank onto the human race. Now the conspiracy stands exposed by spies Anton Zilwicki and Victor Cachat--one an agent of Honor Harrington's Star Kingdom of Manticore, the other a Havenite operative. The outing of the Alignment has turned the galaxy?s political framework topsy-turvy. Old coalitions have disintegrated. New alliances have been born.\n\nFor starters, the long and hard-fought war between the Republic of Haven and the Star Empire of Manticore is not only over, but these bitter enemies have formed a new pact. Their common foe: the Mesan Alignment itself.\n\nBut more information is needed to bring the Alignment out of the shadows. Now, defying the odds and relying on genetic wizardry themselves for a disguise, Zilwicki and Cachat return to Mesa--only to discover that even they have underestimated the Alignment's ruthlessness and savagery.\n\nAuthor:\n\nWith over seven million copies of his books in print and seventeen titles on the New York Times bestseller list, David Weber is a science fiction publishing phenomenon. In the hugely-popular Honor Harrington series, the spirit of C.S. Forester's Horatio Hornblower and Patrick O'Brian's Master and Commander lives on--into the galactic future. Eric Flint is a modern master of alternate history fiction, with over three million books in print. He's the author/creator of the New York Times best-selling Ring of Fire series.\n","torrent":{"xt":"urn:btih:78ca5bc5fe306917a0c33730f3faa4967876bc3c","amp;dn":"Cauldron+of+Ghosts+%28Crown...+%233%29+%28ARC%29+%282014%29+David+Weber+%28multi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ca5bc5fe306917a0c33730f3faa4967876bc3c","infoHashBuffer":{"type":"Buffer","data":[120,202,91,197,254,48,105,23,160,195,55,48,243,250,164,150,120,118,188,60]},"announce":[],"urlList":[]}}