{"title":"AM, Shawn Lee - La Musique Numerique (2013) [FLAC]","uid":8554056,"size":292736630,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79c7981f7f281e5f1ba01bca1463e14e1ced2473&amp;dn=AM%2C+Shawn+Lee+-+La+Musique+Numerique+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1370718204,"description":"\n  AM, Shawn Lee - La Musique Numerique (2013) [FLAC]\n\n  Released: 2013\n  Duration: 42:51\n  Genre: Pop/Rock\n  Style: Alternative, Indie Electronic, Singer/Songwriter\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Two Times\n  02 All the Love\n  03 Good Blood\n  04 Suffer Like Me\n  05 Replay\n  06 In the Aftermath\n  07 Automatic\n  08 Special Disco\n  09 Iron Leaf\n  10 Louna\n  11 Come Back To Me\n  12 Steppin' Out\n\n  The follow-up to AM &amp; Shawn Lee's superb 2011 debut, Celestial Electric, 2013's La Musique Numerique features more of the band's dance-oriented mix of electronic and organic pop music. Lee, a longtime electronic and percussion experimentalist, and AM, a singer/songwriter in the classic soft pop tradition of Paul Williams, are an unlikely duo. However, as Celestial Electric proved, the pairing works, and together they have a knack for crafting evocative mini-masterpieces that benefit from their combined divergent skills and eclectic musical tastes. Whereas last time they focused on a vintage psychedelic aesthetic that touched upon Brazilian Tropicalia, '70s soft rock, and '60s sunshine pop, here they delve into an analog synth sound that touches upon disco, new wave, post-punk, and dub reggae. While that means more of an angular, somewhat robotic approach than the organic vibe of Celestial Electric, there are still plenty of catchy, melodic hooks here. \n\n  In many ways, the album brings to mind the Moog synthesizer sounds of such early electronic innovators as Giorgio Moroder, Laurie Spiegel, and Kraftwerk, as well as the work of such contemporary and similarly synth-centric bands like Air and Phoenix. Sticking with the group's tradition of covering at least one pop song by another artist (last time it was Ozark Mountain Daredevils' 1974 hit &quot;Jackie Blue&quot;), here, AM &amp; Shawn Lee deliver an inspired reworking of Joe Jackson's 1982 classic &quot;Steppin' Out&quot; -- which is impressive, considering the original was an innovative example of early electronic programming in its own right. Elsewhere, tracks like &quot;Two Times,&quot; &quot;Good Blood,&quot; and &quot;Suffer Like Me&quot; are lightly funky, dance-club ready numbers with enough pixilated LED light atmosphere to seep deep into your brain if they don't find you on the dancefloor. While AM &amp; Shawn Lee are clearly taking inspiration from past musical styles, La Musique Numerique never feels anything but fresh.","torrent":{"xt":"urn:btih:79c7981f7f281e5f1ba01bca1463e14e1ced2473","amp;dn":"AM%2C+Shawn+Lee+-+La+Musique+Numerique+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c7981f7f281e5f1ba01bca1463e14e1ced2473","infoHashBuffer":{"type":"Buffer","data":[121,199,152,31,127,40,30,95,27,160,27,202,20,99,225,78,28,237,36,115]},"announce":[],"urlList":[]}}