{"title":"Aqua Teen Hunger Force: Season 2","uid":5161042,"size":2212216832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b64d29b2a5d78c27eabd293f56be490c39d43fa&amp;dn=Aqua+Teen+Hunger+Force%3A+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Beta_Tron","files":-1,"time":1258146636,"description":"----------------\nFor Season 3: &lt;a href=&quot; http://thepiratebay.se/torrent/5164388/Aqua_Teen_Hunger_Force__Season_3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5164388/Aqua_Teen_Hunger_Force__Season_3&lt;/a&gt;\n----------------\n\nAqua Teen Hunger Force: Season 2:\n\n1. Super Birthday Snake [19]\n\nFirst aired: 5/25/2003\n\nMeatwad asks for a bunny for his birthday but Master Shake gets him the wrong gift... a snake! Frylock accidentally kills Meatwad and Master Shake in the process. Free from his friends, Frylock takes up a life of crime and sex.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\n\n2. Super Hero [20]\n\nFirst aired: 6/1/2003\n\nMaster Shake decides to become a new superhero named &quot;The Drizzle.&quot; In his attempt to become better, he douses himself with toxic waste, hands out cell phones, gets a new costume and does everything in his power to establish himself.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\n\n3. Super Bowl [21]\n\nFirst aired: 6/8/2003\n\nAfter Meatwad finds two Super Bowl tickets inside a bag of chips, everyone guns to be Meatwad's friend in order to get that second ticket. Soon,t he contest goes to Meatwad's head and he presures Carl and Shake for more.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\n\n4. Super Computer [22]\n\nFirst aired: 6/15/2003\n\nFrylock invents a new, ridiculously advanced super computer but Shake's incompetence sends it careening into Carl's house. Frylock builds another one but the advanced technologies involved accidentally send the machine back in time!\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Err), Chris Ward (IV) (Commercial Kid) , Jon Glaser (Oog)\n\n5. Super Model [23]\n\nFirst aired: 6/22/2003\n\nMaster Shake comes back from a trip from Guatemala with a new nose that he had put on by a cheap plastic surgeon, which is really just two coconut halves painted on his face to look like a nose. With his newfound &quot;beauty,&quot; Shake sets out to make himself the best damn looking person in the world.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: John Brestan\n\n6. Super Spore [24]\n\nFirst aired: 6/29/2003\n\nWhile The Aqua Teens are chilling in Carl's Pool one day, an alien tentacle reaches out and grabs Shake. The alien uses Shake as his method to speak with the others. The problem is, the alien only speak Japaneses. The alien is also not housebroken. Frylock takes it upon himself to civilize this new comer from space.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Brooks Braselman (Travis of The Cosmos)\n\n7. Super Sirloin [25]\n\nFirst aired: 8/31/2003\n\nMeatwad won't turn off his new album &quot;For The Shorties&quot; by Sir Loin. He goes on a hunger strike &quot;for the Shorties&quot; because it's in the lyrics. However, he doesn't stop there. Soon he ravages all the food in the house for Sir Loin and his hunger drive. But something is oddly familiar here.\n\nWriter: Dave Willis, Matt Maiellaro\nDirector: Ned Hastings\nGuest star: Chris Ward (IV) (Sir Loin)\n\n8. Super Squatter[26]\n\nFirst aired: 9/7/2003\n\nWhen Shake forgets (or decides not) to pay all the bills, all the utilities and accessories get cut off. Instead of paying the bills himself, Frylock decides to teach Shake a lesson and leaves the house with any type of utility. Shake simply takes refuge in Carl's house.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: John Brestan\n\n9. Meatzone [27]\n\nFirst aired: 9/14/2003\n\nSomehow, Meatwad develops an amazing ability to see the future upon touching someone. Shake decides to exploit him for loads of money while Frylock is out to prove its all fake.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\n\n10. Super Trivia [28]\n\nFirst aired: 9/21/2003\n\nSick of losing every week at team trivia to his arch enemy, Wayne the Brain, Frylock decides to up his game. He subjects Shake and Meatwad to his special kind of tutoring and drag Carl along for the ride.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Seth MacFarlane (Wayne &quot;The Brain&quot; McClain), Ned Hastings (Trivia Host)\n\n11. Universal Remonster [29]\n\nFirst aired: 9/28/2003\n\nEmory and Oglethorpe pay the Aqua Teens another visit, only this time they decide to steal their cable using the Fargate, and control what they're watching using the Universal Remonster.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: John Brestan\nGuest star: Andy Merrill (Oglethorpe), Mike Schatz (Emory) , Dave Willis (Education Puppet)\n\n12. Total Recarl [30]\n\nFirst aired: 10/5/2003\n\nFrylock's new invention inadvertently destroys Carl's body leaving only an infuriated head. Frylock decides to rebuild Carl's body by any means necessary which includes grave robbing and robot building.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Phil Samson\n\n13. Revenge of the Trees [31]\n\nFirst aired: 10/12/2003\n\nWith a huge vat of oil left over from his Labor Day feast, Shake creates a foul enviroment in the Aqua Teen's front lawn. With the help of Carl, the two dump the oil in the woods, but pay a hefty price in return.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Master Tree) , Nick Ingkatanuwat (Tree Stenographer), Jim Fortier (Shrub), Jay Edwards (Tree #2), Vishal Roney (Tree #1), Ned Hastings (Tree #3)\n\n14. Spirit Journey Formation Anniversary [32]\n\nFirst aired: 10/19/2003\n\nShake puts together a metal version of the &quot;Birthday&quot; song, hoping to cash in on royalties. But when Zakk Wylde comes looking for his end of the money, things go all wrong for Shake.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Geddy Lee (Singing Voice)) , Zakk Wylde (Himself), B. B. Leeland (Scorpion #1, Scorpion #2), Michael D. Hanks (Homeless Man)\n\n15. The Shaving [33]\n\nFirst aired: 10/26/2003\n\nIt's Halloween at the Aqua Teen headquarters and a monster comes down from the attic...to get his mail. Much to his chagrin, the monster is unable to scare anyone - until he reveals a gruesome secret.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\nGuest star: Tom Scharpling (&quot;Willie Nelson&quot;)\n\n16. Broodwich [34]\n\nFirst aired: 11/2/2003\n\nShake uncovers a delicious, demoniacally possessed submarine sandwich in his front yard. A voice tells him if he eats the whole thing, he will be killed. Shake must battle the Last Temptation of the Broodwich or lose his life. Well, he had a good run...\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Jon Glaser (Jerry), Isaac Hayes III (The Voice), H. Jon Benjamin (Mr. Sticks)\n\n17. Kidney Car [35]\n\nFirst aired: 11/16/2003\n\nWith his prized car destroyed, Carl is left with no choice but to donate it to the Kidney Foundation. In a bad twist of fate, the Kidney Foundation donates the car to Meatwad.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\n\n18. The Cubing [36]\n\nFirst aired: 11/23/2003\n\nThe Wisdom Cube claims to hold all the known knowledge in the universe, but it seems he only possesses a knack for tiresome anecdotes. Frylock has his doubts if this is all for real.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: John Walts\nGuest star: Jon Schnepp (The Wisdom Cube), Brian Posehn (The Real Wisdom Cube)\n\n19. Frat Aliens [37]\n\nFirst aired: 11/30/2003\n\nDP and Skeeter, fraternity brothers from outer space, get lost along the way back home and crash on earth. They quickly become unwanted and Skeeter pulls out but leaves DP behind to be handled by the Aqua Teens.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\nGuest star: Patton Oswalt (DP, Skeeter)\n\n20. The Clowning [38]\n\nFirst aired: 12/7/2003\n\nCarl gets a new head of hair and doesn't wait to show it off to the Aqua Teens. However, when the hair begins to make Carl act strangely, Frylock fears the worst. Carl's been clowned!\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Styro-Head) , Hayden Ward (Carl's Girlfriend)\n\n21. The Dressing [39]\n\nFirst aired: 12/14/2003\n\nWhile sitting down to eat their Thanksgiving dinner one week after Thanksgiving, the Aqua Teens are interrupted by a robotic turkey who is determined to save their turkey and take it back in time in the time rift.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: John Brestan\nGuest star: Matt Maiellaro (Turk-E-Tron) , Seth Green (Himself), Barry Mills (Hustlin' Tom Turkey)\n\n22. THE [40]\n\nFirst aired: 12/21/2003\n\nAfter Shake's antics finally push him too far, Frylock leaves the Aqua Teen's house. Without Frylock around to hold him back, Shake lays waste to the house and tortures Meatwad as he never has before. Carl soon feels the effects of not having Frylock around.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Phil Samson\nGuest star: Matt Maiellaro (Err) , Jay Edwards (Himself)\n\n23. The Cloning [41]\n\nFirst aired: 12/31/2003\n\nAfter breaking one too many TV's, we learn Frylock has been cloning them the entire time, and only clones one more. But the TV begins to act strangely after it's cloned one too many times.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Ned Hastings\nGuest star: Matt Maiellaro (Err), Nick Ingkatanuwat (The Muffin Man), Dave Willis (Singing Puppet), Scott Hilley (George Washington)\n\n24. The Last One [42]\n\nFirst aired: 12/31/2003\n\nSeveral of the Aqua Teens' enemies gather on the moon to plot their next move. After a long while, things don't seem to progress and all that has been managed are the deaths of half the members.\n\nWriter: Matt Maiellaro, Dave Willis\nDirector: Jay Edwards\nGuest star: Matt Maiellaro (Err, Cybernetic Ghost of Christmas Past), Mike Schatz (Emory), Chris Ward (IV) (MC Pee Pants) , Todd Field (Ol' Drippy), Jon Schnepp (The Wisdom Cube), Andy Merrill (Oglethorpe, Merle), H. Jon Benjamin (Mothmonsterman), Isaac Hayes III (The Voice (Uncredited)), David Cross (Happy Time Harry), Todd Barry (Romulox), Brooks Braselman (Travis of The Cosmos), Dave Willis (Satan), Jon Glaser (Oog), Patton Oswalt (DP/Skeeter), Jim Fortier (Tree), Scott Hilley (Flargon), Matt Harrigan (Major Shake) \n","torrent":{"xt":"urn:btih:7b64d29b2a5d78c27eabd293f56be490c39d43fa","amp;dn":"Aqua+Teen+Hunger+Force%3A+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b64d29b2a5d78c27eabd293f56be490c39d43fa","infoHashBuffer":{"type":"Buffer","data":[123,100,210,155,42,93,120,194,126,171,210,147,245,107,228,144,195,157,67,250]},"announce":[],"urlList":[]}}