{"title":"Herbie Hancock - Headhunters 1974 (Rem.1992) TQMP","uid":4297570,"size":237583886,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b82ebad429cae859e1b75dd684bc010db0b1972&amp;dn=Herbie+Hancock+-+Headhunters+1974+%28Rem.1992%29+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Breezin","files":6,"time":1216140478,"description":"Quote from amazon.com\n\nHerbie Hancock Brings On The Funk!!!, July 1, 2008 \nBy  Louie Bourland (Nashville TN via Garden Grove CA)             \n\n&quot;Since its initial release in 1973, Herbie Hancock's &quot;Head Hunters&quot; album has become a fusion jazz classic and rightfully so. Much like his former boss Miles Davis as well as R&amp;B artists like Stevie Wonder and Marvin Gaye, Herbie Hancock set out to make music that was innovative for its time and pushed the envelope of creativity. Although Herbie had been experimenting with fusing rock, funk and African rhythms with Jazz styles in previous albums like &quot;Sextant&quot; and with his former group Mwandishi, &quot;Head Hunters&quot; is where all the musical styles and experimentation fell together in all the right places. \nAt least two of the four tracks on the album have gone on to become timeless classics. The nearly 16-minute centerpiece &quot;Chameleon&quot; is probably one of Herbie's best known compositions of the '70s and features a relentless bassline that stays stuck in your head long after the piece is finished. Drummer Harvey Mason's driving funk rhythms are also a crucial element to this track. Mason's arrangement of Herbie's 1963 piece &quot;Watermelon Man&quot; has become a classic in its own right and has been sampled by numerous hip-hop and dance artists in recent years (notably the pipe intro performed by Herbie and percussionist Bill Summers). \nThe other two tracks aren't quite as popular as the previous two but are still loaded with great musical invention. &quot;Sly&quot; is a nod to soul pioneer Sly Stone but also features a killer turbo-charged middle section in which Herbie and his band improvise at a relentless pace. Reed player Bennie Maupin shines at his best here as does Herbie with his fabulous Fender Rhodes leads. \nThe closing track &quot;Vein Melter&quot; is very similar to the fusion music of Miles Davis and consists of a slow-moving vamp in which different musical phrases are played. This piece would not sound at all out of place on an album like &quot;In A Silent Way&quot; or &quot;B--ches Brew&quot;. If anything, it shows that Herbie definitely learned some great lessons from his former band leader. \n&quot;Head Hunters&quot; is not only an album that will appeal to Jazz fans, it's an album that will appeal to fans of all kinds of music. The styles on this album are an excellent blend of rock, funk and progressive elements with some great jazz-oriented improvisation. 35 years later, &quot;Head Hunters&quot; is still one of Herbie Hancock's best albums that in my opinion has yet to be surpassed. \nIf you're new to Herbie Hancock's music, this album should be your first choice. You won't be disappointed.&quot;\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;680a1a0d0d1201062804011e0d460604&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:7b82ebad429cae859e1b75dd684bc010db0b1972","amp;dn":"Herbie+Hancock+-+Headhunters+1974+%28Rem.1992%29+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b82ebad429cae859e1b75dd684bc010db0b1972","infoHashBuffer":{"type":"Buffer","data":[123,130,235,173,66,156,174,133,158,27,117,221,104,75,192,16,219,11,25,114]},"announce":[],"urlList":[]}}