{"title":"Bobcad cam v24","uid":7571528,"size":285424055,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7cac1312815ecbc3f7a8821e3236e3712d31fa3b&amp;dn=Bobcad+cam+v24&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"huck2012","files":1,"time":1346001729,"description":"BobCAD V24\n\nIn version 24, we have created an interface similar to SolidWorks â„¢ and AutoCAD â„¢, two of the most popular on the market. With our program, the user has the ability to work and coordinate layers, such as AutoCAD â„¢, with the great advantage that our CAD program also combines the ease of use of 3D design, as SolidWorks â„¢.\n\nThe program also has a number of scheduled operations to facilitate programming of mechanical parts more common and more complex. That is, we have integrated a number of automated guides, to generate functions eats, gears, cams and sequences of holes. An example would be if the user needs to generate a gear, the guide would be activated and the user only has to answer a series of questions such as the number of teeth, angle, distance between teeth and the rest of the information needed to guide gear generation and automatically creates BobCAD V24 gear.\n\nNow, if you have another CAD system, CAD parts created on another system or planes they send their customers, BobCAD offers the ability to import: IGES, DXF, DWG, CAD, SAT, 3DM (Rhino) Parasolid, SLDPRT of solidwroks , steps and STL. Not only will you be able to import these files, it also has the ability to modify them. In addition, you can import and also has the ability to export as DXF, DWG, 3DM, STEP and IGES.","torrent":{"xt":"urn:btih:7cac1312815ecbc3f7a8821e3236e3712d31fa3b","amp;dn":"Bobcad+cam+v24","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cac1312815ecbc3f7a8821e3236e3712d31fa3b","infoHashBuffer":{"type":"Buffer","data":[124,172,19,18,129,94,203,195,247,168,130,30,50,54,227,113,45,49,250,59]},"announce":[],"urlList":[]}}