{"title":"Creativity: Flow and the Psychology of Discovery and Invention","uid":8043100,"size":6553891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d717c98874d5a210309ed6cf6603f17c08f6a9a&amp;dn=Creativity%3A+Flow+and+the+Psychology+of+Discovery+and+Invention&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1358689057,"description":" Mihaly Csikszentmihalyi, &quot;Creativity: Flow and the Psychology of Discovery and Invention&quot;\n1997 | ISBN-10: 0060928204 | Djvu, EPUB | 336 pages | 6,3 MB\n\nBased on interviews with 91 internationally recognized creative people-among them Nobel physicist John Bardeen, arts administrator-performer Kitty Carlisle Hart, writer Denise Levertov, jazz musician Oscar Peterson, electronics executive Robert Galvin-this book offers a highly readable anatomy of creativity. As Csikzentmihalyi (Flow) argues, creativity requires not only unusual individuals, but a culture and field of experts that can foster and validate such work. Most creative people, the author suggests, have dialectic personalities: smart yet naive, both extroverted and introverted, etc. Expanding on his previous book, Csikszentmihalyi suggests that complex and challenging work exemplifies fully engaged &quot;flow.&quot; Synthesizing study results, he reports that none of the interviewees was popular during adolescence; while they were not necessarily more brilliant than their college peers, they displayed more &quot;concentrated attention.&quot; Later, they kept a consistent focus on future work. The author reminds us that while individuals can make their own opportunities, a supportive society offering resources and rewards can foster creativity. His advice may sound like homilies-&quot;Try to be surprised by something every day&quot;-but is often worthy.\n\n","torrent":{"xt":"urn:btih:7d717c98874d5a210309ed6cf6603f17c08f6a9a","amp;dn":"Creativity%3A+Flow+and+the+Psychology+of+Discovery+and+Invention","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d717c98874d5a210309ed6cf6603f17c08f6a9a","infoHashBuffer":{"type":"Buffer","data":[125,113,124,152,135,77,90,33,3,9,237,108,246,96,63,23,192,143,106,154]},"announce":[],"urlList":[]}}