{"title":"Fantastic Fabric Folding: Innovative Quilting Projects","uid":8245665,"size":13424747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7dc85756a3dde1766b3e66511bb0c492461d8b73&amp;dn=Fantastic+Fabric+Folding%3A+Innovative+Quilting+Projects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363053169,"description":"Rebecca Wat - Fantastic Fabric Folding: Innovative Quilting Projects\nPublished: 2000-03-15 | ISBN: 1571200851 | PDF | 96 pages | 12 MB\n\n\nEmbellish your traditional quilt with origami techniques! 22 delightful projects for quilts, vests, and pillows, with step-by-step photographs of folding instructions.\nWat had mastered techniques of origami many years before learning to quilt. She had used origami for home decorating and gift-wrapping but had never seen the connection between quilting and traditional Japanese paper folding. Then one day, she tried folding fabric instead of paper and began an exploration that has culminated in this book. A quilt and wearable-art designer, she now uses folded fabric to add dimension and surface interest to her designs and teaches the technique to quilters eager to expand their skills. This book includes detailed instructions for reproducing in fabric eight basic paper folding designs: folded stars, diamonds, inside-out flowers, folded roses, twirled roses, pinwheels, polygon flowers, and kimonos. Once these fabric-folding techniques are mastered, the reader is free to move on to the 22 projects (vests, quilts, pillows, etc.) featuring the origami designs. This book is a good choice for expanding public library quilting collections. One caution: even though the quilting projects use traditional origami folding techniques, their modern designs are unrelated to traditional Japanese quilting.","torrent":{"xt":"urn:btih:7dc85756a3dde1766b3e66511bb0c492461d8b73","amp;dn":"Fantastic+Fabric+Folding%3A+Innovative+Quilting+Projects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc85756a3dde1766b3e66511bb0c492461d8b73","infoHashBuffer":{"type":"Buffer","data":[125,200,87,86,163,221,225,118,107,62,102,81,27,176,196,146,70,29,139,115]},"announce":[],"urlList":[]}}