{"title":"The Seven Basic Plots - [K-23]","uid":8128038,"size":12397332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7efc9b8dd1d5419534a5175dd7e8d51921ceddc3&amp;dn=The+Seven+Basic+Plots+-+%5BK-23%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"K-23","files":-1,"time":1360531028,"description":"The Seven Basic Plots: Why We Tell Stories\n*******************************************\n\n\nThis remarkable and monumental book at last provides a comprehensive answer to the age-old riddle of whether there are only a small number of 'basic stories' in the world. Using a wealth of examples, from ancient myths and folk tales via the plays and novels of great literature to the popular movies and TV soap operas of today, it shows that there are seven archetypal themes which recur throughout every kind of storytelling. But this is only the prelude to an investigation into how and why we are 'programmed' to imagine stories in these ways, and how they relate to the inmost patterns of human psychology. Drawing on a vast array of examples, from Proust to detective stories, from the Marquis de Sade to E.T., Christopher Booker then leads us through the extraordinary changes in the nature of storytelling over the past 200 years, and why so many stories have 'lost the plot' by losing touch with their underlying archetypal purpose.Booker analyses why evolution has given us the need to tell stories and illustrates how storytelling has provided a uniquely revealing mirror to mankind's psychological development over the past 5000 years.This seminal book opens up in an entirely new way our understanding of the real purpose storytelling plays in our lives, and will be a talking point for years to come.\n\nAuthor: Cristopher Booker | Pages: 736 | Publication Date: January 9, 2006 | Format: PDF","torrent":{"xt":"urn:btih:7efc9b8dd1d5419534a5175dd7e8d51921ceddc3","amp;dn":"The+Seven+Basic+Plots+-+%5BK-23%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7efc9b8dd1d5419534a5175dd7e8d51921ceddc3","infoHashBuffer":{"type":"Buffer","data":[126,252,155,141,209,213,65,149,52,165,23,93,215,232,213,25,33,206,221,195]},"announce":[],"urlList":[]}}