{"title":"NataSamrat (2016) - DVD.Rip - HEVC - x265.AAC.Esubs - 1GB - [DDR","uid":14502699,"size":1070346154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f061856b15f1c29f0dbd12c19bbb21f5cf00d8b&amp;dn=NataSamrat+%282016%29+-+DVD.Rip+-+HEVC+-+x265.AAC.Esubs+-+1GB+-+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"SaM","files":2,"time":1462202601,"description":"Presenting a DDR Exclusive\r\n\r\n\r\nNatasamrat(2016)\r\n(A film by Mahesh Manjrekar)\r\n\r\nMarathi - DVD Rip - 720x304 (2.35:1)- 998 MB - x.265.AAC-Esubs - 2 Hrs:45 Min\r\n\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/aldy \nhttp://extraimago.com/image/aldq \nhttp://extraimago.com/image/aldS \nhttp://extraimago.com/image/aldO \nhttp://extraimago.com/image/aldE \nhttp://extraimago.com/image/ald1 \nhttp://extraimago.com/image/aldc \nhttp://extraimago.com/image/ald7 \nhttp://extraimago.com/image/alds \nhttp://extraimago.com/image/aldT\r\n\r\nTech Specifications:\r\n \nhttp://extraimago.com/image/aldj\r\n\r\nSynopsis:\r\nganapat Ramchandra Belwalkar (nana Patekar) is a great Shakespearean actor, once given the title 'NataSamrat' or the Emperor of the Stage. He and his wife Kaveri (Medha Manjrekar) have two children Vidya (Mrinmayee Deshpande) &amp; Makarand (Ajit Parab). These four and Rambhau, his bosom friend, (Vikram Gokhale) make up the world of the retired actor.\r\n\r\nIt is a world in which Ganpat is repeatedly betrayed by his own flesh nad blood. He gives away his property to his son and daughter despite a warning from his quiet and faithful wife, only to find that his son and daughter-in-law first and then his daughter turn him away from their homes. True he is foul mouthed. He is an embarassment to them in society and his ideas are old-fashioned, nevertheless, Ganpat has pride and in each case, he would rather leave than accept humiliation.\r\n\r\nOne by one he loses the people who understand and support him. First Rambhau his friend passes away. Then as he leaves his daughters place and starts out for his ancestral village, Kaveri too dies on the way. Left with no one, Ganpat is devastated. But further dorrow is in store, for he learns one day that his favourite theatre, where he played his greatest roles has burned down..\r\n\r\nComments:\r\nAfter a lon long time, I saw a film that not just touched my heart but left a lasting impression. Based on a 45 year old play by Marathi playwright VV Shirwadkar, this is a straightforward tale of a fading actor. But it is made extraordinary by some brilliant acting by Nana Patekar. Indeed, I have never seen him act better! He is ably supported by Medha Manjrekar as Kaveri and Vikram Gokhale as Rambhau. Besides these three, the others look pedestrian!\r\n\r\nThe film is replete with wonderful scenes. Ganpat's relations with is wife, where we see an understated acting by Medha manjrekar at the best, or the glorious scene between Rambhau and Ganpat in the hospital, or even the last scene where a hallucinating Ganpat shifts from role to role in a mesmerising display of acting.. These scenes remain etched in memory.\r\n\r\nSuperb direction by Mahesh manjrekar helps as does a fine screenplay. This is further embellished by great camerawork by Ajit Reddy. Altogether, this film would surely class among the great films we have seen in recent times.\r\n\r\nPerhaps the only grouse that i have is that the film lasts nearly 3 hours (2 hrs 45 min 32 Sec). Some imaginative editing was perhaps required. But, I must hasten to add, in no place does the film flag. It holds you to your seat, despite its length.\r\n\r\nUploader's Notes:\r\nA surprisingly good quality DVD. There was a wealth of detail that has been accentuated in the rip. The rip also corrects the ugly yellow tint of the DVD and brings out the natural colours that were seen on screen.\r\n\r\nThis is a 10-bit HEVC encoding in x265. The sheer length of the film meant that compressing into one CD would be a compromise in qiality. Hence the 1GB size. It is a little excessive for a x265 rip (800MB would have been enough), but I used the additional bits to reduce banding and to add depth to the pictures.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on most stand-alone devices. You can only watch this on a computer or a compatible device. On your computer be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nEnjoy!\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt5311546/","torrent":{"xt":"urn:btih:7f061856b15f1c29f0dbd12c19bbb21f5cf00d8b","amp;dn":"NataSamrat+%282016%29+-+DVD.Rip+-+HEVC+-+x265.AAC.Esubs+-+1GB+-+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f061856b15f1c29f0dbd12c19bbb21f5cf00d8b","infoHashBuffer":{"type":"Buffer","data":[127,6,24,86,177,95,28,41,240,219,209,44,25,187,178,31,92,240,13,139]},"announce":[],"urlList":[]}}