{"title":"The Naked Future (2014) epub","uid":9896874,"size":1003155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f29939e09bcd00a30ab712e7d1eab0b9a36e6a0&amp;dn=The+Naked+Future+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1396722041,"description":"The Naked Future: What Happens in a World That Anticipates Your Every Move?\n\n\n\nAn in-depth look at the future of the future.\n An app on your phone knows you're getting married before you do. Your friends' tweets can help data scientists predict your location with astounding accuracy, even if you don't use Twitter. Soon, we'll be able to know how many kids in a kindergarten class will catch a cold once the first one gets sick.\n\n We are on the threshold of a historic transition in our ability to predict aspects of the future with ever-increasing precision. Computer-aided forecasting is poised for rapid growth over the next ten years. The rise of big data will enable us to predict not only events like earthquakes or epidemics, but also individual behavior.\n\n Patrick Tucker explores the potential for abuse of predictive analytics as well as the benefits. Will we be able to predict guilt before a person commits a crime? Is it legal to quarantine someone 99 percent likely to have the superflu while they're still healthy? These questions matter, because the naked future will be upon us sooner than we realize.\n","torrent":{"xt":"urn:btih:7f29939e09bcd00a30ab712e7d1eab0b9a36e6a0","amp;dn":"The+Naked+Future+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f29939e09bcd00a30ab712e7d1eab0b9a36e6a0","infoHashBuffer":{"type":"Buffer","data":[127,41,147,158,9,188,208,10,48,171,113,46,125,30,171,11,154,54,230,160]},"announce":[],"urlList":[]}}