{"title":"A Game as Old as Empire: The Secret World of Economic Hit Men an","uid":8628143,"size":1991674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f5180cbf66d4756b120af900a0dcddd75ad0ccc&amp;dn=A+Game+as+Old+as+Empire%3A+The+Secret+World+of+Economic+Hit+Men+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"blackatk","files":-1,"time":1372564751,"description":"\nJohn Perkins's sensational New York Times bestseller Confessions of an Economic Hit Man (more than 300,000 sold) revealed just the tip of the iceberg of the secret world of economic hit men and the web of global corruption. Now more economic hit men and investigators tell the whole shocking story.\n\n Review by Common Ground Magazine\nMarch, 2007\nWritten by Adrian Zupp\n\nIn 2004, John Perkins' Confessions of an Economic Hitman created waves, spoke the unspeakable and became a New York Times bestseller. In it Perkins came clean about how he'd helped US intelligence agencies and multinationals exploit the economies of Third World nations. A Game As Old As Empire - for which he wrote the introduction - is the follow-up, and this time a wide variety of in-the-know authors corroborate and expand upon Perkins' story. And it's frightening stuff.\n\nIn plain language - and providing sufficient historical background - we are shown how First Word countries have used &quot;economic hit men,&quot; institutions like the World Bank and IMF, coercion and even outright strong-arm tactics to steal from the developing countries - often in collusion with the elites of those countries who are happy to hide their ill-gotten gain in offshore accounts.\n\nA Game As Old As Empire is well referenced, very readable and perversely entertaining. Hard data is combined with first-person narratives and the machinations of international economics are made accessible for the layperson. And the book goes one step further by offering hope and practical advice. The chapter &quot;Global Uprising: The Web of Resistance&quot; by policy-analyst Antonia Juhasz sheds light on how people can change the corruption and help create a better world. There is also an appendix: &quot;Resources for Hope.&quot;\n\nWith chapters such as &quot;The Human Cost of Cheap Cell Phones&quot; and &quot;Hijacking Iraq's Oil Reserves,&quot; Game has a conscience-pricking currency.\n\nThis is an important book that should be read by anyone who wants to know how the world is run to the advantage of the wealthy few and the malicious disadvantage of the many poor.\nAbout the Author\nSTEVEN HIATT has worked as an editor and writer for several Bay Area companies, including Apple Computer, Netscape, Progressive Asset Management, and Stanford Research Institute. He is the editor (with Mike Davis) of Fire in the Hearth: The Radical Politics of Place in America (Verso), and is president of Editcetera, a cooperative of publishing professionals. He and his wife live in San Francisco, California. \n\n\nPublisher \tBerrett-Koehler Publishers; First Edition edition (February 28, 2007)\nLanguage \tEnglish\nISBN-10 \t1576753956\nISBN-13 \t978-1576753958\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Game-Old-Empire-Economic-Corruption/dp/1576753956/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372557248&amp;sr=1-1&amp;keywords=A+Game+as+Old+as+Empire%3A+The+Secret+World+of+Economic+Hit+Men+and+the+Web+of+Global+Corruption&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Game-Old-Empire-Economic-Corruption/dp/1576753956/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372557248&amp;sr=1-1&amp;keywords=A+Game+as+Old+as+Empire%3A+The+Secret+World+of+Economic+Hit+Men+and+the+Web+of+Global+Corruption&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7f5180cbf66d4756b120af900a0dcddd75ad0ccc","amp;dn":"A+Game+as+Old+as+Empire%3A+The+Secret+World+of+Economic+Hit+Men+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f5180cbf66d4756b120af900a0dcddd75ad0ccc","infoHashBuffer":{"type":"Buffer","data":[127,81,128,203,246,109,71,86,177,32,175,144,10,13,205,221,117,173,12,204]},"announce":[],"urlList":[]}}