{"title":"Yiddish Language Learning Pack","uid":7429923,"size":1867131282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f7b48277e98f7a405e41a596a5d7d51da65d138&amp;dn=Yiddish+Language+Learning+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"YidLid","files":-1,"time":1341913228,"description":"&quot;Yiddish has historically been the language of the Ashkenazim, the Jews of Central and Eastern Europe and their descendants around the world. At its peak, in the years immediately preceding the Holocaust, there were perhaps ten or eleven million Yiddish speakers worldwide, making Yiddish the most widely spoken Jewish language. As a combined result of genocide in Europe, cultural assimilation in America, and official and unofficial pressure to shift to Hebrew in Israel and Russian in the Soviet Union, today there are probably fewer than two million speakers, most of whom no longer use it as their primary language. With the rare exceptions of young Yiddish activists, it is only in certain Orthodox and Hasidic communities that Yiddish remains the language of everyday discourse and is still learned by children. However, there has been a resurgence of interest in Ashkenazic culture generally in recent decades, and Yiddish courses are now offered by many universities and Jewish cultural organizations.\n\nThe great Yiddish scholar Max Weinreich described it as a 'fusion language' that combines elements from Germanic, Slavic, Semitic, and other languages. This is certainly true, but most linguists would agree that at its core Yiddish is a West Germanic language, and thus a close cousin of English, and an even closer relative of German.&quot;","torrent":{"xt":"urn:btih:7f7b48277e98f7a405e41a596a5d7d51da65d138","amp;dn":"Yiddish+Language+Learning+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f7b48277e98f7a405e41a596a5d7d51da65d138","infoHashBuffer":{"type":"Buffer","data":[127,123,72,39,126,152,247,164,5,228,26,89,106,93,125,81,218,101,209,56]},"announce":[],"urlList":[]}}