{"title":"1776 David McCullough (John Adams) Pulitzer Prize","uid":4134779,"size":668086240,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7face0826d0c744798dbfaa94e25b50211e8e24e&amp;dn=1776+David+McCullough+%28John+Adams%29+Pulitzer+Prize&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":236,"time":1208210235,"description":"I am beginning to get the feeling that few people read these things, but for those who do and for the sake of the keyword effect, a quick explanation of the inclusion of John Adams in the title. David McCullough is the two time Pulitzer Prize winning author of both books. With the current HBO miniseries doing so well, I wanted to include a hook to get a few more people to notice this than otherwise might.\n\nI am a former American History teacher, and so McCullough is as well known to me as John Lennon would be to a fan of pop music. Sadly, however, great scholars are not well known to the general public, so I feel justified in chicanery to get someone to notice this introduction. This book is brilliant, currently on the New York Times bestseller list, and is a fine companion to McCulloughs JOHN ADAMS. Kudos should be given to its original tracker,which has an excellent Audiobook collection.\n\n\n1776 is a book written by historian David McCullough, first published by Simon &amp; Schuster on May 24, 2005. The work is considered a companion piece to McCullough's earlier biography of John Adams, and focuses on the events surrounding the start of the American Revolution. While revolving mostly around the leadership (and often indecisiveness) of George Washington, there is also considerable attention given to King George III, General Howe, Henry Knox, and Nathanael Greene. Key Revolutionary War battles detailed in the book include the Battle of Dorchester Heights, the Battle of Long Island, and the Battle of Trenton. Interestingly, the actual signing of the Declaration of Independence is treated as a somewhat minor detail, as the main focus of the book is on military rather than political events. The book includes a number of pages of full color illustrations, including portraits and historical battlefield maps made by British engineers at the time.\n","torrent":{"xt":"urn:btih:7face0826d0c744798dbfaa94e25b50211e8e24e","amp;dn":"1776+David+McCullough+%28John+Adams%29+Pulitzer+Prize","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7face0826d0c744798dbfaa94e25b50211e8e24e","infoHashBuffer":{"type":"Buffer","data":[127,172,224,130,109,12,116,71,152,219,250,169,78,37,181,2,17,232,226,78]},"announce":[],"urlList":[]}}