{"title":"The Cleveland Clinic Cardiology Review, 2E [Epub] [StormRG]","uid":10043182,"size":22210975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80182223c43f354031e135f00555a43248eb80e4&amp;dn=The+Cleveland+Clinic+Cardiology+Review%2C+2E+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398493370,"description":"Author: Brian P. Griffin MD FACC, Samir R. Kapadia MD FACC, Curtis M. Rimmerman\nHardcover: 952 pages\nPublisher: LWW; Second edition (July 23, 2012)\nLanguage: English\nISBN-10: 1451105371\nISBN-13: 978-1451105377\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nThe Cleveland Clinic Cardiology Board Review, 2nd Edition continues to offer thorough preparation for board certification and recertification exams in cardiology. It is written by distinguished clinicians from the Cleveland Clinic Foundation's Department of Cardiovascular Medicine and based on the Cleveland Clinic Foundation's popular annual Intensive Review of Cardiology course.\n\nThe book provides a comprehensive, state-of-the-art review of every area of contemporary cardiovascular medicine. Emphasis is on board relevant clinical material and accurate real-world clinical decision making. More than 500 illustrations and numerous tables facilitate quick review. Board-format questions with answers and explanations appear at the end of each chapter. Plus, with this edition you have access to an online companion website with fully searchable text and a question bank for access to the content anytime, anywhere.w","torrent":{"xt":"urn:btih:80182223c43f354031e135f00555a43248eb80e4","amp;dn":"The+Cleveland+Clinic+Cardiology+Review%2C+2E+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80182223c43f354031e135f00555a43248eb80e4","infoHashBuffer":{"type":"Buffer","data":[128,24,34,35,196,63,53,64,49,225,53,240,5,85,164,50,72,235,128,228]},"announce":[],"urlList":[]}}