{"title":"John Barth - The Floating Opera &amp; Other Works (11 Books)","uid":10149272,"size":18376592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8078de0d3cb827310c4891179b72f53f7553f019&amp;dn=John+Barth+-+The+Floating+Opera+%26amp%3B+Other+Works+%2811+Books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"nepalifiction","files":-1,"time":1400083861,"description":"John Simmons Barth (born May 27, 1930) is an American novelist and short-story writer, known for the postmodernist and metafictional quality of his work.\n\nBarth began his career with The Floating Opera and The End of the Road, two short &quot;realist&quot; novels that deal wittily with controversial topics, suicide and abortion respectively. They are straightforward realistic tales; as Barth later remarked, they &quot;didn't know they were novels.&quot; The Sot-Weed Factor (1960) was initially intended as the completing novel of a trilogy comprising his first two &quot;realist&quot; novels, but, as a consequence of Barth's maturation as a writer, it developed into a different project. The novel is significant as it marked Barth's discovery of Postmodernism. Barth's next novel, Giles Goat-Boy (about 800 pages), is a speculative fiction based on the conceit of the university as universe. A boy raised as a goat discovers his humanity and becomes a savior in a story presented as a computer tape given to Barth, who denies that it is his work. In the course of the novel Giles carries out all the tasks prescribed by Joseph Campbell in The Hero with a Thousand Faces. Barth kept a list of the tasks taped to his wall while he was writing the book. The short story collection Lost in the Funhouse (1968) and the novella collection Chimera (1972) are even more metafictional than their two predecessors, foregrounding the writing process and presenting achievements such as a seven-deep nested quotation. Chimera shared the U.S. National Book Award for Fiction. His 1994 Once upon a Time: A Floating Opera, reuses stock characters, stock situations and formulas.\n\nBarth's work is characterized by a historical awareness of literary tradition and by the practice of rewriting typical of postmodernism. He said: &quot;I don't know what my view of history is, but insofar as it involves some allowance for repetition and recurrence, reorchestration, and reprise [...] I would always want it to be more in the form of a thing circling out and out and becoming more inclusive each time.&quot; In Barth's postmodern sensibility, parody is a central device. Around 1972, in an interview, Barth declared that &quot;The process [of making a novel] is the content, more or less.&quot; Barth's fiction continues to maintain a precarious balance between postmodern self-consciousness and wordplay and the sympathetic characterization and &quot;page-turning&quot; plotting commonly associated with more traditional genres and subgenres of classic and contemporary storytelling.\n\n\nThe torrent contains books in ePUB format unless otherwise stated:\n\n*  Fiction\n\n\nChimera (three linked novellas) (1972)\n\nEvery Third Thought, A Novel in Five Seasons (2011)\n\nGiles Goat-Boy (1966)\n\nLost in the Funhouse (1968)\n\nThe Development, Nine Stories (2008)\n\nThe End of the Road (1958)\n\nThe Floating Opera (1956) -- PDF\n\nThe Last Voyage of Somebody the Sailor (1991) -- PDF\n\nThe Sot-Weed Factor (1960) -- PDF\n\nWhere Three Roads Meet (three linked novellas) (2005)\n\n\n*  Non-fiction\n\n\nThe Friday Book (1984) -- PDF\n\n\nRead the following article, interviews, and SEED the torrent and don't forget to give FEEDBACK!!!\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/John_Barth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/John_Barth&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.theparisreview.org/interviews/2910/the-art-of-fiction-no-86-john-barth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theparisreview.org/interviews/2910/the-art-of-fiction-no-86-john-barth&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.davidlouisedelman.com/barth/interview/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.davidlouisedelman.com/barth/interview/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bnreview.barnesandnoble.com/t5/Interviews/John-Barth-The-Development/ba-p/749&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bnreview.barnesandnoble.com/t5/Interviews/John-Barth-The-Development/ba-p/749&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8078de0d3cb827310c4891179b72f53f7553f019","amp;dn":"John+Barth+-+The+Floating+Opera+%26amp%3B+Other+Works+%2811+Books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8078de0d3cb827310c4891179b72f53f7553f019","infoHashBuffer":{"type":"Buffer","data":[128,120,222,13,60,184,39,49,12,72,145,23,155,114,245,63,117,83,240,25]},"announce":[],"urlList":[]}}