{"title":"The King of Fighters XI [Ntsc], Ps2","uid":5317003,"size":1848788136,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:80bfadd2330ccf06571e3e276bdffe5d52d4513a&amp;dn=The+King+of+Fighters+XI+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big_dude","files":-1,"time":1264748188,"description":"The King of Fighters XI for the Ps2                                 Rel. 11/13/2007\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action, Fighting\nRating:        T (Teen)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nMukai has stolen the Orochi seal and the theft of the Yata Mirror by Ash Crimson. Just as the dust settles, a new King of Fighters tournament is announced - a tournament which brings together some familiar faces, as well as new comers to the world of King of Fighters. Not all is what it seems in this new tournament...\n\nThe eleventh installment in SNK Playmore's long-running King of Fighters series and the ninth event in the official storyline, The King of Fighters XI is the first game in the series to for go the traditional numbering convention used by the series, and the first game in the series to move beyond the hardware capabilities of the Neo-Geo system. After the controversial resurgence of the Orochi power in the 2003 King of Fighters tournament, the tournament and the fighters return after a two year break in the action. Some are motivated to investigate the new Orochi situation and the antagonistic fighter Ash Crimson, while others enter the tourney to settle old scores...\n\nThe King of Fighters XI features a roster of 33 &quot;team&quot; characters, 7 PS2 exclusive characters, 5 mid-boss characters and 2 boss characters. In total, this allows a player to choose between +40 characters. Many of the characters are returning fighters from the other games in the KOF series, though notable new faces exist in the effective forms of Oswald, Duck King, Bonne Jenet, Elisabeth Blanctorche and Gai Tendo.\n\nThe &quot;tag system&quot; used in The King of Fighters 2003 is still employed in KOF XI. However, the change in the arcade hardware has brought about many gameplay changes since the 2003 release. A new power stock system - specifically called &quot;Skill Stocks&quot; - has been added for use with a few extra special maneuvers called &quot;Shifts&quot;. A character can use a &quot;Quick Shift&quot; to tag in another fighter while in the middle of a combo, while that character may also use a &quot;Saving Shift&quot; to tag out if they are on the verge of defeat. Another maneuver, called the &quot;Dream Cancel&quot;, has also been added to the system. Dream Cancels can be used to interrupt a special move with another one, even allowing a fighter to interrupt a Desperation Move to initiate a Leader Desperation Move. The &quot;Time Out&quot; system has be revamped as well - the system now takes into account the number of fighters defeated on a team and the number and power of attacks made by a team to reach its verdict.\n\n\nFeatures:\n\n* Total of 11 teams and 47 characters with 3 new to the franchise.\n \n* Exclusive PS2 characters, Mai Shiranui, Mr. Big, Geese Howard, Tung fu rue, \n  Robert Garcia, Hoaru Futaba and EX Kyo Kusanagi.\n\n* 7 Playable Boss characters.\n \n* 10 All-new music tracks.\n \n* 14 new endings not available in the arcade version. \n \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:80bfadd2330ccf06571e3e276bdffe5d52d4513a","amp;dn":"The+King+of+Fighters+XI+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80bfadd2330ccf06571e3e276bdffe5d52d4513a","infoHashBuffer":{"type":"Buffer","data":[128,191,173,210,51,12,207,6,87,30,62,39,107,223,254,93,82,212,81,58]},"announce":[],"urlList":[]}}