{"title":"Maps and Atlases - Tree, Swallows, Houses","uid":4250542,"size":35651915,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:80c681549abb7ca846dab4065bfea4bd462ef3a3&amp;dn=Maps+and+Atlases+-+Tree%2C+Swallows%2C+Houses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"brokenchords","files":23,"time":1213986432,"description":"From Wikipedia:\n\nMaps &amp; Atlases is a math rock group from Chicago, Illinois.\n\nMaps &amp; Atlases formed in the fall of 2004 when the founding members met in art school at Columbia College Chicago in the South Loop of Chicago. Shiraz Dada (bass), Chris Hainey (drums), Dave Davison (guitar/vocals), and Erin Elders (guitar) got together to try to find a sound that is both technical and organic, in the same vein as their influences Don Caballero and Hella.\n\nShiraz Dada is the only member of the group who is from the Chicago area. Chris Hainey is originally from Texas, Dave Davison from Philadelphia, and Erin Elders grew up in Maui, Hawaii.\n\nMaps &amp; Atlases gained critical attention from an article in Guitar Player magazine in their October 2006 issue. In that interview, guitar player Elders says &quot;Our goal was to put existing technical elements in a new context, and create something artistically unique, but still accessible.&quot;\n\nThe group was featured in a Pabst Blue Ribbon advertisement in The Onion.\n\nMaps &amp; Atlases are currently unsigned, but played at the Chicago portion of the invite-only 2006 College Music Journal Music Marathon on November 2, 2006. They played the 2007 and 2008 SXSW Music Festival.\n\nFor the month of December 2006, Maps &amp; Atlases were the hosts of cable and satellite music video station Refused TV.\n\nMaps &amp; Atlases was covered in two articles in the Chicago Tribune in regard to their 2006 New Year&amp;#039;s Eve show.\n\nOn May 16th 2008 sargent house announced the completion of Maps &amp; Atlases Newest EP. The 5 song EP is Titled &quot;You Me And The Mountain&quot; and is said to be available June 16th via internet as well as from the band during their summer 2008 tour.","torrent":{"xt":"urn:btih:80c681549abb7ca846dab4065bfea4bd462ef3a3","amp;dn":"Maps+and+Atlases+-+Tree%2C+Swallows%2C+Houses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c681549abb7ca846dab4065bfea4bd462ef3a3","infoHashBuffer":{"type":"Buffer","data":[128,198,129,84,154,187,124,168,70,218,180,6,91,254,164,189,70,46,243,163]},"announce":[],"urlList":[]}}