{"title":"Metal Church - Metal Church (1984) WMA320","uid":6251679,"size":104477788,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81872385844e2a230a4a4bb7a17f073a19408bff&amp;dn=Metal+Church+-+Metal+Church+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300432518,"description":"Metal Church's First Album. \n\nIn 1985, after groundbreaking releases 'Kill 'Em All' and Exodus's 'Bonded By Blood', Thrash Metal, created in the San Francisco Bay Area, was officially &quot;hip&quot;. Not much further behind Metallica and Exodus was a little-known band named Metal Church, comprised of the metallic duel-guitar attack of Kurdt Vanderhoof and Craig Wells, the banshee vocals of David Wayne, the thumping bass of Duke Erickson, and the double-bass heavy percussion of Kirk Arrington. Like Metallica, Metal Church was signed by Elektra, and, when their debut was released, it quickly became an underground hit. Over time, Metal Church's debut and their follow-up, 'The Dark' have been considered Thrash classics, even if you don't hear their name around Anthrax, Metallica, Megadeth, Testament, or Slayer. So, was I impressed with Metal Church's debut or disappointed? Read on to find out! \n\nTrack Ratings- \n\nBeyond The Black- Generally considered a Thrash classic, &quot;Beyond The Black&quot; begins with an ominous opening, but Wells and Vanderhoof's sonic guitar assault, not unlike Yngwie Malmsteen, develops into a pulsing, doomy, thrasher with melodic touches, not unlike early-Testament. Wayne's high-pitched vocals, mixed with the melodic thrash, seems to be a perfect match. An intense mixture of burning riffs, solos, vocals, drumming, and musicianship. A masterpiece. \n\nMetal Church- Like Black Sabbath, the band Metal Church, on the album Metal Church, has a song called &quot;Metal Church&quot;! Anyways, &quot;Metal Church&quot; blends the dark and sludgy guitar harmonies not unlike Tony Iommi of Black Sabbath, and Wayne's vocals would fit well in bands like Slayer. Gloom-and-doom, not to mention duel-guitar riffs, never sounded better. Another winner! \n\nMerciless Onslaught- A &quot;merciless&quot; piece of heavy metal, &quot;Merciless Onslaught&quot; blends the pounding, rhythmic percussion of Kirk Arrington and the insane guitar antics of Vanderhoof and Wells to create 3 minutes of metallic bliss. Instrumentals never sounded better, and Metallica's &quot;The Call of the Ktulu&quot; isn't that much better than this masterpiece. \n\nGods of Wrath- A melodic thrasher, &quot;Gods of Wrath&quot; is one of the best Thrash songs I've ever heard. Building up from a slow, rhythm guitar ballad, with *normal* vocals from Wayne, out of nowhere, the song (!) explodes (!) into an insane, out-of-this-world song with riffs that makes Pantera seem like girls and vocals that makes Axl Rose sound like a pansy. &quot;Gods of Wrath&quot; goes from an insane metal attack-on-the-senses to a melodic ballad, and throughout, this song never fails to amaze me! A friggin' masterpiece, with some of the best guitar riffs and vocals I've heard in Heavy Metal! \n\nHitman- Not unlike Iron Maiden, &quot;Hitman&quot; bursts out of your speakers with an opening riff much akin to the Maiden classic &quot;Number Of The Beast&quot;, and Wayne's melodic vocals clearly remind me of Rob Halford(of Judas Priest)'s falsetto. Metal Church dishes out some of the finest musicianship found in the 80's, and after listening to this song, your jaw should be hanging open. In a word: YES! \n\nIn The Blood- &quot;In The Blood&quot; sounds very similar to Slayer, using the break-neck speeds from drummer Kirk Arrington and guitarists Well and Vanderhoof to back up Wayne's dark, unforgiving vocals. As Quiet Riot would say, &quot;Bang your head!&quot;. \n\n(My Favorite) Nightmare- Metal Church's &quot;(My Favorite) Nightmare&quot; mixes the insane speeds of Motorhead and Slayer, the intricate guitarwork and songwriting of Metallica, the virtuoso performances and guitar solos of Yngwie Malmsteen, and the vocals of Halford(circa 'Painkiller').Obviously you've got yourself one great song! \n\nBattalions- A dark song about the woes of warfare, &quot;Battalions&quot; finds Metal Church exploring with Power Metal, molding an epic soundscape of crunching guitars, meaningful lyrics, operatic vocals, and progressive instrumentation not unlike Symphony X or Blind Guardian. Very mature and magnificent! \n\nHighway Star- A cover of the classic Deep Purple hit, &quot;Highway Star&quot; ends Metal Church's debut with a punky, rebellious statement, changing Deep Purple's classic rock song to a bonafide Punk Metal track, complete with uplifting vocals from Wayne and guitar antics from Vanderhoof and Wells that show them flexing their talents to the brink. Great end to a great album! \n\nOverall, Metal Church's debut shows an uncanny ability for songwriting, musicianship, and maturity that most bands ( ex. Slayer, Queensryche, Megadeth) fail to reach until much later in their career. Metal Church, like Metallica, Diamond Head, and Testament, managed to release a classic album, worthy of anyone's collection, with their first release. A mix of Iron Maiden and Testament, Metal Church's dark, gloomy Thrash metal is infected with melodic moments, and the musicians are top-notch: Wayne's vocals will leave your ears ringing, Vanderhoof and Wells guitar work easily match Kirk Hammett and Marty Friedman's, Kirk Arrington's percussion is flawless, putting him up with the caliber of Mike Portnoy and Lars Ulrich, and the bass is clear and enjoyable. What more can I say? This album is a masterpiece, and every Heavy Metal fan should give this album a home. \n\nHIGHLY RECOMMENDED TO FANS OF HEAVY METAL, THRASH, AND METAL CHURCH! METALLICA AND MEGADETH MAY BE MORE POPULAR, BUT METAL CHURCH IS NO LESS GOOD! \n\nKiller Kuts- &quot;Beyond The Black&quot;, &quot;Metal Church&quot;, &quot;Gods of Wrath&quot;, &quot;(My Favorite) Nightmare&quot;, &quot;Battalions&quot;, and &quot;Highway Star&quot;. \n\nAlso Recommended- \n\nKill 'Em All- Metallica \nBonded By Blood- Exodus \nThe Dark- Metal Church \n\nThanks For Reading!\n\nby Will Culp\n\nTRACKLIST:\n\n01 - Beyond The Black.wma                              \n02 - Metal Church.wma                                  \n03 - Merciless Onslaught.wma                           \n04 - Gods Of Wrath.wma                                 \n05 - Hitman.wma                                        \n06 - In The Blood.wma                                  \n07 - (My Favorite) Nightmare.wma                       \n08 - Battalions.wma                                    \n09 - Highway Star (Deep Purple Cover).wma\n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:81872385844e2a230a4a4bb7a17f073a19408bff","amp;dn":"Metal+Church+-+Metal+Church+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81872385844e2a230a4a4bb7a17f073a19408bff","infoHashBuffer":{"type":"Buffer","data":[129,135,35,133,132,78,42,35,10,74,75,183,161,127,7,58,25,64,139,255]},"announce":[],"urlList":[]}}