{"title":"Black Anal Addiction (Split Scenes)","uid":15558267,"size":5527539481,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:81b9513b01cffae2adf27133cbda2ebbea9cc5a1&amp;dn=Black+Anal+Addiction+%28Split+Scenes%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"LucasCar","files":16,"time":1471093625,"description":"Black Anal Addiction (Split Scenes)\r\n\r\n Although interracial porn has always been huge, the white male/black female variety has historically been difficult to find. But fans of these precious scenes are living in a golden era, and director Mike Adriano leads this revolution. In the double-disc Black Anal Addiction, Mike delivers over six hours of his trademark POV+ up-close camera work to six gorgeous Nubian goddesses who love the forbidden feeling of his big, tireless Caucasian cock inside their ass! Cat-eyed cutie Coffee Brown does her second anal scene ever, opening up her jiggly booty for a series of hole-stretching toys (including Mikes signature speculum) and gagging on the directors dick. Coffee sucks cock ass-to-mouth and swallows a creamy oral cum shot. Light-skinned and naturally voluptuous, Bethany Benz offers Mike her amazing jugs and winking butthole. She indulges his whims with a sensuous blow job and plenty of ass-gaping rectal wreckage. This thick, stunning slut gets rewarded with a mouthful of white boy semen. Sierra Banxxx is a nubile young thing who deep-throats Mikes fat schlong, then buzzes her clit with a vibrator while he plows her tight rear end. Perfect brown beauty Leilani Leeane enjoys two amazing three-way scenes: The first is an anal gapefest with rimming and ATM featuring lithe, adorable Skin Diamond. After Mikes finished sodomizing both luscious models, they snowball a load of his sperm. Then Leilani joins buxom Megan Vaughn in a nasty session of relentless butt pounding. Be careful... these beautiful black asses are totally addictive! \r\n\r\n Starring: - Bethany Benz -- Coffee Brown -- Leilani Leeanne -- Megan Vaughn -- Sierra Banxxx -- Skin Diamond -\r\n \nhttp://screenimage.net/img-57aeff4bccbe6.html \nhttp://screenimage.net/img-57aeff49c0fb6.html \nhttp://screenimage.net/img-57aeff4593d29.html \nhttp://screenimage.net/img-57aeff4195b6e.html \nhttp://screenimage.net/img-57aeff3488c65.html \nhttp://screenimage.net/img-57aeff306a30d.html \nhttp://screenimage.net/img-57aefeaede448.html \nhttp://screenimage.net/img-57aefeabe02e5.html\r\n\r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n  \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:81b9513b01cffae2adf27133cbda2ebbea9cc5a1","amp;dn":"Black+Anal+Addiction+%28Split+Scenes%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b9513b01cffae2adf27133cbda2ebbea9cc5a1","infoHashBuffer":{"type":"Buffer","data":[129,185,81,59,1,207,250,226,173,242,113,51,203,218,46,187,234,156,197,161]},"announce":[],"urlList":[]}}