{"title":"[JAST USA] [ENGLISH] Yumina The Ethereal","uid":8867387,"size":3403292658,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:81e09d9a5e7bf6d1b28c64f446514a6ae02e0acb&amp;dn=%5BJAST+USA%5D+%5BENGLISH%5D+Yumina+The+Ethereal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ATX008","files":-1,"time":1377957352,"description":"The Student Council Election is your only hope. Fight, win, and change your destiny!\n\nMidorishita Yumina is a junior at the prestigious Jinbu Academy. Far from being a model student, Yumina skirts the precarious line between barely passing and failing hard. One day, a young man named Akashima Ayumu transfers into her class. Ayumu claims to have been sent by his father, an eccentric and possibly delusional man who ordered Ayumu to find and protect Yumina, whom he believes will one day save the universe.\n\nAyumu and Yumina are at odds from the moment they first meet. They bicker endlessly, day after day, until finally Yumina goes too far and starts a fight just before a critical test. Her failure dooms her to repeat the year.\n\nBut just when it seems all hope is lost, a mysterious girl named Kurokawa Kirara appears and invites Yumina to run for Student Council President.\n\nAccording to Kirara, whoever wins an Election War and becomes President will have the power to change any school rule he or she likes. Realizing that this is her only hope of becoming a senior, Yumina agrees to join the race, and drags Ayumu along for the ride!\n\nThus begins an epic tale of love and friendship in which youthful passions run high and debates shake the foundation of the heavens.\n\nWho will emerge victorious!?\n\n\nNO DRM JUST INSTALL AND PLAY !","torrent":{"xt":"urn:btih:81e09d9a5e7bf6d1b28c64f446514a6ae02e0acb","amp;dn":"%5BJAST+USA%5D+%5BENGLISH%5D+Yumina+The+Ethereal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e09d9a5e7bf6d1b28c64f446514a6ae02e0acb","infoHashBuffer":{"type":"Buffer","data":[129,224,157,154,94,123,246,209,178,140,100,244,70,81,74,106,224,46,10,203]},"announce":[],"urlList":[]}}