{"title":"The Films of Woody Allen (pdf){Zzzzz}","uid":11459749,"size":2093664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:825ea766d6ad20f23b1b45387ad7f161125ffcdc&amp;dn=The+Films+of+Woody+Allen+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415973596,"description":"The Films of Woody Allen is the first full-length study of Woody Allen the artist as opposed to the celebrity and personality and argues that Allen is a major artistic force. On the cutting edge of contemporary critical and cultural consciousness, Allen challenges our notions of authorship, narrative, perspective, character, theme, ideology, gender and sexuality. A student and admirer of the classic Hollywood cinema, Allen combines this appreciation for American directors with a developed sensitivity to experimental European directors such as Fellini, De Sica and Bergman. Probably the most widely recognized aspect of his work involves his films that experiment with narrative, plot and psychology. In the films dating from the early seventies, Allen develops into one of America's great innovative directors as he takes his brilliant comic impulses seriously. His technical, literary, visual and linguistic innovations introduce intensity and complexity to his humour. Instead of continuing on the path of zany comedy, he carefully creates films that form an original union of the serious and comic.\n\nProduct Description\n\nBook Description\nThe first full-length study of Woody Allen the artist as opposed to the celebrity and personality. It argues that Allen is on the cutting edge of contemporary critical and cultural consciousness.\n\nPublisher: Cambridge University Press (29 January 1993)\nLanguage: English\nISBN-10: 0521380952\nISBN-13: 978-0521380959\n\nMost Helpful Customer Reviews\n\nExcellent 26 September 2011\nBy Isabela Sued -\nIt got here very fast (concerning that it came from USA to Brasil) and the book is in a very good state","torrent":{"xt":"urn:btih:825ea766d6ad20f23b1b45387ad7f161125ffcdc","amp;dn":"The+Films+of+Woody+Allen+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"825ea766d6ad20f23b1b45387ad7f161125ffcdc","infoHashBuffer":{"type":"Buffer","data":[130,94,167,102,214,173,32,242,59,27,69,56,122,215,241,97,18,95,252,220]},"announce":[],"urlList":[]}}