{"title":"Beyond the Square Crochet Motifs: 144 circles, hexagons, triangl","uid":11157632,"size":38426150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82be7bec4116987425367094d977b58f44d79009&amp;dn=Beyond+the+Square+Crochet+Motifs%3A+144+circles%2C+hexagons%2C+triangl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KnitLady","files":-1,"time":1412465317,"description":"Learn to crochet, make a granny square. It's a simple formula that has held true for decades. Crocheters love granny squares because the technique is simple to learn but the possibilities are endless. Vary the colors. Use the same colors but change their placement. Add unique images. Make the same square over and over but in different sizes. There is much to love about the classic square crochet motif. But if it's hip to make squares, imagine the coolness quotient of circles, stars, triangles, and hexagons. Beyond-the-Square Crochet Motifs introduces crocheters to more than 150 designs of every size and shape. Full-color photographs capture the intricate details and color work in each motif, and the stitching instructions offer the flexibility of being presented in both text and symbol formats. Each motif can be quickly crocheted and then used as a small embellishment on a larger item or combined with other motifs to create original pieces, from baby blankets to tote bags. Edie Eckman inspires readers to see the world of possibility in each motif. Master the technique, then let the imagination run wild.Motifs give crocheters the freedom to play with shape, color, and texture in patterns that are small and quickly completed. Motifs ï¿½ each one a tiny work of art ï¿½ are at once addictive and rewarding. With its unexpected range of shapes, designs, and color ideas, Beyond-the-Square Crochet Motifs will keep enthusiasts happy for a very long time!","torrent":{"xt":"urn:btih:82be7bec4116987425367094d977b58f44d79009","amp;dn":"Beyond+the+Square+Crochet+Motifs%3A+144+circles%2C+hexagons%2C+triangl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82be7bec4116987425367094d977b58f44d79009","infoHashBuffer":{"type":"Buffer","data":[130,190,123,236,65,22,152,116,37,54,112,148,217,119,181,143,68,215,144,9]},"announce":[],"urlList":[]}}