{"title":"Genesis 24 Bit Vinyl Pack","uid":9551168,"size":22038657763,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:82d18661b026c08055fd28f7c88101749e0befab&amp;dn=Genesis+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"politux","files":-1,"time":1391267569,"description":"\n  Genesis 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Art Rock, Progressive Rock, Album Rock, Soft Rock\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 -5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  Genesis 1970-1975 Vinyl Boxset - 6x200 gram 1/2 Speed Mastered LP's\n\n  1970 Trespass\n  1971 Nursery Cryme \n  1972 Foxtrot \n  1973 Selling England By the Pound\n  1974 The Lamb Lies Down on Broadway\n\n  Other Vinyl\n \n  24.96\n\n  1970 Trespass - 1975 Reissue - Charisma 63 69 905 (Spain)\n  1971 Nursery Cryme - Charisma CAS 1052, 2nd Pressing (UK)\n  1974 The Lamb Lies Down on Broadway - Charisma (Germany, PBTHAL)\n  1975 A Trick of the Tail - Charisma (Japan, PBTHAL)\n  1976 Rock Roots - Decca Original (UK)\n  1976 Wind &amp; Wuthering - Charisma 9124 003 (Sweden)\n  1977 Seconds Out - Nippon Phonogram SFX-10036~7 (Japan, Dr. Robert)\n  1978 The Story of Genesis - Charisma SFX-10061~2 (Japan)\n  1981 Abacab - Vertigo 6302 162\n  1991 We Can't Dance - Virgin 212 082\n\n  24.192\n\n  1972 Foxtrot - Virgin Audiophile Edition (Germany)  \n\n  Genesis started life as a progressive rock band, in the manner of Yes and King Crimson, before a series of membership changes brought about a transformation in their sound, into one of the most successful pop/rock bands of the 1980s and 1990s. In addition, the group has provided a launching pad for the superstardom of members Peter Gabriel and Phil Collins, and star solo careers for members Tony Banks, Michael Rutherford, and Steve Hackett. Their roots go back to 1965 and a pair of rival groups, the Garden Wall and the Anon, formed by students at the Charterhouse School in Godalming, Surrey. They merged, with the result that 15-year-olds Peter Gabriel, Tony Banks, and Michael Rutherford joined with 14-year-old Anthony Phillips, calling themselves the New Anon and recording a six-song demo featuring songs primarily written by Rutherford and Phillips.\n\n  Charterhouse alumnus, recording artist, and producer Jonathan King heard the tape and arranged for the group to continue working in the studio, and it was also King who renamed the band Genesis. In December of 1967 they cut their debut single, &quot;The Silent Sun,&quot; a very deliberate Bee Gees-style pastiche -- it was released in February of 1968 without attracting much notice from the public, and a second single, &quot;A Winter's Tale,&quot; followed with similar neglect. They also ran through a couple of drummers during this period, Chris Stewart and John Silver. At this time, the group's music was a form of lyrical folk-based progressive pop, built on lush melodies primarily carried on acoustic guitar and piano, with lyrics that tended toward the florid and trippy -- psychedelia was in vogue, and Genesis showed an exceptional facility with poetic content as well as gorgeous melodies. Their debut album, From Genesis to Revelation -- which the group has all but disowned in the decades since -- was released in March of 1969, and passed without too much notice from the music press or the public. The members began thinking about getting on with their lives outside of music, and especially attending college. But they felt strongly enough about their work to try making it as a professional band. The re-formed in 1969 and got their first paying gig in September of that year, and spent the next several months working out new material, with new drummer John Mayhew aboard.\n\n  Genesis soon became one of the first groups signed to the fledgling Charisma label, founded by Tony Stratton-Smith, and they recorded their second album, Trespass. That record, released in October of 1970, showed the first signs of the band that Genesis would become. The music was still folk-based, some of the songs couldn't quite carry their length, and they had some way to go in terms of vocal and instrumental finesse, but it had reach if not grasp -- most of the album was comprised of extended pieces, sung with dramatic intensity, and with complex parts for all of the instruments.\n\n  Genesis then lost two members. Mayhew left over the unhappiness with aspects of his playing, and was replaced by Phil Collins, a former child actor turned drummer who had previously played with Flaming Youth -- he also added an occasional additional lead vocal to their sound. Much more unsettling was the departure of guitarist Anthony Phillips, who had developed crippling stage fright. For some time afterward, Genesis worked as a four-piece with the guitar parts covered by Banks' keyboards. Finally, just prior to Genesis beginning work on their next album, their lineup was completed with the addition of guitarist Steve Hackett, a former member of Quiet World. The band's next album, Nursery Cryme, was recorded so close to his arrival that Hackett played on it, but some of the guitar parts were written and played by Michael Rutherford, while the centerpiece of the new album, &quot;The Musical Box,&quot; used material that Phillips had composed.\n\n  There was hardly a weak moment on the record, and the music was far more exciting -- and witty -- than most of the progressive rock of the period. The heart of the record was &quot;The Musical Box,&quot; a song telling a Victorian-era story of children, murder, and ghostly apparitions that was worthy of the classic horror film Dead of Night. And while it might not have become a pop culture phenomenon, the album and the song did find an audience among collegiate listeners. The theatrical attributes of Gabriel's singing fit in well with the group's live performances during this period as he began to make ever more extensive use of masks, makeup, and props in concert, telling the framing stories in order to set up their increasingly complicated songs. Part of the reason for the stories was practical -- it gave the others, especially Hackett, a chance to retune their instruments. When presented amid the group's very strong playing, this aspect of Gabriel's work turned Genesis' performances into multimedia events. And word soon began to spread about Genesis being an act that was worth hearing and, even more so, worth seeing in concert.\n\n  Foxtrot, issued in the fall of 1972, was the flash point in Genesis' history. The writing, especially on &quot;Supper's Ready&quot; -- a conceptual piece taking up an entire side of the LP -- was as sophisticated as anything in progressive rock, and the lyrics were complex and clever, but the record was never boring, or even less than bracing. It became their first to chart in England, reaching number 12. Genesis' live performances by now were practically legend. Rock music had always contained a theatrical element, which had reached new levels in the late '60s. But Peter Gabriel, with his growing array of costume changes and acting out of roles, far transcended anything seen on a rock stage -- it was true rock theater, and an intense listening experience.","torrent":{"xt":"urn:btih:82d18661b026c08055fd28f7c88101749e0befab","amp;dn":"Genesis+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d18661b026c08055fd28f7c88101749e0befab","infoHashBuffer":{"type":"Buffer","data":[130,209,134,97,176,38,192,128,85,253,40,247,200,129,1,116,158,11,239,171]},"announce":[],"urlList":[]}}