{"title":"History channel - Ancient Aliens - Season 2","uid":6084366,"size":3666618268,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82d3626fdbe2832d4ce757a66fdaccf627b55a52&amp;dn=History+channel+-+Ancient+Aliens+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"radioman-lt","files":-1,"time":1294256176,"description":"History channel - Ancient Aliens - Season 2\n &lt;a href=&quot;\nhttp://www.history.com/shows/ancient-aliens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.history.com/shows/ancient-aliens&lt;/a&gt;\n\nCodec ID                         : XVID\nBit rate                         : 1 019 Kbps\nWidth                            : 624 pixels\nHeight                           : 352 pixels\nDisplay aspect ratio             : 16:9\nFrame rate                       : 23.976 fps\n\nEnjoy! ;}\n\n&quot;Mysterious Places&quot;\n\nThis episode examines locations around the Earth that are proposed &quot;hot spots&quot; of UFO activity; such as the Bermuda Triangle; Mexico's &quot;Zone of Silence&quot; an area of land said to naturally disrupt radio signals; the portal-like structure at Peru's Puerta de Hayu Marka; and the curious rock formations of the Markawasi Plateau. \n\n\n&quot;Gods &amp; Aliens&quot;\n\nThis episode looks at legends about powerful gods and fearsome monsters that have similarities between different cultures separated by vast distances, and suggests that they may be eyewitness accounts of alien visitations. Also discussed are tales of gods interacting with humans, imparting wisdom and technology and impregnating women to create demigods who are supposedly offspring of human/alien unions. \n\n&quot;Underwater Worlds&quot;\n\nThis episode suggests that various underwater structures and ruins found around the globe may have been used by extraterrestrials; such as the temple ruins found under Lake Titicaca in Peru; the geometric structures of Yonaguni off the coast of Japan, and ancient Indian texts that allegedly describe other sunken cities yet to be discovered. \n\n&quot;Underground Aliens&quot;\n\nThis episode theorizes that various underground places may have been extraterrestrial lairs; such as a lost cave in Ecuador said to hold metal tablets containing alien knowledge; the underground city of Derinkuyu in Turkey; Native American legends of &quot;inner-earth&quot; beings; and rumors of a secret U.S. Military-base supposedly built alongside aliens inside the Archuleta Mesa near Dulce, New Mexico. \n\n&quot;Aliens and the Third Reich&quot;\n\nThis episode speculates that Nazi Germany had experimented with advanced alien technology and built flying machines; such as the Haunebu and the Die Glocke (The Bell); and rumors that some of this technology may have made its way to the United States and helped jump start the Apollo program. \n\n&quot;Alien Tech&quot;\n\nThis episode proposes that some advanced weapon technology currently in development, such as laser and sonic weapons, are rediscovered technology used by advanced beings in the past. Also discussed are theories that aliens provided gravity manipulation devices to help man construct colossal stone structures around the world. \n\n&quot;Angels and Aliens&quot;\n\nThis episode looks at various stories of angelic visitations that to some ancient astronaut theorists read more like alien encounters than divine appearances, and suggests they are not supernatural beings, but visitors from distant planets. \n\n&quot;Unexplained Structures&quot;\n\nThis episode suggests that various sites around the world; such GÃƒÂ¶bekli Tepe in Turkey; the Incan ruins of SacsayhuamÃƒÂ¡n in Peru; the Carnac stones of France; and Zorats Karer in Armenia, show construction techniques and mathematical concepts that were not believed to have been known at the time, and that this knowledge was gained from alien visitors. \n\n&quot;Alien Devastations&quot;\n\nThis episode surmises that aliens may have caused various disasters, as depicted in the Bible and other texts, or even tried to warn man of them; such as Noah of the Great Flood. Also proposed is that some disasters ushered changes in human evolution and that our leaps in technology over the centuries were achieved with alien help. \n\n&quot;Alien Contacts&quot;\n\nThis episode proposes that extraterrestrials contacted various human beings throughout history in order to pass on important messages for humanity, or to help guide and inspire them to achieve great things. \n","torrent":{"xt":"urn:btih:82d3626fdbe2832d4ce757a66fdaccf627b55a52","amp;dn":"History+channel+-+Ancient+Aliens+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d3626fdbe2832d4ce757a66fdaccf627b55a52","infoHashBuffer":{"type":"Buffer","data":[130,211,98,111,219,226,131,45,76,231,87,166,111,218,204,246,39,181,90,82]},"announce":[],"urlList":[]}}