{"title":"The Paradox of Liberation (2015) pdf","uid":11804702,"size":588872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82debb51623f22c1f47484e095714980f7ed81fe&amp;dn=The+Paradox+of+Liberation+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1428531569,"description":"The Paradox of Liberation: Secular Revolutions and Religious Counterrevolutions\n\n\nMany of the successful campaigns for national liberation in the years following World War II were initially based on democratic and secular ideals. Once established, however, the newly independent nations had to deal with entirely unexpected religious fierceness. Michael Walzer, one of America's foremost political thinkers, examines this perplexing trend by studying India, Israel, and Algeria, three nations whose founding principles and institutions have been sharply attacked by three completely different groups of religious revivalists: Hindu militants, ultra-Orthodox Jews and messianic Zionists, and Islamic radicals. In his provocative, well-reasoned discussion, Walzer asks why these secular democratic movements have failed to sustain their hegemony: Why have they been unable to reproduce their political culture beyond one or two generations? In a postscript, he compares the difficulties of contemporary secularism to the successful establishment of secular politics in the early American republic-thereby making an argument for American exceptionalism but gravely noting that we may be less exceptional today","torrent":{"xt":"urn:btih:82debb51623f22c1f47484e095714980f7ed81fe","amp;dn":"The+Paradox+of+Liberation+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82debb51623f22c1f47484e095714980f7ed81fe","infoHashBuffer":{"type":"Buffer","data":[130,222,187,81,98,63,34,193,244,116,132,224,149,113,73,128,247,237,129,254]},"announce":[],"urlList":[]}}