{"title":"EXPLOITED COLLEGE GIRLS - Penny + Daisy - Anal Threesome *NEW*","uid":11597227,"size":553687208,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:82ecc38ea72c46c4f093551a2e12ec7fbdc765c5&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Penny+%2B+Daisy+-+Anal+Threesome+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"beta2008x","files":1,"time":1417297293,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=iz4zh_pnd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=iz4zh_pnd.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=wbdtm_ecg_penny_daisy_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=wbdtm_ecg_penny_daisy_s.jpg&lt;/a&gt;\n\nGrab your favorite jack lotion and settle in for awesomeness: anal queen Daisy and leggy nympho Penny return for a rare Ex Co Gi threesome. Between alternating orgasms, girl on girl make out sessions and a fantastic 69 we managed to fit in some anal sex and an epic double facial.\nIt turns out that two recent fan (and Jay) favorites happen to be friends; very openminded friends, as it turns out. After meeting and shooting Penny, Jay got in touch with Daisy and shot her as well. Then, since Jay is clearly A GENIUS, he suggested the pair return together for a threesome shoot.\nThings start off fun, with Penny and Daisy clowning around as they get ready for the big event. Since we've met both them already, the interview is fairly brief and soon enough they are kissing and undressing each other. Daisy is doing her best to get at at her (and our) favorite part of Penny's body - her huge, firm tits. Jay tosses a vibrator in the mix and in no time Daisy is fucking Penny with it and licking her to her first orgasm. They switch spots and Penny returns the favor by fucking and licking Daisy to her first orgasm.\nJay jumps in at this point and insists on a double BJ. With help from Penny, he captures the action from different angles and gets some amazing head for the girls individually and together. Recalling his favorite scene from The Human Centipede, Jay has Penny settle in for some serious pussy licking from Daisy as he pounds her from behind. Things get fast and furious from this point and after the girls take turns getting fucked they end up in a 69, eating each other out.\nAbout now Jay remembers that Daisy loves anal and manages to maneuver himself in between Penny's face and Daisy's ass and slide his cock in Daisy's tight little ass from behind as Penny licks her pussy. After the girls take turns getting fucked again, Jay (remember, he is A GENIUS) gets them positioned at the foot of the bed for a bit more double BJ, a little girl on girl make out action and then a huge double facial finish","torrent":{"xt":"urn:btih:82ecc38ea72c46c4f093551a2e12ec7fbdc765c5","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Penny+%2B+Daisy+-+Anal+Threesome+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ecc38ea72c46c4f093551a2e12ec7fbdc765c5","infoHashBuffer":{"type":"Buffer","data":[130,236,195,142,167,44,70,196,240,147,85,26,46,18,236,127,189,199,101,197]},"announce":[],"urlList":[]}}