{"title":"[Clips4Sale / Family-Therapy] Molly Jane (Dad Meets My New Boyfr","uid":13675069,"size":729417849,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:837e03d16ce8d440eefc0389271eb6661a86c190&amp;dn=%5BClips4Sale+%2F+Family-Therapy%5D+Molly+Jane+%28Dad+Meets+My+New+Boyfr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1456389809,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/kUW\r\n \nhttp://imgsnaps.com/image/kUw\r\n\r\nHey, its Molly again:) I GOT A NEW BOYFRIEND!!!! I'm sooo excited and I'm totally in love I think (even though I just met him last month.) He's soo CUTE!!! I told my Dad that he had to meet Rosario. So when Dad got back from the liquor store I called Rosario and told him to come over. But after only a few minutes Dad left again to go drink at his buddy's house. So I decided to try something new with my boyfriend while Dad was gone.... After my dad left I started messing around with my new boyfriend, but it took some convincing for him to fuck me. I think he's kinda shy around girls... But once we started fucking it was great--until DAD CAME IN AND CAUGHT US!!! He was pretty mad because he told me I'm not allowed to mess with boys unless he can watch--thats kinda weird, right? Dad pulled his cock out and shoved it in my mouth and told Rosario he had to stay and learn how to fuck me. WHY DOES MY DAD ALWAYS EMBARRASS ME?!?....I told my Dad he should let Rosario leave but he said no-- he had to learn how to please a woman sometime. I CAN'T BELIEVE MY DAD WAS FUCKING ME IN FRONT OF MY NEW BOYFRIEND!!! This was even worse than what he did to my last boyfriend!! Dad pounded my little pussy from behind while he shoved my head down on my boyfriend's cock. THIS WAS CRAZY!! Dad kept fucking me really hard and telling my boyfriend to pay attention to what he was doing. Finally he told my boyfriend to cum on my huge tits and he said that was the only place my boyfriend was allowed to cum. I thanked my Daddy for not letting him cum inside me-- I totally forgot I'm not on birth control!! Then Dad pulled out and blew his load all over my face-- he said that's only for him to cum on. I don't know if Rosario will ever want to see me again, that was pretty weird, but at least I know I'll always have my Dad to take care of me-- even if he does make me mad sometimes:)","torrent":{"xt":"urn:btih:837e03d16ce8d440eefc0389271eb6661a86c190","amp;dn":"%5BClips4Sale+%2F+Family-Therapy%5D+Molly+Jane+%28Dad+Meets+My+New+Boyfr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837e03d16ce8d440eefc0389271eb6661a86c190","infoHashBuffer":{"type":"Buffer","data":[131,126,3,209,108,232,212,64,238,252,3,137,39,30,182,102,26,134,193,144]},"announce":[],"urlList":[]}}