{"title":"Standup Comedy - Mike Birbiglia - Two Drink Mike","uid":4319094,"size":73468626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:839f5d5f2eb5e51175f77f7360f562e7c5e6159c&amp;dn=Standup+Comedy+-+Mike+Birbiglia+-+Two+Drink+Mike&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":19,"time":1217286614,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nMike Birbiglia - You&amp;#039;d Be Surprised\n\nReview by David Jeffries \nThe title of Mike Birbiglia&amp;#039;s 2006 release refers to what a lightweight he is. Couple drinks and he&amp;#039;s doing magic tricks and dancing, but without the booze he&amp;#039;s a guy who likes biographies, has serious opinions about wildlife, and is really good at drinking hot chocolate. That is what&amp;#039;s great about Two Drink Mike, Birbiglia projects a humble attitude that&amp;#039;s approachable, endearing even, but it leads to material that can be Steven Wright-strange and just as hilarious. Course Wright could be from Mars while Birbiglia is the weird kid-next-door grown-up and adjusted to the world outside just enough to get by. Imagine a protected kid from the suburbs devouring BET&amp;#039;s hip-hop programming and you&amp;#039;ve got an idea of how Birbiglia relates. He&amp;#039;s enthusiastic about the bling-bling lifestyle he sees on MTV Cribs but worries the rappers are dying inside and crying out for attention with their rims and grills. Gay cats, why parents can&amp;#039;t understand computers, and the cockiness of handing Kleenex out before funerals are hot topics, and if it seems at first like Birbiglia is just a stream of consciousness guy like Wright; the trick of Two Drink Mike is how well it flows before exiting on a handful of hilarious musical numbers. Containing mostly different material than the CD, the bonus DVD of older performances is clumsier and features a more straight-laced looking, not as comfortable performer. You can study a comedian honing his craft by analyzing the two discs, or you can just sit back and listen to the arrival of stand-up&amp;#039;s next big thing.\n","torrent":{"xt":"urn:btih:839f5d5f2eb5e51175f77f7360f562e7c5e6159c","amp;dn":"Standup+Comedy+-+Mike+Birbiglia+-+Two+Drink+Mike","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"839f5d5f2eb5e51175f77f7360f562e7c5e6159c","infoHashBuffer":{"type":"Buffer","data":[131,159,93,95,46,181,229,17,117,247,127,115,96,245,98,231,197,230,21,156]},"announce":[],"urlList":[]}}