{"title":"Henry VIII  (2003 - Ray Winstone)","uid":5152571,"size":4680845312,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:83f971dcd2ccc244804352859125b766a65508ed&amp;dn=Henry+VIII++%282003+-+Ray+Winstone%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"dougietrotter","files":-1,"time":1257643061,"description":"At the heart of Henry VIII stands a towering performance by Ray Winstone, who literally grows into the role, impressively doubling in size and ageing 40 years over the course of two feature-length episodes. \n\nFocusing on Henry's relationships with his six wives, this lavish mini-series also makes a good job of explaining the complex court intrigues of the period, detailing Henry's split with Rome and the political crisis following the creation of the Church of England. Winstone initially seems to play the King as little more than a London gangster, but he gradually unfolds a complex, brutal, manipulative, romantic, dedicated and driven man with great skill.\n\nIn a role which harks back to Lady Jane (1986), Helena Bonham Carter makes an intelligent and sardonic Anne Boleyn, her bold performance contrasting strongly with GeneviÃƒÂ¨ve Bujold in Anne of the Thousand Days (1969). Emily Blunt impresses as the sexpot Katherine Howard, and Emilia Fox is compelling as Henry's greatest love, Jane Seymour. \n\nThere's fine support from an all-star cast, including Sean Bean, Charles Dance and David Suchet. The production is unflinching, with burnings, torture, marital violence and executions graphically portrayed. If there's a weakness it lies in too-modern dialogue and an uncertain visual style, with noticeable borrowings from John Boorman's Excalibur and Ridley Scott's Gladiator, as well as setting Shakespeare in Love-style elegance against the ugly colours and graininess of reality TV. \n\nUltimately Henry VIII plays most like a prequel to Elizabeth (1999) - right down to using the same piece of Elgar to underscore the finale - and has most of the same faults and virtues as that Oscar-winning film.\n\nThis film and many others can be found on the film/music torrent site: files24.com.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:83f971dcd2ccc244804352859125b766a65508ed","amp;dn":"Henry+VIII++%282003+-+Ray+Winstone%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83f971dcd2ccc244804352859125b766a65508ed","infoHashBuffer":{"type":"Buffer","data":[131,249,113,220,210,204,194,68,128,67,82,133,145,37,183,102,166,85,8,237]},"announce":[],"urlList":[]}}