{"title":"CSI - Hard Evidence PC Game","uid":6224144,"size":1910445434,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8486834c90b8173538c9285b12f90c53820c6953&amp;dn=CSI+-+Hard+Evidence+PC+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Bl4z3","files":2,"time":1299452297,"description":"CSI: Hard Evidence is a computer game based on the CSI: Crime Scene Investigation television series. This is the fifth CSI game released, including CSI: Miami.\n\nAs with the previous CSI games, there are five cases to work on. However, the game includes improvements on CSI: 3 Dimensions of Murder, like a 3D crime scene kit. The voice of Sara Sidle is again performed by a soundalike (Kate Savage) and not Jorja Fox. Catherine Willows is also replaced by a soundalike in this game, with Edie Mirman standing in for Marg Helgenberger.\n\nThis is Telltale's first console game which was released inline with the PC version. It is Telltale's first Xbox 360 and Wii game. A Mac OS X version was later released by TransGaming, using their Cider technology.\n\n\n\nThe Cases\nCase 1: Burning For You\n\nIn the first case, a taxi driver has been killed in an apparent arson attack inside his car. The player works with Nick Stokes in this case.\n\nDuring the investigation, the victim, was found to be a racist with a criminal record. The details pointed out to a homeless man from Arizona, and two women who are in a relationship, one of them was the victim's old high school prom date and being harassed by him for two weeks.\n\nCase 2: Double Down\n\nA woman is repeatedly stabbed in her house and lives, but doesn't know who hurt her. The player works with Catherine Willows in this case. The husband is initially suspected after the woman is found to have entered into a contract with an aging African-American tycoon to be the surrogate mother for his son. However, after discovering that the husband was oblivious of the arrangement, it is discovered that the wife of the tycoon was only able to bear a daughter, and stabbed the woman in hopes of miscarrying the child, leaving her daughter the sole heir. This case can also be played as the sixth case of the PlayStation 2 version of the 3 Dimensions of Murder game.[citation needed]\n\nCase 3: Shock Rock\n\nThe bodies of four members of a rock band called Bullet Train, are found electrocuted. The player works with Warrick Brown in this case.\n\nThe band members each have a record, except for the young singer. The suspects are the band's roadie/sound-tech, who was picked on by the band, his current lover, who is the band's second choice for a singer, the band's hateful manager, and Bullet Train's ex-singer, who was also the ex-wife of the lead guitar player.\n\nCase 4: In Your Eyes\n\nAn eye surgeon was brutally killed in his own home. the only witness is his blind wife. The player works with Greg Sanders in this case.\n\nDuring the investigation, Suspicion is initially cast on the surgeons daughter, the evidence leads back to the blind wife, in retribution for years of abuse and the botched surgery that left her blind. It is seen that murder was because of torture of the victims daughter.\n\nCase 5: The Peacemaker\n\nThere has been a gun shootout where lots of bullets have been found, and a store clerk is shot repeatedly. One of three brothers are found waiting at the scene with murder weapons in hand. Despite a full confession and mounds of physical evidence, the trail leads back to the other two brothers, enraged at the high school aged clerk, who was having an intimate relationship with the brothers' mother. The player works with Gil Grissom in this case. Evidence finds an old pistol used in the west after which the case is named.\n\nInstall:\n\nMount image with magic ISO and install. No need for disk.\n\n\nEnjoy! AND SEED PLEASE!!!!","torrent":{"xt":"urn:btih:8486834c90b8173538c9285b12f90c53820c6953","amp;dn":"CSI+-+Hard+Evidence+PC+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8486834c90b8173538c9285b12f90c53820c6953","infoHashBuffer":{"type":"Buffer","data":[132,134,131,76,144,184,23,53,56,201,40,91,18,249,12,83,130,12,105,83]},"announce":[],"urlList":[]}}