{"title":"Essential COM by Don Box (PDF e-book)","uid":4455759,"size":35453279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84bf0b960936d677190a2be355858e80ef7542c0&amp;dn=Essential+COM+by+Don+Box+%28PDF+e-book%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Aufseher","files":2,"time":1224469111,"description":"Uploaded by scguy318 on Demonoid\n\nThis is a PDF e-book of the Essential COM book, written by Don Box and published in 1998.\n\nFrom Amazon.com review:\n\n&quot;The Component Object Model (COM) is deep and extremely difficult, making it impossible to grasp the ideas behind this specification quickly or easily. Don Box, the author of Essential COM concedes that it took him six months of reading documentation, writing programs, and experiencing general puzzlement before he had his personal COM epiphany. Nonetheless, if you&amp;#039;re a C++ programmer and you want your skills to continue to be relevant in a PC market dominated by Windows 95 and Windows NT, you need to get going down the path toward your own COM enlightenment. COM is the tool of choice for creating distributed and concurrent systems for modern Microsoft operating systems. If there&amp;#039;s a book that will help you get a handle on the COM phenomenon, Essential COM is it.\n\nEndorsed by object-orientation guru Grady Booch and Microsoft COM expert Charlie Kindel, Box&amp;#039;s book takes the reader from an elucidating discussion of why a demand exists for COM and how it fits into the progression of C++ technology to a cool exhibition of some COM programs he&amp;#039;s written. Along the way, Box covers the four corners of COM interfaces, classes, apartments, and security--all explained in developer&amp;#039;s detail. He also gives attention to access control, marshaling, and Distributed COM (DCOM). Essential COM isn&amp;#039;t an application programming interface (API) reference; it is an exploration of the Tao of COM. As the author says in his preface, you will figure out the how of COM programming quickly, as soon as you grasp the why.&quot;","torrent":{"xt":"urn:btih:84bf0b960936d677190a2be355858e80ef7542c0","amp;dn":"Essential+COM+by+Don+Box+%28PDF+e-book%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84bf0b960936d677190a2be355858e80ef7542c0","infoHashBuffer":{"type":"Buffer","data":[132,191,11,150,9,54,214,119,25,10,43,227,85,133,142,128,239,117,66,192]},"announce":[],"urlList":[]}}