{"title":"[Clips4Sale / BareBackStudios] Taylor Raz (College Girl Father,","uid":15576458,"size":550335471,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:852fe8dd03f4a3ac91bb7ab280c8a25002ae74de&amp;dn=%5BClips4Sale+%2F+BareBackStudios%5D+Taylor+Raz+%28College+Girl+Father%2C&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"LucasCar","files":2,"time":1471342311,"description":"[Clips4Sale / BareBackStudios] Taylor Raz (College Girl Father &amp; Daughter) 480p [Roleplay]\r\n\r\nScene One:Pledging to a sorority\r\n\r\nTaylor comes home after her first semester of college. She has completely changed from daddy's little girl to a woman in what is only a few months. Her dad is shocked at the changes he sees in her. She tells him not to worry, and asks him for a favor.\r\n\r\nShe is pledging to a sorority and to get in she has to suck her fathers cock. She puts her hand down his shorts telling him that she has to do this and that he will like it. Taylor pulls down her dads shorts and begins to jerk his cock. She teases him with her tongue before fully taking his dick into her mouth. She gives him a better blowjob than he has ever had.\r\n\r\nPicking up her phone she snaps a few photos of her with her dads dick in her mouth for the sorority girls. Not being able to take anymore her dad cums. She takes a pic of her cum filled mouth and thanks her dad for the help.\r\n\r\nScene Two: Does this make you uncomfortable?\r\n\r\nDad is sitting on the couch when Taylor walks through the living room completely naked. She goes into the kitchen and grabs a beer and returns to the couch exposing her pussy while sitting. She complains about the heat and rubs the cold beer over her body. She asks her dad if this makes him uncomfortable looking at her hot tight body?\r\n\r\nCrawling over to him she giggles that she made her dad's cock so hard. She pulls off his shorts and sucks on his cock again. He asks her what she is doing, and she tells him she is getting him ready to fuck her.\r\n\r\nShe pulls herself onto his cock and fucks her dad. Losing himself in the moment he fucks her back and she moans with excitement. Holding his little girl by the hips he fucks her until she loudly cums. The sound of her cumming causes him to cum and he shoots his load into his daughters pussy.\r\n\r\nScene Three: How I got good grades\r\n\r\nAfter living on campus for one semester Taylor has emptied her bank account. She decides to ask her dad for more money. Dressed in lingerie Taylor walks into her dads bedroom and asks him for some cash. When he refuses, she begins to dance showing him how she gets her professors to give her good grades without having to go to class.\r\n\r\nPulling down her top she plays with her tits for him, then moves her hands down to play with her pussy. When she sees his dick get hard she pounces jumping on her dad's cock. She fucks him hard on the bed until she cums again on her dad's dick. She licks her dad's cock clean and sucks him begging him to cum in her mouth. Taylor swallows her father's huge load and asks him how much he is going to give her.\r\n\r\nScene Four:The deal\r\n\r\nTaylor's dad does not want her to go back to college. She is been nothing but a slut there. Taylor makes her dad a deal. She promises not to fuck any men if her dad can fuck her better than she has ever been fucked before. As her dad pulls off her clothes Taylor taunts him making her dad angry.\r\n\r\nShoving his cock into her mouth he face fucks her in the bed. Her moans are muffled as she rubs her pussy. Like a jackhammer he fucks her around the room making her cum over and over again. His cock drills her into a puddle of pleasure. He jerks his cock onto her face sending streams of cum to cover her.\r\n\r\nExhausted and destroyed Taylor agrees to the deal, but she did not say anything about fucking girls at college.\r\n \nhttp://screenimage.net/img-57b2cac36da6e.html \r\n \nhttp://screenimage.net/img-57b2cac6398f7.html \r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:852fe8dd03f4a3ac91bb7ab280c8a25002ae74de","amp;dn":"%5BClips4Sale+%2F+BareBackStudios%5D+Taylor+Raz+%28College+Girl+Father%2C","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"852fe8dd03f4a3ac91bb7ab280c8a25002ae74de","infoHashBuffer":{"type":"Buffer","data":[133,47,232,221,3,244,163,172,145,187,122,178,128,200,162,80,2,174,116,222]},"announce":[],"urlList":[]}}