{"title":"Hank Williams III - Ramblin' Man (2014) {FLAC} vtwin88cube","uid":10384920,"size":187113453,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85d3a3fcd52e40b9774c77c357d1d1afce4c4727&amp;dn=Hank+Williams+III+-+Ramblin%27+Man+%282014%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1403124283,"description":"Hank Williams III\nRamblin' Man EP (2014)\n\n\n\n\n\nallmusic.com...\n\nAs his fans know by now, Hank Williams III made it clear he didn't want to play nice with Curb Records after they signed the renegade country artist in 1996 and quickly discovered he was also into punk and metal and wanted to add those sounds to his recorded repertoire. Hank's contract ran out in 2010, and Ramblin' Man is the third album Curb has released since Hank III moved on. With only eight songs and a total running time of 27 minutes, it's more like an EP than a full-length, and most of this material will sound pretty familiar to Hank III completists. &quot;Okie from Muskogee&quot; and the title cut both come from sessions with the Melvins that appeared on their 2000 album The Crybaby, &quot;Fearless Boogie&quot; comes from the 2002 ZZ Top tribute Sharp Dressed Men, &quot;I'm the Only Hell (My Mamma Ever Raised)&quot; was previously released on the 2004 Johnny Paycheck tribute disc Touch My Heart, and &quot;Marijuana Blues&quot; popped up on the 2010 Peter La Farge tribute Rare Breed. Elsewhere, &quot;On My Own&quot; is a longer take of the same tune that appeared on Hank III's Risin' Outlaw in 1999, and &quot;Hang On&quot; was first released on the soundtrack to the 2001 Sylvester Stallone vehicle Driven. That leaves the previously bootleg-only Assjack track &quot;Runnin' and Gunnin'&quot; as the only &quot;new&quot; item to appear on Ramblin' Man. While the mix of country and raw rock material on this collection certainly gives it more of the flavor of Hank III's genre-bending style, Ramblin' Man is best recommended for casual Hank III fans who haven't gotten caught up with many of the tracks he's cut for tribute albums and other collections; otherwise, this set feels short and not so sweet, despite the strength of a few genuinely strong tracks. \n\n\nGenre................: Country\nSource...............: CD {Curb D2-79382}\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Front Cover, Cue, Log, Audiochecker\n\n\n\n01.Ramblin' Man\n02.Fearless Boogie\n03.Okie From Muskogee\n04.I'm The Only Hell My Mama Ever Raised\n05.On My Own (Full Length Version)\n06.Marijuana Blues\n07.Hang On\n08.Runnin' And Gunnin'\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers...","torrent":{"xt":"urn:btih:85d3a3fcd52e40b9774c77c357d1d1afce4c4727","amp;dn":"Hank+Williams+III+-+Ramblin%27+Man+%282014%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85d3a3fcd52e40b9774c77c357d1d1afce4c4727","infoHashBuffer":{"type":"Buffer","data":[133,211,163,252,213,46,64,185,119,76,119,195,87,209,209,175,206,76,71,39]},"announce":[],"urlList":[]}}