{"title":"One Day in the Life of Ivan Denisovich (1970)","uid":8832581,"size":419061799,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:865546f08a5aa8c0b43339ed8a4bb3f759ae6a05&amp;dn=One+Day+in+the+Life+of+Ivan+Denisovich+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"glngwl","files":1,"time":1377027026,"description":"Joint Norwegian-British 1970 film based on the novel of the same name by Aleksandr Solzhenitsyn. The film stars Tom Courtenay as the title character, a prisoner in a Soviet gulag in the 1950s who endures a long prison sentence, and tells of one routine day in his life. It wasn't a particularly noteworthy day, for any reason other than it was what it was. The sense of hopelessness is very moving.\n\nThe film is closely adapted from Solzhenitsyn's 1962 novel based on his own experiences. (Solzhenitsyn was later expelled from the Soviet Writers' Union in 1969, and was awarded the Nobel Prize in Literature the following year in 1970 at which time this work was specifically cited. In 1974 he was arrested, then deported from the Soviet Union.  He returned to Russia only in 1994 after the dissolution of the Soviet Union. Russian and world leaders paid tribute to him when he died near Moscow in 2008.\n\nThis film is very hard to find.  This copy is a YouTube rip, so it's not my encode. The audio/video quality is not great - but the film has never had a DVD release, and is not available here otherwise, so many people might want this.\n\nThis is the 105-minute version, which plays at the correct speed (ie, not the sped-up version with the 100-minute running time).\n\nResolution: 478 x 360\nFilesize: 399.65 gB\nFilm running time: 1hr 45m 10s","torrent":{"xt":"urn:btih:865546f08a5aa8c0b43339ed8a4bb3f759ae6a05","amp;dn":"One+Day+in+the+Life+of+Ivan+Denisovich+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"865546f08a5aa8c0b43339ed8a4bb3f759ae6a05","infoHashBuffer":{"type":"Buffer","data":[134,85,70,240,138,90,168,192,180,51,57,237,138,75,179,247,89,174,106,5]},"announce":[],"urlList":[]}}