{"title":"The Book of Ninja BANSENSHUKAI (2013) epub","uid":9164615,"size":9756236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86d74f21a83fdfaf7043d4f07dc83fc15306e5e3&amp;dn=The+Book+of+Ninja+BANSENSHUKAI+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1383946511,"description":"The Book of Ninja, the ultimate ninjutsu manual, was penned in 1676 by a ninja known as Fujibayashi. Born in the post-civil war era of Japan, Fujibayashi collected and combined information from the ninja clans of Iga - regarded to be the homeland of the ninja - and compiled it into an authoritative book. Known as The Bansenhukai, this book has now been translated into English by the Historical Ninjutsu Research Team. It is widely considered to be the 'bible' of 'ninjutsu', the arts of the ninja.\n\n The Book of Ninja begins with an in-depth introduction to the history of Fujibayashi's scripture. Then the teachings themselves, appealingly rendered in this translation, take us into the secrets of guerilla warfare and espionage. We learn how to become the ultimate spy, whether through a network of spies or by hiding in plain sight. Through the stealth and concealment tactics of night-time infiltration and through weapon and tool building skills, as well as mission planning, we can learn much both about warfare and about adopting the right mindset for tackling our own inner and outer enemies. Adding to the mix for the spycraft lover, there are sections on capturing criminals, performing night raids, making secret codes and signs, and even techniques for predicting the weather and using an esoteric Buddhist system of divination.\n\n An exciting and engaging tome of lost knowledge, The Book of the Ninjais the final say in the world of the ninja and the ultimate classic for samurai and ninja enthusiasts alike.","torrent":{"xt":"urn:btih:86d74f21a83fdfaf7043d4f07dc83fc15306e5e3","amp;dn":"The+Book+of+Ninja+BANSENSHUKAI+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d74f21a83fdfaf7043d4f07dc83fc15306e5e3","infoHashBuffer":{"type":"Buffer","data":[134,215,79,33,168,63,223,175,112,67,212,240,125,200,63,193,83,6,229,227]},"announce":[],"urlList":[]}}