{"title":"Galbraith - Money - Whence It Came, Where It Went (1975)","uid":7065993,"size":999304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86f587650340b08b617b0e9de04a7eac2959ebc6&amp;dn=Galbraith+-+Money+-+Whence+It+Came%2C+Where+It+Went+%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"red_gonzo","files":1,"time":1330513050,"description":"This is John Kenneth Galbraith's informative book Money - Whence It Came, Where It Went (1975) which is an easily read and easily comprehended history of how the western industrialized countries have created, adapted, and managed their monetary systems. Written by one of the post-WWII-era's most famous economists, it's as much a lesson in American history and politics as it is in economics. Galbraith seeks to show how the management of monetary systems, driven by the interests of the rich and supported at times by conservative ideology, has been fraught with error, corruption, and more commonly - simple incompetence. Ultimately Galbraith's Money is an excellent and understandable introduction to the various efforts over the last several centuries to manage monetary systems. But the reader is given more than monetary and Keynesian theory and is engaged in a wonderful, if broad-brushed economic history of the United States. Years ago, an argument could be made that &quot;Money&quot; was out of date. A second look at recent crises born of monetary policy suggests that &quot;Money&quot; is a relevant reminder that there is still much to learn. 320 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:86f587650340b08b617b0e9de04a7eac2959ebc6","amp;dn":"Galbraith+-+Money+-+Whence+It+Came%2C+Where+It+Went+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f587650340b08b617b0e9de04a7eac2959ebc6","infoHashBuffer":{"type":"Buffer","data":[134,245,135,101,3,64,176,139,97,123,14,157,224,74,126,172,41,89,235,198]},"announce":[],"urlList":[]}}