{"title":"The Shanghai Restoration Project -- Pictures In Motion","uid":9174192,"size":71533308,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:873efa52c8f80f1bbc264cf0ae097ee75433c1e8&amp;dn=The+Shanghai+Restoration+Project+--+Pictures+In+Motion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"elder_g4","files":12,"time":1384120206,"description":"In the early 1900s, Hollywood was enamored with Shanghai. Cinema legends ranging from Charlie Chaplin (Shanghaied 1915) to Alfred Hitchcock (East of Shanghai 1932) to Orson Welles (Lady from Shanghai 1948) all found themselves inspired by the cosmopolitan Chinese city at some point during this period. In 1932, Josef von Sternberg's Shanghai Express even made its way to the Oscar stage, winning the award for Best Cinematography. Despite this industry-wide fascination with Shanghai, many Western filmmakers still viewed the city through a narrow exoticed lens. In fact, the city itself hardly appeared in any of the films while cultural differences between the East and West were often grossly exaggerated on Hollywood sound stages.\n\nTo catch a more authentic glimpse of Shanghai during this time, one should turn to the Chinese films of this era, many of which remain popular to this day. Entertaining classics of all genres were created including the slapstick comedy è¿˜ä¹¡æ—¥è®° -Diary of the Homecoming (1947), the action packed Greedy Neighbors (1933), the romantic dilemma Spring in a Small Town (1948), the costume drama Dream of the Red Mansions (1944), and the horror flick Song at Midnight (1937). On the animated front, cartoons such as Princess Iron Fan (1941), The Conceited General (1956), and Uproar in Heaven (1964) captured audiences of all ages with their beautiful imagery and slightly subversive content.\n\nPictures in Motion, the latest album from the electronic group The Shanghai Restoration Project, pays tribute to these classic films with a collection of twelve mostly original compositions, each inspired by a different movie from the era. Primarily instrumental, the tracks reflect the mood and themes of each film (sometimes light-hearted and fun, sometimes majestic and uplifting, other times dark and brooding). The last song on the album, a remake of the classic &quot;The Wandering Songstress&quot; from the famous film Street Angel (1937), features renowned Shanghainese jazz vocalist Zhang Le. \n\nEnjoy the show.","torrent":{"xt":"urn:btih:873efa52c8f80f1bbc264cf0ae097ee75433c1e8","amp;dn":"The+Shanghai+Restoration+Project+--+Pictures+In+Motion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"873efa52c8f80f1bbc264cf0ae097ee75433c1e8","infoHashBuffer":{"type":"Buffer","data":[135,62,250,82,200,248,15,27,188,38,76,240,174,9,126,231,84,51,193,232]},"announce":[],"urlList":[]}}