{"title":"Congo: The Epic History of a People (2014) epub","uid":10100040,"size":2194957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87542b26c30d09c3f772408288f1140a2583ee7d&amp;dn=Congo%3A+The+Epic+History+of+a+People+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1399336670,"description":"The gripping saga of one of the world's most devastated countries\n\n The Democratic Republic of Congo currently ranks among the world's most failed nation-states, second only to war-torn Somalia. David Van Reybrouck's Congo: The Epic History of a People traces the history of this devastated nation from the beginnings of the slave trade through the arrival of Sir Henry Morton Stanley, the ivory and rubber booms, colonization, the struggle for independence, and the three decades of Mobutu's brutal rule. Van Reybrouck also examines the civil war--the world's deadliest conflict since the Second World War. Still raging today after seventeen years, the Congolese war is driven, in part, by the demand for the rare-earth minerals required to make cell phones.\n\n Van Reybrouck has balanced hundreds of interviews with meticulous historical research to construct a many-dimensional portrait of the rich and convoluted history of Congo. Taking pains to seek out the Congolese perspective on the country's history, Van Reybrouck creates a panoramic canvas wherein the child soldiers whom he encounters in the eastern rebel territories talk candidly about their choices and misfortunes, and where elderly Congolese--some of them more than one hundred years old--reminisce about their lives in a country where the average life expectancy has dropped to forty-five.","torrent":{"xt":"urn:btih:87542b26c30d09c3f772408288f1140a2583ee7d","amp;dn":"Congo%3A+The+Epic+History+of+a+People+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87542b26c30d09c3f772408288f1140a2583ee7d","infoHashBuffer":{"type":"Buffer","data":[135,84,43,38,195,13,9,195,247,114,64,130,136,241,20,10,37,131,238,125]},"announce":[],"urlList":[]}}