{"title":"Operating System Concepts, 9th Edition.","uid":11237455,"size":7038104,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:878a84a51bb5bd6abba2eac92146b92b087fd92d&amp;dn=Operating+System+Concepts%2C+9th+Edition.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"lordwito","files":1,"time":1413611436,"description":"Description\n\nOperating System Concepts, now in its ninth edition, continues to provide a solid theoretical foundation for understanding operating systems. The ninth edition has been thoroughly updated to include contemporary examples of how operating systems function. The text includes content to bridge the gap between concepts and actual implementations. End-of-chapter problems, exercises, review questions, and programming exercises help to further reinforce important concepts.  A new Virtual Machine provides interactive exercises to help engage students with the material.\n\n\nNew To This Edition\n\nNew, updated content throughout including increased coverage of multicore systems and parallel programming, new coverage of mobile systems including IOS and Android, updated coverage of Memory, and an update of the Linux chapter to include the 3.4 kernel.\n\nNew chapters on virtual machines and Windows 7.\n\nIntegrated coverage of Linux and Windows throughout.\n\nStreamlined the second half of the book by consolidating three networking chapters into one completely rewritten  chapter and eliminating the multimedia chapter.\n\nMany new exercises, programming problems, and programming projects.\n\nOffers a more interactive experience with exercises using a Linux Virtual Machine with GCC development environment and Linux source code distribution","torrent":{"xt":"urn:btih:878a84a51bb5bd6abba2eac92146b92b087fd92d","amp;dn":"Operating+System+Concepts%2C+9th+Edition.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"878a84a51bb5bd6abba2eac92146b92b087fd92d","infoHashBuffer":{"type":"Buffer","data":[135,138,132,165,27,181,189,106,187,162,234,201,33,70,185,43,8,127,217,45]},"announce":[],"urlList":[]}}