{"title":"Through.the.Wormhole.Series.5.08of10.Will.We.Become.God.720p.HDT","uid":12010571,"size":1001259758,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:879559b1c256f1c7d804626406b35d0bc423ef90&amp;dn=Through.the.Wormhole.Series.5.08of10.Will.We.Become.God.720p.HDT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"artistharry","files":1,"time":1434102282,"description":"Through the Wormhole: Series 5\n\nScience Documentary hosted by Morgan Freeman, published by Discovery Channel in 2014 - English narration\n      &lt;a href=&quot;\nhttp://docuwiki.net/images/b/b7/Through-the-Wormhole-Series-5-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/b/b7/Through-the-Wormhole-Series-5-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nThrough the Wormhole: Series 5\nIn this fifth season, Morgan Freeman walks us Through The Wormhole and into the mind-bending realities defining our universe. Exploring topics from gravity to poverty, these ten episodes set out on scientific quests for answers to our most puzzling questions. Is there such a thing as a shadow universe? When did time begin? Is a zombie apocalypse possible? Does the ocean think? Quantum physicists, biologists, statisticians, neuroscientists, and more of the world s greatest minds take a synergistic approach to provide practical answers and pose even more questions in an attempt to explain the unexplained.\n\n\n1)  Is God an Alien Concept \nIs God worshipped in other worlds, across the cosmos? How might alien deities differ from our own? The answer may lie buried on Earth. Animal behaviorists are testing elephants and finding them capable of having spiritual thoughts. Artificial intelligence researchers are building enlightened robots that contemplate the divine. Meanwhile, cosmologists are looking for universal equations that could replace God. Have advanced aliens discovered everything there is to know about the universe? Or are they looking to a higher power for answers?\n\n2)  Is Luck Real \nDo you make your own luck, or does luck make you? Some scientists believe luck is strictly a matter of statistics and probabilities...but others believe unseen forces are at work, and randomness is built into every particle of the universe. We'll find luck, good and bad, in casinos, basketball courts, genetics labs and the subatomic world. How much does the genetic lottery rule your fate? Are lucky streaks and unfortunate accidents merely our own minds fooling us? It's a scientific journey that will radically revise your understanding of the laws of nature and the workings of the human brain.\n\n3)  Is Poverty Genetic \nAre the wealthy just born in the right place at the right time? Are the poor victims of a system designed to keep them down? Or do physics and biology determine who is rich and who is poor? Throughout history, distribution of wealth is governed by hidden forces: DNA, environmental stress, patterns of human migration and even the laws of thermodynamics! Nature seems to demand winners and losers in life. But does this mean greed is king, and the rich can take what they want? Or is cooperation - between microorganisms, monkeys, and humans - more essential to survival of a species?\n\n4)  How to Collapse a Superpower \nWith a little imagination, could a few terrorists sabotage a mighty nation? Perhaps even tear down modern civilization? The stability of the US, Europe, China, or any global power depends on high-speed digital communication. Our increasing dependence on digital devices and global interactivity may be placing us in grave danger. Scientists around the world are dealing with new threats such as body hacking, Trojan horse viruses, and brain-damaging Internet addiction. But what if the ultimate threat isn't an attack on technology, but the technology? Could the final superpower be the disembodied mind of the Internet itself?\n\n5)  Does the Ocean Think \nThere could be an undiscovered species on Earth unlike anything we've ever known. Not in the ocean, but the ocean itself! Its body spans thousands of miles; its heart beats with a one-thousand-year pulse. It could even have an immune system capable of annihilating all other life on earth. Just as our bodies function through the interaction of water with individual cells, including bacteria and other microorganisms, the ocean's residents might collectively form a super-organism. A recent discovery suggests the ocean is a living being capable of thought. If so, what is the ocean thinking about us?\n\n6)  Is a Zombie Apocalypse Possible \nIt is a nightmare that has stalked us for centuries: hordes of human beings transformed into mindless, cannibalistic monsters. Could this civilization-ending nightmare become reality? Scientists have discovered pathogens that turn insects into the walking dead. New strains of viruses are attacking humans every day. Mathematicians have calculated the likelihood of surviving a zombie virus outbreak: they're not hopeful. Now neuroscientists are discovering how easy it is for us to lose conscious control of our bodies. Are we at risk of becoming puppets? If we were in the middle of a zombie apocalypse, would we even know it?\n\n7)  Is Gravity an Illusion \nWe feel it every moment of our lives but for physicists, gravity is the longest running unsolved mystery of the universe. Why do all objects that have mass pull on one another? Cutting-edge theories are proposing unexpected answers: Gravity could be another force in disguise, a thermodynamic mirage, or even, a shadow of a hidden holographic universe. If so, the force that holds us to the surface of the earth, and holds the earth in orbit around the sun, may be a trick of the mind. We feel it, but it may not be real. Is Gravity an Illusion?\n\n8)  Will We Become God \nHumanity's potential seems limitless. But could we become as powerful as God? Scientific breakthroughs grant our species seemingly divine abilities. Biologists tinkering with DNA are figuring out ways to grow new life forms, while neuroscientists try to create artificial consciousness. Statisticians around the world are using big data to predict the future and computer scientists have discovered a &quot;God algorithm&quot; that could solve any global problem in an instant. But to truly become God, we not only have to be all knowing, but all being. Quantum physicists are figuring out how to teleport matter at the speed of light!\n\n9)  Is there a Shadow Universe \nWhen we look up into the sky it appears we live in a universe that is filled with light. But scientists are now certain there is far more matter in the dark portions of our universe that we can't see or touch. There's something hiding in the shadows. Cosmologists agree that &quot;dark matter&quot; has helped shape our Universe, but now they need to figure out what dark matter is. What's going on in this hidden world? Could it have formed its own dark stars, planets, and even life forms? Could this Shadow Universe threaten our world of light?\n\n10)  When Did Time Begin \nWe float along the river of time. But does that river have a source? Where did time come from? Some believe time and space are one thing, and the Big Bang started the cosmic clock. Others believe the universe existed for almost half a million &quot;years&quot; before light could move and time began. Still others say time is older than our universe. But what if time itself is an illusion? Incredible new experiments may hold the answer. One groundbreaking experiment gives us the power to punch holes in time...and another may create a machine that operates outside time's boundaries!\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;115c70787f515d223f20&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3186 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/s VBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 44mins\n * Framerate: 23.976 fps\n * Number of Parts: 10\n * Container Mp4\n * Part Size: 981 MB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:879559b1c256f1c7d804626406b35d0bc423ef90","amp;dn":"Through.the.Wormhole.Series.5.08of10.Will.We.Become.God.720p.HDT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879559b1c256f1c7d804626406b35d0bc423ef90","infoHashBuffer":{"type":"Buffer","data":[135,149,89,177,194,86,241,199,216,4,98,100,6,179,93,11,196,35,239,144]},"announce":[],"urlList":[]}}