{"title":"Legion: Skin Deep - Brandon Sanderson - Audiobook MP3","uid":11569524,"size":128441142,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87edd498781815502755fdb20edca0ca8ea97440&amp;dn=Legion%3A+Skin+Deep+-+Brandon+Sanderson+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1416998660,"description":"This is the second book in the Legion series. The first book is simply called &quot;Legion.&quot;  Search, or get it with one of the following torrent hashes\n55E76ED45C820B5AA4500844115BB9F2EAEB6EFD\nor \nAD40A45BFB0F617A4E4816283C12B7580CFD1B52\n\n\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\n\nLegion: Skin Deep\n\nWritten by: Brandon Sanderson\nNarrated by: Oliver Wyman\nLength: 4 hrs and 23 mins\nSeries: Legion, Book 2\nUnabridged Audiobook\nRelease Date:11-24-14\n\nBrandon Sanderson is one of the most significant fantasists to enter the field in a good many years. His ambitious, multi-volume epics (Mistborn, The Stormlight Archive) and his stellar continuation of Robert Jordan's Wheel of Time series have earned both critical acclaim and a substantial popular following. In Legion, a short, distinctly contemporary novella filled with suspense, humor, and an endless flow of invention, Sanderson revealed a startling new facet of his singular narrative talent. In the stunning sequel, Legion: Skin Deep, that talent is on full display.\n\nStephen Leeds, AKA ''Legion',' is a man whose unique mental condition allows him to generate a multitude of personae: hallucinatory entities with a wide variety of personal characteristics and a vast array of highly specialized skills. As the new story begins, Leeds and his &quot;aspects&quot; are hired by I3 (Innovative Information Incorporated) to recover a corpse stolen from the local morgue. But there's a catch. The corpse is that of a pioneer in the field of experimental biotechnology, a man whose work concerned the use of the human body as a massive storage device. He may have embedded something in the cells of his now dead body. And that something might be dangerous... What follows is a visionary thriller about the potential uses of technology, the mysteries of the human personality, and the ancient human need to believe that death is not the end. Legion: Skin Deep is speculative fiction at its most highly developed. It reaffirms Sanderson's place as one of contemporary fiction's most intelligent - and unpredictable - voices","torrent":{"xt":"urn:btih:87edd498781815502755fdb20edca0ca8ea97440","amp;dn":"Legion%3A+Skin+Deep+-+Brandon+Sanderson+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87edd498781815502755fdb20edca0ca8ea97440","infoHashBuffer":{"type":"Buffer","data":[135,237,212,152,120,24,21,80,39,85,253,178,14,220,160,202,142,169,116,64]},"announce":[],"urlList":[]}}