{"title":"Joe Abercrombie - Best Served Cold","uid":11610175,"size":1144132562,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87f6559c762e3d0597c0a6785c36a85a16fa967f&amp;dn=+Joe+Abercrombie+-+Best+Served+Cold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":23,"time":1417444198,"description":" Joe Abercrombie - Best Served Cold\n\n\nRead by Steven Pacey\n\nSpringtime in Styria. And that means war.\n\nThere have been nineteen years of blood. The ruthless Grand Duke Orso is locked in a vicious struggle with the squabbling League of Eight, and between them they have bled the land white. Armies march, heads roll and cities burn, while behind the scenes bankers, priests and older, darker powers play a deadly game to choose who will be king.\n\nWar may be hell but for Monza Murcatto, the Snake of Talins, the most feared and famous mercenary in Duke Orso's employ, it's a damn good way of making money too. Her victories have made her popular - a shade too popular for her employer's taste. Betrayed and left for dead, Murcatto's reward is a broken body and a burning hunger for vengeance. Whatever the cost, seven men must die.\n\nHer allies include Styria's least reliable drunkard, Styria's most treacherous poisoner, a mass-murderer obsessed with numbers and a Northman who just wants to do the right thing. Her enemies number the better half of the nation. And that's all before the most dangerous man in the world is dispatched to hunt her down and finish the job Duke Orso started","torrent":{"xt":"urn:btih:87f6559c762e3d0597c0a6785c36a85a16fa967f","amp;dn":"+Joe+Abercrombie+-+Best+Served+Cold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f6559c762e3d0597c0a6785c36a85a16fa967f","infoHashBuffer":{"type":"Buffer","data":[135,246,85,156,118,46,61,5,151,192,166,120,92,54,168,90,22,250,150,127]},"announce":[],"urlList":[]}}