{"title":"Dictionary of Untranslatables - A Philosophical Lexicon (gnv64)","uid":11155249,"size":66873844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:884ae14dbf6c20bc2600e1b8e3e77169488f8338&amp;dn=Dictionary+of+Untranslatables+-+A+Philosophical+Lexicon+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1412399355,"description":"Dictionary of Untranslatables: A Philosophical Lexicon  \nby Barbara Cassin, Emily Apter, Jacques Lezra and Michael Wood\nPrinceton University Press | February 2014 | ISBN-10: 0691138702 | PDF | 1344 pages | 63.7 mb\n\nThis is an encyclopedic dictionary of close to 400 important philosophical, literary, and political terms and concepts that defy easy--or any--translation from one language and culture to another. Drawn from more than a dozen languages, terms such as Dasein (German), pravda (Russian), saudade (Portuguese), and stato (Italian) are thoroughly examined in all their cross-linguistic and cross-cultural complexities. Spanning the classical, medieval, early modern, modern, and contemporary periods, these are terms that influence thinking across the humanities. The entries, written by more than 150 distinguished scholars, describe the origins and meanings of each term, the history and context of its usage, its translations into other languages, and its use in notable texts. The dictionary also includes essays on the special characteristics of particular languages--English, French, German, Greek, Italian, Portuguese, Russian, and Spanish.\nOriginally published in French, this one-of-a-kind reference work is now available in English for the first time, with new contributions from Judith Butler, Daniel Heller-Roazen, Ben Kafka, Kevin McLaughlin, Kenneth Reinhard, Stella Sandford, Gayatri Chakravorty Spivak, Jane Tylus, Anthony Vidler, Susan Wolfson, Robert J. C. Young, and many more.The result is an invaluable reference for students, scholars, and general readers interested in the multilingual lives of some of our most influential words and ideas.\n\n-  Covers close to 400 important philosophical, literary, and political terms that defy easy translation between languages and cultures\n-  Includes terms from more than a dozen languages\n-  Entries written by more than 150 distinguished thinkers\n-  Available in English for the first time, with new contributions by Judith Butler, Daniel Heller-Roazen, Ben Kafka, Kevin McLaughlin, Kenneth Reinhard, Stella Sandford, Gayatri Chakravorty Spivak, Jane Tylus, Anthony Vidler, Susan Wolfson, Robert J. C. Young, and many more\n-  Contains extensive cross-references and bibliographies\n-  An invaluable resource for students and scholars across the humanities\n\nCONTENTS\nPreface vii\nIntroduction xvii\nHow to Use This Work xxi\nPrincipal Collaborators xxiii\nContributors xxv\nTranslators xxxiii\nEntries A to Z 1\nReference Tools 1269\nIndex 1275","torrent":{"xt":"urn:btih:884ae14dbf6c20bc2600e1b8e3e77169488f8338","amp;dn":"Dictionary+of+Untranslatables+-+A+Philosophical+Lexicon+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"884ae14dbf6c20bc2600e1b8e3e77169488f8338","infoHashBuffer":{"type":"Buffer","data":[136,74,225,77,191,108,32,188,38,0,225,184,227,231,113,105,72,143,131,56]},"announce":[],"urlList":[]}}