{"title":"Girl Walks into a Bar - Comedy Calamities, Dating Disasters, and","uid":7190279,"size":1703802,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88614a3c7bee5c12130a482fe7690f35adeb1e4d&amp;dn=Girl+Walks+into+a+Bar+-+Comedy+Calamities%2C+Dating+Disasters%2C+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tduckin","files":-1,"time":1334592927,"description":"PER REQUEST\n\n\nIn this side-splitting memoir, the former Saturday Night Live star recounts the hilarious adventures and unexpected joy of dating and becoming a mother when she least expected it-at the age of forty-four.\n\nAnyone who saw an episode of Saturday Night Live between 1999 and 2006 knows Rachel Dratch. She was hilarious! So what happened to her? After a misbegotten part as Jenna on the pilot of 30 Rock, Dratch was only getting offered roles as &quot;Lesbians. Secretaries. Sometimes secretaries who are lesbians.&quot;\n\nHer career at a low point, Dratch suddenly had time for yoga, dog- sitting, learning Spanish-and dating. After all, what did a forty- something single woman living in New York have to lose? Resigned to childlessness but still hoping for romance, Dratch was out for drinks with a friend when she met John.\n\nHandsome and funny, after only six months of dating long-distance, he became the inadvertent father of her wholly unplanned, undreamed-of child, and moved to New York to be a dad. With riotous humor, Dratch recounts breaking the news to her bewildered parents, the awe of her single friends, and the awkwardness of a baby-care class where the instructor kept tossing out the f-word.\n\nFilled with great behind-the-scenes anecdotes from Dratch's time on SNL, Girl Walks into a Bar is a refreshing version of the &quot;happily ever after&quot; story that proves female comics-like bestsellers Tina Fey and Chelsea Handler-are truly having their moment. ","torrent":{"xt":"urn:btih:88614a3c7bee5c12130a482fe7690f35adeb1e4d","amp;dn":"Girl+Walks+into+a+Bar+-+Comedy+Calamities%2C+Dating+Disasters%2C+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88614a3c7bee5c12130a482fe7690f35adeb1e4d","infoHashBuffer":{"type":"Buffer","data":[136,97,74,60,123,238,92,18,19,10,72,47,231,105,15,53,173,235,30,77]},"announce":[],"urlList":[]}}