{"title":"Ending Aging (2007) by Aubrey de Grey &amp; Michael Rae","uid":10554735,"size":1111541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:889fc02b4071a115c8957b6adcdf10f267743400&amp;dn=Ending+Aging+%282007%29+by+Aubrey+de+Grey+%26amp%3B+Michael+Rae&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"321boomboom","files":-1,"time":1405375513,"description":"Ending Aging - The Rejuvenation Breakthroughs That Could Reverse Human Aging in Our Lifetime (2007) by Aubrey de Grey &amp; Michael Rae.epub\n\nA long life in a healthy, vigorous, youthful body has always been one of humanity's greatest dreams. Recent progress in genetic manipulations and calorie-restricted diets in laboratory animals hold forth the promise that someday science will enable us to exert total control over our own biological aging.\n\nNearly all scientists who study the biology of aging agree that we will someday be able to substantially slow down the aging process, extending our productive, youthful lives. Dr. Aubrey de Grey is perhaps the most bullish of all such researchers. As has been reported in media outlets ranging from 60 Minutes to The New York Times, Dr. de Grey believes that the key biomedical technology required to eliminate aging-derived debilitation and death entirely--technology that would not only slow but periodically reverse age-related physiological decay, leaving us biologically young into an indefinite future--is now within reach.\n \nIn Ending Aging, Dr. de Grey and his research assistant Michael Rae describe the details of this biotechnology. They explain that the aging of the human body, just like the aging of man-made machines, results from an accumulation of various types of damage.  As with man-made machines, this damage can periodically be repaired, leading to indefinite extension of the machine's fully functional lifetime, just as is routinely done with classic cars.  We already know what types of damage accumulate in the human body, and we are moving rapidly toward the comprehensive development of technologies to remove that damage.  By demystifying aging and its postponement for the nonspecialist reader, de Grey and Rae systematically dismantle the fatalist presumption that aging will forever defeat the efforts of medical science.\n\n389 pages\nPublisher: St. Martin's Press; 1st edition (September 4, 2007)\nLanguage: English\nISBN-10: 0312367066\nISBN-13: 978-0312367060","torrent":{"xt":"urn:btih:889fc02b4071a115c8957b6adcdf10f267743400","amp;dn":"Ending+Aging+%282007%29+by+Aubrey+de+Grey+%26amp%3B+Michael+Rae","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"889fc02b4071a115c8957b6adcdf10f267743400","infoHashBuffer":{"type":"Buffer","data":[136,159,192,43,64,113,161,21,200,149,123,106,220,223,16,242,103,116,52,0]},"announce":[],"urlList":[]}}