{"title":"Fleetwood Mac - Rumours and Bonus 2004 [FLAC] - Kitlope","uid":7057424,"size":671681607,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89099a31dd70e5b63b6108f2bc7bc81d7cbc9a72&amp;dn=Fleetwood+Mac+-+Rumours+and+Bonus+2004+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Kitlope","files":37,"time":1330185054,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 89099A31DD70E5B63B6108F2BC7BC81D7CBC9A72\nFile Size: 640.56 MB\nYear: Original release: 1977; Remastered 2004\nLabel: Warner\nCatalog #: R2 73882\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nFleetwood Mac are a British-American rock band formed in 1967 in London.\n\nThe only original member present in the band is its eponymous drummer, Mick Fleetwood. Despite band founder Peter Green naming the group by combining the surnames of two of his former bandmates (Fleetwood, McVie) from John Mayall's Bluesbreakers, bassist John McVie played neither on their first single nor at their first concerts. The keyboardist, Christine McVie, has, to date, appeared on all but two albums, either as a member or as a session musician. She also supplied the artwork for the album Kiln House.\n\nThe two most successful periods for the band were during the late 1960s British blues boom, when they were led by guitarist Peter Green and achieved a UK number one with &quot;Albatross&quot;; and from 1975 to 1987, with more pop-orientation, featuring Christine McVie, Lindsey Buckingham and Stevie Nicks. Fleetwood Mac's second album after the incorporation of Nicks and Buckingham, 1977's Rumours, produced four U.S. Top 10 singles (including Nicks' song &quot;Dreams&quot;, which was the band's first and only U.S. number one) and remained at No.1 on the American albums chart for 31 weeks, as well as reaching the top spot in various countries around the world. To date the album has sold over 40 million copies worldwide, making it the eighth highest selling album of all time.\n\nThe band enjoyed more modest success in the intervening period between 1971 and 1974, with the line-up including Bob Welch, and also during the 1990s which saw more personnel changes before the return of Nicks and Buckingham in 1997, and more recently, the departure of Christine McVie. \n\n\n\n\nRumours 1977 (Remastered 2004)\n\n\nRumours is the eleventh studio album by British-American rock band Fleetwood Mac. Largely recorded in California during 1976, it was produced by the band with Ken Caillat and Richard Dashut and was released on 4 February 1977 by Warner Bros. Records. The record peaked at the top of both the main United States Billboard chart and the United Kingdom Albums Chart. &quot;Go Your Own Way&quot;, &quot;Don't Stop&quot;, &quot;Dreams&quot;, and &quot;You Make Loving Fun&quot; were released as singles. A Grammy Award winner, Rumours is Fleetwood Mac's most successful release with sales of over 40 million copies worldwide.\n\nThe band wanted to expand on the commercial success of the 1975 record Fleetwood Mac, but struggled with relationship breakups before recording started. The Rumours studio sessions were marked by hedonistic behaviour and interpersonal strife between Fleetwood Mac members; these experiences informed the album's lyrics. Influenced by pop music, the record's tracks were recorded using a combination of acoustic and electric instruments. The mixing process delayed the completion of Rumours, but was finished by the end of 1976. Following the album's release in 1977, Fleetwood Mac undertook worldwide promotional tours.\n\nRumours garnered widespread critical acclaim. Praise centred on its production quality and harmonies, which frequently relied on the interplay among three vocalists. The record has inspired the work of musical acts in different genres. Often considered Fleetwood Mac's best release, it has featured in several publications' lists of the best albums of the 1970s and the best albums of all time. In 2004, Rumours was remastered and reissued with the addition of an extra track and a bonus CD of outtakes from the recording sessions.\n\n\nTracks: \n\nDisc 1 \n\n1.\t&quot;Second Hand News&quot; \t\n2.\t&quot;Dreams&quot; \n3.\t&quot;Never Going Back Again&quot; \n4.\t&quot;Don't Stop&quot; \n5.\t&quot;Go Your Own Way&quot; \n6.\t&quot;Songbird&quot; \n7.\t&quot;The Chain&quot; \n8.\t&quot;You Make Loving Fun&quot; \n9.\t&quot;I Don't Want to Know&quot; \t\n10.\t&quot;Oh Daddy&quot; \t\n11.\t&quot;Gold Dust Woman&quot;\n\n\n\nDisc 2 \n\n1.\t&quot;Second Hand News&quot; \n2.\t&quot;Dreams&quot; \n3.\t&quot;Brushes (Never Going Back Again)&quot; (Instrumental)\n4.\t&quot;Don't Stop&quot; \n5.\t&quot;Go Your Own Way&quot; \n6.\t&quot;Songbird&quot; \n7.\t&quot;Silver Springs&quot; \n8.\t&quot;You Make Loving Fun&quot; \n9.\t&quot;Gold Dust Woman #1&quot; \n10.\t&quot;Oh Daddy&quot; \n11.\t&quot;Think About It&quot; \n12.\t&quot;Never Going Back Again&quot; \n13.\t&quot;Planets of the Universe&quot; \n14.\t&quot;Butter Cookie (Keep Me There)&quot; \n15.\t&quot;Gold Dust Woman&quot; \n16.\t&quot;Doesn't Anything Last&quot; \n17.\t&quot;Mic the Screecher&quot; (Jam)\n18.\t&quot;For Duster (The Blues)&quot; (Jam)\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:89099a31dd70e5b63b6108f2bc7bc81d7cbc9a72","amp;dn":"Fleetwood+Mac+-+Rumours+and+Bonus+2004+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89099a31dd70e5b63b6108f2bc7bc81d7cbc9a72","infoHashBuffer":{"type":"Buffer","data":[137,9,154,49,221,112,229,182,59,97,8,242,188,123,200,29,124,188,154,114]},"announce":[],"urlList":[]}}