{"title":"The Prediabetes Diet Plan How to Reverse Prediabetes and Prevent","uid":9383737,"size":1489629,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:892ed210c1865baffcd58281d70a101a6f255363&amp;dn=The+Prediabetes+Diet+Plan+How+to+Reverse+Prediabetes+and+Prevent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":5,"time":1387760800,"description":"A practical, empowering guide to managing and reversing prediabetes through diet and exercise, from a registered dietitian. \nAffecting 79 million Americans, prediabetes often develops into full-blown type 2 diabetes, one of the leading causes of death in the United States. Increasingly diagnosed by doctors, prediabetes is a condition in which blood sugar levels are elevated, but not yet high enough to be labeled diabetes. While diabetes cannot be cured, prediabetes can be reversed, so it is critical to take action at an early stage. In straightforward, jargon-free language, The Prediabetes Diet Plan explains insulin resistance (the underlying cause of prediabetes and type 2 diabetes) and offers a comprehensive strategy of diet and lifestyle change, which has been proven more effective than medication. With sections on meal planning, grocery shopping, dining out, supplements, and exercise, this book empowers you to make healthier everyday choices that can effect real change on your insulin levels and overall well-being.","torrent":{"xt":"urn:btih:892ed210c1865baffcd58281d70a101a6f255363","amp;dn":"The+Prediabetes+Diet+Plan+How+to+Reverse+Prediabetes+and+Prevent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"892ed210c1865baffcd58281d70a101a6f255363","infoHashBuffer":{"type":"Buffer","data":[137,46,210,16,193,134,91,175,252,213,130,129,215,10,16,26,111,37,83,99]},"announce":[],"urlList":[]}}