{"title":"The Jewish Annotated New Testament  (Epub,Mobi) Gooner","uid":9780000,"size":11756730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8944e8d28d0357595ecdcd97d194b9b5bbeb3ade&amp;dn=The+Jewish+Annotated+New+Testament++%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1395089311,"description":"Description\nHardcover: 700 pages\nPublisher: Oxford University Press, USA; 1 edition (November 15, 2011)\nLanguage: English\nISBN-10: 0195297709\nISBN-13: 978-0195297706\n\nAlthough major New Testament figures--Jesus and Paul, Peter and James, Jesus' mother Mary and Mary Magdalene--were Jews, living in a culture steeped in Jewish history, beliefs, and practices, there has never been an edition of the New Testament that addresses its Jewish background and the culture from which it grew--until now. In The Jewish Annotated New Testament, eminent experts under the general editorship of Amy-Jill Levine and Marc Z. Brettler put these writings back into the context of their original authors and audiences. And they explain how these writings have affected the relations of Jews and Christians over the past two thousand years. \n\nAn international team of scholars introduces and annotates the Gospels, Acts, Letters, and Revelation from Jewish perspectives, in the New Revised Standard Version translation. They show how Jewish practices and writings, particularly the Greek translation of the Hebrew Bible, influenced the New Testament writers. From this perspective, readers gain new insight into the New Testament's meaning and significance. In addition, thirty essays on historical and religious topics--Divine Beings, Jesus in Jewish thought, Parables and Midrash, Mysticism, Jewish Family Life, Messianic Movements, Dead Sea Scrolls, questions of the New Testament and anti-Judaism, and others--bring the Jewish context of the New Testament to the fore, enabling all readers to see these writings both in their original contexts and in the history of interpretation. For readers unfamiliar with Christian language and customs, there are explanations of such matters as the Eucharist, the significance of baptism, and &quot;original sin.&quot;\n\nFor non-Jewish readers interested in the Jewish roots of Christianity and for Jewish readers who want a New Testament that neither proselytizes for Christianity nor denigrates Judaism, The Jewish Annotated New Testament is an essential volume that places these writings in a context that will enlighten students, professionals, and general readers.\n\nAbout the Author\nAmy-Jill Levine is University Professor of New Testament and Jewish Studies, E. Rhodes and Leona B. Carpenter Professor of New Testament Studies, and Professor of Jewish Studies at the Divinity School, College of Arts and Science, Graduate Department of Religion, and Program in Jewish Studies at Vanderbilt University in Nashville, TN \nMarc Z. Brettler is Dora Golding Professor of Biblical Studies at Brandeis University.","torrent":{"xt":"urn:btih:8944e8d28d0357595ecdcd97d194b9b5bbeb3ade","amp;dn":"The+Jewish+Annotated+New+Testament++%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8944e8d28d0357595ecdcd97d194b9b5bbeb3ade","infoHashBuffer":{"type":"Buffer","data":[137,68,232,210,141,3,87,89,94,205,205,151,209,148,185,181,187,235,58,222]},"announce":[],"urlList":[]}}