{"title":"Stars - Discography (2001-2012) [FLAC]","uid":8657555,"size":2082726312,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89754e492db59c42dd442344d38bb1b82098350a&amp;dn=Stars+-+Discography+%282001-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1373241637,"description":"\n  Stars - Discography (2001-2012) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Indie Electronic\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kpbs\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Albums\n\n  2001 Nightsongs\n  2003 Heart\n  2005 Set Yourself on Fire\n  2007 In Our Bedroom, After the War\n  2010 The Five Ghosts (Deluxe)\n  2012 The North\n\n  Artist Bio\n\n  Sharing a fondness for sophisticated soul and pop artists like the Smiths, New Order, and Marvin Gaye, vocalist Torquil Campbell and keyboardist Chris Seligman formed Stars in Toronto. Along with friends Evan Cranley (also of Big Rude Jake) and Amy Millan (who contributed to the soundtrack for the film Drowning Mona), the band relocated to New York City before returning to Canada, this time settling in Montreal. Their debut full-length, Nightsongs, was released in early 2001 on Le Grand Magistery, with the Comeback EP following later that same year. The band's mix of pop and indie rock made Stars a popular act in Montreal, not to mention an important part of the city's burgeoning indie scene, and their success began spreading into other cities as well. Before 2002 came to an end, the band headed back into the studio to record a sophomore effort. \n\n  The soft-hued Heart was released to critical acclaim in the U.K. before Christmas; Heart appeared on the Canadian label Arts &amp; Crafts during summer 2003. The ambitious Set Yourself on Fire followed two years later, and all of its tracks were creatively remixed by the band's peers. Stars released those remixed songs on a new album, Do You Trust Your Friends?, in 2007. During July of that year, as a preemptive measure to beat any blog leaks of their next record, Stars made In Our Bedroom After the War available for download two months before its actual September release date. They also created their own label, Soft Revolution, which released the band's next studio album, The Five Ghosts, in 2010. After moving to the ATO label, the group released their sixth album, The North, in the summer of 2012.","torrent":{"xt":"urn:btih:89754e492db59c42dd442344d38bb1b82098350a","amp;dn":"Stars+-+Discography+%282001-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89754e492db59c42dd442344d38bb1b82098350a","infoHashBuffer":{"type":"Buffer","data":[137,117,78,73,45,181,156,66,221,68,35,68,211,139,177,184,32,152,53,10]},"announce":[],"urlList":[]}}