{"title":"Scott Hahn - Catholic Biblical Scholar, Apologist - 18 books","uid":8787315,"size":26760934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89a92373afd30d15d433e9659000b1787a142347&amp;dn=Scott+Hahn+-+Catholic+Biblical+Scholar%2C+Apologist+-+18+books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"pharmakate","files":71,"time":1375856726,"description":"18 books by Scott Hahn; all are epub and mobi formats except Covenant and Communion, which is pdf format\n\nScott Hahn is a professor of theology at Franciscan University of Steubenville and a well-known biblical scholar and apologist. He first became famous delivering lectures on biblical scholarship (usually with a strong focus on the theme of &quot;kinship covenant&quot;) and telling the story of his conversion to Catholicism from evangelical Protestantism.\n\nHahn's theology and apologetics are extremely conservative; he is a member of Opus Dei.\n\nBooks in this torrent include:\n\nAnswering the New Atheism: Dismantling Dawkins' Case Against God (with Benjamin Wiker)\nCatholic Bible Dictionary\nConsuming the Word: The New Testament and the Eucharist in the Early Church\nCovenant and Communion: The Biblical Theology of Pope Benedict XVI\nA Father Who Keeps His Promise: God's Covenant Love in Scripture\nFirst Comes Love: The Family in the Church and the Trinity\nHail, Holy Queen: The Mother of God in the Word of God\nThe Lamb's Supper: The Mass as Heaven on Earth\nLetter and Spirit: From Written Text to Living Word in the Liturgy\nLord, Have Mercy: The Healing Power of Confession\nOrdinary Work, Extraordinary Grace: My Spiritual Journey in Opus Dei\nA Pocket Guide to the Bible\nReasons to Believe: How to Understand, Explain, and Defend the Catholic Faith\nRome Sweet Home: Our Journey to Catholicism (with Kimberly Hahn)\nScripture Matters: Essays on Reading the Bible From the Heart of the Church\nSigns of Life: 40 Catholic Customs and Their Biblical Roots\nSwear to God: The Promise and Power of the Sacraments\nUnderstanding Our Father: Biblical Reflections on the Lord's Prayer","torrent":{"xt":"urn:btih:89a92373afd30d15d433e9659000b1787a142347","amp;dn":"Scott+Hahn+-+Catholic+Biblical+Scholar%2C+Apologist+-+18+books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89a92373afd30d15d433e9659000b1787a142347","infoHashBuffer":{"type":"Buffer","data":[137,169,35,115,175,211,13,21,212,51,233,101,144,0,177,120,122,20,35,71]},"announce":[],"urlList":[]}}