{"title":"Simon Schama - History of Britain 1603-1776 (Unabridged)","uid":4597913,"size":595842675,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89af7a188c27ac4d96971da6016bf427aff25785&amp;dn=Simon+Schama+-+History+of+Britain+1603-1776+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"eddie1969","files":420,"time":1230078226,"description":"Audio Books : Misc. Educational : MP3/64Kbps : English\n\nA History of Britain by Simon Schama \n1603 - 1776: The British Wars\n\nRead by Stephen Thorne\n\nUnabridged recording on 18 CD's @ 64Kbs \n\n\n\nReview\nThe second volume of Simon Schama's BBC History of Britain: The British Wars, 1603-1776 is a more serious affair than the first. A History of Britain Vol I was free-range history: a fresh and at times iconoclastic survey of more than 1,500 years of the nation's story. Now Schama is more penned in, covering just a century and a half in 500 pages, and mixing it with the cockiest and wisest historians in the farmyard.\n\nThe ingredients that made the first volume such a spectacular success are still there: highly visual prose, fine informative illustrations, insightful thumbnail sketches of all the leading players and above all a clever interplay between what happened and, often of more significance, what people thought had happened. But this time around Schama also has to weave his way through the complex narrative of the civil war and Protectorate, restoration, &quot;glorious&quot; revolution and establishment of empire. He does so with clarity and wit, but also with admirable sympathy for all the conflicting protagonists - the austere Stuarts, the reluctant hero Cromwell, the cunning Walpole, the gouty Pitt and the thousands of Scots, Irish and American, and the millions of Africans and Indians whose destinies shaped and were shaped by the forging of the British state in these years. \n\n","torrent":{"xt":"urn:btih:89af7a188c27ac4d96971da6016bf427aff25785","amp;dn":"Simon+Schama+-+History+of+Britain+1603-1776+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89af7a188c27ac4d96971da6016bf427aff25785","infoHashBuffer":{"type":"Buffer","data":[137,175,122,24,140,39,172,77,150,151,29,166,1,107,244,39,175,242,87,133]},"announce":[],"urlList":[]}}