{"title":"The Kingdom of God is Within You [EBOOK] Leo Tolstoy","uid":8204585,"size":2607076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a0b39ad28d5c887e41ab0cee86e4f8d25eec1b8&amp;dn=The+Kingdom+of+God+is+Within+You+%5BEBOOK%5D+Leo+Tolstoy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"UnviolentPeacemaker","files":3,"time":1362090130,"description":"Subtitle: &quot;CHRISTIANITY NOT AS A MYSTIC RELIGION BUT AS A NEW THEORY OF LIFE&quot;\n\nWikipedia - \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Kingdom_of_God_Is_Within_You#Tolstoy.27s_relationship_with_Mohandas_Gandhi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Kingdom_of_God_Is_Within_You#Tolstoy.27s_relationship_with_Mohandas_Gandhi&lt;/a&gt;\n\n&quot;The Kingdom of God is Within You,&quot; and Tolstoy's influence on Mohandas Gandhi:\n\nMohandas Gandhi wrote in his autobiography The Story of My Experiments with Truth (Part II, Chapter 15) that Tolstoy's &quot;The Kingdom of God is Within You,&quot; &quot;overwhelmed&quot; him and &quot;left an abiding impression.&quot; Gandhi listed Tolstoy's book, as well as John Ruskin's &quot;Unto This Last&quot; and the poet Shrimad Rajchandra (Raychandbhai), as the three most important modern influences in his life. Reading this book opened up the mind of the world-famous Tolstoy to Gandhi, who was still a young protester living in South Africa at the time.\n\nIn 1908 Tolstoy wrote, and Gandhi read, A Letter to a Hindu, which outlines the notion that only by using love as a weapon through passive resistance could the native Indian people overthrow the colonial British Empire. This idea ultimately came to fruition through Gandhi's organization of nationwide non-violent strikes and protests during the years c. 1918-1947. In 1909, Gandhi wrote to Tolstoy seeking advice and permission to republish A Letter to a Hindu in his native language, Gujarati. Tolstoy responded and the two continued a correspondence until Tolstoy's death in 1910. The letters concern practical and theological applications of non-violence, as well as Gandhi's wishes for Tolstoy's health. Tolstoy's last letter was to Mohandas Gandhi.\n\nMany consider The Kingdom of God is Within You to be a key text for Tolstoyan, Christian anarchist, and nonviolent resistance movements worldwide.","torrent":{"xt":"urn:btih:8a0b39ad28d5c887e41ab0cee86e4f8d25eec1b8","amp;dn":"The+Kingdom+of+God+is+Within+You+%5BEBOOK%5D+Leo+Tolstoy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a0b39ad28d5c887e41ab0cee86e4f8d25eec1b8","infoHashBuffer":{"type":"Buffer","data":[138,11,57,173,40,213,200,135,228,26,176,206,232,110,79,141,37,238,193,184]},"announce":[],"urlList":[]}}