{"title":"Alphonse Mucha - The complete graphic works (Art Ebook).pdf","uid":9292329,"size":161181075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a10ab905c3d44ae79832b2e63ab499079f97219&amp;dn=Alphonse+Mucha+-+The+complete+graphic+works+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"STBGD","files":-1,"time":1386115618,"description":"[IMG]http://i.imgur.com/04yGQaN.jpg[/IMG]\n\nAnn Bridges - Alphonse Mucha: The Complete Graphic Works\nHarmony Books | 1980 | ISBN: 0517541890, 0517553082 | English | 193 pages | PDF | 153.71 MB\n\nArt lovers around the world recall with delight Mucha's wonderful portraits of Sarah Bernhardt. Mucha single-handedly revolutionized French poster art at the turn of the century with art nouveau advertisements for Moet &amp; Chandon, Job, Nestle's, Benedictine brandy and &quot;the flower of the nineties&quot;; Monaco Monte-Carlo. Mucha's work was an inspiration to architects and designers who adapted his style of sinuous flowers and plant motifs for designing buildings and furniture. Mucha's harmonious designs, sensitive colors and superb draughtmanship have earned him the reputation as one of the outstanding and influential graphic artists of Europe. This stunning and colorful book is the most accurate record of Mucha's work available. Included are 163 full-color plates, some appearing here for the first time since their original publication. A complete catalog section contains 525 detailed and illustrated entries and an extensive bibliography of books, periodicals and exhibition catalogs. Marina Henderson's introduction, &quot;Women and Flowers,&quot; and Dr. Anna Dvorak's epilogue, &quot;Illustrations for Books and Periodicals,&quot; describe with insight Mucha's life, his achievements and his philosophy.","torrent":{"xt":"urn:btih:8a10ab905c3d44ae79832b2e63ab499079f97219","amp;dn":"Alphonse+Mucha+-+The+complete+graphic+works+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a10ab905c3d44ae79832b2e63ab499079f97219","infoHashBuffer":{"type":"Buffer","data":[138,16,171,144,92,61,68,174,121,131,43,46,99,171,73,144,121,249,114,25]},"announce":[],"urlList":[]}}