{"title":"HeartLand - Season 2 (The New McLeods Daughters)","uid":4793426,"size":7554371631,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a3e7ece67b039b56c9bff4458a2489027cbf9ea&amp;dn=HeartLand+-+Season+2+%28The+New+McLeods+Daughters%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"softline","files":19,"time":1237794470,"description":"A multi-generational family drama series set in the foothills of the Rocky Mountains of Alberta. Heartland is a place like no other; a horse ranch with a special mission of healing abused or neglected horses and finding them new homes. The series follows the Fleming family as they deal with the ups and downs of running a ranch that's been in the family for generations but is now deep in debt. \n\nSet against the stunning vistas of the Alberta Rocky Mountains, Heartland is a sprawling family drama that follows sisters Amy and Lou Fleming and their grandfather, Jack, through the highs and lows of life on a horse ranch.\n\nAmy continues to keep her mother's dream alive by healing abused and neglected horses, but life is a little more complicated than it was. Four months have passed since Ty's sudden departure at the end of season one and a lot has changed at Heartland. Ty's been replaced by a new stable hand, Caleb Odell, a cowboy with rodeo aspirations who comes in days to help out with the chores. Lou is busy making plans to brand and expand Heartland into an &quot;Equine Corporate Retreat&quot; or, as the others less than affectionately call it, a Dude Ranch. Jack continues to be the rock of Heartland who quietly holds everything together. But he has his job cut out for him as the family struggles to find a place in their life for Amy and Lou's estranged father, Tim.\n\nBased on the best selling books by Lauren Brooke.\n &lt;a href=&quot;\nhttp://www.cbc.ca/heartland&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbc.ca/heartland&lt;/a&gt;\n\nAll episodes except for 18 have been previously posted here as separate torrents.  Please help seed.","torrent":{"xt":"urn:btih:8a3e7ece67b039b56c9bff4458a2489027cbf9ea","amp;dn":"HeartLand+-+Season+2+%28The+New+McLeods+Daughters%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a3e7ece67b039b56c9bff4458a2489027cbf9ea","infoHashBuffer":{"type":"Buffer","data":[138,62,126,206,103,176,57,181,108,155,255,68,88,162,72,144,39,203,249,234]},"announce":[],"urlList":[]}}