{"title":"I Will Teach Yo Be Rich by Ramit Sethi","uid":14469474,"size":7730343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a4c86800cfaa50b596ac69bf609371697ab6dbd&amp;dn=I+Will+Teach+Yo+Be+Rich+by+Ramit+Sethi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Dr.Soc","files":2,"time":1461889407,"description":"I Will Teach You To Be Rich by Ramit Sethi\r\n2009 | ISBN: 0761147489 | English | 266 pages | MOBI, EPUB | 7 MB\r\n\r\nAt last, for a generation that's materially ambitious yet financially clueless comes I Will Teach You To Be Rich, Ramit Sethi's 6-week personal finance program for 20-to-35-year-olds. A completely practical approach delivered with a nonjudgmental style that makes readers want to do what Sethi says, it is based around the four pillars of personal finance–banking, saving, budgeting, and investing–and the wealth-building ideas of personal entrepreneurship.\r\n\r\nSethi covers how to save time by not wasting it managing money; the guns and cars myth of credit cards; how to negotiate like an Indian–the conversation begins with &quot;no&quot;; why &quot;Budgeting Doesn't Have to Suck!&quot;; how to get things rolling–for real–with only $20; what most people don't understand about taxes; how to get a CEO to take you out to lunch; how to avoid the Super Mario Brothers trap by making your savings work harder than you do; the difference between cheap and frugal; the hidden relationship between money and food. Not to mention his first key lesson: Getting started is more important than being the smartest person in the room. Integrated with his website, where readers can use interactive charts, follow up on the latest information, and join the community, it is a hip blueprint to building wealth and financial security.\r\n\r\nEvery month, 175,000 unique visitors come to Ramit Sethi's website, Iwillteachyoutoberich.com, to discover the path to financial freedom. They praise him thoughtfully (&quot;Your site summarizes everything I want with my life–to be rich in finances, rich in experience, rich in family blessings,&quot; Dan Esparza) and effusively (&quot;Dude, you rock. I love this site!&quot; Richard Wu). The press has caught on, too: &quot;Ramit Sethi is a rising star in the world of personal finance writing . . . one singularly attuned to the sensibilities of his generation. his style is part frat boy and part silicon Valley geek, with a little bit of San Francisco hipster thrown in&quot; (San Francisco Chronicle). His writing is smart, his voice is full of attitude, and his ideas are uncommonly sound and refreshingly hype-free","torrent":{"xt":"urn:btih:8a4c86800cfaa50b596ac69bf609371697ab6dbd","amp;dn":"I+Will+Teach+Yo+Be+Rich+by+Ramit+Sethi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4c86800cfaa50b596ac69bf609371697ab6dbd","infoHashBuffer":{"type":"Buffer","data":[138,76,134,128,12,250,165,11,89,106,198,155,246,9,55,22,151,171,109,189]},"announce":[],"urlList":[]}}