{"title":"All About Space - Tour of the Universe 2014 (gnv64)","uid":10124129,"size":36713281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b03398d74b1e05b33525aeb891c5a6ce75213ea&amp;dn=All+About+Space+-+Tour+of+the+Universe+2014+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"gnv65","files":-1,"time":1399736064,"description":"All About Space - Tour of the Universe 2014 (Magbook)\nEnglish | PDF | 180 pages | 35 mb\n\nOnce upon a time. a man named Neil Armstrong stepped onto the surface of the Moon claiming it to be &quot;One small step for man, one giant leap for mankind.&quot; Join us as we take you further than ever imagined across our Solar System and into deep space. Explore the Milky Way from Earth's natural satellite, the Moon. to learning all about the star at the centre of our Solar System. Further your understanding of how the human race is exploring the universe, as we search for life and prepare to become tourists in space. Learn about the science of space with the formation of the planets and the Space Junk Crisis. Finally, you will head into the deepest depths of the universe touring alien worlds and uncovering the power of supernovas. In this book, you will also discover some of the wonders of the universe. and what mysteries they hold. Jump on board. and get ready to tour the universe.\n\nExplore the Galaxies\n22 Journey through the Milky Way - What do we still have to learn about our universe?\n30 Inside the Apollo spacesuit - What did Armstrong and Aldrin wear on the moon?\n32 The 1969 Lunar Lander - Explore the first commercially produced spacecraft\n34 Space tourism - Are we finally on the verge of constant space travel?\n42 Search for life - Is there really life out there?\n51 5 amazing facts about rockets - Discover the vehicles taking humanity into space\n52 The Dragon space capsule - How this probe hopes to reveal more about Jupiter\n54 Underwater space training - How do astronauts prepare for their missions?\n56 Destination Mars - How will we take the first humans to the Red Planet?\n\nDiscover the Solar System \n68 All about the Sun - Find out all about the only star in our Solar System\n80 The Moon - Explore the Earth's only natural satellite\n82 Moon colonies - What will it take to permanently live on the Moon?\n90 Awesome impact craters - Discover some of the Solar System's best impacts\n94 The rings of Jupiter - Explore the rings of the gas giant\n96 Giant ice geysers of Enceladus - What causes the water on Saturn's moon?\n98 Alien volcanoes on Io - Exploding mountains on one of Jupiter's moons\n\nSights of the Universe \n104 Mega storms - Find out about the deadly weather in space\n114 What happens inside a star? - Leam about the inner-workings of a star\n116 How planets form - Discover how our planet came into being\n122 What are asteroids made of? - Explore the physical properties of these space-rocks\n126 Lagrange points - Discover the points of gravity that balance orbiting masses out\n128 The Space Junk Crisis - What are we leaving behind in space and how will it affect us?\n134 How we see the Universe - Learn about the Gaia spacecraft bringing us new discoveries\n\nInto Deep Space \n118 Supernovas - Learn all about the energy of a thousand suns\n146 Tour the Alien Worlds - Discover the distant Gliese system and what it could be like there\n150 Deepest ever view of the universe - Take a look at the deepest image Hubble has ever taken\n152 Bubble Nebula - What's behind this interstellar phenomenon in space?\n154 All about Proxima Centauri - Learn all about the closest star to the Sun\n162 When galaxies collide - Observe the rarity of colliding galaxies\n164 The Sombrero Galaxy - Explore the space phenomenon that is two types of galaxy at once\n166 Red Square Nebula - Discover the most mysterious object in the galaxy\n168 Hypergiant stars - Understand how the biggest stars push the limits of astrophysics","torrent":{"xt":"urn:btih:8b03398d74b1e05b33525aeb891c5a6ce75213ea","amp;dn":"All+About+Space+-+Tour+of+the+Universe+2014+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b03398d74b1e05b33525aeb891c5a6ce75213ea","infoHashBuffer":{"type":"Buffer","data":[139,3,57,141,116,177,224,91,51,82,90,235,137,28,90,108,231,82,19,234]},"announce":[],"urlList":[]}}