{"title":"Thurston Moore Suicide Notes For Acoustic Guitar","uid":10968666,"size":187953320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b54b3b6eeb2bbb6f695ed6dfc3ceb9774d806fe&amp;dn=Thurston+Moore+Suicide+Notes+For+Acoustic+Guitar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":6,"time":1409775295,"description":"Allmusic.com, Jesse Jarnow\n\nSonic Youth co-founder Thurston Moore remained busy as always in 2010 and 2011 with both collaborations and solo releases. While the rock-noise veteran focused on elegant acoustic guitar playing on both his dream folk Demolished Thoughts (for Matador) and the equally dreamy instrumental 12-String Meditations for Jack Rose (for VDSQ), on Suicide Notes for Acoustic Guitar the 52-year-old Moore used the instrument to bridge his acoustic explorations with the free improv he also continued to spend much of his time playing. Three shorter pieces accompany the 14-minute &quot;Soul,&quot; each pushing the acoustic into distortion, often accompanied by a heavy attack. But while distorted, Moore rarely lets loose into out-and-out feedback, instead working subtly -- if such a thing is possible with a rudely distorted acoustic guitar -- to find melodies inside apparent chaos. Originally issued as a CD-R, the 25-minute disc might not receive as much play in most households as his other acoustic-oriented projects, but Moore's one-man blend of freedom and form is (again if such a thing is possible) a quiet achievement that further cements his status as an able improviser.","torrent":{"xt":"urn:btih:8b54b3b6eeb2bbb6f695ed6dfc3ceb9774d806fe","amp;dn":"Thurston+Moore+Suicide+Notes+For+Acoustic+Guitar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b54b3b6eeb2bbb6f695ed6dfc3ceb9774d806fe","infoHashBuffer":{"type":"Buffer","data":[139,84,179,182,238,178,187,182,246,149,237,109,252,60,235,151,116,216,6,254]},"announce":[],"urlList":[]}}