{"title":"Dan Simmons - Ilium-Olympos","uid":11486871,"size":1023325018,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8c22e5a0f0f3e7750d6fe53c49d3534907ec4d46&amp;dn=Dan+Simmons+-+Ilium-Olympos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":3,"time":1416185449,"description":"Ilium/Olympos is a science fiction duology by Dan Simmons. The events are set in motion by beings who have taken on the roles of the Greek gods. Like Simmons' earlier series, the Hyperion Cantos, it is a form of &quot;literary science fiction&quot;; it relies heavily on intertextuality, in this case with Homer and Shakespeare as well as references to Marcel Proust's Ã€ la recherche du temps perdu (or In Search of Lost Time) and Vladimir Nabokov's novel Ada or Ardor: A Family Chronicle.\n\nAs with most of his science fiction and in particular with Hyperion, Ilium demonstrates that Simmons writes in the soft science fiction tradition of Ray Bradbury and Ursula K. Le Guin. Ilium is based on a literary approach similar to most of Bradbury's work, but describes larger segments of society and broader historical events. As in Le Guin's Hainish series, Simmons places the action of Ilium in a vast and complex universe made of relatively plausible technological and scientific elements. Yet Ilium is different from any of the works of Bradbury and Le Guin in its exploration of the very far future of humanity, and in the extra human or post-human themes associated with this. It deals with the concept of technological singularity where technological change starts to occur beyond the ability of humanity to presently predict or comprehend. The first book in the duology, Ilium, received the Locus Award for Best Science Fiction novel in 2004.\n\nAUDIBLE VERSION\n\n\nTPB DELETED MY FIRST TORRENT YOU CAN DOWNLOAD THAT ONE WHICH HAS SEEDS INSTEAD OF THIS ONE: \n\nmagnet:?xt=urn:btih:22526C48849ADBDDB168D4DA2BF940449EA52173","torrent":{"xt":"urn:btih:8c22e5a0f0f3e7750d6fe53c49d3534907ec4d46","amp;dn":"Dan+Simmons+-+Ilium-Olympos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c22e5a0f0f3e7750d6fe53c49d3534907ec4d46","infoHashBuffer":{"type":"Buffer","data":[140,34,229,160,240,243,231,117,13,111,229,60,73,211,83,73,7,236,77,70]},"announce":[],"urlList":[]}}