{"title":"THE RATPACK 12 DISC BOXSET MP3- 320K- BY STIG","uid":5014172,"size":1699535122,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8c371cdd26c050a88bcc9c72dabf353cbce6b814&amp;dn=THE+RATPACK+12+DISC+BOXSET+MP3-+320K-+BY+STIG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"alanwatson","files":249,"time":1248137042,"description":"over 200 classics 12 albums\n\nCD 1 / The Rat Pack - That's Amore\n\n\n\nSinatra - Nancy (With The Laughing Face). Martin - That's Amore. Davis Jr - Lonely Is The Name. Sinatra - I'm A Fool To Want You.\n\nMartin - I Got The Sun In The Morning. Davis Jr - What Now My Love. Sinatra - Oh What A Beautiful Mornin'. Martin - That Lucky Old Sun.\n\nDavis Jr - On A Clear Day. Sinatra - Where Or When. Martin - Who's Sorry Now. Davis Jr - I Have But One Life To Live. Sinatra - I Concentate On You.\n\nMartin - Powder Your Face With Sunshine. Davis Jr - I'm A Brass Band. Sinatra - Say It. Martin - Baby, It's Cold Outside. Davis Jr - Shake, Shake, Shake.\n\nSinatra - Aintcha Ever Coming Back. Martin - Zing A Zing A Zing Boom\n\n\n\nCD 2 / The Rat Pack - Your'e Nobody Until Somebody Loves You\n\n'\n\nSinatra - Come Back To Sorrento. Martin - All Of Me. Davis Jr - With A Song In My Heart. Sinatra - My Melancholy Baby.\n\nMartin - I Wonder Who's Kissing Her Now. Davis Jr - Hi - Heel Sneakers. Sinatra - Oh! What It Seemed To Be.\n\nMartin - How It Lies, How It Lies, How It Lies. Davis Jr - Bye, Bye, Blackbird. Sinatra - When Your Lover Has Gone.\n\nMartin - The Night Is Young And Your So Beautiful. Davis Jr - Do What You Gotta Do. Sinatra - How About You. Martin - Rambling Rose.\n\nDavis Jr - You're Nobody Until Somebody Loves You. Sinatra - Ol' Man River Martin. - About A Quarter To Nine. Davis Jr - Where Is Love.\n\nSinatra - The Things We Did Last Summer. Martin - Three Wishes\n\n\n\nCD 3 / The Rat Pack - Everybody Love Somebody\n\n\n\nSinatra - Day By Day. Martin - Everybody Loves Somebody. Davis Jr - What Kind Of Fool Am I. Sinatra - I Couldn't Sleep A Wink Last Night.\n\nMartin - If I Knew Then (What I Know Now). Davis Jr - You've Made Me So Very Happy. Sinatra - Oh! Look At Me Now.\n\nMartin - I Can't Give You Anything But Love. Davis Jr - Talk To The Animals. Sinatra - I Dream Of You Martin - Solitaire.\n\nDavis Jr - Please Don't Talk About Me When I'm Gone. Sinatra - Homesick-that's All. Martin - Pretty As A Picture. Davis Jr - Sweet November.\nSinatra - Out Of Nowhere. Martin - Sunflower. Davis Jr - Whisper To One. Sinatra - There Are Such Things. Martin - There's Yes In Your Eyes.\n\n\n\nCD 4 / The Rat Pack - Some Enchanted Evening\n\n\n\nSinatra - Fools Rush In. Martin - Don't Let The Stars Get In Your Eyes. Davis Jr - Second Best Secret Agent In The World.\n\nSinatra - I Have But One Heart. Martin - If You Were The Only Girl In The World. Davis Jr - In The Ghetto. Sinatra - Some Enchanted Evening.\n\nMartin - I Don't Care If The Sun Don't Shine. Davis Jr - As Long As She Needs Me. Sinatra - What'll I Do. Martin - Someday You'll Want Me To Want You.\n\nDavis Jr - I Have Dreamed. Sinatra - Dream. Martin - Tarra Talarra Talar. Davis Jr - The Impossible Dream. Sinatra - Mam'selle. Martin - Swanee.\n\nDavis Jr - This Guy's In Love With You. Sinatra - They Say It's Wonderful. Martin - The Sweetheart Of Sigma Chi.\n\n\n\nCD 5 / The Rat Pack - Begin The Beguine\n\n\n\nSinatra - Begin The Beguine. Martin - There Be A Hot Time In The Town Of Berlin.. Davis Jr - Without A Song. Sinatra - People Will Say We're In Love. Martin - I'll Always Love You. Davis Jr - The Folks Who Live On The Hill. Sinatra - The Birth Of The Blues. Martin - I Don't See Me In Your Eyes Any More.\n\nDavis Jr - Doctor Dolittle. Sinatra - You'll Never Know. Martin - Someone Like You. Davis Jr - Here I'll Stay. Sinatra - Don't Forget Tonight Tomorrow.\n\nMartin - Ghost Riders In The Sky. Davis Jr - The Good Life. Sinatra - I'll Be Seeing You. Martin - Louise. Davis Jr - Any Place I Hang My Hat Is Home.\n\nSinatra - Always. Martin - You Won't Be Satisfied.\n\n\n\nCD 6 / The Rat Pack - Blue Skies\n\n\n\nSinatra - Blue Skies. Martin - You Belong To Me. Davis Jr - Somebody. Sinatra - This Love Of Mine. Martin - I'll String Along With You.\n\nDavis Jr - Every Time We Say Goodbye. Sinatra - When You're Smiling. Martin - I Love The Way You Say Goodnight.\n\nDavis Jr - I'm Always Chasing Rainbows. Sinatra - Five Minutes More. Martin - Somewhere Along The Way. Davis Jr - I'm Glad There Is You.\n\nSinatra - East Of The Sun(And West Of The Moon). Martin - Once In Love With Amy. Davis Jr - The Goin's Great. Sinatra - If You Are But A Dream.\n\nMartin - Love Me, Love Me. Davis Jr - Tomorrow With Me. Sinatra - This Is The Night. Martin - Which Way Did My Heart Go?\n\n\n\nCD 7 / The Rat Pack - My Way\n\n\n\nSinatra - All Or Nothing At All. Martin - Again. Davis Jr - My Way. Sinatra - Time After Time. Martin - I'm Gonna Paper All My Walls With Your Love Letters.\n\nDavis Jr - If It's The Last Thing I Do. Sinatra - Saturday Night. Martin - I Passed Your House Tonight. Davis Jr - Chicago. Sinatra - You Go To My Head.\n\nMartin - Take Your Girlie To The Movies. Davis Jr - Here's That Rainy Day. Sinatra - For You. Martin - Oh Marie.\n\nDavis Jr - Love Is A Meaningless Word. Sinatra - One For My Baby (And One More For The Road). Martin - Meander'.Davis Jr - I've Gotta Be Me.\n\nSinatra - They Didn't Believe Me. Martin - Absence Makes The Heart Grow Fonder.\n\n\n\nCD 8 / The Rat Pack - A Lovely Way To Spend An Evening\n\n\n\nSinatra - A Lovely Way To Spend An Evening. Martin - Till Then. Davis Jr - Like Young. Sinatra - You'll Never Walk Alone.\n\nMartin - I'm In Love With You (With Margaret Whiting). Davis Jr - At The Crossroads. Sinatra - The House I Live In. Martin - If.\nDavis Jr - Children, Children. Sinatra - Stella By Starlight. Martin - Takes Two To Tango. Davis Jr - She Is Today.\nSinatra - From The Bottom Of My Heart. Martin - Night Train To Memphis. Davis Jr - The Birth Of The Blues. Sinatra - Autumn In New York.\n\nMartin - Memory Lane. Davis Jr - Another Spring. Sinatra - All Through The Day. Martin - Dreamy Old New England Moon.\n\n\n\nCD 9 / The Rat Pack - I?ve Got You Under My Skin\n\n\n\nSinatra - (I Don't Stand) A Ghost Of A Chance. Martin - Some Enchanted Evening. Davis Jr - I've Got You Under My Skin.\n\nSinatra - The Coffee Song. Martin - In The Cool Cool Cool Of The Evening. Davis Jr - One For My Baby. Sinatra - Dolores. Martin - A Room Full Of Roses.\n\nDavis Jr - Come Back To Me. Sinatra - You Are Too Beautiful. Martin - Rain. Davis Jr - Monologue. Sinatra - From This Day Forward.\nMartin - Never Before. Davis Jr - She Believes In Me. Sinatra - I Should Care. Martin - My Heart Has Found A Home Now. Davis Jr - Turnaround.\n\nSinatra - Almost Like Being In Love. Martin - Be Honest With Me.\n\n\n\nCD10 / The Rat Pack - Night And Day\n\n\n\nSinatra - Night And Day. Martin - On A Slowboat To China. Davis Jr - All That Jazz. Sinatra - The Girl That I Marry. Martin - Vieni Su.\n\nDavis Jr - For Once In My Life. Sinatra - All Of Me. Martin - A' You're Adorable. Davis Jr - Fabulous Places.\nSinatra - It Only Happens When I Dance With You. Martin - Oh Boy Oh Boy Oh Boy. Davis Jr - If My Friends Could See Me Now.\n\nSinatra - The Moon Was Yellow &amp; The Night Was Young. Martin - My Own My Only My All. Davis Jr - Spinning Wheel. Sinatra - I Fall In Love Too Easily.\n\nMartin - My Lady Loves To Dance. Davis Jr - Take It From One Who Knows. Sinatra - But Beautiful. Martin - Baby Obey Me.\n\n\n\nCD 11 / The Rat Pack - Live In St. Louis with Count Basie\n\n\n\nMartin - Johnny Carson Introduces Dean Martin. Martin - Send Me The Pillow That You Dream On. Martin - King Of The Road.\n\nMartin - Everybody Loves Somebody. Martin - Medley: Volare / On An Evening In Roma. Davis Jr - Johnny Carson Introduces Sammy Davis Jr.\n\nDavis Jr - My Shining Hour .Davis Jnr - Monologue. Davis Jr - Who Can I Turn To.\nDavis Jr - Medley: I've Got You Under My Skin / You Are My Sunshine. Davis Jr - One For My Baby. Sinatra - Johnny Carson Introduces Frank Sinatra. Sinatra - Get Me To The Church On Time. Sinatra - Fly Me To The Moon. Sinatra - Luck Be A Lady. Sinatra - I Only Have Eyes For You.\nSinatra - I've Got You Under My Skin. Sinatra - Monologue. Sinatra - Please Be Kind. Sinatra - You Make Me Feel So Young. Sinatra - My Kind Of Town\n\nMartin, Sinatra, Davis Jr - Rat Pack Monologue. Martin, Sinatra, Davis Jr - Birth Of The Blues / Closing Tune.\n\n\n\nCD 12 / The Rat Pack - Live In Las Vegas\n\n\n\nMartin - Medley: Drink To Me Only With Thine Eyes / I Don't Care If The Sun Don't Shine / I Love Vegas (Paris). Martin - Monolgue.\nMartin - June In January. Martin - Via Veneto. Martin - Volare (Nel Blu Dipinto Di Blu). Martin - On An Evening In Roma.\nSinatra - I Only Have Eyes For You. Sinatra - My Heart Stood Still. Sinatra - Please Be Kind. Sinatra - Monolgue. Sinatra - Call Me Irresponsible.\nSinatra - Luck Be A Lady. Frank &amp; Dean - At The Salad Bar. Frank &amp; Dean - Kiddie Album Medley. Davis Jr - Sammy, Dean &amp; Frank.\nDavis Jr - The Lady Is A Tramp. Davis Jr - Rock-A-Bye Your Baby. Davis Jr - Sammy's March. Dean &amp; Frank - Guys And Dolls.","torrent":{"xt":"urn:btih:8c371cdd26c050a88bcc9c72dabf353cbce6b814","amp;dn":"THE+RATPACK+12+DISC+BOXSET+MP3-+320K-+BY+STIG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c371cdd26c050a88bcc9c72dabf353cbce6b814","infoHashBuffer":{"type":"Buffer","data":[140,55,28,221,38,192,80,168,139,204,156,114,218,191,53,60,188,230,184,20]},"announce":[],"urlList":[]}}