{"title":"[Clips4Sale / Taboo-Fantasy] Molly Jane (Bedtime Story) 1080p [R","uid":13624962,"size":1017435935,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8c4854c346dfcdd5a3d99c25d28b9ba376487457&amp;dn=%5BClips4Sale+%2F+Taboo-Fantasy%5D+Molly+Jane+%28Bedtime+Story%29+1080p+%5BR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1456005991,"description":"[Clips4Sale / Taboo-Fantasy] Molly Jane (Bedtime Story) 1080p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/ktk\r\n \nhttp://imgsnaps.com/image/kty\r\n\r\nIt's Bedtime for Molly....and as she does every night.....Molly calls in her Daddy to read her a Bedtime Story. Her favourite is the Princess and the Pea. Dad is reading her the Story, when Molly mentions to her Dad that a girl in her class at school had sex with a boy for the first time. Molly also tells Daddy that she is very curious about sex....and wants to try it. Dad takes off his reading glasses and asks Molly if she would like to try sex. Molly is very eager....so Dad starts by telling her to take off her pajama bottoms. Dad plays with Molly's pussy and asks her if it feels good. Molly says it feels VERY good. Next, Dad begins to lick Molly's pussy and she immediately falls in love with this new sensation. Molly even experiences her very first orgasm from her Daddy's tongue. After that....Dad introduces Molly to his penis. Molly screams when she sees it...&quot;WOW!!! it's so big!!! are they all that big Daddy?&quot; Dad explains that cocks come in all shapes and sizes....and he teaches Molly how to suck it. When Dad's cock is rock hard, he asks her if she would like to have it inside her....like her friend did....and Molly says she wants it!! Dad is very, very gentle as he carefully inserts his big cock inside Molly's tight, little pussy....giving her just a tiny bit at a time...and making sure she is ok, before putting more of it inside her. Eventually, Molly's pussy is stretched to the limit, as all of Daddy's huge cock gets inside her. Dad begins to hump Molly, and she enjoys every minute. Dad finally unloads his sperm all over her tummy....telling her that she should make boys from school do the same thing....and that they should NOT ejaculate inside her. With her tummy full of Daddy's semen....the two go back to reading her Bedtime Story....but Molly quickly gets very tired and starts to yawn....so Daddy kisses her on the forehead and says goodnight","torrent":{"xt":"urn:btih:8c4854c346dfcdd5a3d99c25d28b9ba376487457","amp;dn":"%5BClips4Sale+%2F+Taboo-Fantasy%5D+Molly+Jane+%28Bedtime+Story%29+1080p+%5BR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c4854c346dfcdd5a3d99c25d28b9ba376487457","infoHashBuffer":{"type":"Buffer","data":[140,72,84,195,70,223,205,213,163,217,156,37,210,139,155,163,118,72,116,87]},"announce":[],"urlList":[]}}