{"title":"Technibble's Computer Repair Utility Kit v2","uid":7461420,"size":92768447,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8c593a2a5575e553dea47f7bb1a967a6ed7a23fd&amp;dn=Technibble%27s+Computer+Repair+Utility+Kit+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Slammer94","files":2,"time":1342828014,"description":"Technibble is a website/blog aimed at helping people in the computer repair business. Some time ago, they created a kit of portable software (all freeware) that people could put on a flashdrive and run on pretty much any PC. It contained software that was useful in a wide variety of PC repair/help tasks. Unfortunately, some of the developers of some of the software didn't like them re-distributing their FREE software that way, so Technibble stopped hosting it. I think that is ridiculous, so I went out and found an old link to it and decided to upload it over here, so it'll be a bit easier to find. \n\nThe Readme file contains a list of all the programs included in this, as well as some basic instructions on how to use this. If those instructions aren't enough for you, and you can't figure it out using Google, then you're probably better off not using this anyway. \n\nThis was created by a reputable website, and is virus-free. I'm uploading the original zip file that they created, without any modifications. I did encounter at least one false-positive with MSE, and other AV's may pick up more. But rest assured that it is clean. \n\nThis is heavily compressed, and extraction size is about 175 MB. So extracting it will take some time. Be patient. \n\nFor more information about this, a simple Google search will provide you with all the information that you need. This was made for people who fix computers. If you need someone to hold you hand to set this up or use it, then this is not for you. \n\nEnjoy and please seed! I can only seed on and off due to various circumstances, but I'll do my best to get this thing going and help out when I can. ","torrent":{"xt":"urn:btih:8c593a2a5575e553dea47f7bb1a967a6ed7a23fd","amp;dn":"Technibble%27s+Computer+Repair+Utility+Kit+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c593a2a5575e553dea47f7bb1a967a6ed7a23fd","infoHashBuffer":{"type":"Buffer","data":[140,89,58,42,85,117,229,83,222,164,127,123,177,169,103,166,237,122,35,253]},"announce":[],"urlList":[]}}