{"title":"Michael Jackson 30th Anniversary Concert Celebration ","uid":8295504,"size":3025556074,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8d296865881c1f9dee094df8c383be8b025bd3e9&amp;dn=Michael+Jackson+30th+Anniversary+Concert+Celebration+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"biscuitboy","files":-1,"time":1364136568,"description":"\nMichael Jackson - 30th Anniversary Concert Celebration / Celebration of the 30th anniversary of his solo car [2001, Pop, SATRip]\n\nMichael Jackson - 30th Anniversary Concert Celebration / Celebration of the 30th anniversary of his solo career,\n\nYear : 2001 Country : USA Genre : Pop Duration : 2:24 Description : The full concert dedicated to the 30th anniversary of his solo career, Michael Jackson. Consists of two parts and a bonus application. \n\nThe first part consists of artists performing songs of Jackson and just songs dedicated to him: - Usher, Mya, Whitney Houston - Wanna be startin something - James Ingram and Gloria Estefan - I Just Can not Stop Loving You - Billy Gilman - Ben - Shaggy feat. Rayvon and RikRok - Angel and It Was not Me - Mya, Debora Cox, Tamia, Monica and Rah Digga - Heal The World - Aaron Carter and Candy - Video Interlude 1 - Destiny's Child - Bootylicius - Video Interlude 2 - Missy Elliot and Nelly Furtado - Give Me Some New Sh't - Monica - Home (The Wiz Tribute) - Jill Scott - You Can not Win (The Wiz Tribute) - Monica, Jill Scott, Al Jarreau and Debora Cox - Ease On Down The Road ( the Wiz Tribute) - Liza Minnelli - You Are Not Alone and Happy Little Bluebirds - Lil 'Romeo &amp; Master P - Girlfriend (I Want You Back) - Marc Anthony - She's Out Of My Life - Dionne Warwick - I'll Never Love This Again way - Gloria Gaynor - I Will Survive - Usher, 98 Degrees and Luther Vandross - Man In The Mirror \n\nThe second part is already part of his speech where Jackson performs his songs solo or duet or with his brothers: Michael &amp; The Jacksons - Can You Feel It - ABC - The Love You Save - I'll Be There - I Want You Back - Dancing Machine (feat. N'Sync) - Shake Your Body (Down To The Ground) Michael Jackson - Cris Tucker - The Way You Make Feel Me - Video Interlude 3 - Black or White (feat. Slash) - Beat It (feat. Slash) - Billie Jean - You Rock My World (feat. Usher and Chris Tucker) - We are the World (All-Star emsenble Including Quicy Jones &amp; The Legends of Jazz) bonus app - Michael Jackson feat. Britney Spears - The Way You Make Me Feel \n\nThis is the complete version of the concert was shown on TV USA. At the end of the concert inserted some &quot;mistakes&quot; - that were cut when installing the official version. \n\nQuality : SATRip Format : MKV Video codec : H.264 Audio Codec : MP3 Video : 1024 (704) X-528, 703kbps, 25.000fps Audio : MPEG Layer 3 (0x55), 48000 Hz, 2 channels, 16 bit, 128Kbps\n\n","torrent":{"xt":"urn:btih:8d296865881c1f9dee094df8c383be8b025bd3e9","amp;dn":"Michael+Jackson+30th+Anniversary+Concert+Celebration+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d296865881c1f9dee094df8c383be8b025bd3e9","infoHashBuffer":{"type":"Buffer","data":[141,41,104,101,136,28,31,157,238,9,77,248,195,131,190,139,2,91,211,233]},"announce":[],"urlList":[]}}