{"title":"The Lawrence Arms - Metropole (Deluxe) (2014) [FLAC]","uid":9533271,"size":307018431,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d4838605383afa84de1c9c525d5532d937a7354&amp;dn=The+Lawrence+Arms+-+Metropole+%28Deluxe%29+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1390878792,"description":"\n  The Lawrence Arms - Metropole (Deluxe) (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Punk\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Chilean District \n  02 You Are Here \n  03 Hickey Avenue \n  04 Seventeener (17th and 37th) \n  05 Beautiful Things \n  06 Acheron River \n  07 Metropole \n  08 Drunk Tweets \n  09 The YMCA Down The Street From The Clinic \n  10 Never Fade Away \n  11 Paradise Shitty \n  12 October Blood \n  13 These Pigs Seem to Be Getting the Best of Me\n  14 Bonfire Park\n  15 The Profiteers   \n\n  The eight-year hiatus preceding the Lawrence Arms' sixth record, Metropole, seems to have been a time of personal growth for members Neil Hennessy, Brendan Kelly, and Chris McCaughan. The Chicago-based trio have always had a knack for clever, melodically minded songwriting, but as they regroup for this 2014 release, there is a newfound world-weariness not present on their earlier records. The pop-punk genre of which they are veterans is often unkind to aging bands who refuse to let go of the scene's youthful trappings, but the Arms have managed to craft a thoughtful, reflective record full of somber notes and a refined kind of fury earned by experience. The single &quot;You Are Here&quot; burns with a pensive, blue-collar discontent, and themes of nostalgia and regret reappear throughout the album. If it's possible to make a wistful punk album, the Lawrence Arms have made it with Metropole. The standout track &quot;Beautiful Things&quot; churns in an autumnal blaze of distorted major seventh chords and impressively poetic lyrics romanticizing past artistic triumphs. Mortality is examined in tracks like &quot;Seventeener&quot; and &quot;October Blood&quot; with their personal and mournful lyrics. The noirish quality of the record, both in lyrical content and tone, suits the band well. As on their previous albums, Kelly and McCaughan trade vocals back and forth or sing together, bringing even more unity to a record that already holds itself together well. The curious samples of distantly heard street jazz, accordion music, and aural cityscapes that thread between the tracks lend an air of mystery and help to further associate the Lawrence Arms with the great Midwestern city they call home. The fact that they waited eight years to make this impressive album demonstrates the patience and maturity of a band whose members wanted to wait until they had something worthy to say.","torrent":{"xt":"urn:btih:8d4838605383afa84de1c9c525d5532d937a7354","amp;dn":"The+Lawrence+Arms+-+Metropole+%28Deluxe%29+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d4838605383afa84de1c9c525d5532d937a7354","infoHashBuffer":{"type":"Buffer","data":[141,72,56,96,83,131,175,168,77,225,201,197,37,213,83,45,147,122,115,84]},"announce":[],"urlList":[]}}