{"title":"Charles Mingus - The Black Saint and the Sinner Lady (1963) Flac","uid":8884354,"size":858613073,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d5461781119f7e43eb9b52457ac38762e62c871&amp;dn=Charles+Mingus+-+The+Black+Saint+and+the+Sinner+Lady+%281963%29+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"77ausy","files":-1,"time":1378413329,"description":"\n\n=====================================\n\nThe Black Saint and the Sinner Lady is one of the greatest achievements in orchestration by any composer in jazz history.\n Charles Mingus consciously designed the six-part ballet as his magnum opus, and -- implied in his famous inclusion of\n liner notes by his psychologist -- it's as much an examination of his own tortured psyche as it is a conceptual piece\n about love and struggle. It veers between so many emotions that it defies easy encapsulation; for that matter, it can be\n difficult just to assimilate in the first place. Yet the work soon reveals itself as a masterpiece of rich, multi-layered \ntexture and swirling tonal colors, manipulated with a painter's attention to detail. There are a few stylistic reference\n points -- Ellington, the contemporary avant-garde, several flamenco guitar breaks -- but the totality is quite unlike \nwhat came before it. Mingus relies heavily on the timbral contrasts between expressively vocal-like muted brass,\n a rumbling mass of low voices (including tuba and baritone sax), and achingly lyrical upper woodwinds, highlighted\n by altoist Charlie Mariano. Within that framework, Mingus plays shifting rhythms, moaning dissonances, \nand multiple lines off one another in the most complex, interlaced fashion he'd ever attempted.\n Mingus was sometimes pigeonholed as a firebrand, but the personal exorcism of Black Saint deserves the reputation\n -- one needn't be able to follow the story line to hear the suffering, mourning, frustration, and caged fury pouring\n out of the music. The 11-piece group rehearsed the original score during a Village Vanguard engagement, where Mingus\n allowed the players to mold the music further; in the studio, however, his exacting perfectionism made The Black Saint\n and the Sinner Lady the first jazz album to rely on overdubbing technology. The result is one of the high-water marks\n for avant-garde jazz in the '60s and arguably Mingus' most brilliant moment. \n\n=============================================\n\nTracklist\n\n1\tTrack A: Solo Dancer\t6:39\n2\tTrack B: Duet Solo Dancers\t6:45\n3\tTrack C: Group Dancers\t7:22\n4\tMode D: Trio and Group Dancers / Mode E: Single Solos and Group Dance / Mode F: Group and Solo Dance\t18:39\n\n==============================================\n\nGeneral\n\nFile size                                : 818 MiB\nAlbum                                    : The Black Saint and the Sinner Lady\nTrack name/Total                         : 4\nPerformer                                : Charles Mingus\nComposer                                 : Charles Mingus\nGenre                                    : Jazz\nRecorded date                            : 1963\n\n\n===========================================\n\nAudio\n\nFormat                                   : FLAC\nFormat/Info                              : Free Lossless Audio Codec\nDuration                                 : 6mn 38s\nBit rate mode                            : Variable\nBit rate                                 : 3 003 Kbps\nChannel(s)                               : 2 channels\nSampling rate                            : 96.0 KHz\nBit depth                                : 24 bits\nWriting library                          : libFLAC 1.2.1 (UTC 2007-09-17)","torrent":{"xt":"urn:btih:8d5461781119f7e43eb9b52457ac38762e62c871","amp;dn":"Charles+Mingus+-+The+Black+Saint+and+the+Sinner+Lady+%281963%29+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d5461781119f7e43eb9b52457ac38762e62c871","infoHashBuffer":{"type":"Buffer","data":[141,84,97,120,17,25,247,228,62,185,181,36,87,172,56,118,46,98,200,113]},"announce":[],"urlList":[]}}