{"title":"The Complete Idiot's Guide To Learning French On your Own","uid":4360220,"size":8741099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dcc6e225bcab67bfedd87e035f774331a4cd116&amp;dn=The+Complete+Idiot%5C%27s+Guide+To+Learning+French+On+your+Own&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"m666m","files":1,"time":1219610421,"description":"Why and How this Book Is Meant for You\nThe six parts of this book will take you from the very basics to more extensive knowledge of the patterns of the language. Keep in mind that this is not a phrase book, a dictionary, a grammar book, or a tour book. Rather, it is a combination of the four, with an emphasis on teaching you to communicate effectively in everyday situations: to socialize, to give and obtain information, to express your opinions, to persuade friends and family members to follow a course of action and, plainly and simply, to help you get what you want when you want it. Students, tourists, and business people alike will find this book useful, informative, and easy to use. Each chapter is based on a theme that ties together vocabulary, useful phrases, and grammar, and that provides authentic materials and activities that will give you a better understanding of French-speaking people and immerse you in their culture.\n\nHere s what the book covers:\n\nPart 1, &quot;The Very Basics&quot;, begins by discussing why French should be a part of your life, is followed by a phonetic pronunciation guide designed for the shy and easily intimidated speaker, and then proceeds to show you just how much French you know before you even get started. Idioms, slang, and typical gestures are presented, as well as basic, elementary grammar terms and rules. Almost immediately you will be able to engage in simple conversations and ask and answer easy questions.\n\nPart 2, &quot;Travel&quot;, will help you to plan and take a trip. You ll learn how to express greetings and salutations, and introduce, speak about, and describe yourself and your traveling companions. You ll even be able to ask nosy questions. There s a chapter to help you find your way around the airport, and another that will help you get transportation to wherever you are going (even if you are renting a car). You ll find yourself a pro at giving and receiving directions. Finally, this part will ensure that you get the room you want, with all the creature comforts you desire.\n\nPart 3, &quot;Fun and Games&quot;, promises that you will have the greatest experience ever. This section presents in detail anything and everything you could possible want to do in a foreign country: sports, concerts, museums, tourist attractions. You will learn how to interpret the weather report, express your opinions and preferences, and make suggestions. More important, the two chapters on food will enable you to understand and expertly order from a menu, and ensure that you dine on the finest dishes that French cuisine has to offer even if you follow a special diet. Finally, the chapter on shopping will allow you to buy whatever your heart desires, from haute couture fashions (don t worry, everything will fit if you use the conversion tables) to souvenirs for your loved ones.\n\nPart 4, &quot;Problems,&quot; prepares you for them all. You ll be able to phone home, receive medical attention and assistance, and get your hair done, clothes cleaned, camera fixed, glasses repaired, shoes resoled, prescriptions filled, and mail delivered. You ll even be able to explain what happened in the past.\n\nPart 5, &quot;Let s Get Down to Business,&quot; helps you deal with common business transactions. This section includes a mini-dictionary for banking terms. When you re through with this chapter, you ll even be able to buy or rent a piece of property abroad and be able to express your present and future needs.\n\nPart 6, &quot;Answer Key,&quot; gives you the answers to all of the exercises in this book. By the time you have finished this book, you will have studied and practiced skills that will enable you to feel confident in social and business situations where French is required. It is simply a matter of finding the time, being patient, making the effort to test your abilities, and creating your own adventure.","torrent":{"xt":"urn:btih:8dcc6e225bcab67bfedd87e035f774331a4cd116","amp;dn":"The+Complete+Idiot%5C%27s+Guide+To+Learning+French+On+your+Own","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dcc6e225bcab67bfedd87e035f774331a4cd116","infoHashBuffer":{"type":"Buffer","data":[141,204,110,34,91,202,182,123,254,221,135,224,53,247,116,51,26,76,209,22]},"announce":[],"urlList":[]}}