{"title":"Leadership Roles and Management Functions in Nursing [PDF] [Stor","uid":11511591,"size":15198850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dcda2234e419753c5086738fcaa48e6f172929f&amp;dn=Leadership+Roles+and+Management+Functions+in+Nursing+%5BPDF%5D+%5BStor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":2,"time":1416406564,"description":"TITLE/EDITION Leadership Roles and Management Functions in Nursing: Theory and Application\nAuthor: Bessie L Marquis RN CNAA MSN (Author), Carol J. Huston MSN MPA DPA (Author)\nPaperback: 624 pages\nPublisher: LWW; Eighth, North American Edition edition (February 20, 2014)\nLanguage: English\nISBN-10: 1451192819\nISBN-13: 978-1451192810\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n_)_________________________________________________________________________________\n\n\nDevelop the skills you'll need on the job - from organizing patient care and motivating staff to managing conflict and working collaboratively - with this new edition of the number 1 selling book for the course. The authors provide a concise, user-friendly synthesis of application and theory and a unique focus on critical thinking, problem solving, and decision making. Over 240 case studies are drawn from a variety of health care settings, including 15-25 new cases that focus on the new nurse or first-level manager. Prepare to take on leaderships roles in nursing practice with Examining the Evidence sections in each chapter that provide new research findings, evidence-based practice, and best practices in leadership and management. Enhance your critical-thinking skills with more than 250 Learning Exercises, that put you in the role of a nurse-manager: assessing, deciding, and executing. You can reinforce your understanding of key ideas with Break Out Comments in every chapter. You can master complex information with tables, displays, and illustrations. You can prepare for exams with Key Concepts that summarize each chapter's important information. You can take your learning beyond the book a wide range of online learning tools, including with Web links for each chapter that guide you to new information","torrent":{"xt":"urn:btih:8dcda2234e419753c5086738fcaa48e6f172929f","amp;dn":"Leadership+Roles+and+Management+Functions+in+Nursing+%5BPDF%5D+%5BStor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dcda2234e419753c5086738fcaa48e6f172929f","infoHashBuffer":{"type":"Buffer","data":[141,205,162,35,78,65,151,83,197,8,103,56,252,170,72,230,241,114,146,159]},"announce":[],"urlList":[]}}