{"title":"Barry Long Talks - A Collection Of Audiobooks And Podcasts","uid":4171813,"size":247084120,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8e02c66e07403cb5dc4f6726e95054caa9a59996&amp;dn=Barry+Long+Talks+-+A+Collection+Of+Audiobooks+And+Podcasts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"pubfood22","files":14,"time":1209915598,"description":"Barry Long Talks. \n\nA Collection Of Audiobooks And Podcasts Released over the Years.\n\nAll items Encoded in 40Kbps.\n\nPlease remember to keep seeding your torrents after downloading, Thank you.\n\n\nPlaylist files:\n\n      1. Barry Long - A Journey In Consciousness - Disc 1 (63:25)\n      2. Barry Long - A Journey In Consciousness - Disc 2 (77:10)\n      3. Barry Long - Barry Long - How To Live Joyously - Disc 1 (63:52)\n      4. Barry Long - Barry Long - How To Live Joyously - Disc 1 (76:51)\n      5. Barry Long - Making Love - Disc 1 (72:28)\n      6. Barry Long - Making Love - Disc 2 (75:21)\n      7. Barry Long - Seeing Through Death (79:35)\n      8. Barry Long - Start Meditating Now - Disc 1 (77:33)\n      9. Barry Long - Start Meditating Now - Disc 2 (52:43)\n      10. Barry Long - Being Honest To Love [Podcast] (80:44)\n      11. Barry Long - Being Responsible For Love [Podcast] (68:59)\n      12. Barry Long - Now - The Secret of Infinity [Podcast] (80:49)\n\n\n----------------------------------------------------------------------------\n\nAbout Barry Long.\n\nBarry Long (August, 1926 - December 6, 2003[1]) was an Australian spiritual teacher and writer.\n\nBorn and raised in Australia with little formal education, by his twenties, Long, married with two children, was an editor of a Sunday newspaper and press secretary in the New South Wales Parliament. By his early thirties he began to experience a disillusionment with his material life and in 1964 he abandoned everything and went to India. There he experienced a spiritual crisis culminating in a mystic death, which he called his &quot;realisation of immortality,&quot; followed four years later by a &quot;transcendental realisation&quot;; a contact with a depth of consciousness from which his knowledge of universal reality ultimately derived[2].\n\nAfter leaving India he moved to London, living in Highgate and working as a sub-editor in Fleet Street until he was able to support himself from teaching and publishing. In 1986 he returned to his native Australia, living on Mount Tamborine QLD with his wife Kathy and young stepson, Simon, then in Burleigh Heads QLD when they divorced, and finally moving to Crabbes Creek NSW where he lived until his death from prostate cancer in December 2003.\n\nLong stated that he was a tantric master and that unhappiness arises because man and woman have forgotten how to love each other. In 1984 he recorded a double audio cassette Making Love: Sexual Love the Divine Way, later published as a book and now on CD.[3].\n\nHe started his public teaching in England and later went on to teach worldwide; in Australia and New Zealand, Europe including Scandinavia and Russia, the USA and Canada. His last public seminar was the tenth annual 14 day Master Session held at Bond University on the Gold Coast of Queensland, Australia in late October 2002.\n\nIn his last year he continued to write including articles about the approach to death which were published on his website. There are fourteen of his books in print in English with translations in ten languages[4]. His autobiography and last works are yet to be published. His works in English in book, audio and video form continue to be published and disseminated by the Barry Long Foundation International, based in NSW, Australia [5].\n\nBarry Long&amp;#039;s teaching\n\nBarry Long&amp;#039;s teaching focuses on freeing the individual from unhappiness which he defined as &amp;#039;happy today, unhappy tomorrow&amp;#039;[6].\n\nHe stated that this fluctuating condition is set in motion and maintained by an addiction to thoughts and the emotions they create. These emotions encourage other thoughts and so a vicious cycle is initiated. We are trapped in this cycle, he felt, until we follow a way of getting out, which he called &quot;the way of truth&quot;. It includes:\n\n    * constant vigilance in observation of one&amp;#039;s thoughts, emotions and actions[7];\n    * meditation to still the mind and connect with life within i.e. what &quot;I&quot; call &quot;me&quot;; &quot;feeling the well-being in the body&quot; [8];\n    * being, without thought; the next step on from meditation[9];\n    * getting your life right, taking action in those areas of your life which disturb you because something is wrong there\n\nA particular example of the last which assumed greater prominence in the public mind than Barry wished was getting the relationship between man and woman right. This was the issue that Barry perceived caused the greatest unhappiness in the society that he was addressing, the late-twentieth century post-industrial West. He taught and wrote in detail about sexual love between man and woman and its use to purify them both and rid them of personal, human love [10][11]. The sexual aspects of his teaching gained most notoriety, but he said many times that getting your life right in all its aspects, and prolonged selfless giving were more important. Such a person would naturally attract a loving sexual partner.\n\nBarry also wrote about many other aspects of &quot;Love, Life, Truth, God and Death&quot;. In The Origins of Man and the Universe he presents his cosmology [12]. He taught and spoke about family life and the importance of raising children from birth in justice and truth not just love. [13]. In response to the September 2001 terrorist attacks in the USA, an extract on terrorism from his Origins book written in 1983 was published separately [14]as well as a new book &amp;#039;A Prayer for Life: The Cause and Cure of Terrorism, War and Human Suffering&amp;#039;.\n\nBarry&amp;#039;s family life\n\nBarry&amp;#039;s abandonment of his family in 1964 left his 12 year old daughter ?devastated?. He said he was going to India for 2 years and would then return. He never came back. His wife did not find out for a long time that he had met his secretary, Ann Lane, in India. His daughter did not see him again until she was 19. During those years she wrote to him for help and advice but he refused to be involved with her, telling her that she was her mother&amp;#039;s responsibility[15].\n\nIncluding his first wife he married or lived monogamously with five women, three of whom he left or divorced: Betty, his first wife; Julie, whom he married in England and who left her 2 sons, because Barry did not want any children around him; after Julie&amp;#039;s death from cancer, he married Kathy in England; after divorcing Kathy, he lived with Josephine (whose name he changed to Jade); and then Sara, who was with him when he died. Between the monogamous relationships with Jade and Sara, for three years he had a relationship with five women simultaneously: Jade, Dawn, Moira, Linda (who changed her name to Sally), and Sara [16].\n\nControversy\n\nIn some quarters there is controversy about his teachings, particularly his separation of feelings from sensation [17]; his teachings on sex and love[18][19], his attitude towards women and children and his understanding of science and scientists.[20]","torrent":{"xt":"urn:btih:8e02c66e07403cb5dc4f6726e95054caa9a59996","amp;dn":"Barry+Long+Talks+-+A+Collection+Of+Audiobooks+And+Podcasts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e02c66e07403cb5dc4f6726e95054caa9a59996","infoHashBuffer":{"type":"Buffer","data":[142,2,198,110,7,64,60,181,220,79,103,38,233,80,84,202,169,165,153,150]},"announce":[],"urlList":[]}}