{"title":"(1972) John Lennon Yoko Ono (Plastic Ono Band) - Sometime in New","uid":9842831,"size":842319337,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e033c33b9622193398432ff910909aabd4ae5a0&amp;dn=%281972%29+John+Lennon+Yoko+Ono+%28Plastic+Ono+Band%29+-+Sometime+in+New&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"100.XY","files":-1,"time":1396019055,"description":"(1972) John Lennon &amp; Yoko Ono - Sometime in New York City\n\n\n\nReview:\nThe first album co-billed to John Lennon and Yoko Ono to actually contain recognizable pop music, Some Time in New York City found the Lennons in an explicitly political phase. This was understandable -- at the time, Lennon was neck-deep in his struggle to remain in the United States, a conflict rooted in his antiwar and antiestablishment politics and the enmity of the Nixon administration. At the same time, having written, recorded, and released the music on the Plastic Ono Band and Imagine albums -- and musically exorcising many of the emotional demons associated with aspects of his past, and working out a musical and publishing &quot;divorce&quot; from Paul McCartney -- he was now reveling in the freedom of being an ex-Beatle and exploring music and other subjects that he'd never felt fully free to delve into during the first decade of his career. This album was actually a long time in coming, as there had been hints of Lennon moving in this direction for years -- he'd long looked upon Bob Dylan with unabashed envy, emulating his sound at moments (&quot;You've Got to Hide Your Love Away&quot;) and striving for some of the same mix of edginess and depth, once the group got beyond its original two-guitars-bass-drums and love songs sound; &quot;Revolution&quot; (and &quot;Revolution No. 1&quot;) and the anthems &quot;Give Peace a Chance&quot; and &quot;Power to the People&quot; saw him trying to embrace outside subjects in his work, and Some Time in New York City carried his writing a step further in this direction, introducing John Lennon, protest singer -- true, he was ten years late, in terms of the musical genre (even Joan Baez and Judy Collins were doing pop-style records by then), but it was a logical development given the time in Lennon's life and the strife-filled era with which it coincided. Seeking his own voice in all of its permutations, and living amid the bracing pace of New York City (which made London, much less Liverpool, look like a cultural and political backwater), Lennon entered a phase similar to Dylan's 1963-1964 period, represented by songs such as &quot;The Ballad of Hollis Brown,&quot; &quot;The Death of Emmett Till,&quot; and &quot;Talking John Birch Society Blues.&quot; Except that where Dylan had toned down that side of his work, never officially releasing his versions of two of those songs (the two most confrontational, in fact), Lennon didn't hold back, delivering his topical songs with both barrels smoking, expounding on such topical subjects as radical feminism, the Attica prison riot, the treatment of activists John Sinclair and Angela Davis, and the rising strife in Northern Ireland (which was on its way to becoming for the British the same kind of military and political quagmire that Vietnam was for America). Lennon had some advantages in getting heard, as an ex-Beatle, not an up-and-coming talent as Dylan had been a decade earlier, and if the subject matter of his new songs puzzled or alienated some fans, he also still had a huge amount of rock &amp; roll street cred, which was only enhanced at the time by his having made Nixon's enemies list; at the time, there were a lot of people to whom that mattered more than his past as a Beatle -- at the April 24 antiwar rally in New York in 1971, where he appeared with Yoko Ono and the Elephant's Memory Band, he showed himself to be among the few musicians who could get a quarter of a million or more people singing and chanting spontaneously, in unison. And Some Time in New York City was a logical progression from that event. Especially in the case of Lennon's songs, there is an appealing rock style to the material here, even if the lyrics limit the record's appeal. And even Yoko's songs have something to recommend them, &quot;Sisters, O Sisters&quot; representing a peculiar form of reggae-pop, &quot;Born in a Prison&quot; possessing a strange pop ambience, and &quot;We're All Water&quot; offering a preview of late-'70s punk/new wave rawness (Lena Lovich may well have worn out that track). At the time of its release in June of 1972, all except the most devoted fans were put off by the album's topicality and in-your-face didacticism, and the bonus live disc was challenging in other ways. Heard today, the studio disc rocks in enough of the right places, as well as drawing on influences ranging from blues to reggae, to surprise listeners and even delight them -- the relatively tuneless &quot;Sunday, Bloody Sunday&quot; manages to favorably recall elements of &quot;Come Together,&quot; and both it and &quot;New York City&quot; have some of the best electric guitar ever heard on a Lennon album, while &quot;John Sinclair&quot; shows off Lennon's blues playing (on a steel National guitar, no less) brilliantly. Even those who were of the left at the time may wince at &quot;Angela&quot; some decades on, but &quot;We're All Water&quot; has lost none of its intellectual or musical resonances, even if Nixon and Mao are long dead. The Elephant's Memory Band may not be the best set of musicians that Lennon could have been working with, but that was less important than the fact that he seemed to respond to their club band R&amp;B and jazz background with a roots-oriented approach to songwriting that's ultimately refreshing. Co-producer Phil Spector gives most of the music a larger-than-life ambience, with a reverb-drenched, rhythm-heavy approach recalling his Wall of Sound productions, which gives a lot of even the most didactic songs a big-band pop/rock smoothness, when the songs weren't lean and stripped down like &quot;John Sinclair&quot; (which sounds in terms of texture like a Furry Lewis side from 1930). Some Time in New York City was released with a &quot;free&quot; bonus disc containing a live medley of Lennon's &quot;Cold Turkey&quot; and Ono's &quot;Don't Worry Kyoko,&quot; from an antiwar rally at the Lyceum in London with George Harrison, and an appearance by the Lennons at a Mothers of Invention concert from the Fillmore East. The Lyceum tracks were well recorded and, apart from both going on too long, exude a certain power; these may not be the songs you'd have had performed at the one recorded post-Beatles concert appearance by Lennon and Harrison, but &quot;Cold Turkey&quot; is good, if a little disorganized near the end, and &quot;Don't Worry Kyoko&quot; has some pretty fair rock &amp; roll jamming going on behind Ono's vocal acrobatics; the Fillmore stuff sounds less good technically, and captures a spontaneous moment that's mostly wasted, though not without a moment of personal musical reflection from Lennon in &quot;Well (Baby Please Don't Go).&quot; Alas, the presence of the second disc now makes this the most expensive of all Lennon's CD releases, virtually ensuring that it remain the least known of his mainline albums, especially for any fans who weren't around in 1972.\nReview by Bruce Eder\n\n\nimage\n\n\n\nTrack List:\n\nDisc 1\n01. Woman Is The Nigger Of The World 05:16\n02. Sisters, O Sisters 03:48\n03. Attica State 02:55\n04. Born In A Prison 04:05\n05. New York City 04:31\n06. Sunday Bloody Sunday 05:02\n07. The Luck Of The Irish 02:59\n08. John Sinclair 03:30\n09. Angela 04:07\n10. We're All Water 07:11\n\nDisc 2\n01. Cold Turkey 8:35\n02. Don't Worry Kyoko 16:01\n03. Well (Baby Please Don't Go) 4:41\n04. Jamrag 5:36\n05. Scumbag 6:08\n06. AuÌˆ 6:23\n\n\nSummary:\nCountry: USA\nGenre: Rock\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~784-934 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits","torrent":{"xt":"urn:btih:8e033c33b9622193398432ff910909aabd4ae5a0","amp;dn":"%281972%29+John+Lennon+Yoko+Ono+%28Plastic+Ono+Band%29+-+Sometime+in+New","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e033c33b9622193398432ff910909aabd4ae5a0","infoHashBuffer":{"type":"Buffer","data":[142,3,60,51,185,98,33,147,57,132,50,255,145,9,9,170,189,74,229,160]},"announce":[],"urlList":[]}}