{"title":"Principles of Surface Enhanced Raman Spectroscopy and Related Pl","uid":15988817,"size":12645125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e27336ddbe0c2ab042e98ca3b72f15726555321&amp;dn=Principles+of+Surface+Enhanced+Raman+Spectroscopy+and+Related+Pl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"clouderone","files":1,"time":1475988001,"description":"Principles of Surface Enhanced Raman Spectroscopy and Related Plasmonic Effects - Eric C. Le Ru, Pablo G. Etchegoin (Elsevier, 2009).pdf\r\n\r\nSERS was discovered in the 1970s and has since grown enormously in breadth, depth, and understanding. One of the major characteristics of SERS is its interdisciplinary nature: it lies at the boundary between physics, chemistry, colloid science, plasmonics, nanotechnology, and biology. By their very nature, it is impossible to find a textbook that will summarize the principles needed for SERS of these rather dissimilar and disconnected topics. Although a basic understanding of these topics is necessary for research projects in SERS with all its many aspects and applications, they are seldom touched upon as a coherent unit during most undergraduate studies in physics or chemistry. This book intends to fill this existing gap in the literature. It provides an overview of the underlying principles of SERS, from the fundamental understanding of the effect to its potential applications. It is aimed primarily at newcomers to the field, graduate students, researchers or scientists, attracted by the many applications of SERS and plasmonics or its basic science. The emphasis is on concepts and background material for SERS, such as Raman spectroscopy, the physics of plasmons, or colloid science, all of them introduced within the context of SERS, and from where the more specialized literature can be followed.\r\n\r\nRepresents one of very few books fully dedicated to the topic of surface-enhanced Raman spectroscopy (SERS)\r\nGives a comprehensive summary of the underlying physical concepts around SERS\r\nProvides a detailed analysis of plasmons and plasmonics","torrent":{"xt":"urn:btih:8e27336ddbe0c2ab042e98ca3b72f15726555321","amp;dn":"Principles+of+Surface+Enhanced+Raman+Spectroscopy+and+Related+Pl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e27336ddbe0c2ab042e98ca3b72f15726555321","infoHashBuffer":{"type":"Buffer","data":[142,39,51,109,219,224,194,171,4,46,152,202,59,114,241,87,38,85,83,33]},"announce":[],"urlList":[]}}