{"title":"Computer Architecture Book Collection","uid":9687354,"size":2368892752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e2ad03bc44ebba5dbcfc7adbb1779bc53644166&amp;dn=Computer+Architecture+Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"ebooksports","files":124,"time":1393797399,"description":"Computer Architecture Book Collection\n-------------------------------------\n\nAbd-El-Barr, El-Rewini: Advanced Computer Architecture and Parallel Processing. 2005 (PDF)\nAbd-El-Barr, El-Rewini: Fundamentals of Computer Organization and Architecture 2005 (PDF)\nAndrew S. Tanenbaum, Maarten Van Steen: Prentice Hall: Distributed Systems, Principles And Paradigms. 2007 (PDF)\nAndrew S. Tanenbaum, Maarten Van Steen: Prentice Hall: Distributed Systems, Principles And Paradigms. (Problem Solutions)(2001) (PDF)\nAndrew S. Tanenbaum: Structured Computer Organization 5th (PDF)\nAndrew S. Tanenbaum, Todd Austin: Structured Computer Organization. 6th (PDF)\nARM Limited: ARM Architecture Reference Manual (June, 2000) (PDF)\nArnold S. Berger: Hardware and Computer Organization. The Software Perspective. 2005 (PDF)\nBailey, Lucas, Williams: Performance Tuning of Scientific Applications (PDF)\nBarrie Sosinsky: Cloud Computing Bible (EPUB)\nBarrie Sosinsky: Cloud Computing Bible (PDF)\nBarry B. Brey: The Intel Microprocessors. 4th (PDF)\nBlanchet, Dupouy: Computer Architecture. 2013 (PDF)\nBlum, Aho: Computer Science. The Hardware, Software and Heart of It (PDF)\nCarl Hamacher: Computer Organization 2002 (PDF)\nChandra M. R. Thimmannagari: CPU Design Answers to Frequently Asked Questions (PDF)\nCharles Petzold: Code The Hidden Language of Computer Hardware and Software  -Microsoft Press(2000) (PDF)\nCharles Severance, Kevin Dowd: High Performance Computing (PDF)\nColin Walls: Embedded Software: The Works (PDF)\nComputer Arithmetic: Principles, Architectures and VLSI Design (PDF)\nCrawley, Nikolic, Forshaw: 3d Nanoelectronic Computer Architecture and Implementation (PDF)\nDaniel Page: Gries, Schneider: A Practical Introduction to Computer Architecture (PDF)\nDavid J. Lilja: Measuring Computer Performance (PDF)\nDavid Tarnoff: Computer Organization and Design Fundamentals (PDF)\nD. Harris, S. Harris: Digital Design and Computer Architecture 2nd (PDF)\nD. Harris, S. Harris: Digital Design and Computer Architecture (PDF)\nDominic Sweetman: See MIPS Run (PDF)\nDon Anderson, Jay Trodden: Hypertransport system architecture (CHM)\nEmanuel Udoh: Cloud, Grid and High Performance Computing (PDF)\nFisher, Faraboschi, Young: Embedded Computing. A VLIW Approach to Arichecture, Compilers, and Tools (PDF)\nFlynn, Luk: Computer System Design. System-on-Chip (PDF)\nF. Mayer-Lindenberg: Dedicated Digital Processors 2004 (PDF)\nGaster, Howes, Kaeli, Mistry, Schaa: Heterogeneous Computing with OpenCL (PDF)\nGeodecker, Hoiste: Performance Optimization of Numerically Intesive Codes (DJVU)\nGlen E. Clarke, Ed Tetz: CompTIA A+ Cerification for Dummies (PDF)\nGonzales, Latorre, Magklis: Processor Microarchitecture. An Implementation Perspective (PDF)\nGraham Wilson: Embedded Systems and Computer Architecture (PDF)\nGrant McFalrand: Microprocesor Desing. 2006 (PDF)\nGuide to RISC Processors: For Programmers and Engineers: ISBN-0387210172 (PDF)\nHamacher, Vrasenic, Zaky, Manjikian: Computer Organization and Embedded Systems 6th .2011 (PDF)\nHarvey G. Craygon: Computer Architecture and Implementation (DJVU)\nHennessy, Patterson: Computer Architecture. A Quantitative Approach: 3ed 2003 (PDF)\nHennessy, Patterson: Computer Architecture. A Quantitative Approach: 4ed 2007 (PDF)\nHennessy, Patterson: Computer Architecture. A Quantitative Approach. 5th (PDF)\nHennessy, Patterson: Computer Organization and Design. The Hardware, Software interface. 3th (PDF)\nHennessy, Patterson: Computer Organization and Design. The Hardware, Software interface. 4th 2009 (PDF)\nHennessy, Patterson: Computer Organization and Design. The Hardware, Software interface. 5th 2013 (EPUB)\nHennessy, Patterson: Computer Organization and Design. The Hardware, Software interface. 5th 2013 (PDF)\nHow It Works: The Computer (Ladybird) (1971) (pointlessmuseum).rar\nHow It Works: The Computer (Ladybird) (1979) (pointlessmuseum).rar\nIrv Englander: The Architecture of Computer Hardware, System Software and Networking 4th (PDF)\nJ.A.Fisher: Embedded Computing (PDF)\nJames A. Langbridge: Professional Embedded ARM Development (EPUB)\nJames A. Langbridge: Professional Embedded ARM Development (PDF)\nJames S. Evans and Gregory L. Trimper: Itanium architecture for programmers. Understanding 64-bit processors and EPIC principles. ISBN 0131013726 (CHM)\nJavaid, Parameswaran: Pipelined Multiprocessor System-on-Chip for Multimedia (PDF)\nJean-Loup Baer: Microprocessor Architecture. From Simple Pipelines to Chip Multiprocessors (PDF)\nJeffers, Reinders: Intel Xeon Phi Coprocessor High Performance Programming (EPUB)\nJohn Levesque: High Performance Computing. Programming and Applications. CRC 2011 (PDF)\nJohn Y. Hsu: Computer Architecture. Software Aspect, Coding, And Hardware (PDF)\nJoseph D. Dumas: Computer Architecture. Fundamentals and Principles of Computer Design (PDF)\nJoseph Yiu: The Definitive Guide to ARM Cortex M3 and Cortex M4 Processors 2014 (PDF)\nJoseph Yiu: The Definitive Guide to the ARM Cortex M0 2011 (PDF)\nKaye, Laflamme, Mosca: An Introduction to Quantum Computing (PDF)\nKeith E. Curtis: Embedded Multitasking with Small Microcontrollers (PDF)\nKrisztof Iniewski: CMOS Processors and Memories (PDF)\nKrzystof Iniewski: Embedded Systems. Hardware, Design and Implementation (PDF)\nKumar, Corporaal, Mesman, Ha: Multimedia Multiprocessor Systems (PDF)\nKurzak, Bader, Dongarra: Scientific Computing with Multicore and Accelerators (PDF)\nLibro Hardware Mcgraw Hill: Complete Digital Design A Comprehensive Guide To Digital Electronics And Computer System Architecture (PDF)\nLinda Null, Julia Lobur: The Essentials of Computer Organization and Architecture (PDF)\nManolache, Eles, Peng: Real-Time Applications with Stochastic Task Execution Times (PDF)\nMaxfield, Brown: The Definitive Guide to How Computers Do Math (PDF)\nMazidi: The 80x86 IBM PC and Compatible Computers 4th (PDF)\nMi Lu: Arithmetic and Logic in Computer Systems (PDF)\nMircea Vladutiu: Computer Arithmetics. Algorithms and Hardware Implementations (PDF)\nMorley, Parker: Understanding Computers. 13th (PDF)\nMorris Mano: Computer System Architecture 3rd (PDF)\nM. Rafiquazzaman: Fundamentals of Digital Logic and Microcomputer Design. 5th (PDF)\nMurdocca, Heuring: Principles of Computer Architecture (Prentice Hall-1999) (PDF)\nNagel, Kroner, Resch: Hight Performance Computing in Science and Engineering 11 (PDF)\nNewnes: Embedded software. know it all (PDF)\nNick Antonopoulos, Lee Gillam: Cloud Computing (PDF)\nNisan, Schoken: The Elements of Computing Systems  Building a Modern Computer from First Principles (EPUB)\nP.A.Laplante: Real-Time Systems Design and Analysis (PDF)\nPanos Lekkas: Network Processors: Architectures, Protocol and Platforms (PDF)\nPaolo Ienne, Rainer Leupers: Customizable Embedded Processors (PDF)\nPaul E. Ceruzzi: A History of Modern Computing, 2nd Ed (PDF)\nProgramming the Cell Processor: For Games, Graphics, and Computation Oct 2008 (CHM)\nProgramming the Cell Processor: For Games, Graphics, and Computation Oct 2008-SOURCE.rar\nRainer Leupers: Code Optimization Techniques for Embedded Processors. Methods, Algorithms, and Tools (PDF)\nRalus, Rajwar: Transactional Memoery. Syntheris Lectures on Computer Architecture 2 (PDF)\nRezaur Rahman: Intel Xeon Phi Copreocessor Architecture and Tools (EPUB)\nRezaur Rahman: Intel Xeon Phi Copreocessor Architecture and Tools (PDF)\nRichard Zurawski: Embedded Systems Handbook (PDF)\nR.M.Needham: Computer Systems: Theory, Technology, and Applications: A Tribute to Roger Needham. 2004 (PDF)\nRoger Yound: How Computer Work (PDF)\nRon White: How Computers Work (9th Edition) (PDF)\nSajjan G. Shiva: Computer Design and Architecture Revised and Expanded-0824703685 (PDF)\nSajjan G. Shiva: Computer Organization 4th (PDF)\nShen, Lipa: Modern processor design. Fundamentals of Superscalar Processors (DJVU)\nSivarama P. Dandamudi: Fundamentals of Computer Organization and Design 2002 (PDF)\nSpringer: Multicore Processors and Systems (PDF)\nSriram, Bhattacharyya: Embedded Multiprocessors. Scheduling and Synchronization (PDF)\nSteve Furber: ARM SoC Architecture, 2nd Edition (PDF)\nSteve Furber: ARM System-on-chip architecture. 2nd (PDF)\nTammy Noergaard: Elsevier-Embedded Systems Architecture   A Comprehensive Guide for Engineers and Programmers (PDF)\nThe ARM7TDMI Introduction and Architecture. Presentation (PDF)\nTom Shanley: Pentium Pro and Pentium II System Architecture (PDF)\nTom Shanley: The Unabridged Pentium 4 IA32 Processor Genealogy (CHM)\nTrevor Martin: Insider's Guide To The Arm7 Microcontroller (PDF)\nUlrich Drepper: What Every Programmer Should Know About Memory (PDF)\nUniversity of California: Embedded System Design A Unified Hardware Software Approach: 1999 (PDF)\nVeljko Milutinovic: Surviving the Design of Microprocessor and Multimicroprocessor Systems (PDF)\nVeljsko Milutinovic: Surviving the Desing of Microprocessor and Multimicroprocessor Systems (PDF)\nVerma, Marwedel: Advanced Memory Optimization Techniques for Low-Power Embedded Processors (PDF)\nVojin G. Oklobdzija: Digital Systems and Applications 2e (PDF)\nWagner, Steinmetz, Bode, Muller: High Performance Computing in Science and Engineering (PDF)\nWang, Naffziger: Adaptive Techniques for Dynamic Processor Optimization (PDF)\nWarren A. Hunt: FM8501: A Verified Microprocessor (DJVU)\nWilliam Stallings: Computer Organization and Architecture 6th (PDF)\nWilliam Stallings: Computer Organization and Architecture 8th (PDF)\nWilliam Stallings: Computer Organization and Architecture 9th (PDF)\nWolfgang W. Osterhage: Computer Performance Optimization (PDF)","torrent":{"xt":"urn:btih:8e2ad03bc44ebba5dbcfc7adbb1779bc53644166","amp;dn":"Computer+Architecture+Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2ad03bc44ebba5dbcfc7adbb1779bc53644166","infoHashBuffer":{"type":"Buffer","data":[142,42,208,59,196,78,187,165,219,207,199,173,187,23,121,188,83,100,65,102]},"announce":[],"urlList":[]}}