{"title":"The Nature Of Things Collection 3 01of12 Arctic Meltdown Changin","uid":11543065,"size":1067532870,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8e2e40bc3710a0f395f8dc361b06dd156e6fa910&amp;dn=The+Nature+Of+Things+Collection+3+01of12+Arctic+Meltdown+Changin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"MVGroup","files":-1,"time":1416688672,"description":"The Nature of Things: (Collection Three)\n\nScience Documentary hosted by David Suzuki, published by CBC in 2010 - English narration\n\n\nInformation\n------------------------------\n\nThe Nature of Things: (Collection Three) \nThe Nature of Things is one of the most successful series in the history of Canadian television. Hosted by the world-renowned geneticist and environmentalist, David Suzuki, the program is in its 53rd season, a landmark by any standard.\nEvery week, the influential program presents stories that are driven by a scientific understanding of the world. Stories full of adventure, drama and insight. Our programs entertain and inspire audiences by engaging with the people and personalities behind the science.\nFrom the search for other life in the universe to the psychology of babies, from the furry animals that invade your backyard to the consequences of human progress, The Nature of Things throws open the door to the wonder and accomplishments of science.\n\n\n1)  Arctic Meltdown: Changing World \nIn Episode 1: A Changing World, we see the changes that are upsetting the scientific predictions of the impact of climate change on the Arctic. Now, one sobering forecast is that the Arctic Ocean will be seasonally ice free by the summer of 2013. This possibility is what drives environmentalists to identify ways to minimize the changes affecting this snowy land. But for prospectors like Gordon McCreary, climate change brings new opportunities. He is part of the rush to claim the riches beneath the Arctic's ice: deposits of metals, gold, diamonds, and oil and gas.\n\n2)  Chasing Snowflakes \nWe have a relationship with few things in nature the way we do with snow: we hate it, we love it, and we think we understand it. But we barely know the contradictory and beautiful components of snow's character. But that's something scientists are changing. From the formation of single flakes to the howling 70 km/h winds of lake effect snow storms to the destructive power of avalanches, intrepid researchers are bringing snow science into the 21st Century.\n\n3)  Decoding Desire \nThe Birds do it. The bees do it. It seems we all do it. But we like to think we are different from other animals. So are we? Decoding Desire unravels the mysteries of sex and desire and explores how sexual diversity and the experience of pleasure itself may be the key to species survival. Traditionally, the common assumption has been that men are sexually dominant with strong desires, while females are more interested in security and monogamy. But is this really true? Scientists are increasingly looking at animals to reveal more about our own sexual behaviour.\n\n4)  Gone Sideways \nWhen most of us hear &quot;scientific research&quot;, it conjures the image of serious men and women in meticulous labs using carefully prescribed methods to achieve rather predictable outcomes. We have an expectation that science is calculated and controlled. Yet some of the most influential scientific discoveries have been made entirely by accident. Does chance work alone or are other phenomenons at play? Combining dramatic re-creation with cheeky animation and cleverly manipulated archival images, Gone Sideways illustrates three areas of exploration: medicine, technology and natural science.\n\n5)  Raccoon Nation \nIn an effort to outwit raccoons, are we pushing their brain development and perhaps even sending them down a new evolutionary path? Using high-definition, infrared cameras that turn pitch dark into daylight; we take viewers deep inside a world that was once shrouded in mystery - to gain new insights and understanding about a species that is far more elusive and wily than most people ever imagined. &quot;There is a lot we don't know, and the more we've looked at raccoons, the harder they are to understand.&quot; - Stan Gehrt, Wildlife Biologist &amp; Internationally recognized raccoon expert\n\n6)  Return of the Prairie Bandit \nTheir habitat once stretched across the Prairies, but when humans wiped out the one thing they eat, the black-footed ferret disappeared. The only native North American ferret, this mysterious animal became the most endangered species in the world. For many years, they survived only in zoos. Now a fledgling project is attempting to bring the black-footed ferret back to Saskatchewan. This dramatic story of the ferrets' reintroduction to the wild unfolds in Return of the Prairie Bandit, a new documentary by Kenton Vaughan set in the stunning prairie of southern Saskatchewan.\n\n7)  Stonehenge Uncovered \nStonehenge is an icon of prehistoric Britain, an enigma that has seduced archaeologists and tourists for centuries. Why is it here? What is its significance? And which forces inspired its creators? For the last four years, an international team has surveyed and mapped every monument, both visible and invisible, across 10 square kilometres of the sacred landscape to create a complete digital picture of Stonehenge and the surrounding area through time. Known monuments have yielded more data than ever before, revealing hidden structures within; and new finds are revolutionising the history of Stonehenge.\n\n8)  Gorilla Doctors \nIn the thick of the jungle of Rwanda's Volcanoes National Park, an infant mountain gorilla has been caught in a snare. If the rope is not removed quickly enough, the young gorilla could lose its hand. In order to remove the snare, a team of veterinarians will first need to sedate the infant's mother. But if the infant screams too much, the three 400-pound adult males that form part of this gorilla group will all attack. Everything must go perfectly, or there's no telling what could happen. And being jungle medicine, things rarely go perfectly. The pioneering group of vets performing this medical intervention is known as Gorilla Doctors. Led by Canadian Mike Cranfield, they work in Rwanda, the Democratic Republic of Congo and Uganda, where the world's last Mountain Gorillas can be found.\n\n9)  Dreams of the Future \nWe live in a world where technology is constantly changing. Sadly you know as you leave the store, that your brand new SmartPhone is already out of date - somebody, somewhere has just upgraded it. Keeping up with the latest everything can be a challenge. We asked Dr. Jennifer Gardy to explore current scientific research that will impact us all in the future. Dr. Gardy is a Senior Scientist, Molecular Epidemiology at the British Columbia Centre for Disease Control. On this journey, Jennifer travels from Toronto to New York, Los Angeles, Tokyo, and Munich and back home to Vancouver - all in the name of science exploration.\n\n10)  The Cholesterol Question \nThe Cholesterol Question is a hard-hitting investigation into the heart of cholesterol's controversial journey, from essential biological substance to Public Enemy Number One and possible rehab. It's a villain that's simple to understand, easy to implicate and, we thought, easy to medicate. But it's a story almost stranger than fiction. At Stanford University, Dr. Christopher Gardner reveals the debatable science behind our assault on dietary fat and cholesterol - a massive intervention that many believe only made us fatter and sicker.\n\n11)  The Code Breakers \nFor decades, scientists believed that humans were forced to wait until the end of the last Ice Age before they could enter the Americas. Evidence suggests that 11,000 years ago they crossed the Bering Land Bridge by foot, into what is now modern-day Alaska. Those peoples were called the Clovis, and their arrival and hunting practices were blamed for the sudden disappearance of many large mammals, from mastodons and woolly mammoths to giant ground sloths and sabre-toothed tigers. In recent years however, tantalizing - but often frustratingly inconclusive - evidence of an earlier human migration into the Americas has begun to emerge. It is an incredible revelation - to think that ancient humans could somehow have managed to get past a sheet of ice four kilometres thick. In this fascinating documentary, Canadian anthropologist and adventurer Niobe Thompson takes us inside the incredible scientific discoveries that are finally unraveling these mysteries\n\n12)  The Emperors Lost Harbour \nIn the heart of a metropolitan city of 15 million people and among the construction of a new billion-dollar transportation network, an archaeological sensation has been discovered: the ancient harbour of Theodosious. Theodosious was the last ruler over both Eastern and Western portions of a unified Roman Empire; the harbour has been buried and shrouded in mystery for over 800 years...until now. Istanbul, Turkey, is situated exactly between Europe and Asia. It has, since prehistoric times, bridged the gap between these continents, their cultures and its people. Engineers are working to connect East to West through a spectacular 1.4 kilometer railway tunnel, 60 meters below the surface, but they've been stalled by the discovery of the Emperor's Lost Harbor.\n\nScreenshots\n------------------------------\nclick on the links below to get full-size images &lt;a href=&quot;\nhttp://image.bayimg.com/d35508ea814786cb1a5cf93fbb34f0f20b81acca.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/d35508ea814786cb1a5cf93fbb34f0f20b81acca.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/6ddca4388f5fa753af548cf32a2e5f39eed2f810.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6ddca4388f5fa753af548cf32a2e5f39eed2f810.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/273f498c95abd707f7b3b1d50e69439c253b1a65.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/273f498c95abd707f7b3b1d50e69439c253b1a65.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/c287a439513f0559d064979828aa8b4515568920.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/c287a439513f0559d064979828aa8b4515568920.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/6176dd81a067f3811ed55069dd342e9325e41b77.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6176dd81a067f3811ed55069dd342e9325e41b77.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/cc9eadca73d363168e18b4fcec9e1a313a8c33a8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/cc9eadca73d363168e18b4fcec9e1a313a8c33a8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/3f25479bdae2e4056dd40d9e84bc49a22482bc7e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3f25479bdae2e4056dd40d9e84bc49a22482bc7e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/33a105377b37fe5358f7d5a1fc5ec34da5ac9fb5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/33a105377b37fe5358f7d5a1fc5ec34da5ac9fb5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/0f8a2a7bb460eb4554b858237d2df8278c0e5c77.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/0f8a2a7bb460eb4554b858237d2df8278c0e5c77.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/1ca9b8a6d78e77e5cb276d0f883dcf42cda35233.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/1ca9b8a6d78e77e5cb276d0f883dcf42cda35233.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/2f973c412915df3654b1bf13b0d9cc088e4beaaf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/2f973c412915df3654b1bf13b0d9cc088e4beaaf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/35e831f7a8b1fd917259b07f764e76d7464052e9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/35e831f7a8b1fd917259b07f764e76d7464052e9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/2ca9eabaa007098e5653d51b7ef6c3a28b2740f9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/2ca9eabaa007098e5653d51b7ef6c3a28b2740f9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/9730ac68d2066e1131e840209eac9a903c35c257.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/9730ac68d2066e1131e840209eac9a903c35c257.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/6674df2c50996bb9083520d6bab52865fe383e33.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6674df2c50996bb9083520d6bab52865fe383e33.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/326fc9a1e39c0f48a12e55464efd4c8db7561c09.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/326fc9a1e39c0f48a12e55464efd4c8db7561c09.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e8a0818f80a8a4dcc6d9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3188 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/s VBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 45mins\n * Framerate: 25 FPS\n * Number of Parts: 12\n * Container Mp4\n * Part Size: average 1,018 MB\n * Source: HDTV\n * Encoded by: Harry65\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.cbc.ca/natureofthings/episodes/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbc.ca/natureofthings/episodes/&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20One%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20One%29&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20Two%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20Two%29&lt;/a&gt;","torrent":{"xt":"urn:btih:8e2e40bc3710a0f395f8dc361b06dd156e6fa910","amp;dn":"The+Nature+Of+Things+Collection+3+01of12+Arctic+Meltdown+Changin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2e40bc3710a0f395f8dc361b06dd156e6fa910","infoHashBuffer":{"type":"Buffer","data":[142,46,64,188,55,16,160,243,149,248,220,54,27,6,221,21,110,111,169,16]},"announce":[],"urlList":[]}}