{"title":"Downton Abbey S05E07-09 DvdRip NL Subs DutchReleaseTeam","uid":11686789,"size":2993964927,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e6a5f9963d0683d664278b9bd8c0aab5d04c63e&amp;dn=Downton+Abbey+S05E07-09+DvdRip+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Recon06","files":10,"time":1423347601,"description":"Downton Abbey S05E01-06 DvdRip NL Subs DutchReleaseTeam\n\n[img]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/DTA51dvdcase_zpse864c70a.png[/img]\n\nHet vijfde seizoen speelt zich af in 1924. \nWe zien de terugkeer van onze geliefde personages in de weelderige wereld van Downton Abbey tegemoet.\n\nDe Crawley familie en hun bedienden blijven onlosmakelijk met elkaar verbonden als ze worden geconfronteerd met nieuwe uitdagingen.\nDe nieuwe Labour-regering kondigt veranderingen aan die gevolgen hebben voor het hele land, het leven op Downton blijft niet onaangetast. \nRobert, Mary en Branson moeten samenwerken om de toekomst van het landgoed te waarborgen voor de komende generaties.\nBransons rol wordt steeds belangrijker voor Downton, maar hij twijfelt aan zijn plek. \nMary besluit dat ze toch graag nog een keer wil trouwen, maar vindt ze ooit nog zo veel geluk als met Matthew? \nOndertussen heeft Edith nog steeds geen nieuws over haar geliefde Gregson en lijdt ze onder een verschrikkelijk geheim.\n\nBeneden vragen de bediendes zich af wat de sociale veranderingen betekenen voor hun loopbaan. \nDaisy staat open voor alle veranderingen maar mevrouw Patmore ziet de nieuwe en onzekere paden met argwaan tegemoet. \nAnna en Bates hebben de storm doorstaan en durven eindelijk aan hun toekomst te denken. Zullen ze ooit in staat zijn om verder te gaan of speelt hun pijnlijke geschiedenis een te grote rol en bedreigen de oude geheimen hun kans op geluk?\n\nActeurs: Joanne Froggatt, Rob James-Collier, Hugh Bonneville, Michelle Dockery, Brendan Coyle, Phyllis Logan, Laura Carmichael, Jim Carter and many more.\nGenre: Drama | Family | History\nTaal orig. Versie : Engels\nLanguage: English\nOndertiteling: Nederlands\nSubtitles: Dutch (Hardcoded)\n\n\n\n\n\nDutchReleaseTeam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.org or http://www.hetmultimediacafe.nl","torrent":{"xt":"urn:btih:8e6a5f9963d0683d664278b9bd8c0aab5d04c63e","amp;dn":"Downton+Abbey+S05E07-09+DvdRip+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6a5f9963d0683d664278b9bd8c0aab5d04c63e","infoHashBuffer":{"type":"Buffer","data":[142,106,95,153,99,208,104,61,102,66,120,185,189,140,10,171,93,4,198,62]},"announce":[],"urlList":[]}}