{"title":"Brainwashed - Ben Shapiro","uid":11707041,"size":529892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e834b42e7270fb471eafb1858f8c347d8e30a8a&amp;dn=Brainwashed+-+Ben+Shapiro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1424173711,"description":"When parents send their children off to college, mom and dad hope they'll return more cultivated, knowledgeable, and astute--able to see issues from all points of view. But, according to Ben Shapiro, there's only one view allowed on most college campuses: a rabid brand of liberalism that must be swallowed hook, line, and sinker. In this explosive book, Ben Shapiro, a college student himself, reveals how America's university system is one of the largest brainwashing machines on the planet. Examining this nationwide problem from firsthand experience, Shapiro shows how the leftists who dominate the universities--from the administration to the student government, from the professors to the student media--use their power to mold impressionable minds. Fresh and bitterly funny, this book proves that the universities, far from being a place for open discussion, are really dungeons of the mind that indoctrinate students to become socialists, atheists, race-baiters, and narcissists.\n\n\nAbout the Author:\nBen Shapiro has been a nationally syndicated columnist with Creators Syndicate since 2002 and is the bestselling author of Brainwashed (Nelson Current, 2004) and Porn Generation (Regnery, 2005).  He is a frequent guest on television and radio shows across the nation; his columns are printed weekly in newspapers and websites from coast to coast.  A graduate of UCLA and Harvard Law School, Shapiro practices law in Los Angeles, California","torrent":{"xt":"urn:btih:8e834b42e7270fb471eafb1858f8c347d8e30a8a","amp;dn":"Brainwashed+-+Ben+Shapiro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e834b42e7270fb471eafb1858f8c347d8e30a8a","infoHashBuffer":{"type":"Buffer","data":[142,131,75,66,231,39,15,180,113,234,251,24,88,248,195,71,216,227,10,138]},"announce":[],"urlList":[]}}