{"title":"PHPUnit Essentials (ePUB,Retail){32Skulls}","uid":11011500,"size":10294441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e842bde391eea7f7f739b3f135d0e120b4a5fe3&amp;dn=PHPUnit+Essentials+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"32Skulls","files":-1,"time":1410366582,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nGet started with PHPUnit and learn how to write and test code using advanced technologies\nOverview\n\nLearn how to install PHPUnit as well as how to write and execute tests\nUnderstand the advanced concepts of testing using test doubles and the continuous integration process\nA hands-on, step-by-step guide full of real-life examples to help you learn quickly and effectively\n\n\nIn Detail\nThe ability to write unit tests and software testing have become skills that every PHP developer should master.\n\nThis book is a practical guide to PHPUnit and unit testing, covering all aspects of writing PHPUnit tests and using them. The book shows why testable code is better code and how to write good tests with the help of simple and easy-to-understand examples.\n\nWith this book, you will learn how to write, organize, and execute effective tests. Step-by-step techniques of how to write testable code, how to refactor the code, and how to run your tests are shown. You will also learn about advanced testing techniques, including how to test databases, APIs, and legacy code. PHPUnit Essentials is a guide for PHP developers who want to learn or improve their software testing skills. It is a book for developers who begin with testing but is also a good source of information for developers who are already familiar with PHPUnit.\nWhat you will learn from this book\n\nHow to install PHPUnit and confi gure IDEs for PHPUnit support\nWhat are unit tests and why to test code\nWrite test doubles and learn how to replace dependencies\nExplore how to test legacy code\nTest code calling APIs and connecting to the database\nRun functional tests in a web browser using Selenium tests\nUse tests as part of the continuous integration process\nDiscover the alternatives to PHPUnit\nUse PHPUnit tests in the Jenkins and Travis CI servers\n\n\nApproach\nThis book is a practical guide featuring a step-by-step approach that aims to help PHP developers who want to learn or improve their software testing skills. It also takes you through many real-life examples encountered by PHP developers to help you avoid common pitfalls.\nWho this book is written for\nThis book is a practical guide featuring a step-by-step approach that aims to help PHP developers who want to learn or improve their software testing skills. It also takes you through many real-life examples encountered by PHP developers to help you avoid common pitfalls.\n\n\nBy Zdenek Machek\nPublished by Packt Publishing in 2014\nEPUB, Retail, 314 pages, English ","torrent":{"xt":"urn:btih:8e842bde391eea7f7f739b3f135d0e120b4a5fe3","amp;dn":"PHPUnit+Essentials+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e842bde391eea7f7f739b3f135d0e120b4a5fe3","infoHashBuffer":{"type":"Buffer","data":[142,132,43,222,57,30,234,127,127,115,155,63,19,93,14,18,11,74,95,227]},"announce":[],"urlList":[]}}