{"title":"Torchlight 2 for Mac(Wine Wrapped)","uid":7781948,"size":1643891070,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:8f001a12b3c6273a8df476c58106bdc4699d3c81&amp;dn=Torchlight+2+for+Mac%28Wine+Wrapped%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"zombird","files":1,"time":1351794858,"description":"Torchlight 2 is going to be released for Mac. But, it's going to take a while. So while we're waiting, I thought it would be nice to grab Torchlight 2 and wrap it so it runs somewhat natively on Mac. Special thanks to nosTEAM for making the non-Steam version of Torchlight 2. It helped with this wrapping process a lot.\n\nTested on 10.8.2 and works okay, with minor framerate drops at times. Please remember this is a homemade port, not a native game.\n\nSuggestions: Turn off Shadows and Bloom, as well as any other graphic effects you are willing to get rid of. This severely helps the game run better.\n\nSome issues you might run into: When I was wrapping and testing, there was a ASCII related error. If you run into this, Go to Documents/My Games/Runic Games/Torchlight 2 and delete everything in there besides the Save folder. This should(hopefully) fix that error if you're having it.\n\nNot to be rude, but I am NOT tech support, so if you have any other problems I will not be helping much. Please note the original System Requirements Runic Games has put up.\n\nOne final note.\n\nSupport the developer. Buy the game when the Mac version comes out. For starters, it will run a whole lot better. But, Runic Games have made an extremely good ARPG here.","torrent":{"xt":"urn:btih:8f001a12b3c6273a8df476c58106bdc4699d3c81","amp;dn":"Torchlight+2+for+Mac%28Wine+Wrapped%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f001a12b3c6273a8df476c58106bdc4699d3c81","infoHashBuffer":{"type":"Buffer","data":[143,0,26,18,179,198,39,58,141,244,118,197,129,6,189,196,105,157,60,129]},"announce":[],"urlList":[]}}