{"title":"Acacia Trilogy - David Anthony Durham [Audio Book]","uid":9593184,"size":2347434325,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8f18e9dbf921188c7171012434cb30a94402126c&amp;dn=Acacia+Trilogy+-+David+Anthony+Durham+%5BAudio+Book%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1391955356,"description":"\n  Acacia Trilogy - David Anthony Durham [Audio Book]\n\n  Book One: The War with the Mein (2007)\n  Book Two: The Other Lands (2009)\n  Book Three: The Sacred Band (October 2011)\n \n  Codec: MP3\n  Bitrate: 64 kbps\n\n  This torrent contains the complete Acacia Trilogy by David Anthony Durham in audio format.  I found these scattered across the web and the torrents were nearly dead so I thought I would put them together and upload it.  Props to the original uploaders.\n\n  About the Author\n\n  David Anthony Durham (born 1969) is an American novelist, author of historical fiction and fantasy.  Durham's first novel, Gabriel's Story, centered on African American settlers in the American West. Walk Through Darkness followed a runaway slave during the tense times leading up to the American Civil War. Pride of Carthage focused on Hannibal Barca of Ancient Carthage and his war with the Roman Republic. His novels have twice been New York Times Notable Books, won two awards from the American Library Association, and been translated into eight foreign languages. Gabriel's Story, Walk Through Darkness and Acacia: The War with the Mein are all in development as feature films. Durham's most recently released book, Acacia: The Sacred Band, concludes his epic fantasy Acacia Trilogy.\n\n  Born to parents of Caribbean ancestry, Durham has lived in Scotland for a number of years. He has worked as an Outward Bound Instructor, and as a whitewater raft guide and kayak instructor. After receiving an MFA from the University of Maryland, College Park in 1996, he taught at the University of Maryland and University of Massachusetts Amherst. He was the MacLean Distinguished Visiting Writer at The Colorado College and was an Associate Professor at Cal State University, Fresno and an adjunct professor at Hampshire College. He won the Zora Neale Hurston/Richard Wright Fiction Award in 1992, the 2002 Legacy Award for Debut Fiction and was a Finalist for the 2006 Legacy Award for Fiction. In 2009, he won the John W. Campbell Award for Best New Writer. He currently teaches for the Stonecoast MFA Program in Creative Writing.","torrent":{"xt":"urn:btih:8f18e9dbf921188c7171012434cb30a94402126c","amp;dn":"Acacia+Trilogy+-+David+Anthony+Durham+%5BAudio+Book%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f18e9dbf921188c7171012434cb30a94402126c","infoHashBuffer":{"type":"Buffer","data":[143,24,233,219,249,33,24,140,113,113,1,36,52,203,48,169,68,2,18,108]},"announce":[],"urlList":[]}}