{"title":"Nanotubes and Nanosheets - Ying Chen","uid":15374360,"size":54332173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f271e60a45c08d4a1914b8998b9c94a45233ee9&amp;dn=Nanotubes+and+Nanosheets+-+Ying+Chen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1469177122,"description":"Nanotubes and Nanosheets - Ying Chen (CRC, 2015).pdf\r\n\r\nReveals Innovative Research on BN Nanotubes and Nanosheets\r\n\r\nNanotubes and Nanosheets: Functionalization and Applications of Boron Nitride and Other Nanomaterials is the first book devoted to nanotubes and nanosheets made of boron nitride (BN). It shows how the properties of BN nanotubes and nanosheets have led to many exciting applications where carbon (C) materials cannot be used, including high-temperature metal-ceramic-based composites, substrates for graphene and other semiconducting layers in electronic devices, reusable absorbents for oil and other contaminants, dry solid lubricants, and biomedical applications.\r\n\r\nResearchers working on various aspects of BN nanomaterials share their knowledge and current work on the applications of BN nanotubes and nanosheets. They describe numerous applications, including BN nanotube-reinforced metal-ceramic-based composites, field emission, desalination, cleanup of oil spillages, biosensing and bioimaging, drug delivery, biomedical applications, and energy storage using BCN and TiO2 nanorods and nanosheets as electrode materials. The book also covers C and other nanotubes and nanosheets to give readers a broad view of the latest nanomaterials research","torrent":{"xt":"urn:btih:8f271e60a45c08d4a1914b8998b9c94a45233ee9","amp;dn":"Nanotubes+and+Nanosheets+-+Ying+Chen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f271e60a45c08d4a1914b8998b9c94a45233ee9","infoHashBuffer":{"type":"Buffer","data":[143,39,30,96,164,92,8,212,161,145,75,137,152,185,201,74,69,35,62,233]},"announce":[],"urlList":[]}}