{"title":"Pharoah Sanders - Karma [1969]","uid":7929941,"size":277806710,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f36c66c40d97f445116dc611bee28cef780bc1e&amp;dn=Pharoah+Sanders+-+Karma+%5B1969%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"FatFreddy437","files":-1,"time":1355691763,"description":"perhaps the perfect album :)\n\neac secure cue log scans\n\nâˆ’ 1995 - Impulse! / AS-9181 / Reissue / CD\n\n1. The Creator Has A Master Plan (32:47)\n2. Colors (5:37)\n\nPharoah Sanders: tenor saxophone\nLeon Thomas: vocals, percussion\nJulius Watkins: french horn\nJames Spaulding: flute (1)\nLonnie Liston Smith: piano\nReggie Workman: bass\nRichard Davis: bass (1)\nRon Carter: bass (2)\nBilly Hart: drums (1)\nFreddie Waits: drums (2)\nNathaniel Bettis: percussion (1)\n\nRecorded on February 14 &amp; 19, 1969 at RCA Studios, NYC, USA.\n\nAllmusic review by Thom Jurek:\n\n    Pharoah Sanders' third album as a leader is the one that defines him as a musician to the present day. After the death of Coltrane, while there were many seeking to make a spiritual music that encompassed his ideas and yearnings while moving forward, no one came up with the goods until Sanders on this 1969 date. There are only two tracks on Karma, the 32-plus minute &quot;The Creator Has a Master Plan&quot; and the five-and-a-half-minute &quot;Colours.&quot; The band is one of Sanders' finest, and features vocalist Leon Thomas, drummer Billy Hart, Julius Watkins, James Spaulding, a pre-funk Lonnie Liston Smith, Richard Davis, Reggie Workman on bass, and Nathaniel Bettis on percussion. &quot;Creator&quot; begins with a quote from &quot;A Love Supreme,&quot; with a nod to Coltrane's continuing influence on Sanders. But something else emerges here as well: Sanders' own deep commitment to lyricism and his now inherent knowledge of Eastern breathing and modal techniques. His ability to use the ostinato became not a way of holding a tune in place while people soloed, but a manner of pushing it irrepressibly forward. Keeping his range limited (for the first eight minutes anyway), Sanders explores all the colors around the key figures, gradually building the dynamics as the band comps the two-chord theme behind with varying degrees of timbral invention. When Thomas enters at nine minutes, the track begins to open. His yodel frees up the theme and the rhythm section to invent around him. At 18 minutes it explodes, rushing into a silence that is profound as it is noisy in its approach. Sanders is playing microphonics and blowing to the heavens and Thomas is screaming. They are leaving the material world entirely. When they arrive at the next plane, free of modal and interval constraints, a new kind of lyricism emerges, one not dependent on time but rhythm, and Thomas and Sanders are but two improvisers in a sound universe of world rhythm and dimension. There is nothing to describe the exhilaration that is felt when this tune ends, except that &quot;Colours,&quot; with Ron Carter joining Workman on the bass, was the only track that could follow it. You cannot believe it until you hear it. ","torrent":{"xt":"urn:btih:8f36c66c40d97f445116dc611bee28cef780bc1e","amp;dn":"Pharoah+Sanders+-+Karma+%5B1969%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f36c66c40d97f445116dc611bee28cef780bc1e","infoHashBuffer":{"type":"Buffer","data":[143,54,198,108,64,217,127,68,81,22,220,97,27,238,40,206,247,128,188,30]},"announce":[],"urlList":[]}}