{"title":"A Batalha do Chile (La Batalla de Chile) [4 FULL DVD]","uid":14504514,"size":17820987392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:90cac44e1f3f64a0c4494cfa4543da4c4fc0f564&amp;dn=A+Batalha+do+Chile+%28La+Batalla+de+Chile%29+%5B4+FULL+DVD%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"JibJib007","files":40,"time":1462223729,"description":"A Batalha do Chile (FULL DVD)\r\nDiscos: 4 DVD\r\n\r\nDVD 01: A Insurreicao da Burguesia\r\nDVD 02: O Golpe de Estado\r\nDVD 03: O Poder Popular\r\nDVD 04: Extras\r\n\r\nlegendas: portugues\r\n\r\n\r\nRarissimo documentario finalmente disponibilizado em sua melhor qualidade ate entao disponivel.\r\n\r\n** AJUDE A COMPARTILHAR E A SEMEAR ESTE TORRENT! \r\n\r\n\r\n\r\nSINOPSE:\r\n\r\n Considerado um dos melhores e mais completos documentários latino-americanos, A Batalha do Chile é o resultado de seis anos de trabalho do cineasta Patrício Guzmán. Dividido em três partes (A insurreição da burguesia (1975), O golpe militar (1977) e O poder popular (1979)), o filme cobre um dos períodos mais turbulentos da história do Chile, a partir dos esforços do presidente Salvador Allende em implantar um regime socialista (valendo-se da estrutura democrática) até as brutais consequências do golpe de estado que, em 1974, instaurou a ditadura do general Augusto Pinochet.\r\n     Patrício Guzmán foi além dos temas espetaculares, filmando desde assembleias de fábricas, passando por trabalhadores do campo, moradores de bairros construindo um abastecimento alternativo, até militantes de direita. É um registro e uma análise bastante completa do que foi a caminhada chilena pela via democrática ao socialismo, abordando temas difíceis como as nacionalizações, o apoio ambíguo da presidência ao processo de construção do &quot;poder popular&quot; que se dava com as ocupações de fábricas e latifúndios e a construção da participação direta através de assembleias locais e regionais, e as contradições entre este poder popular e um Estado que acabou paralisado pela maioria conservadora do Congresso e as ações de sabotagem apoiadas pela CIA e pelas elites. Com o golpe em 1973, Guzmán se refugiou em Cuba, onde terminou de editar a terceira parte do documentário apenas em 1979. Foram praticamente 10 anos de trabalho.\r\nDireção: Patrício Guzmán\r\nAno: 1975 - 1977 - 1979","torrent":{"xt":"urn:btih:90cac44e1f3f64a0c4494cfa4543da4c4fc0f564","amp;dn":"A+Batalha+do+Chile+%28La+Batalla+de+Chile%29+%5B4+FULL+DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90cac44e1f3f64a0c4494cfa4543da4c4fc0f564","infoHashBuffer":{"type":"Buffer","data":[144,202,196,78,31,63,100,160,196,73,76,250,69,67,218,76,79,192,245,100]},"announce":[],"urlList":[]}}