{"title":"Parque Prehistorico 1 y 2 de 6 (Docu).(TVRip.Divx.Spanish).","uid":4692066,"size":1458860032,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:90d127b7e87b19fafae09d4d70f93d104c49449a&amp;dn=Parque+Prehistorico+1+y+2+de+6+%28Docu%29.%28TVRip.Divx.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"cholo24","files":2,"time":1233428027,"description":"Parque PrehistÃƒÂ³rico\n\nGÃƒÂ©nero: Documental \nNacionalidad: Reino Unido \nIntÃƒÂ©rpretes: Nigel Marven, David Jason, Rod Arthur, Suzanne McNabb \n\nSinopsis: \nA travÃƒÂ©s de los ÃƒÂºltimos avances en tecnologÃƒÂ­a y creaciÃƒÂ³n digital, el famoso explorador Nigel Marven ha conseguido viajar a la Prehistoria en busca de las mÃƒÂ¡s magnÃƒÂ­ficas criaturas que han existido en la Tierra. Una de estas criaturas, quizÃƒÂ¡ la mÃƒÂ¡s famosa y mÃƒÂ¡s temida, es el Tiranosaurio Rex. Nigel Marven llevarÃƒÂ¡ a cabo la primera parada de su alucinante viaje en las regiones salvajes del CretÃƒÂ¡ceo de Dakota, un lugar completamente inhÃƒÂ³spito hace 65 millones de aÃƒÂ±os. El famoso explorador encontrarÃƒÂ¡ numerosos peligros a lo largo de su periplo, pero tendrÃƒÂ¡ la oportunidad de contemplar a una manada de Ornithonimos, familiares lejanos de los avestruces y, sobre todo, el gran premio, el Tiranosaurio Rex. No se pierdan esta espectacular aventura, una serie de seis episodios para toda la familia que no les dejarÃƒÂ¡ indiferentes.\n\n\n1 - La vuelta del Tiranosaurio Rex\n\nEl explorador Nigel Marven se traslada hasta las regiones salvajes del CretÃƒÂ¡ceo de Dakota de hace 65 millones de aÃƒÂ±os para rescatar al Tiranosauro Rex, el dinosaurio carnÃƒÂ­voro mÃƒÂ¡s conocido de todos los tiempos. Nigel Marven estudia la poblaciÃƒÂ³n en la que viven estas criaturas y las rescata antes de que el meteorito que acabÃƒÂ³ con su especie colisione con la Tierra.\n\n\n2 - Los mamuts\n\nEl cambio climÃƒÂ¡tico que supuso el final de la ÃƒÂºltima Edad de Hielo acabÃƒÂ³ con la vida de los mamuts, ya que su organismo era incompatible con el nuevo hÃƒÂ¡bitat que se crearÃƒÂ­a despuÃƒÂ©s. El equipo de cientÃƒÂ­ficos de Parque PrehistÃƒÂ³rico viaja hasta esa ÃƒÂ©poca y encuentra a un mamut moribundo en la serie, y gracias a las ÃƒÂºltimas tecnologÃƒÂ­as, cobra vida en el siglo XXI.\n","torrent":{"xt":"urn:btih:90d127b7e87b19fafae09d4d70f93d104c49449a","amp;dn":"Parque+Prehistorico+1+y+2+de+6+%28Docu%29.%28TVRip.Divx.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d127b7e87b19fafae09d4d70f93d104c49449a","infoHashBuffer":{"type":"Buffer","data":[144,209,39,183,232,123,25,250,250,224,157,77,112,249,61,16,76,73,68,154]},"announce":[],"urlList":[]}}