{"title":"Historical Controversies and Revisionism - Collection 5 (The Hol","uid":10724253,"size":215295689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90e08943f2b3ccc2de95f184d3ef537d754ecb3a&amp;dn=Historical+Controversies+and+Revisionism+-+Collection+5+%28The+Hol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moman73","files":26,"time":1407530789,"description":"Historical Controversies and Revisionism - Collection 5 (The Holocaust):\n\nVery few deny the holocaust suffered by the Jews on the hands of the Nazis; after all, since the rise of Christianity, the Jews had suffered numerous massacres throughout the long history of conflict between Judaism and Christianity. In most of these cases the Jewish minorities in Europe had to relocate to other safer places.  Historians unanimously agree that only the lands under the control of the Islamic empire provided protection to the emigrating Jews and allowed them to thrive and practice their religion freely. Medieval history is full of many Jewish figures who  occupied high positions in the lands of the Islamic caliphate.\n\nThe historical revisionism of the holocaust questions the number of Jews killed in the holocaust; is it 6 millions or merely a few hundred thousands? Did most of the Jews die because of typhus or in gas chambers? and how Zionism used the holocaust to justify the creation of a homeland for the Jews in Palestine on the expense of the Palestinians, the native people of the land.\n\nWe have 26 titles here:\n\n-  Baron - Holocaust Affirmers; Their Ideologies, Their Methodologies, Their Antecedents, Their Raison D'etre (1998)\n\n-  Baron - Holocaust Denial, New Nazi Lie or New Inquisitions; a Defense of Free Inquiry and the Necessity of Rewriting History (1995)\n\n-  Butler - Censored History (1983)\n\n-  Butz - The Hoax of the Twentieth Century; the Case Against the Presumed Extermination of European Jewry (2003)\n\n-  Castan - Holocaust, Jewish or German; I Denounce the Lie of the Century (1988)\n\n- Duke - Jewish Supremacism; My Awakening to the Jewish Question (2001)\n\n-  Finkelstein - Beyond Chutzpah; On the Misuse of Anti-Semitism and the Abuse of History (2008)\n\n-  Finkelstein - The Holocaust Industry; Reflections on the Exploitation of Jewish Suffering (2000)\n\n-  Garaudy - The Founding Myths of Israeli Politics (1996)\n\n-  Graf - The Giant with Feet of Clay; Raul Hilberg and His Standard Work on the Holocaust (2001)\n\n-  Hayward - The Fate of Jews in German Hands; an Historical Enquiry into the Development and Significance of Holocaust Revisionism (1993)\n\n-  Heddesheimer - The First Holocaust; Jewish Fund Raising Campaigns with Holocaust Claims During and After World War One (2003)\n\n-  John - Behind the Balfour Declaration; Britain's Great War Pledge to Lord Rothschild (1983)\n\n-  Leuchter, Faurisson &amp; Rudolf - The Leuchter Reports; Critical Edition (2005)\n\n-  Mattogno - The Bunkers of Auschwitz; Black Propaganda versus History (2004)\n\n-  Piper - Best Witness; the Mel Mermelstein Affair and the Triumph of Historical Revisionism (1994)\n\n-  Rassinier - Debunking the Genocide Myth; a Study of the Nazi Concentration Camps and the Alleged Extermination of European Jewry (1978)\n\n-  Rudolf &amp; Mattogno - Auschwitz Lies; Legends, Lies, and Prejudices on the Holocaust (2005)\n\n-  Rudolf (Ed.) - Dissecting the Holocaust; the Growing Critique of Truth and Memory, 2e (2003)\n\n- Staglich - Auschwitz; a Judge Looks at the Evidence (1986)\n\n-  The Comittee for Truth in History - The Six Million Reconsidered\n\n-  Theil - Heresy in Twenty-First Century France; a Case of In Submission to the Holocaust Dogma (2006)\n\n-  Toben - Fight or Flight; the Personal Face of Revisionism (2003)\n\n-  Weckert - Jewish Emigration from the Third Reich (2004)\n\n-  Weintraub - The Holocaust Dogma of Judaism (1995)\n\n-  Zertal - Israel's Holocaust and the Politics of Nationhood (2005)\n\n\n","torrent":{"xt":"urn:btih:90e08943f2b3ccc2de95f184d3ef537d754ecb3a","amp;dn":"Historical+Controversies+and+Revisionism+-+Collection+5+%28The+Hol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90e08943f2b3ccc2de95f184d3ef537d754ecb3a","infoHashBuffer":{"type":"Buffer","data":[144,224,137,67,242,179,204,194,222,149,241,132,211,239,83,125,117,78,203,58]},"announce":[],"urlList":[]}}