{"title":"The Cave Singers - Welcome Joy (2009)","uid":7967065,"size":86428013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:90f1ff7febf290a622358d45a27539324eb47fed&amp;dn=The+Cave+Singers+-+Welcome+Joy+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1356710214,"description":"The Cave Singers - Welcome Joy (2009) mp3 \n\n\nSeattle trio The Cave Singers delighted us with their debut album, Invitation Songs - a brilliant collection of American alt-folk tracks. They return with the follow up Welcome Joy, which although remaining true to their roots, has a slightly bigger, more rock sound. \n\nFrom the melodic picking of opener Summer Light, The Cave Singers show you exactly what they're about. Although the album is undoubtedly more polished than their debut from a production point of view, they still retain that rustic country charm. The foot stomping country of At The Cut shows The Cave Singers Gospel side before the band drop Shrine - a real stand out track. It is musically sparse, building gradually with haunting layers of gentle drums, tambourine and melodic guitar. It allows Pete Quirk's extraordinary vocal delivery to make an impact before thumping drums burst through and then fade out to return to the slow tempo folk - truly mesmerising. \n\nHen of the woods intro and melody is reminiscent of gentler Vampire Weekend sound, a pretty galloping melody, almost too sweet for the band. But as soon as the vocals kick in, you are instantly transported back to the rich folk sound and gravelly vocals. Beach House again is a beautiful emotive track, where the catchy melody and vocal harmonies really shine through, with Quirks heart felt delivery giving a nod to early Dylan. \n\nWelcome Joy is a triumphant return for The Cave Singers and those who fell in love with their first album wont be disappointed. The expansion of their sound works perfectly, it is soulful alternative folk at its best.","torrent":{"xt":"urn:btih:90f1ff7febf290a622358d45a27539324eb47fed","amp;dn":"The+Cave+Singers+-+Welcome+Joy+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f1ff7febf290a622358d45a27539324eb47fed","infoHashBuffer":{"type":"Buffer","data":[144,241,255,127,235,242,144,166,34,53,141,69,162,117,57,50,78,180,127,237]},"announce":[],"urlList":[]}}