{"title":"The Alchemist Trilogy (Complete) by Dave Duncan (retail) {dwg}","uid":11177028,"size":8011526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90f870ec633685244f4a2c1bb324661909493c3b&amp;dn=The+Alchemist+Trilogy+%28Complete%29+by+Dave+Duncan+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gratefuldawg77","files":18,"time":1412801617,"description":"The Alchemist's Apprentice (The Alchemist #1)\nTo the legendary clairvoyant Maestro Nostradamus, the future is forever in motion. But for young swordsman Alfeo Zeno, his apprentice and protector, the present is hard enough to contend with. His days are spent poring over astrology charts and making calculations, his nights learning arcane magic or transcribing Nostradamus's nebulous prophecies. Until one night, when the Council of Ten arrives to take the seer into custody.\n\nIt seems that a high-ranking friend of the prince died under mysterious circumstances after Nostradamus cast his horoscope, warning of danger-and rumors are swirling that the mystic poisoned the victim to enhance his own reputation. Alfeo is stunned when his master refuses to flee. Instead, Nostradamus charges Alfeo with the task of clearing his name. Now, Alfeo must unravel a web of magic and murder if he is to have any future of his own.\n\nThe Alchemist's Code (The Alchemist #2) \nThe legendary Maestro Nostradamus may be able to glimpse the ever- changing future, but even he cannot see the danger that is about to envelop him and his daring apprentice Alfeo when Nostradamus is hired to find a foreign spy by Venice's ruling Council of Ten. The only clues they can offer him are the spy's intercepted messages, encoded in a seemingly unbreakable cipher. But Nostradamus soon detects evil influences working against him, and realizes the spy can only be caught by occult means. He turns to his able apprentice, the young swordsman Alfeo Zeno, whose unique talents may prove essential to unraveling the truth.\n\nThe Alchemist's Pursuit (The Alchemist #3) \nHampered by arthritis, Nostradamus is in no mood for granting favors or running about looking for trouble. But when his apprentice Alfeo's mistress asks him to investigate the murder of her beloved courtesan mentor-and promises a fortune in payment-he comes around.\n\nIt appears that someone is murdering the courtesans of Venice. All were well-known, admired for their skills-and somehow connected by a sinister event involving one of the great families of the city.\n\nWhile Nostradamus attempts to use the dark arts to solve riddles which confound explanation, Alfeo finds himself led by a possibly demonic force through a maze of deceit and death. And when the master and apprentice come to the end of their intertwined paths, there may be hell to pay.","torrent":{"xt":"urn:btih:90f870ec633685244f4a2c1bb324661909493c3b","amp;dn":"The+Alchemist+Trilogy+%28Complete%29+by+Dave+Duncan+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f870ec633685244f4a2c1bb324661909493c3b","infoHashBuffer":{"type":"Buffer","data":[144,248,112,236,99,54,133,36,79,74,44,27,179,36,102,25,9,73,60,59]},"announce":[],"urlList":[]}}