{"title":"Holding Trevor [2007] [Gay Interest].avi","uid":5199261,"size":730356258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9145dfa815515699cea1acdd0482eb4ce2e3b207&amp;dn=Holding+Trevor+%5B2007%5D+%5BGay+Interest%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"tk76054","files":1,"time":1260076093,"description":"Young, beautiful and intelligent, Trevor (screenwriter Brent Gorski) is in a stalemate. Entangled in an unhealthy relationship with Darrell, a self-destructive heroin addict, and trapped in a telemarketing job, Trevor finds scant comfort in Los Angeles' vapid party scene, where conversation rarely rises above inquiries like &quot;So, are you an actor?&quot; Worse still, he and his two best friends - roommate Andie and singer Jake - are being pulled apart by boredom and discontent. At the hospital for his boyfriend's latest overdose, Trevor finds a potential new beginning in Ephram, a medical intern with ambition, a warm demeanor and strikingly good looks. After they spend a romantic evening together, Trevor seems poised to make some changes. He begins by ending his relationship with Darrell and then strives to reconnect with Andie and Jake. But what should be a joyous event - a party celebrating a negative HIV test - explodes into rage and sorrow. Darrell shows up unannounced and makes a scene, Ephram suggests that Trevor isn't ready for a commitment, and Andie, reeling from a painful revelation, kicks Trevor while he's down. Though pulled in multiple directions, Trevor remains committed to bettering his life. But first he must realize that some people are too precious to abandon. Director Rosser Goodman (That's What I'm Talkin' 'Bout, Frameline29) finds rich emotional territory in Gorski's script, keeping it both focused and raw.  Written by JONATHAN L. KNAPP","torrent":{"xt":"urn:btih:9145dfa815515699cea1acdd0482eb4ce2e3b207","amp;dn":"Holding+Trevor+%5B2007%5D+%5BGay+Interest%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9145dfa815515699cea1acdd0482eb4ce2e3b207","infoHashBuffer":{"type":"Buffer","data":[145,69,223,168,21,81,86,153,206,161,172,221,4,130,235,76,226,227,178,7]},"announce":[],"urlList":[]}}