{"title":"Intrusion Detection with SNORT Advanced IDS Techniques Using SNO","uid":8289051,"size":2652086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:918a373b869796d0248d2e051e9f20415aafdde0&amp;dn=Intrusion+Detection+with+SNORT+Advanced+IDS+Techniques+Using+SNO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Sardaar","files":8,"time":1363999247,"description":"Network security has become an important part of corporate IT strategy and safeguarding all the nooks and crannies of your network can be timely and expensive. This book provides information about how to use free Open Source tools to build and manage an Intrusion Detection System. Rehman provides detailed information about using SNORT as an IDS and using Apache, MySQL, PHP and ACID to analyze intrusion data.\n\nThe book contains custom scripts, real-life examples for SNORT, and to-the-point information about installing SNORT IDS so readers can build and run their sophisticated intrusion detection systems.SNORT is your network's packet sniffer that monitors network traffic in real time, scrutinizing each packet closely to detect a dangerous payload or suspicious anomalies.NSS Group, a European network security testing organization, tested SNORT along with intrusion detection system (IDS) products from 15 major vendors including Cisco, Computer Associates, and Symantec. According to NSS, SNORT, which was the sole Open Source freeware product tested, clearly outperformed the proprietary products.\n\nTitle: Intrusion Detection with SNORT: Advanced IDS Techniques Using SNORT, Apache, MySQL, PHP, and ACID\nAuthor(s): Rafeeq Ur Rehman\nPaperback: 275 pages\neBook: PDF, 2.52 MB\nLanguage: English\n","torrent":{"xt":"urn:btih:918a373b869796d0248d2e051e9f20415aafdde0","amp;dn":"Intrusion+Detection+with+SNORT+Advanced+IDS+Techniques+Using+SNO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918a373b869796d0248d2e051e9f20415aafdde0","infoHashBuffer":{"type":"Buffer","data":[145,138,55,59,134,151,150,208,36,141,46,5,30,159,32,65,90,175,221,224]},"announce":[],"urlList":[]}}