{"title":"Cisco Packet Tracer 6","uid":8260198,"size":59294380,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:919445fc51345cb5da2fdb6f432b286380a5212b&amp;dn=Cisco+Packet+Tracer+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"anarchist9027","files":1,"time":1363366082,"description":"I am proud to present Cisco Packet Tracer 6 BETA build 45\n\n\n\nCisco Networking Academy is a comprehensive e-learning initiative that enables students to develop valuable information and communication technology skills for increased access to opportunities in the global economy. To learn more about the program, how to get involved, career resources for students, how we are addressing the digital divide, and more.\n\nPacket Tracer is an application produced by Cisco Systems to provide a virtual simulation of real life equipment and situations. Packet Tracer is used heavily in the Cisco Net Academy (Program used to teach Cisco curriculum through third-party schools and training organizations). While Packet Tracer is commonly used in the education environment, many corporations use the tool, to map out and plan network layout, and base device configuration. With Packet Tracer you have the ability to simulate a network, and well as traffic, end devices and servers. You can configure routers, switches, wireless access points, servers, and end devices. (This includes mock versions of the Cisco IOSs)\n\nEnjoy Everyone ;)\n\n-anarchist9027","torrent":{"xt":"urn:btih:919445fc51345cb5da2fdb6f432b286380a5212b","amp;dn":"Cisco+Packet+Tracer+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"919445fc51345cb5da2fdb6f432b286380a5212b","infoHashBuffer":{"type":"Buffer","data":[145,148,69,252,81,52,92,181,218,47,219,111,67,43,40,99,128,165,33,43]},"announce":[],"urlList":[]}}