{"title":"White Cargo: White Slaves in America by Don Jordan &amp; M. Wals","uid":10130949,"size":1060760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91f9514b9502cb91b64415435e55e778577f0194&amp;dn=White+Cargo%3A+White+Slaves+in+America+by+Don+Jordan+%26amp%3B+M.+Wals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"holocen","files":-1,"time":1399881200,"description":"White Cargo - The Forgotten History of Britain's White Slaves in America (2007) by Don Jordan &amp; Michael Walsh.pdf\n\nWhite Cargo is the forgotten story of the thousands of Britons who lived and died in bondage in Britain's American colonies.\n\nIn the seventeenth and eighteenth centuries, more than 300,000 white people were shipped to America as slaves. Urchins were swept up from London's streets to labor in the tobacco fields, where life expectancy was no more than two years. Brothels were raided to provide &quot;breeders&quot; for Virginia. Hopeful migrants were duped into signing as indentured servants, unaware they would become personal property who could be bought, sold, and even gambled away. Transported convicts were paraded for sale like livestock.\n\nDrawing on letters crying for help, diaries, and court and government archives, Don Jordan and Michael Walsh demonstrate that the brutalities usually associated with black slavery alone were perpetrated on whites throughout British rule. The trade ended with American independence, but the British still tried to sell convicts in their former colonies, which prompted one of the most audacious plots in Anglo-American history.\n\nThis is a saga of exploration and cruelty spanning 170 years that has been submerged under the overwhelming memory of black slavery. White Cargo brings the brutal, uncomfortable story to the surface.\n\n320 pages\nPublisher: MAINSTREAM PUBLISHING (2007)\nLanguage: English\nISBN-10: 1845961951\nISBN-13: 978-1845961954","torrent":{"xt":"urn:btih:91f9514b9502cb91b64415435e55e778577f0194","amp;dn":"White+Cargo%3A+White+Slaves+in+America+by+Don+Jordan+%26amp%3B+M.+Wals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f9514b9502cb91b64415435e55e778577f0194","infoHashBuffer":{"type":"Buffer","data":[145,249,81,75,149,2,203,145,182,68,21,67,94,85,231,120,87,127,1,148]},"announce":[],"urlList":[]}}