{"title":"Art of Digital Audio 3rd Edition - (Malestrom)","uid":6013803,"size":13008722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:920906522f889081151b59735bfdd5634774c4d9&amp;dn=Art+of+Digital+Audio+3rd+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1291508407,"description":"Art of Digital Audio, Third Edition\nPublisher: Focal Press | Pages: 752 | 2000-12-28 | ISBN 0240515870 | PDF\n\nDescribed as &quot;the most comprehensive book on digital audio to date&quot;, it is widely acclaimed as an industry &quot;bible&quot;. Covering the very latest developments in digital audio technology, it provides an thorough introduction to the theory as well as acting as an authoritative and comprehensive professional reference source. Everything you need is here from the fundamental principles to the latest applications, written in an award-winning style with clear explanations from first principles.\n\n\n\nNew material covered includes internet audio, PC audio technology, DVD, MPEG audio compression, digital audio broadcasting and audio networks.\n\nWhether you are in the field of audio engineering, sound recording, music technology, broadcasting and communications media or audio design and installation, this book has it all. Written by a leading international audio specialist, who conducts professional seminars and workshops around the world, the book has been road tested for many years by professional seminar attendees and students to ensure their needs are taken into account, and all the right information is covered.\n\nThis new edition now includes:\n\nInternet audio\nPC Audio technology\nDVD\nMPEG Audio compression\nDigital Audio Broadcasting\nAudio networks\n\nDigital audio professionals will find everything they need here, from the fundamental principles to the latest applications, written in an award-winning style with clear explanations from first principles.\n\nJohn Watkinson is an international consultant in audio, video and data recording. He is a Fellow of the AES, a member of the British Computer Society and a chartered information systems practitioner. He presents lectures, seminars, conference papers and training courses worldwide. He is the author of many other Focal Press books, including: the Kraszna-Krausz award winning MPEG-2; The Art of Digital Audio; An Introduction to Digital Video; The Art of Sound Reproduction; An Introduction to Digital Audio; TV Fundamentals and Audio for Television. He is also co-author, with Francis Rumsey, of The Digital Interface Handbook, and contributor to the Loudspeaker and Headphone Handbook, 3rd edition.\n\nÃ‚Â· The 'Bible' of Digital Audio\nÃ‚Â· Get everything you need on digital audio in just one book\nÃ‚Â· Gain a thorough understanding of all the latest technology\n","torrent":{"xt":"urn:btih:920906522f889081151b59735bfdd5634774c4d9","amp;dn":"Art+of+Digital+Audio+3rd+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"920906522f889081151b59735bfdd5634774c4d9","infoHashBuffer":{"type":"Buffer","data":[146,9,6,82,47,136,144,129,21,27,89,115,91,253,213,99,71,116,196,217]},"announce":[],"urlList":[]}}