{"title":"Win PDF Editor v3.2.2.4","uid":15479437,"size":16102450,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9229544ef71c1af2b664f30c0d98c9869fa74c40&amp;dn=Win+PDF+Editor+v3.2.2.4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LxByte","files":1,"time":1470228922,"description":"Win PDF Editor v3.2.2.4\r\n\r\nEdit PDF Easily: Add Text, Insert Images, Draw Shapes &amp; Remove Unwanted Content.\r\n\r\nWin PDF Editor is a Windows PDF editing software product that lets you modify and edit PDF documents like adding text, insert images, removing unwanted content, drawing lines and rotating PDF pages. If you write text on the PDF, you can change the text font, size, color and move it to anywhere you want on the page. After inserting an image into PDF, you can resize the image and move it also. If you find some words or images need to be removed, simply use the eraser tool to erase. Better than other PDF Reader applications, Win PDF Editor can permanently save the edited PDF content changes in PDF. \r\n\r\nAll Tools Preview:\r\nAdd Text, Add Image, Pen, Brush, Eraser, Line, Rectangle, Ellipse, Color Selection, Copy to All Page, Page Rotation, Font Selection, and Line Weight Selection. \r\n\r\nWhat Can Win PDF Editor Do?\r\n\r\nAdd text to PDF\r\nYou can write text and move it to any place on the PDF page. Win PDF Editor allows you to set the text font, size and color. With Win PDF Editor you can easily fill out the PDF forms now.\r\n\r\nRemove PDF Content\r\nThere is an Eraser tool in Win PDF Editor, and you can use it to remove any unwanted text or graphics like erasing. You can also change the line weight to make the eraser bigger or smaller.\r\n\r\nRotate PDF\r\nThe program has the ability to rotate PDF 90, 180 and 270 degrees for single page and all pages. So that you can rotate the PDF pages to the correct orientation.\r\n\r\nAdd Image to PDF\r\nYou can add images to the PDF and resize them. Win PDF Editor supports most popular image formats like JPG, PNG, GIF, BMP and TIF etc. It also keeps the image original transparent. You can add your signature image to the PDF document and easy to sign now.\r\n\r\nDraw shape on PDF\r\nIf you want to annotate on a PDF document, you may need to draw a line or square frame around the text. You can use Line, Rectangle, Ellipse and Pen to draw any shapes you want.\r\n\r\nAdd watermark on PDF\r\nThe Copy To All Pages Tool allows you to copy the selected object to every page in the PDF. You can use this function to make an inserted image as watermark for the PDF document.\r\n\r\nPermanently Save PDF Modify\r\nWin PDF Editor can save the edited content permanently into the original PDF document, and also allows you to save the content to a new PDF file. \r\n\r\nConvert PDF to Word and Other Formats\r\nWin PDF Editor Converter can convert PDF documents to other editable formats like WORD(*.Doc), Text(*.txt), Images(*.JPG, *.TIF, *.BMP, *.GIF, *.PNG), Web page(*.HTML) or Flash(*.SWF). \r\n\r\nOfficial Website: http://www.winpdfeditor.com/","torrent":{"xt":"urn:btih:9229544ef71c1af2b664f30c0d98c9869fa74c40","amp;dn":"Win+PDF+Editor+v3.2.2.4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9229544ef71c1af2b664f30c0d98c9869fa74c40","infoHashBuffer":{"type":"Buffer","data":[146,41,84,78,247,28,26,242,182,100,243,12,13,152,201,134,159,167,76,64]},"announce":[],"urlList":[]}}