{"title":"Avi Nardia - KAPAP Combat Techniques 4DVD's","uid":5297198,"size":10553075712,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9295ec5cf3969d9ef5079c8fb708970bc39d330b&amp;dn=Avi+Nardia+-+KAPAP+Combat+Techniques+4DVD%5C%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"mackdaddywhite","files":-1,"time":1264099524,"description":"Learn how the New World Order are training their forces by seeing their techniques and concepts with Avi Nardia's 'KAPAP Combat Concepts'.\n\nBefore Krav Maga, Haganah or Lotar, Kapap was the original Israeli fighting art. As the tactical foundation of Israeli defense and security forces, Kapap's face-to-face combat system continues to serve a vital role in modern self-defense. With backgrounds in the Israeli military and as current instructors at the Kapap Academy, Avi Nardia and Albert Timen teach civilians, martial artists, law-enforcement officers and military personnel how to upgrade their toolbox of personal combat skills for any situation.\n\nIn Volume 1, PRINCIPLES AND CONDITIONING, topics include: the push-pull principle, manipulations via T-shapes, linear vs. circular attacks, how to counter edged-weapon attacks, the concept of relative position, attacking sensory points and the brain, the high-low attack principle and mental and physical conditioning for combat.\n\nIn Volume 2, HOLDS AND THIRD-PARTY PROTECTION, topics include; third-party protection principles, V.I.P. protection with two- and three-man drills, &quot;The Mask&quot;, The Nailing Technique&quot;, holds and releases, how to escape front bear hugs and how to escape rear bear hugs.\n\nIn Volume 3, WEAPONS SKILLS AND DEFENSES, topics include; gun-disarming principles, S.P.E.C. weapon-retention system, deadly mistakes in knife defenses, shared principles of Kapap and Philippine martial arts (featuring guru Roger Abgulos), countering the seven angles of attack, medium- and long-range weapons, using the karambit and empty-hand combat against an assailant.\n\nIn Volume 4, BRAZILIAN JIU-JITSU APPLICATIONS, topics include; special lessons with Brazilian jiu-jitsu expert Professor John Machado, escaping knife threats, handgun defenses from the ground, escaping a guillotine hold, controlling the fight on the ground, shared principles of Kapap and Brazilian jiu-jitsu, defending yourself in the guard position and drills for multiple opponents. &lt;a href=&quot;\nhttp://www.kapapacademy.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kapapacademy.com/&lt;/a&gt;\nBuy From Amazon.\n\n ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nThanks to member for share!\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nDOWNLOAD MAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n","torrent":{"xt":"urn:btih:9295ec5cf3969d9ef5079c8fb708970bc39d330b","amp;dn":"Avi+Nardia+-+KAPAP+Combat+Techniques+4DVD%5C%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9295ec5cf3969d9ef5079c8fb708970bc39d330b","infoHashBuffer":{"type":"Buffer","data":[146,149,236,92,243,150,157,158,245,7,156,143,183,8,151,11,195,157,51,11]},"announce":[],"urlList":[]}}