{"title":"Meat Loaf - The Essential (Greatest Hits) 2011 [FLAC] - Kitlope","uid":8007081,"size":819344581,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:94559e0ac95486aac8a47ad68b280fed18f3502a&amp;dn=Meat+Loaf+-+The+Essential+%28Greatest+Hits%29+2011+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Kitlope","files":25,"time":1357915894,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 94559E0AC95486AAC8A47AD68B280FED18F3502A\nFile Size: 781.38 MB\nYear: Original Release: 1998 Re-released: 2011\nLabel: Sony / Cleveland\nCatalog #: 88697 92211 2 *\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\nMichael Lee Aday (born Marvin Lee Aday, September 27, 1947), known by his stage name Meat Loaf, is an American hard rock musician and actor. He is noted for the Bat Out of Hell album trilogy consisting of Bat Out of Hell, Bat Out of Hell II: Back Into Hell and Bat Out of Hell III: The Monster is Loose as well as his powerful voice. Bat Out of Hell has sold more than 43 million copies worldwide.[1] After 35 years, it still sells an estimated 200,000 copies annually and stayed on the charts for over nine years, making it one of the best selling albums of all time.[2][3]\n\nAlthough he enjoyed success with Bat Out of Hell and Bat Out of Hell II: Back Into Hell and earned a Grammy Award for Best Solo Rock Vocal Performance for the song &quot;I'd Do Anything for Love (But I Won't Do That)&quot; on the latter album, Meat Loaf experienced some initial difficulty establishing a steady career within his native US. However, he has retained iconic status and popularity in Europe, especially the UK, where he ranks 23rd for the number of weeks overall spent on the charts. He ranked 96th on VH1's &quot;100 Greatest Artists of Hard Rock.&quot;\n\nMeat Loaf has also appeared in over 50 movies and television shows,[4] sometimes as himself or as characters resembling his stage persona. His most notable roles include Eddie in the American premiere of The Rocky Horror Show and The Rocky Horror Picture Show and Robert &quot;Bob&quot; Paulson in Fight Club.\n\n\nThe Essential \n\n\nThe Very Best of Meat Loaf (later released as &quot;The Essential&quot;) is a 1998 album spanning the first 21 years of Meat Loaf's recording career. Although not reaching the top ten in the UK, it recently went platinum[when?], and was already platinum around the rest of the world just after its release. The album features many of Meat Loaf's best-known songs as well as a few from his lesser known albums of the 1980s.\n\nBesides hits like &quot;Paradise by the Dashboard Light&quot; and &quot;I'd Do Anything for Love (But I Won't Do That)&quot;, The Very Best of Meat Loaf contains three new tracks. Two of those are written by Andrew Lloyd Webber and Jim Steinman and are adapted from their musical Whistle Down The Wind; both of these tracks were produced by Steinman. The third new track, &quot;Is Nothing Sacred&quot; is written by Steinman and lyricist Don Black, and produced by Russ Titelman (the single version of this song is a duet with Patti Russo, whereas the album version is a solo song by Meat Loaf. The single version would later appear on the VH1 Storytellers CD).\n\nBoth Bat out of Hell and Bat out of Hell II: Back into Hell are prominently featured with five tracks from the first and four from the second. The album did not feature any songs from his 1986 album Blind Before I Stop.\n\nThe album was rereleased in 2003 with the same tracks in a different order.\n\n\n\nTracks: \n\n\nDisc: 1\n\n\n1. Home By Now/No Matter What \n2. Life Is A Lemon And I Want My MoneyBack \n3. You Took The Words Right Out Of MyMouth \n4. Two Out Of Three Ain't Bad \n5. Modern Girl (Live) \n6. Rock And Roll Dreams Come Through \n7. Is Nothing Sacred \n8. Paradise By The Dashboard Light;I.Paradise II. Let Me Sleep On It III.Praying For The End Of Time \n9. Heaven Can Wait \n\n\nDisc: 2 \n \n\n1. I'd Do Anything For Love (But I Won'tDo That) \n2. A Kiss Is A Terrible Thing To Waste \n3. I'd Lie For You (And That's TheTruth) \n4. Not A Dry Eye In The House \n5. Nocturnal Pleasure \n6. Dead Ringer For Love \n7. Midnight At The Lost And Found \n8. Objects In The Rear View Mirror MayAppear Closer Than They Are \n9. Bat Out Of Hell \n\n\n\n\nEnjoy Meat Loaf :)\n","torrent":{"xt":"urn:btih:94559e0ac95486aac8a47ad68b280fed18f3502a","amp;dn":"Meat+Loaf+-+The+Essential+%28Greatest+Hits%29+2011+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94559e0ac95486aac8a47ad68b280fed18f3502a","infoHashBuffer":{"type":"Buffer","data":[148,85,158,10,201,84,134,170,200,164,122,214,139,40,15,237,24,243,80,42]},"announce":[],"urlList":[]}}