{"title":"Holy Wave - Relax (2014) [FLAC]","uid":9588855,"size":282837706,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:950af62106ced6095b1c30f5a763fc3f13941992&amp;dn=Holy+Wave+-+Relax+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1391868447,"description":"\n  Holy Wave - Relax (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie, Garage\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Do You Feel It?\n  02 Psychological Thriller\n  03 Night Tripper\n  04 Sol Love\n  05 Star Stamp\n  06 Son of Sound\n  07 Shamania\n  08 Change Your Head / Ecstatic Moment\n  09 Surfin MTA\n  10 Moth Mountain\n  11 Wet &amp; Wild \n\n  More than a few contemporary bands who play psychedelic-influenced rock seem to be trying very, very hard to seem properly addled in the studio, but on their second full-length album, Relax, Holy Wave sound as if they were dosed at birth and have been tripping ever since. The echo and reverb that hover over the music on Relax certainly help to conjure up a lysergic mood, as do the occasional atonal sound effects that creep in and out of the mix, but the real key to Holy Wave is their way with a drone; the low-budget organ that lurks in the background of most of these tunes gives the music a persistent, thoughtful hum that not only gives the songs a cohesive thread but adds a hypnotic element, lulling the listener into the determined drift of these 11 songs. Holy Wave are clearly students of the fuzz 'n' Farfisa branch of psychedelia rather than the more serious acts that would emerge on the West Coast (the Dead and the Airplane wouldn't sing about surfing in the subway, let alone make it sound like a good idea), but their commitment to a properly expanded mind never seems less than total, as the ringing of the guitars, the throb of the bass, and the report of the tambourine suggest a descent into a gentle maelstrom. Holy Wave could work a little harder on their melodies (the &quot;Hey Joe&quot; lift &quot;Psychological Thriller&quot; is as good as they get in terms of tunefulness), but they sure have a sound of their own, and if you're of a mind to journey beyond the infinite with your headphones as your guide, Relax is as good a road map as you'll find in the year 2014.","torrent":{"xt":"urn:btih:950af62106ced6095b1c30f5a763fc3f13941992","amp;dn":"Holy+Wave+-+Relax+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"950af62106ced6095b1c30f5a763fc3f13941992","infoHashBuffer":{"type":"Buffer","data":[149,10,246,33,6,206,214,9,91,28,48,245,167,99,252,63,19,148,25,146]},"announce":[],"urlList":[]}}