{"title":"Peter Greenaway - Tulse Luper Suitcases: The Moab Story (2003)","uid":3528281,"size":1467314223,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:950ccc8274e129dd3f65efa2c621c6c293352c53&amp;dn=Peter+Greenaway+-+Tulse+Luper+Suitcases%3A+The+Moab+Story+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Beksinski","files":3,"time":1159039772,"description":"Title: The Tulse Luper Suitcases, Part 1: The Moab Story\nDirector: Peter Greenaway\nYear: 2003\nLanguage: English/Spanish\nSubtitles: n/a\nVideo Codec: DivX 5.0\nVideo Bitrate: 1301 kb/s\nResolution: 640x352 (1.82:1) [=20:11]\nQf: 0.231 bits/pixel\nFramerate: 25.000\nAudio Specs: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 116 kb/s (58/ch, stereo)\nFs: 48000 Hz\nRuntime: 127 min\nSource: DVD\n\nDescription: Iconoclastic director Peter Greenaway begins his most ambitious project to date with this feature, the first in a proposed series of films, television programs, and multimedia projects that examine the contents of 92 suitcases, each revealed by title character Tulse Henry Purcel Luper. Broken into three sections spanning 1928 to 1940, The Tulse Luper Suitcases: Part One follows our young hero from age 10, when he is reprimanded by his father for scrawling some graffiti on a wall in his desolate South Wales neighborhood. Years later, Tulse (JJ Field) is a desert explorer who winds up being further punished by the aptly-named dominatrix Passion Hockmeister (Caroline Dhavernas). Finally, in the film&amp;#039;s last section, Tulse is in Antwerp at the start of World War II, where he ends up being imprisoned by Nazis. Told in a fractured, non-narrative style, The Tulse Luper Suitcases also incorporates many inter-titles, superimposed images, an ever-present narrator presented in a picture-within-picture format, intentionally fake-looking sets, and many, many references to other Greenaway films and characters.\n-All Movie Guide\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde. \n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\t\t\t\twww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:950ccc8274e129dd3f65efa2c621c6c293352c53","amp;dn":"Peter+Greenaway+-+Tulse+Luper+Suitcases%3A+The+Moab+Story+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"950ccc8274e129dd3f65efa2c621c6c293352c53","infoHashBuffer":{"type":"Buffer","data":[149,12,204,130,116,225,41,221,63,101,239,162,198,33,198,194,147,53,44,83]},"announce":[],"urlList":[]}}