{"title":"Aaron Russo - America From Freedom to Facism","uid":3519240,"size":733028352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95639c1947b80d12cdfa86251ef547b23ba596d2&amp;dn=Aaron+Russo+-+America+From+Freedom+to+Facism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"smartypants","files":1,"time":1157370553,"description":"Quality:         DVDRip from screener\nImdb Link:      &lt;a href=&quot; http://www.imdb.com/title/tt0772153/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0772153/&lt;/a&gt;\n\nIf you can, please donate. This film needs to be seen by as many people possible. \n\n-smartypants-\n\n\nFrom an Imdb review:\n--------------------\n\nHundreds turn out for screening of Aaron Russo&amp;#039;s &quot;America: From Freedom to Fascism&quot; By Kat Dillon About 300 people attended the We the People Foundation (http://givemeliberty.org) screening of Aaron Russo&amp;#039;s new movie, &quot;America: From Freedom to Fascism&quot; in Londonderry on Sunday March 26th. Russo&amp;#039;s movie delved into a wide array of subjects, from the Federal Reserve system, lack of accountability from Fort Knox gold reserves, the legality of the Federal Income Tax, IRS abuses of the innocent, lack of constitutional restraint, similarities of the US to a police state, The New World Order, the upcoming National ID Card, to abuses of Radio Frequency Identification (RFID) technology.\n\nThe film&amp;#039;s impetus was the Truth-in-Taxation Movement&amp;#039;s claim that the Federal Income Tax does not apply to most people living and working in American. The We the People Foundation has been asking the government a simple question, &quot;Where is the law that says average Americans have to pay taxes on their wages?&quot; Easy question, right? But since 2002, the Federal Government and the IRS have refused to answer this straightforward question. The Supreme Court has ruled that the 16th Amendment did not confer to the government any new taxation powers (Stanton v. Baltic Mining Co.) The movie points to lower court judges blatantly refusing to allow this Supreme Court decision be entered into evidence in trials of tax resisters. Ex-IRS Commissioner Sheldon Cohen ended the interview when asked about this Supreme Court decision, rather than answer Russo&amp;#039;s questions about it.\n\nThe issue of the Federal Reserve has surprises for even those familiar with the subject. In 1913, the power allotted to Congress to coin money was handed over to a private group of banks otherwise known as the Federal Reserve. Author Franklin Saunders asks, &quot;Why have we given a monopoly of creating money out of thin air to a private corporation?&quot; That the public is not allowed to even know what banks are a part of the Federal Reserve is driven home by author Michael Ruppert. Toward the end of the movie, it is revealed that there has not been an accounting of the gold in Fort Knox in recent history.\n\nIn an interview with Congressman Ron Paul of Texas, Paul states, &quot;You have to get permission for almost everything. If that&amp;#039;s a definition of a police state, that you can&amp;#039;t do anything unless the government gives you permission, we&amp;#039;re well on our way.&quot; Dramatic footage brings the police state into focus with a Florida woman being repeatedly tasered to her pitiful screams of pain. Her crime? Driving with a suspended license. Another woman is tasered while huddled on the ground. She had been protesting.\n\nProgrammer Clinton Eugene Curtis is questioned at a hearing about programs for the new electronic voting machines, &quot;Mr. Curtis, are there programs that can be used to fix elections?&quot; Curtis replies with a definitive, &quot;Yes.&quot; And when asked if he thought the Ohio presidential election in 2004 was rigged, he said that it appeared to have been.\n\nNew Hampshire activist and Spychips author Katherine Albrecht is interviewed in the movie about the dangers of RFID technology. She paints a frightening picture of our every move, our every purchase being tracked by the government in the near future. With the use of RFID in money, you could not make purchases with regular money without the approval or knowledge of the government. To be a political dissident would be a condemnation to live completely outside normal society.\n\nAt the end of the movie, Russo poses the very apt question, &quot;What are you going to do about it?&quot; He first poses the idea of civil disobedience, a great suggestion, which I think he should have stuck with. The movie screams for revolt. But he dilutes the whole message of the movie by then suggesting electing people who will not do these horrible things to us, even after making it clear that the elections are rigged. He would have done well to stick with the idea of non-violent, non-cooperation in the tradition of Gandhi and Martin Luther King, Jr. I wonder if Mr. Russo realizes the power of such action. It cannot be ignored, and puts pressure on everyone to act. It is feared by government more than any other means of resistance, for good reason. They must have our consent to enslave us. They are too few, and we too many for it to be otherwise.\n\nYou can view a preview of the movie online at http://www.freedomtofascism.com/. Russo plans to release the movie to theaters this summer.","torrent":{"xt":"urn:btih:95639c1947b80d12cdfa86251ef547b23ba596d2","amp;dn":"Aaron+Russo+-+America+From+Freedom+to+Facism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95639c1947b80d12cdfa86251ef547b23ba596d2","infoHashBuffer":{"type":"Buffer","data":[149,99,156,25,71,184,13,18,205,250,134,37,30,245,71,178,59,165,150,210]},"announce":[],"urlList":[]}}