{"title":"La.Vida.de.los.Peces.2010.DVDRip.XviD.MP3.CLAN-SUD","uid":5980505,"size":737079028,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95c4caebdd81af95d8033f711cf1030f732f9177&amp;dn=La.Vida.de.los.Peces.2010.DVDRip.XviD.MP3.CLAN-SUD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"noriegaRJ","files":-1,"time":1290578116,"description":"Title: La Vida de los Peces aka The Life of Fish\nYear: 2010 \nCountry: Chile\nLanguage: Spanish\nSource: DVDRIP\nSize: 702 MB \nGenre: Drama\nRuntime: 84 min\nResolution: 720 X 384\nBitrates: 128kbps\nVideo Codec: XVID\nAudio Codec: MP3\nDirected by: Matias Bize\nStarring: Santiago Cabrera    ...  Andres\n \t  Blanca Lewin        ...  Beatriz\n \t  Antonia Zegers      ...  Mariana\n \t  Victor Montero      ...  Pablo\n \t  Sebastian Layseca   ...  Ignacio\n \t  Juan Pablo Miranda  ...  Roberto\n \t  Luz Jimenez         ...  Guille\n \t  Maria Gracia Omegna ...  Carolina\n \t  Alicia Rodriguez    ...  Daniela\n \t  Francisca Cardenas  ...  Maca\n \t  Diego Fontecilla    ...  Jorge\n\nIMDB Link:     &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1672078/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1672078/&lt;/a&gt;\n\nSynopis: Ruggedly handsome Andres (Santiago Cabrera, &quot;Heroes&quot;) is a travel writer in his early 30s who's practically never at home and has just sold his parents' house in Santiago. Before boarding an early morning flight to Europe, he's at the birthday party of a childhood friend, Pablo (Victor Montere), though in the pic's opening frames, Andres is already saying goodbye to those present.\n\nFriendly, semi-inebriated banter quickly fills in the backstory and also reveals the real reason Andres went to the party: Beatriz (Blanca Lewin), an ex-girlfriend who could have been the love of his life but is now with a gringo, with whom she has 5-year-old twins. Andres feels their story hasn't quite finished yet, even though he's unsure what he really wants out of this late-in-the-game encounter.\n\nReal-time pacing is thankfully accomplished through artfully edited sequences rather than endlessly long takes, and the naturally acted dialogue is what will keep auds hooked. But this is no &quot;In Bed,&quot; in which two people meet for the first time, and unlike &quot;Saturday&quot; and &quot;About Crying,&quot; pic is not narrowly focused on just one thing a couple shared before things went awry. The strong suit of &quot;Fish,&quot; which is of a piece with Bize's oeuvre but also reps an impressive leap forward, is that it focuses not on possible things in the future or concrete ones in the past, but the nebulous notion of what might have been.\n\nAs Andres wanders around the house where the party is in full swing, he gets pulled into conversations that tie into this subject, though the dialogue never is overly didactic. &quot;It's easy to live in this world as a tourist, but hard to deal with the day-to-day reality of life,&quot; remarks one of the characters, and it's clear that Andres, through his occupation, has been avoiding settling down like his peers, whether subconsciously or not. Pic also raises questions of how people, places and even relationships remain recognizable over time, as time seems to change everything.\n\nThough the film's home stretch focuses on an intense one-on-one conversation between Andres and Beatriz, its scope feels much wider; its themes and motifs have emerged in the preceding party conversations, whose ruminations have the ring of truth. (Variety)\n\n\nThis movie was chosen by Chile to represents that country in the Oscar 2011.\n\n\nTHIS TORRENT HAS SUBTITLES IN ENGLISH AND BRAZILIAN PORTUGUESE. \n\n\nThanks to those helping me seed. Leechers remember, the community depends on you. If nobody shares, the freebies go away. Remember, the only reason you can download this free movie is because others are generous enough to keep sharing it with you. If nobody shares, everybody loses, so even if its for an extra hour or two after you get it, remember, others want to see it too, and they can't without you.\n\n\nSEE MY OTHERS UPLOADS:                             &lt;a href=&quot;\nhttp://thepiratebay.se/user/noriegaRJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/noriegaRJ&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:95c4caebdd81af95d8033f711cf1030f732f9177","amp;dn":"La.Vida.de.los.Peces.2010.DVDRip.XviD.MP3.CLAN-SUD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95c4caebdd81af95d8033f711cf1030f732f9177","infoHashBuffer":{"type":"Buffer","data":[149,196,202,235,221,129,175,149,216,3,63,113,28,241,3,15,115,47,145,119]},"announce":[],"urlList":[]}}