{"title":"Infectious Diseases of the Dog and Cat - 4th Edition","uid":9924760,"size":67416542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:962af931bfe07f1332eeff6807d63eaa9ef76391&amp;dn=Infectious+Diseases+of+the+Dog+and+Cat+-+4th+Edition+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1397051892,"description":"Publication Date: December 5, 2011 | ISBN-10: 1416061304 | ISBN-13: 978-1416061304 | Edition: 4\nThe definitive reference for the diagnosis, treatment, and prevention of small animal infections, Infectious Diseases of the Dog and Cat, 4th Edition delivers current, comprehensive information essential to the management of infectious diseases caused by viruses, rickettsiae, chlamydiae, mycoplasmas, bacteria, fungi, algae, protozoa, and unknown agents. Each section guides you through diagnostic testing for specific microorganisms, from sample collection to laboratory submission to interpretation of results, then details appropriate treatment measures and pharmacologic considerations for the various related infections. Full-color illustrations and hundreds of tables provide quick, convenient access to diagnostic and therapeutic guidelines, and thoroughly updated drug information helps you confidently administer appropriate dosages for the most effective treatment and prevention. \n\n    The most comprehensive infectious disease coverage available helps you confidently address clinical problems related to infectious diseases in dogs and cats, and includes:\n        Immunization strategies and environmental control of infections \n\n\n\n        Immunodeficiency disorders \n\n\n\n        Prevention of infection in multi-pet and shelter settings \n\n\n\n        Immunocompromised people and their pets \n\n    Vibrant full-color illustrations clarify disease features and modes of disease transmission for enhanced diagnostic accuracy and disease prevention.\n    Convenient tables deliver therapeutic recommendations and drug dosages at a glance.\n    Complete antimicrobial drug formulary provides fast, easy access to indications, recommended dosages, and pharmacologic considerations essential for all relevant pharmaceuticals.\n    State-of-the-art diagnostic testing procedures help you ensure accurate diagnoses for all clinically relevant pathogens.\n    Content reflects the expert insight and vast clinical experience of a panel of trusted authorities on small animal infectious diseases.\n    Easy-to-use companion website provides convenient online access to additional images, tables, boxes, appendices, and references linked directly to original PubMed abstracts. \n\n\n\n    Expanded coverage of zoonoses, zoonotic potential, and precautions helps you effectively monitor and treat zoonotic infections.\n    Fully updated drug formulary reflects the most current pharmacokinetics, indications, contraindications, handling and administration guidelines, and dosage recommendations available.\n    Updated content throughout the text details current diagnostic testing regimens and therapeutic and preventive considerations for all pathogens you're likely to encounter in the clinical setting.\n    Special focus on disease incidence and susceptibility in traveling animals helps you alert animal owners to potential risks associated with pet travel. ","torrent":{"xt":"urn:btih:962af931bfe07f1332eeff6807d63eaa9ef76391","amp;dn":"Infectious+Diseases+of+the+Dog+and+Cat+-+4th+Edition+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962af931bfe07f1332eeff6807d63eaa9ef76391","infoHashBuffer":{"type":"Buffer","data":[150,42,249,49,191,224,127,19,50,238,255,104,7,214,62,170,158,247,99,145]},"announce":[],"urlList":[]}}