{"title":"The People's Republic of Amnesia: Tiananmen Revisited (2014)","uid":10514999,"size":23706428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96e60f7564de830c7ffd9e8b98739a94645dbcc2&amp;dn=The+People%27s+Republic+of+Amnesia%3A+Tiananmen+Revisited+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1404906120,"description":"pdf\n\n\nOn June 4, 1989, People's Liberation Army soldiers opened fire on unarmed civilians in Beijing, killing untold hundreds of people. A quarter-century later, this defining event remains buried in China's modern history, successfully expunged from collective memory. In The People's Republic of Amnesia, NPR correspondent Louisa Lim charts how the events of June 4th changed China, and how China changed the events of June 4th by rewriting its own history. \n\n Lim reveals new details about those fateful days, including how one of the country's most senior politicians lost a family member to an army bullet, as well as the inside story of the young soldiers sent to clear Tiananmen Square. She also introduces us to individuals whose lives were transformed by the events of Tiananmen Square, such as a founder of the Tiananmen Mothers, whose son was shot by martial law troops; and one of the most important government officials in the country, who post-Tiananmen became one of its most prominent dissidents. And she examines how June 4th shaped China's national identity, fostering a generation of young nationalists, who know little and care less about 1989. For the first time, Lim uncovers the details of a brutal crackdown in a second Chinese city that until now has been a near-perfect case study in the state's ability to rewrite history, excising the most painful episodes. By tracking down eyewitnesses, discovering US diplomatic cables, and combing through official Chinese records, Lim offers the first account of a story that has remained untold for a quarter of a century. The People's Republic of Amnesia is an original, powerfully gripping, and ultimately unforgettable book about a national tragedy and an unhealed wound.\n\n\n","torrent":{"xt":"urn:btih:96e60f7564de830c7ffd9e8b98739a94645dbcc2","amp;dn":"The+People%27s+Republic+of+Amnesia%3A+Tiananmen+Revisited+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96e60f7564de830c7ffd9e8b98739a94645dbcc2","infoHashBuffer":{"type":"Buffer","data":[150,230,15,117,100,222,131,12,127,253,158,139,152,115,154,148,100,93,188,194]},"announce":[],"urlList":[]}}