{"title":"The Cambridge History of Iran, Vol. 5: The Saljuq and Mongol Per","uid":11739176,"size":81349058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96f978690bd4299797b8e355b1ffa1a0430a6979&amp;dn=The+Cambridge+History+of+Iran%2C+Vol.+5%3A+The+Saljuq+and+Mongol+Per&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425691472,"description":"The Cambridge History of Iran is an eight-volume survey of Iranian history and culture, and its contribution to the civilisation of the world. All aspects of the religious, philosophical, political, economic, scientific and artistic elements in Iranian civilisation are studied, with some emphasis on the geographical and ecological factors which have contributed to that civilisation's special character. The aim is to provide a collection of readable essays rather than a catalogue of information. The volumes offer scope for the publication of new ideas as well as providing summaries of established facts. They should act as a stimulus to specialists, but are primarily concerned to answer the sort of questions about the past and present of Iran that are asked by the non-specialist. Volume 5 is a survey of every aspect of the civilisations which flourished in the Iranian region between the eleventh and thirteenth centuries: the rise and decline of the Saljuqs, the Mongol invasion and the establishment of a Mongol regime which dominated the Middle East for more than a century. It is the first attempt in modern times to study in detail a period of the greatest significance in Iranian history","torrent":{"xt":"urn:btih:96f978690bd4299797b8e355b1ffa1a0430a6979","amp;dn":"The+Cambridge+History+of+Iran%2C+Vol.+5%3A+The+Saljuq+and+Mongol+Per","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96f978690bd4299797b8e355b1ffa1a0430a6979","infoHashBuffer":{"type":"Buffer","data":[150,249,120,105,11,212,41,151,151,184,227,85,177,255,161,160,67,10,105,121]},"announce":[],"urlList":[]}}