{"title":"Reading Style - A Life in Sentences (gnv64)","uid":10608791,"size":16097945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97152cf612e1aa33e71beb63daca7386b03edfb4&amp;dn=Reading+Style+-+A+Life+in+Sentences+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"gnv65","files":-1,"time":1406019648,"description":"Reading Style: A Life in Sentences\nby Jenny Davidson \nColumbia University Press | June 2014 | ISBN-10: 0231168586 | PDF | 208 pages | 15.2 mb\n\nA professor, critic, and insatiable reader, Jenny Davidson investigates the passions that drive us to fall in love with certain sentences over others and the larger implications of our relationship with writing style. At once playful and serious, immersive and analytic, her book shows how style elicits particular kinds of moral judgments and subjective preferences that turn reading into a highly personal and political act.\nMelding her experiences as reader and critic, Davidson opens new vistas onto works by Jane Austen, Henry James, Marcel Proust, and Thomas Pynchon; adds richer dimension to critiques of W. G. Sebald, Alan Hollinghurst, Thomas Bernhard, and Karl OveKnausgaard; and allows for a sophisticated appreciation of popular fictions by Stephen King, Neil Gaiman, Lionel Shriver, George Pelecanos, and Helen DeWitt. She privileges diction, syntax, point of view, and structure over plot and character, identifying the intimate mechanics that draw us in to literature's sensual frameworks and move us to feel, identify, and relate. Davidson concludes with a reading list of her favorite titles so others can share in her literary adventures and get to know better the imprint of her own reading style.\n\nCONTENTS\n1. The Glimmer Factor: Anthony Burgess's 99 Novels\n2. Lord Leighton, Liberace and the Advantages of Bad Writing: Helen DeWitt, Harry Stephen Keeler, Lionel\nShriver, George Eliot\n3. Mouthy Pleasures and the Problem of Momentum: Gary Lutz, Lo/ita, Lydia Davis, Jonathan Lethem\n4. The Acoustical Elegance of Aphorism: Kafka, Fielding, Austen, Flaubert\n5. Tempo, Repetition and a Taxonomy of Pacing: Peter Temple, Neil Gaiman, A. L. Kennedy, Edward P. Jones\n6. Late Style: The Golden Bowl and Swann 's Way\n7. Disordered Sentences: Georges Perec, Roland Barthes, Wayne Koestenbaum, Luc Sante\n8. Details That Linger and the Charm of Voluntary Reading: George Pelecanos, Stephen King, Thomas Pynchon\n9. The Ideal Bookshelf: The Rings of Saturn and The Line of Beauty\n10. The Bind of Literature and the Bind of Life: Voices from Chernobyl, Thomas Bernhard, Karl Ove Knausgaard\nNotes\nA Reading List\nIndex","torrent":{"xt":"urn:btih:97152cf612e1aa33e71beb63daca7386b03edfb4","amp;dn":"Reading+Style+-+A+Life+in+Sentences+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97152cf612e1aa33e71beb63daca7386b03edfb4","infoHashBuffer":{"type":"Buffer","data":[151,21,44,246,18,225,170,51,231,27,235,99,218,202,115,134,176,62,223,180]},"announce":[],"urlList":[]}}