{"title":"The Art and Science of Psychotherapy {BBS}","uid":6807616,"size":6701392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:971a50d70b1b93872a9ee44d3447909b21f77321&amp;dn=The+Art+and+Science+of+Psychotherapy+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320884914,"description":"Psychotherapy, like most other areas of health care, is a synthesis of scientific technique and artistic expression. The practice, like any other, is grounded in a series of standardized principles, theories, and techniques. Individual practitioners define themselves within the field by using these basic tools to achieve their therapeutic goals in novel ways, applying these rudimentary skills and guiding principles to each situation. However, a toolbox full of treatment approaches, no matter how comprehensive, is not enough to effectively reach your patients. Effective work can only be accomplished through a synthesis of the fundamental scientific methods and the creative application of these techniques, approaches, and strategies.\n\nThe Art and Science of Psychotherapy offers invaluable insight into the creative side of psychotherapy. The book addresses the fundamental split between researchers and scholars who use scientific methods to develop disorder-specific treatment techniques and those more clinically inclined therapists who emphasize the individual, interpersonal aspects of the therapeutic process. With contributions from leading therapists, the editors have compiled a practical handbook for clinical psychologists, social workers, psychiatrists, and mental health professionals.\n\n\n# Hardcover: 344 pages\n# Publisher: Routledge; 1 edition (December 13, 2006)\n# Language: English\n# ISBN-10: 0415952158\n# ISBN-13: 978-0415952156","torrent":{"xt":"urn:btih:971a50d70b1b93872a9ee44d3447909b21f77321","amp;dn":"The+Art+and+Science+of+Psychotherapy+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971a50d70b1b93872a9ee44d3447909b21f77321","infoHashBuffer":{"type":"Buffer","data":[151,26,80,215,11,27,147,135,42,158,228,77,52,71,144,155,33,247,115,33]},"announce":[],"urlList":[]}}