{"title":"(PSX-PSP) Tony Hawks Pro Skater 1-4 converted properly (Kingdom-","uid":4523115,"size":1883442648,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:973c24bf861b773d390b01815936af785f2c30be&amp;dn=%28PSX-PSP%29+Tony+Hawks+Pro+Skater+1-4+converted+properly+%28Kingdom-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"toxicjuggalo","files":5,"time":1227244419,"description":"Tony Hawks Pro Skater 1:\n\nTony Hawk&amp;#039;s Pro Skater is a skateboarding simulation in which you control a famous skate star around 3d environments. Each game area contains a plethora of objects like ramps, rails, and half-pipes which can be used to perform tricks. Each trick you perform earns you more points for your score\n\nTony Hawks Pro Skater 2:\n\nWhile Tony Hawk&amp;#039;s Pro Skater put extreme sports on the videogame map, Tony Hawk&amp;#039;s Pro Skater 2 redefined an already great game. Its addition of stellar new features (like Create-A-Park), and great gameplay tweaks (the manual maneuver will be copied for years to come) made it the best installment in a killer series of games. Anyone who has ever skated the Philadelphia level will agree -- this game is a masterpiece of level design. Hell, it&amp;#039;s a masterpiece all around. There isn&amp;#039;t a bad park or dull moment, just pure gaming nirvana. Developed by Neversoft Entertainment, THPS2 came out in 2000 across a range of platforms.\n\nTony Hawks Pro Skater 3:\n\nThe first of the series built specifically for next-gen consoles, Tony Hawk&amp;#039;s Pro Skater 3 delivers realistic, cutting edge graphics, action-packed gameplay, seamless video cinematic sequences and crisp special effects. The game extends beyond the boundaries of the traditional skateboarding genre by setting players in living environments that evolve. Players can choose to skate through realistic urban settings complete with pedestrians, cars, traffic accidents, natural disasters and changing weather conditions.\n\nPlayers go high flying through some of the hottest skating locales in the world including Skater?s Island in Middleton, Rhode Island, Rio, Los Angeles, Canada, Tokyo and Paris. Fluid animations let gamers pull off hundreds of combo moves and tricks including nollies, manuals and lip tricks using the franchise&amp;#039;s signature solid control scheme.\n\nTony Hawks Pro Skater 4:\n\nDrop into the ultimate skating challenge with Tony Hawk&amp;#039;s Pro Skater 4. Players take on the role of legendary skateboarder Tony Hawk and 13 other athletes as they skate through enormous free roaming levels, choose from 190 progressively harder goals and build their skills to perform 14 of the greatest skateboarding stunts of all time. Tony Hawk&amp;#039;s Pro Skater 4 delivers the deepest and most challenging gameplay experience yet in the Tony Hawk&amp;#039;s Pro Skater series. The game&amp;#039;s enhanced career mode allows players to earn respect and the chance to take on all new pro goals by conquering a skater-specific Pro Challenge based on each skater&amp;#039;s personal history.","torrent":{"xt":"urn:btih:973c24bf861b773d390b01815936af785f2c30be","amp;dn":"%28PSX-PSP%29+Tony+Hawks+Pro+Skater+1-4+converted+properly+%28Kingdom-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"973c24bf861b773d390b01815936af785f2c30be","infoHashBuffer":{"type":"Buffer","data":[151,60,36,191,134,27,119,61,57,11,1,129,89,54,175,120,95,44,48,190]},"announce":[],"urlList":[]}}