{"title":"Strikeforce Morituri","uid":5090462,"size":482237296,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:973fc7259ca056970932d7b0b0de5bdd9476c650&amp;dn=Strikeforce+Morituri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"brodahisou","files":-1,"time":1253099283,"description":"Strikeforce: Morituri is a comic book series published by Marvel Comics from 1986 to 1989. The series was created by writer Peter B. Gillis and artist Brent Anderson.\n\nThe premise is that aliens have invaded Earth and nearly succeeded in conquering it and stripping it of its resources. A scientist discovers a process which can provide humans with superhuman powers, effectively creating a group of defending superheroes. However, the process would also ensure that the empowered humans would die within a year of being empowered. The series thus focused on the heroism of the main characters in fighting the invaders, while living with the knowledge that their fates were sealed regardless of whether or not they prevailed.\n\nThe title comes from the Latin phrase: &quot;Morituri te salutamus&quot; (We who are about to die salute you!), a proclamation gladiators made to the emperor of Rome before they would battle in the arena. The subtitle of the comic was &quot;We who are about to die&quot;.\n\nGillis and Anderson left the series within two years and carried on under the tenure of writer James Hudnall and artist Mark Bagley.  After the series ended with #31 Marvel published an additional five-issue miniseries, Strikeforce Morituri: Electric Undertow, which took place ten years after the events of the last issue.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:973fc7259ca056970932d7b0b0de5bdd9476c650","amp;dn":"Strikeforce+Morituri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"973fc7259ca056970932d7b0b0de5bdd9476c650","infoHashBuffer":{"type":"Buffer","data":[151,63,199,37,156,160,86,151,9,50,215,176,176,222,91,221,148,118,198,80]},"announce":[],"urlList":[]}}