{"title":"Natalie Imbruglia - Left Of The Middle - (1997)[FLAC-EAC-CUE]","uid":4364441,"size":368015645,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9893de285ca02639282338a58d0cbdbff11e5916&amp;dn=Natalie+Imbruglia+-+Left+Of+The+Middle+-+%281997%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"seanprince","files":21,"time":1219830383,"description":"Natalie Imbruglia - Left Of The Middle - (1997)[FLAC-EAC-CUE]\n\nTrack list\n\nNatalie Imbruglia - Left Of The Middle\n\n01. Torn 04:04\n02. One More Addiction 03:31\n03. Big Mistake 04:33\n04. Leave Me Alone 04:23\n05. Wishing I Was There 03:53\n06. Smoke 04:37\n07. Pigeons And Crumbs 05:19\n08. Don&amp;#039;t You Think? 03:55\n09. Impressed 04:48\n10. Intuition 03:23\n11. City 09:33\n12. Left Of The Middle 03:46\n\nBiography by Greg Prato\n\nBy mixing Lisa Loeb/Alanis Morissette-like singing with music that sounds similar to a more mainstream Portishead at times, Natalie Imbruglia became one of the biggest pop sensations in Europe. Born in Sydney, Australia, on February 4, 1975, Imbruglia was one of four sisters and grew up in a tiny beach town. After becoming a teen actress and landing a spot on the Australian soap opera Neighbours, Imbruglia decided that she would rather be a singer, and moved to London in 1996 to try her luck. It was a wise move, as she was soon signed to the RCA U.K. label. Deciding to release a single before her full-length debut, the track &quot;Torn&quot; was issued in 1997, and no one could have predicted its wild success. Produced by former Cure member Phil Thornalley and written by Ednaswap, the single spent a total of 14 weeks at number one, sold over a million copies, and broke the record for most airplay in U.K. history. Her debut album, Left of the Middle, was a major hit in Australia, the U.K., and the U.S. upon its release in early 1998. Follow-up singles &quot;Smoke&quot; and the album&amp;#039;s title track did moderately well, but never achieved massive success like &quot;Torn.&quot; After whirlwind praise, Imbruglia disappeared for the rest of the &amp;#039;90s. She found herself battling writer&amp;#039;s block while trying to compose material for a sophomore effort, but finally succeeded and, in 2001, released White Lilies Island in the U.K. The album&amp;#039;s debut single, &quot;That Day,&quot; was a favorite among radio play. A nearly four-year wait preceded the release of Counting Down the Days. Alongside Coldplay&amp;#039;s &quot;Speed of Sound&quot; and James Blunt&amp;#039;s &quot;You&amp;#039;re Beautiful,&quot; Imbruglia&amp;#039;s song &quot;Shiver&quot; was nominated for the Ivor Novello Award in the PRS most-performed work category in 2006.\n\nReview by Greg Prato\n\nExpectations for Natalie Imbruglia&amp;#039;s debut album, Left of the Middle, were high because of the runaway success of the pre-album single &quot;Torn&quot; during 1997-1998. Fans of the single will be pleased to hear that the album is quite similar in approach and sound to the breakthrough single: laid-back alt-pop with sweetly melodic vocals. Admittedly, some of the material will be seen as pop fluff by certain listeners, but fans of popular latter-day female artists like Paula Cole, Sheryl Crow, and Meredith Brooks will find Imbruglia&amp;#039;s debut most enjoyable. What separates Imbruglia from the aforementioned artists is her willingness to experiment with electronic sounds, no doubt courtesy of mixer Nigel Godrich (of Radiohead fame), which can be heard on such tracks as &quot;Smoke.&quot; &quot;Torn&quot; proves to be the best song on the album, with its bouncy acoustic feel, but the pop/rocker &quot;Big Mistake&quot; is almost as good. Not all of the material on Left of the Middle fares as well, however, such as the Alanis Morissette sound-alike &quot;Intuition,&quot; but Imbruglia need not worry about being lumped into the copycat category; for the most part, she has a style all her own.\n\nEnjoy. ","torrent":{"xt":"urn:btih:9893de285ca02639282338a58d0cbdbff11e5916","amp;dn":"Natalie+Imbruglia+-+Left+Of+The+Middle+-+%281997%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9893de285ca02639282338a58d0cbdbff11e5916","infoHashBuffer":{"type":"Buffer","data":[152,147,222,40,92,160,38,57,40,35,56,165,141,12,189,191,241,30,89,22]},"announce":[],"urlList":[]}}