{"title":"Rosemary: The Hidden Kennedy Daughter - Kate Clifford Larson","uid":15385383,"size":225401461,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:98b6dceb312b9aed995ad1d13325f20a5cc14692&amp;dn=Rosemary%3A+The+Hidden+Kennedy+Daughter+-+Kate+Clifford+Larson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Kane_krit","files":7,"time":1469287439,"description":"Rosemary: The Hidden Kennedy Daughter - Kate Clifford Larson\r\n\r\nThey were the most prominent American family of the 20th century. The daughter they secreted away made all the difference.\r\n\r\nJoe and Rose Kennedy's strikingly beautiful daughter, Rosemary, attended exclusive schools, was presented as a debutante to the queen of England, and traveled the world with her high-spirited sisters. And yet Rosemary was intellectually disabled - a secret fiercely guarded by her powerful and glamorous family.\r\n\r\nMajor new sources - Rose Kennedy's diaries and correspondence, school and doctors' letters, and exclusive family interviews - bring Rosemary to life as a girl adored but left far behind by her competitive siblings. Kate Larson reveals both the sensitive care Rose and Joe gave to Rosemary and then, as the family's standing reached an apex, the often desperate and duplicitous arrangements the Kennedys made to keep her away from home as she became increasingly intractable in her early 20s. Finally, Larson illuminates Joe's decision to have Rosemary lobotomized at age 23 and the family's complicity in keeping the secret.\r\n\r\nRosemary delivers a profoundly moving coda: JFK visited Rosemary for the first time while campaigning in the Midwest; she had been living isolated in a Wisconsin institution for nearly 20 years. Only then did the siblings understand what had happened to Rosemary and bring her home for loving family visits. It was a reckoning that inspired them to direct attention to the plight of the disabled, transforming the lives of millions.\r\n\r\nLength: 7 Hrs and 45 mins\r\n \nhttp://www.audible.com.au/pd/Biographies-Memoirs/Rosemary-Audiobook/B015JUV1W6","torrent":{"xt":"urn:btih:98b6dceb312b9aed995ad1d13325f20a5cc14692","amp;dn":"Rosemary%3A+The+Hidden+Kennedy+Daughter+-+Kate+Clifford+Larson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98b6dceb312b9aed995ad1d13325f20a5cc14692","infoHashBuffer":{"type":"Buffer","data":[152,182,220,235,49,43,154,237,153,90,209,209,51,37,242,10,92,193,70,146]},"announce":[],"urlList":[]}}