{"title":"Single Digits - In Praise of Small Numbers (gnv64)","uid":12359846,"size":40169854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98de467d35cf68d496bffa339f7c39285fa54131&amp;dn=Single+Digits+-+In+Praise+of+Small+Numbers+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"gnv65","files":4,"time":1441518773,"description":"Single Digits - In Praise of Small Numbers\nby Marc Chamberland\nPrinceton University Press | June 2015 | ISBN-10: 0691161143 | True PDF | 240 pages | 38.3 mb\n\nThe numbers one through nine have remarkable mathematical properties and characteristics. For instance, why do eight perfect card shuffles leave a standard deck of cards unchanged? Are there really &quot;six degrees of separation&quot; between all pairs of people? And how can any map need only four colors to ensure that no regions of the same color touch? In Single Digits, Marc Chamberland takes readers on a fascinating exploration of small numbers, from one to nine, looking at their history, applications, and connections to various areas of mathematics, including number theory, geometry, chaos theory, numerical analysis, and mathematical physics.\nEach chapter focuses on a single digit, beginning with easy concepts that become more advanced as the chapter progresses. Chamberland covers vast numerical territory, such as illustrating the ways that the number three connects to chaos theory, an unsolved problem involving Egyptian fractions, the number of guards needed to protect an art gallery, and problematic election results. He considers the role of the number seven in matrix multiplication, the Transylvania lottery, synchronizing signals, and hearing the shape of a drum. Throughout, he introduces readers to an array of puzzles, such as perfect squares, the four hats problem, Strassen multiplication, Catalan's conjecture, and so much more. The book's short sections can be read independently and digested in bite-sized chunks--especially good for learning about the Ham Sandwich Theorem and the Pizza Theorem.\nAppealing to high school and college students, professional mathematicians, and those mesmerized by patterns, this book shows that single digits offer a plethora of possibilities that readers can count on.\n\nAbout the Author &lt;a href=&quot;\nhttp://s3.postimg.org/94i9bv58z/mark.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s3.postimg.org/94i9bv58z/mark.jpg&lt;/a&gt;\nMarc Chamberland is the Myra Steele Professor of Mathematics and Natural Science at Grinnell College. He has published over 40 research articles in diverse areas such as number theory, combinatorics, differential equations, and dynamical systems. Marc is a huge proponent of experimental mathematics, a growing paradigm which uses computers to discover, conjecture and prove mathematical results. He is passionate about communicating the beauty and excitement of mathematics. Besides this book, Marc is also the creator of the youtube channel Tipping Point Math which shows &quot;math as you never imagined&quot;. He has given about 100 talks on research topics, math problems for students, and creativity.\n\nCONTENTS\nPreface xi\nChapter 1 The Number One 1\nChapter 2 The Number Two 24\nChapter 3 The Number Three 69\nChapter 4 The Number Four 111\nChapter 5 The Number Five 132\nChapter 6 The Number Six 156\nChapter 7 The Number Seven 170\nChapter 8 The Number Eight 191\nChapter 9 The Number Nine 205\nChapter 10 Solutions 216\nFurther reading 219\nCredits for illustrations 223\nIndex 225\n\nVideo about this book:\n &lt;a href=&quot;\nhttp://s13.postimg.org/u6vbpfvuv/Single_Digits_In_Praise_of_Small_Numbers.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s13.postimg.org/u6vbpfvuv/Single_Digits_In_Praise_of_Small_Numbers.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:98de467d35cf68d496bffa339f7c39285fa54131","amp;dn":"Single+Digits+-+In+Praise+of+Small+Numbers+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98de467d35cf68d496bffa339f7c39285fa54131","infoHashBuffer":{"type":"Buffer","data":[152,222,70,125,53,207,104,212,150,191,250,51,159,124,57,40,95,165,65,49]},"announce":[],"urlList":[]}}