{"title":"Giles, Giles, and Fripp - The Cheerful Insanity of","uid":4458384,"size":84911394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99282bd9e819e75aab8a50d004eebd827ee595ab&amp;dn=Giles%2C+Giles%2C+and+Fripp+-+The+Cheerful+Insanity+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Alarindris","files":-1,"time":1224586914,"description":"Track listing\n\nThe Saga of Rodney Toady:\n\n   1. Northmeadow (Peter Giles) - 2:29\n   2. Newly-weds (Peter Giles) - 2:07\n   3. One in a Million (Michael Giles)- 2:25\n   4. Call Tomorrow (Peter Giles) - 2:31\n   5. Digging My Lawn (Peter Giles) - 1:50\n   6. Little Children (Robert Fripp) - 2:48\n   7. The Crukster (Michael Giles) - 1:35\n   8. Thursday Morning (Michael Giles) - 2:50\n\nJust George:\n\n   9. How Do They Know (Michael Giles) - 2:14\n   10. Elephant Song (Michael Giles) - 3:15\n   11. The Sun is Shining (Michael Giles) - 3:06\n   12. Suite No. 1 (Robert Fripp) - 5:33\n   13. Erudite Eyes (Robert Fripp) - 5:05\n\nBonus Tracks:\n   \n   14. She is Loaded\n   15. Thursday Morning [Stereo Single Version]\n   16. Under the Sky\n   17. One in a Million [Mono Single Version]\n   18. Newly-weds [Single Version]\n   19. Thursday Morning [Mono Single Version]\n\n\nGiles, Giles and Fripp were a quirky English late sixties band featuring brothers Michael Giles on drums and vocals, Peter Giles on bass guitar and vocals, and rounded out by Robert Fripp on guitar.\n\nThe group formed in their native Bournemouth, Dorset area in 1967 when the Giles brothers sought a singing keyboard player through a newspaper advertisement. Fripp, a non-singing guitarist responded but was hired anyway. Between late 1967 and late 1968 the group lived in Brondesbury Road, London. Throughout their time at the house they made many demo recordings. The early home demos soon led to a record contract with UK Decca's newly formed Deram Records division.\n\nIn April 1968 the group recorded an album The Cheerful Insanity of Giles, Giles and Fripp and two singles, all of which sold poorly. In autumn 1968 the group added Ian McDonald on saxophone, flute and clarinet, and former Fairport Convention vocalist Judy Dyble. Ian McDonald's clarinet overdubs were added to the single version of Thursday Morning. Deram then rejected their next studio sessions including &quot;She Is Loaded&quot; and &quot;Under the Sky&quot;. These later recordings now appear as bonus tracks on the CD reissue of the album. Judy Dyble did not feature in any of the Deram recordings.\n\nThe group continued to record at home; Dyble was only with the group for a short time but did perform with the group on a few songs including &quot;Make It Today&quot; and demo versions of &quot;Under The Sky&quot; and &quot;I Talk to the Wind&quot;. One of the melodies from &quot;Passages of Time&quot; was later re-used for &quot;Peace - An End&quot; on the second King Crimson album, In the Wake of Poseidon. A collection of the home recordings were eventually released in 2002 as The Brondesbury Tapes. The demo recordings were made on a professional 2 track Revox recorder which was specially modified to allow for multiple overdubs. Though the finished recordings are mono many have excellent sound quality and are close to studio sound for the period.\n\nIn late 1968 Peter Giles left the group. Michael Giles, Robert Fripp and Ian McDonald went on to form the first line-up of King Crimson, rounded out by bassist/vocalist Greg Lake and lyricist Peter Sinfield. Peter Giles would go on to appear on the second Crimson album In the Wake of Poseidon in 1970, and more recently joined with 21st Century Schizoid Band. Judy Dyble would go on to join the duo Trader Horne. In 1971, Michael Giles and Ian McDonald released an album together as McDonald and Giles.\n\n\nThe Cheerful Insanity of Giles, Giles and Fripp was the first of only two albums from the 1960's psychedelic rock group Giles, Giles and Fripp.\n\nThe album is divided into two parts, &quot;The Saga of Rodney Toady&quot; and &quot;Just George&quot;. The names of the parts came from the titles of spoken word pieces recited by members of the band and spread out, so that they link the musical works on the A and B sides. Though two-thirds of the band would later form King Crimson, the album, arguably, does not represent the traditional progressive rock style. Rather, it is a mix of various styles (folk, classical, pop, psychedelic rock and sacred music).\n\nThe original ultra-rare U.S. LP version released in 1968 has a completely different cover than the U.K. version. The album has been released on CD at least 4 times. First in Japan with no bonus tracks, then on Deram in the U.S. and U.K. with bonus tracks compiled from singles and previously unreleased recordings. A later Japanese re-issue in a paper sleeve contained the bonus tracks and also a bonus paper sleeve reproduction of the rare U.S. alternate cover. The most recent CD version released by Eclectic Discs has the same bonus tracks as the Deram CD.\n\nAccording to Robert Fripp the album sold only 500 copies. This information came from his royalty statement, but it is very unlikely that this was the total number of original copies sold. Also during 1968 the group recorded what would become The Brondesbury Tapes at their home demo studio, which would not be released until 2001. Peter Giles was replaced on bass by Greg Lake soon after and the band renamed themselves King Crimson, making The Cheerful Insanity... the only album released by the band during its existence.\n","torrent":{"xt":"urn:btih:99282bd9e819e75aab8a50d004eebd827ee595ab","amp;dn":"Giles%2C+Giles%2C+and+Fripp+-+The+Cheerful+Insanity+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99282bd9e819e75aab8a50d004eebd827ee595ab","infoHashBuffer":{"type":"Buffer","data":[153,40,43,217,232,25,231,90,171,138,80,208,4,238,189,130,126,229,149,171]},"announce":[],"urlList":[]}}