{"title":"Vandals, Romans and Berbers - New Perspectives on Late Antiqe No","uid":8816911,"size":33044014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9975c9297ee9eac4d618092c0952a35b41d3695d&amp;dn=Vandals%2C+Romans+and+Berbers+-+New+Perspectives+on+Late+Antiqe+No&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1376608849,"description":"Andrew H. Merrills - Vandals, Romans and Berbers: New Perspectives on Late Antique North Africa\nPublished: 2004-11-30 | ISBN: 0754641457 | PDF | 347 pages | 31 MB\n\nThe birth, growth and decline of the Vandal and Berber Kingdoms in North Africa have often been forgotten in studies of the late Roman and post-Roman West. Although recent archaeological activity has alleviated this situation, the vast and disparate body of written evidence from the region remains comparatively neglected. The present volume attempts to redress this imbalance through an examination of the changing cultural landscape of 5th- and 6th-century North Africa. Many questions, which have been central within other areas of Late Antique studies, are here asked of the North African evidence for the first time. Vandals, Romans and Berbers considers issues of ethnicity, identity and state formation within the Vandal kingdoms and the Berber polities, through new analysis of the textual, epigraphic and archaeological record. It reassesses the varied body of written material that has survived from Africa, and questions its authorship, audience and function, as well as its historical value to the modern scholar. The final section is concerned with the religious changes of the period, and challenges many of the comfortable certainties which have arisen in the consideration of North African Christianity, including the tensions between 'Donatist', Catholic and Arian, and the supposed disappearance of the faith after the Arab conquest. Throughout, attempts are made to assess the relation of Vandal and Berber states to the wider world and the importance of the African evidence to the broader understanding of the post-Roman world.","torrent":{"xt":"urn:btih:9975c9297ee9eac4d618092c0952a35b41d3695d","amp;dn":"Vandals%2C+Romans+and+Berbers+-+New+Perspectives+on+Late+Antiqe+No","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9975c9297ee9eac4d618092c0952a35b41d3695d","infoHashBuffer":{"type":"Buffer","data":[153,117,201,41,126,233,234,196,214,24,9,44,9,82,163,91,65,211,105,93]},"announce":[],"urlList":[]}}