{"title":"Udemy Sleep Hacking Masterclass Sleep Faster And Feel Refreshed","uid":12830232,"size":3497876010,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:999a97085cfd32f7ba244c5b1ab83320ed34c205&amp;dn=Udemy+Sleep+Hacking+Masterclass+Sleep+Faster+And+Feel+Refreshed+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"BarCraft","files":30,"time":1448388883,"description":"\nCourse Description\r\n\r\nLearn powerful hacks to fall asleep faster, improve the quality of your sleep and learn how to effectively nap during the day.\r\n\r\nWake up feeling refreshed and energized and improve your general health by sleeping well.\r\n\r\n    The Circadian Rhythm\r\n    Self hypnosis, meditation and breathing techniques\r\n    Day-time napping\r\n    The psychological process of sleep\r\n    Help for insomniacs\r\n    Lucid dreaming\r\n    Sleep restriction techniques\r\n    Night shift workers\r\n    Jetlags \r\n\r\nSleeping well is the key to general well-being and health\r\n\r\nBeing able to sleep well affects many areas of our lives. It helps us to wake up in the morning feeling refreshed and energized to start the day. Sleeping well is essential to a well functioning immune system and a healthy and positive mind.\r\n\r\nLack of sleep causes many issues: low energy levels during the day, feeling lethargic, being unproductive, getting into a bad mood, not feeling like engaging in social activities and even more serious problems like feeling depressed and all sorts of health issues.\r\n\r\nContent Overview\r\n\r\nThis course is a very comprehensive resource on the topic of sleep hacking. The way you plan your day has a big effect on how well you sleep at night, which is why we start by teaching you how to align your day to the Circadian Rhythm and explain the different factors that affect your sleep, such as light exposure, body temperature and several hormones like serotonin, adenosine and cortisol. We also teach you how you can control these factors so that they will help you sleep well at night.\r\n\r\nWith these topics mastered, the course moves on to more advanced methods to improve the quality of your sleep, such as self hypnosis, meditation, breathing techniques and sleep restriction. A section on step-by-step advice for insomniacs is also provided.\r\n\r\nFinally, we'll also cover how to effectively use naps during the day and how to control your dreams at night.\r\n\r\nWho should take this course?\r\n\r\nWe designed this course for anyone who is struggling to sleep well or seeking to improve the quality of their sleep, either at night or by taking day-time naps. By the end of this course, you’ll be able to fall asleep within minutes and wake up in the morning feeling refreshed and ready to start your day.\r\n\r\nWhat will I get from this course?\r\n\r\n    Fall asleep faster\r\n    Avoid waking up during the night\r\n    Waking up rested\r\n    Feel energetic during the day\r\n    The ability to nap\r\n    Controlling your dreams \r\n\r\nWhat are the requirements?\r\n\r\n    There are no requirements for this course, we just ask that the student comes open-minded and ready to learn\r\n\r\nWhat am I going to get from this course?\r\n\r\n    Over 38 lectures and 4 hours of content!\r\n    Fall asleep faster\r\n    Improve the quality of sleep\r\n    Take naps during the day\r\n    Control their dreams during sleep\r\n\r\nWhat is the target audience?\r\n\r\n    This course is meant for people who are either insomniacs or people who want to improve their sleep to feel more refreshed in the mornings and have more energy during the day time\r\n    The course is also suited for people who want to learn how to use day-time naps","torrent":{"xt":"urn:btih:999a97085cfd32f7ba244c5b1ab83320ed34c205","amp;dn":"Udemy+Sleep+Hacking+Masterclass+Sleep+Faster+And+Feel+Refreshed+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"999a97085cfd32f7ba244c5b1ab83320ed34c205","infoHashBuffer":{"type":"Buffer","data":[153,154,151,8,92,253,50,247,186,36,76,91,26,184,51,32,237,52,194,5]},"announce":[],"urlList":[]}}