{"title":"Super Eurobeat 050-099 ALL ALBUMS  (ONCE IN A LIFETIME TORRENT!)","uid":3391330,"size":5223728432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99b4c3f0682ee584f5b851253d6a163a7513cb6e&amp;dn=Super+Eurobeat+050-099+ALL+ALBUMS++%28ONCE+IN+A+LIFETIME+TORRENT%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ninjasource","files":1414,"time":1128285991,"description":"All Super Eurobeat albums that exists to this day. Collected from all over the\nworld for a 5 years period of time. It has taken alot of time to collect and\nrename the mp3s correctly. Most had broken filenames (and no id3 tags) in the\nbegining of my collecting.\n\nEurobeat has evolved from Italo Disco and it sounds similar to Eurodance,\nbut faster and if possible happier with really crazy songtexts. In short.\nFor a good eurobeat history page see: http://www.eurobeat-prime.com/history.php\n\nAvex Trax that owns the copyright for these albums are NOT interested to\nmarket eurobeat outside japan. Like most record companys they dont get that\npeople will be able to buy mp3s online (not DRM wma!). Eurobeat is mostly\nunheard of outside japan. You can only buy eurobeat inside japan (however\nsome online shops ships to the whole world, but its VERY expensive). It\nprobably wouldnt work to market eurobeat in USA aka Rap/Hiphop land but I\nbelive it would work in Europe.\n\nProbably will this release limit the possibility for me to trade albums with\nother pople :( The very few that happend to have something that I dont. On\nthe other hand, I help to spread eurobeat to the world and makes alot of people\nhappy, which is good :) Enjoy!\n\nMy eurobeat page: http://www.eurobeat.se/\nIf you have a album that I dont, then please contact me.\n\nSeeded from 1 Gbit/s. However, due to the size I can not promise to seed\nthis torrent forever. And I wont make a new if there is no seeds. So please\nseed after your download.\n\nSome of you will not be able to connect directly to the seeding computer, in\nthis case, its normal. You will get your data from other torrent peers instead,\nthat can connect directly to it. Most of you wouldnt understand if I try to\nexplain why it is like this, so I dont.\n\nPS. It was splitted into four torrents because TPB doesnt accept more than\n    1 MB torrents (or slightly less?). I dont have time to wait for it to \n    be fixed so I gave up and did the split.\n\n// jenka, 2005-10-02.\n","torrent":{"xt":"urn:btih:99b4c3f0682ee584f5b851253d6a163a7513cb6e","amp;dn":"Super+Eurobeat+050-099+ALL+ALBUMS++%28ONCE+IN+A+LIFETIME+TORRENT%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b4c3f0682ee584f5b851253d6a163a7513cb6e","infoHashBuffer":{"type":"Buffer","data":[153,180,195,240,104,46,229,132,245,184,81,37,61,106,22,58,117,19,203,110]},"announce":[],"urlList":[]}}