{"title":"TTC - Understanding Linguistics: The Science of Language","uid":4547212,"size":1070885755,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9a64886bffb0d0bd7ab7dcb1cf9fbb1fcc2990b4&amp;dn=TTC+-+Understanding+Linguistics%3A+The+Science+of+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"BhangWalla","files":149,"time":1228172956,"description":"he Teaching Company\n\n\nTTC - Understanding Linguistics: The Science of Language\n\nCourse No. 2270\n\n36 lectures, 30 minutes/lecture\n\nTaught by John McWhorter\nManhattan Institute\nPh.D., Stanford University &lt;a href=&quot;\nhttp://www.teach12.com/ttcx/CourseDescLong2.aspx?cid=2270&amp;pc=Social%20Sciences&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.teach12.com/ttcx/CourseDescLong2.aspx?cid=2270&amp;pc=Social%20Sciences&lt;/a&gt; \n\nSummery:\n\nWe all use language every day of our lives. Language, regardless of the particular dialect spoken, is the tool we use to express our wants, our needs, and our feelings.\n\nRecently, many experts who study language have become convinced by an idea about this remarkable human trait that was, only a few decades ago, utterly revolutionary. These experts believe that the capacity for spoken language and the rules for its structure are not cultural but universal - a set of rules shared by humans in every culture and that even may be hardwired into our brains. Moreover, these rules apply regardless of which of the world's 6,000 languages are being spoken.\n\nBut what are these rules? How do they work? And how can knowing them enhance your experience of the world?\n\nThe 36 lectures of Understanding Linguistics: The Science of Language - taught by acclaimed linguist, author, and Professor John McWhorter from the Manhattan Institute - are your opportunity to take a revealing journey through the fascinating terrain of linguistics. You focus on the scientific aspects of human language that were left out of any classes you may have taken in English or a foreign language, and you emerge from your journey with a newfound appreciation of the mysterious machinery built into all of us - an appreciation likely to surface time and again in your everyday life.\n\n\n-----------------------\n\nGain Insights into How We Speak\n\n&quot;When we talk about language, we talk about the way people talk,&quot; says Professor McWhorter. Just as linguistics opens windows into our past, it can also reveal more about the world we live in today.\n\nIt was once possible, perhaps even likely, to go through daily life without encountering someone who spoke a different language. But in today's increasingly diverse world, where you can encounter different languages in different settings and where you might even speak multiple languages yourself, understanding how languages operate is increasingly important and can be extraordinarily rewarding.\n\nIn Understanding Linguistics, you explore the vast field of scientific linguistics and discover why this burgeoning field is becoming increasingly important in your everyday life:\n\n    * Glean the real meanings hidden in everyday conversations.\n    * Understand the process by which young children learn to speak.\n    * Comprehend that changes in language (including new words, constructions, or usages) are a normal and inevitable part of the language's evolution.\n    * Grasp the complex interaction of language, brain structure, and the physiology of the human mouth.\n    * See how the science of language can reveal nuances of human history beyond the reach of any other discipline.\n\nFrom Building Blocks to Social Tools\n\nProfessor McWhorter explains and illustrates the critical elements and purposes of language, from its most basic building blocks to its uses as a nuanced social tool:\n\n    * The basic sounds from which human language is built and why the English alphabet, with only 26 letters, is inadequate to deal with the 44 sounds of our own language - a dilemma solved by the International Phonetic Alphabet\n    * How these sounds are combined into words and words into sentences, and how rules of structure hardwired into everyone's brain work to ensure that those sentences have meaning within whatever language is being spoken\n    * How children learn to acquire their first language spontaneously but why learning a second language can be so difficult\n    * Why language, from the level of basic sounds to the customs of usage, inevitably changes over time\n    * How writing systems, which exist for only about 200 of the world's approximately 6,000 languages, evolved\n\nMeet Pioneering Linguists\n\nUnderstanding Linguistics also introduces you to many of the individuals who have most influenced our scientific understanding of language. The business of linguists isn't policing language, correcting your grammar, or acting as a translator; instead, linguists devote themselves to the scientific study of human language. These are some of the many pioneers of the field whom you meet in this course:\n\n    * Jacob Grimm: Best known to the general public for the often-dark folk tales he collected with his brother, Grimm demonstrated the systematic and predictable way the sounds of a language evolve, offering linguists a way to trace current languages back to their roots.\n    * Noam Chomsky: Also a political commentator and activist, Chomsky founded the influential school of syntactic analysis - the study of how words are ordered into sentences - and developed the now widely accepted hypothesis of a hardwired human capacity for language.\n    * Edward Sapir: Sapir first put forth the seed of what was ultimately to become one of linguistics' most enduring theories: that languages, to some extent, reflect the thought patterns and cultural outlooks of their speakers.\n    * Benjamin Whorf: Building on the ideas of Sapir, Whorf developed what became known as the Sapir-Whorf hypothesis: the idea that people's languages actually channel the way in which they perceive the world.\n    * Ferdinand de Saussure: Straddling the 19th and 20th centuries, de Saussure laid the foundation for modern linguistics analysis with his idea that language could be analyzed as it exists in the moment and not just from a historical perspective.\n    * William Labov: One of the first linguists to examine how race, class, and gender influence language, Labov, in his signature study The Social Stratification of English in New York City, inaugurated the now-vigorous subfield of sociolinguistics.\n\nAn Entertaining, Captivating Instructor\n\nProfessor McWhorter, a prolific writer and frequent media commentator, makes the process of understanding linguistics intensely rewarding.\n\nSupplementing his own considerable teaching skills with recorded materials and exclusively developed graphics designed to make even complex ideas immediately graspable, he takes you inside your own mind and into cultures and social situations around the world to explain the surprisingly orderly and hierarchical levels of human language.\n\nIn exploring the ideas and people that make this course both intellectually rigorous and readily accessible, Professor McWhorter is tirelessly entertaining and as captivated by his subject as he wants you to be. His use of humor, personal anecdotes, and unexpected forays into contemporary culture make Understanding Linguistics a course you'll savor long after you've finished the final lecture.\n\nUndoubtedly, you'll find its insights surfacing whenever you experience the language around you.\n\n\nCourse Lecture Titles:\n\n1. What Is Linguistics?\n2. The Sounds of Language - Consonants\n3. The Other Sounds - Vowels\n4. In the Head versus On the Lips\n5. How to Make a Word\n6. The Chomskyan Revolution\n7. Deep Structure and Surface Structure\n8. The On-Off Switches of Grammar\n9. Shades of Meaning and Semantic Roles\n10. From Sentence to Storytelling\n11. Language on Its Way to Becoming a New One\n12. Recovering Languages of the Past\n13. Where Grammar Comes From\n14. Language Change from Old English to Now\n15. What Is an Impossible Language?\n16. How Children Learn to Speak\n17. How We Learn Languages as Adults\n18. How You Talk and How They Talk\n19. How Class Defines Speech\n20. Speaking Differently, Changing the Language\n21. Language and Gender\n22. Languages Sharing the World - Bilingualism\n23. Languages Sharing a Sentence - Code-Switching\n24. The Rules of Conversation\n25. What Is This Thing Called Language?\n26. Speech as Action\n27. Uses of Talk from Culture to Culture\n28. Does Language Channel Thought? The Evidence\n29. Does Language Channel Thought? New Findings\n30. Is Language Going to the Dogs?\n31. Why Languages Are Never Perfect\n32. The Evolution of Writing\n33. Writing Systems\n34. Doing Linguistics - With a Head Start\n35. Doing Linguistics - From the Ground Up\n36. The Evolution of Language\n\nGuidebook Included\n\nMore related material: \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9a64886bffb0d0bd7ab7dcb1cf9fbb1fcc2990b4","amp;dn":"TTC+-+Understanding+Linguistics%3A+The+Science+of+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a64886bffb0d0bd7ab7dcb1cf9fbb1fcc2990b4","infoHashBuffer":{"type":"Buffer","data":[154,100,136,107,255,176,208,189,122,183,220,177,207,159,187,31,204,41,144,180]},"announce":[],"urlList":[]}}