{"title":"MSC Patran 2013 (64bit)","uid":9604960,"size":1676399063,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a8999215f619dcc2f896865b943d65f94fe3cd1&amp;dn=MSC+Patran+2013+%2864bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"wimpie999","files":3,"time":1392205245,"description":"MSC Software Corporation, the leader in multidiscipline simulation solutions that accelerate product innovation, announced the release Patran 2013 , its most widely used pre/post-processing software for Finite Element Analysis (FEA).\n\nPatran 2013 delivers several ease of use enhancements for structural analysis and durability applications in aerospace, automotive, and other non-transportation industries. Some of the new capabilities in this release include:\n\n- Support for MSC Nastran 2013.1\nPatran now supports the most recent version of MSC Nastran available at release time which is MSC Nastran 2013.1. This includes post-processing MASTER/DBALL, XDB, and OP2 results files generated by MSC Nastran 2013.1.\n- MSC Nastran OP2 New (PARAM,POST,1) Format\nPatran 2013 provides enhanced post-processing support for MSC Nastran by supporting the new OP2 (obtained using PARAM,POST,1) format. In addition to supporting Direct Results Access (DRA) attachment of the results via Patran, the file browser menus have been modified to the correct defaults which allow for OP2 import or DRA attachment. The new OP2 format supports the latest SOL400 results quantities including contact results, Nastran embedded fatigue results, and user defined service and subroutine results.\n- Patran Support for MSC Nastran Embedded Fatigue (NEF)\nPatran 2013 provides support for the MSC Nastran Embedded Fatigue (NEF) capabilities including fatigue materials, load event manipulation, and post-processing, which is provided for using standard MASTER/DBALL attachments, or through the new OP2 file.\n- Patran Support for MSC Nastran Contact Pair Modeling\nMSC Patran 2013 supports the new MSC Nastran 2013.1 contact pair user interface by providing a new Contact Pair Load and Boundary Condition (LBC) graphical user interface. The interface allows users to create contact pairs using individual contact property sets, or re-use existing interface definitions by referencing existing property sets. This capability, along with Patran's global property editing capability, provide a powerful, scalable UI that is suited equally well to creating both individual contact pairs, and large numbers of complex contact pairs, using common properties. Along with the new contact pair user interface is a set of tools that allow users to automatically create contact bodies and contact pairs based on user-defined criteria.\n- Patran Support for MSC Nastran User Defined Services / Subroutines (UDS)\nThis release enhances the capabilities of user defined materials. The user could define state variables for user material subroutines. More arguments are added in the UMAT and UCOHES subroutines for passing internal data, such as element Gaussian point volume, procedure phase and convergence flag. Within material user subroutines, the information of element and node as well analysis data can be obtained using utility functions. A new SCA interface is available for user to get notification from MSC Nastran when the analyzing procedure runs into the beginning and end of load case and increments. The output support of user state variables makes post-processing of state variables possible.","torrent":{"xt":"urn:btih:9a8999215f619dcc2f896865b943d65f94fe3cd1","amp;dn":"MSC+Patran+2013+%2864bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a8999215f619dcc2f896865b943d65f94fe3cd1","infoHashBuffer":{"type":"Buffer","data":[154,137,153,33,95,97,157,204,47,137,104,101,185,67,214,95,148,254,60,209]},"announce":[],"urlList":[]}}