{"title":"French Film Collection(Film 40) BAISE-MOI (2000)","uid":6048164,"size":734251692,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b1ad4188d7986dd6c59126818349ef564b77365&amp;dn=French+Film+Collection%28Film+40%29+BAISE-MOI+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"forcefox","files":-1,"time":1292632218,"description":"ENGLISH HARDCODED SUBTITLES\n\nBaise Moi (2000)\n\nBaise Moi (Fuck Me) .\nYear: 2000\nDirector: Virginie Despentes, Coralie Trinh Thi\nStars: Karin Bach, Raffaela Anderson, Karen Lancaume, Delphine McCarty\nGenre: Drama, Sex\n\nReview: A certain line of dialogue from The Wild One springs to mind when considering this savage, sexually explicit film.\n\nThe funny games really start when two women meet up on the road to ruin after murdering their nearest and not-so dearest (brother and flat mate). Embarking on a blood and cum-splattered partnership that puts Mickey and Mallory Knox firmly in the shade, Nadine (Karin Bach) and Manu (Raffaela Anderson) conduct their business on a revenge/cash/kicks basis, egged on by two directors who seem only too happy to throw bullets towards those moronic 'defenders of public decency' who seek to dictate our viewing. Well, screw political correctness because Baise Moi is a powerful, beautifully constructed film that demands more than a single viewing.\n\nMade as a ferocious indictment on the French porn industry (and a good dozen other issues), Virginie Despentes and Coralie Trinh Thi do much more than push the envelope; in fact, they've screwed it up and launched it, with several scenes that shock to the core. Naturally, the usual suspects in the UK press (Hi Chris and Alex) have kicked up a storm, but do they have a point? In a word, no. The rape scene is, without a doubt, the most nauseating feature footage I've ever witnessed and that's precisely why the BBFC were correct in granting a certificate, with one cut lasting just a couple of seconds (though I would question the reasoning behind this brief omission): the scene in question is NOT erotic. It disgusts and this is the sort of reaction this vile crime should provoke from the public, as opposed to the titillating tabloid 'journalese' found in certain papers. Baise Moi is a highly intelligent film, with nifty editing, a terrific soundtrack and fine performances from its two female leads. Here, Karin Bach and Raffaela Anderson are so good that even if you're not rooting for them, you may well hope they die together, such is the strength of their bond, formed in adversity.\n\nPotential viewers should again be warned; this film plays hardball with your head like no other, using machine gun etiquette that will stun even the most jaded seen-it-all-before cinefile. Whether or not you agree with the message, or even doubt there is one, Baise Moi is a good few cuts above the usual 'let's rock, let's shock' movies we're always being warned about. Oh, and for the uninitiated, allow me to clear one thing up: the infamous 'bullet in the anus' scene? Trust me, it's the least of your worries.\n\naka: Rape Me ","torrent":{"xt":"urn:btih:9b1ad4188d7986dd6c59126818349ef564b77365","amp;dn":"French+Film+Collection%28Film+40%29+BAISE-MOI+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1ad4188d7986dd6c59126818349ef564b77365","infoHashBuffer":{"type":"Buffer","data":[155,26,212,24,141,121,134,221,108,89,18,104,24,52,158,245,100,183,115,101]},"announce":[],"urlList":[]}}