{"title":"Mastering Microsoft Lync Server 2013 - Keith Hanna &amp; Nathan","uid":8729860,"size":41646916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b48e1ebed055729e89e68c602f10f7cba2e1e29&amp;dn=Mastering+Microsoft+Lync+Server+2013+-+Keith+Hanna+%26amp%3B+Nathan+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374572541,"description":"image\n\n\nOverview\n\nEverything you need to know to get Lync 2013 up and running smoothly\n\nAs a Unified Communications (UC) technology, Lync allows you to keep track of your contacts' availability so you can communicate with anyone, anywhere, and at any time. With this hands-on book, you will learn how to administer the newest and most robust version of Lync Server in order to send an IM; start or join an audio, video, or web conference; or make a phone call through a familiar interface. Packed with real-world exercises throughout, this unique resource encourages you to learn from the best practices and deployments of others so that you can benefit from their experiences.\n\nWalks you through designing and managing enterprise instant messaging and conferencing solutions\nDetails how to configure voicemail, enterprise voice, dual-forking, and VoIP\nTeaches you how to automate management tasks\nShares invaluable advice for monitoring, diagnosing, and troubleshooting problems\nHelps you understand SIP and authentication technologies\n\nWith Mastering Microsoft Lync Server 2013, you'll gain the skills you need to effectively deploy Lync Server 2013 and be on your way to gaining all the benefits UC has to offer.\n\n\n\nProduct Details\n\nISBN-13: 9781118521328\nPublisher: Wiley, John &amp; Sons, Incorporated\nPublication date: 6/4/2013\nEdition number: 1\nPages: 888\n\n\nMeet the Author\n\nKeith Hanna, Microsoft Certified Master at Microsoft Office Communications Server (OCS), is a Service Delivery Specialist at Microsoft U.K. focused on partner-led support offerings for Lync. He has been working with OCS and Lync since before they were launched, helping to design and deploy some of the largest worldwide installations in use today. He also helps develop content for the Microsoft Lync Ignite training series and has contributed to the Lync Resource Kit. Nathan Winters is a Technical Solution Professional at Microsoft U.K. He has worked with some of the U.K.'s largest companies. He is a four-time MVP for Exchange Server, a speaker at events in both the U.S. and the U.K., and a published writer in leading industry resources such as Windows IT Pro and the MSExchange.org website. He is also the author of Microsoft Exchange Server 2013: Design, Deploy and Deliver.","torrent":{"xt":"urn:btih:9b48e1ebed055729e89e68c602f10f7cba2e1e29","amp;dn":"Mastering+Microsoft+Lync+Server+2013+-+Keith+Hanna+%26amp%3B+Nathan+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b48e1ebed055729e89e68c602f10f7cba2e1e29","infoHashBuffer":{"type":"Buffer","data":[155,72,225,235,237,5,87,41,232,158,104,198,2,241,15,124,186,46,30,41]},"announce":[],"urlList":[]}}