{"title":"Neil Young &amp; Crazy Horse - Psychedelic Pill (2012) [320]","uid":7789926,"size":213763107,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b521a0ee61b9c7c6fba25f3f5478eea8b63a019&amp;dn=Neil+Young+%26amp%3B+Crazy+Horse+-+Psychedelic+Pill+%282012%29+%5B320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1351994195,"description":"\n\n\nNeil Young &amp; Crazy Horse\nPsychedelic Pill (2012)\n\n\n\n\nAs it turns out, the lumbering Americana was merely an amateurish rehearsal for the reuniting Neil Young &amp; Crazy Horse. Just a handful of months after that collection of schoolhouse folk tunes, the band released the mammoth Psychedelic Pill, Neil's first-ever studio double-LP. It's not just the album itself that sprawls: Young rides Crazy Horse through long, long songs, kicking off the proceedings with the 27-minute &quot;Driftin' Back,&quot; a song that makes the nearly 17-minute &quot;Ramada Inn&quot; and 16:30 &quot;Walk Like a Giant&quot; look comparatively svelte. No matter how many three-minute palate cleansers surround these monoliths, there's no getting around the fact that these overdriven, overlong jams are a way of separating the men from the boys, leaving behind only those with the strength to stomach such a large, undiluted dose of the Horse. Fortunately, the band is sounding much more limber than they did on Americana, where it seemed like the group were picking up their instruments for the first time in a decade, so they can keep things moderately enchanting as the rock rolls out with no end in sight. That heavy, churning, perpetual motion is what's unique about Young &amp; Crazy Horse, and Psychedelic Pill provides an abundance of it, but this feels different than their skronk-fests of the past, lacking the ballast of Ragged Glory, the sinew of Rust Never Sleeps, or the crackling, kinetic energy of Arc Weld or Live Rust. Instead, this is the sound of a veteran band settling into their familiar frayed clothes, doing precisely what they do best and nothing more. An air of tempered nostalgia permeates the album, evident not only in the unapologetic '70s grind of the band but in Young's lyrics, which fuzzily rhapsodize about &quot;Drifting Back&quot; and the first time he heard &quot;Like a Rolling Stone.&quot; Unlike Dylan -- or many other of his Baby Boomer peers -- Young sounds like a defiant old coot pining for his past, which makes Psychedelic Pill yet another oddity in a catalog filled with them: it's noise rock as comfort food. \n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\nAudio-Info:\n\n\nDisc 1\n\n01.Driftin' Back\n02.Psychedelic Pill\n03.Ramada Inn\n04.Born In Ontario\n\n\nDisc 2\n\n01.Twisted Road\n02.She's Always Dancing\n03.For The Love Of Man\n04.Walk Like A Giant\n05.Psychedelic Pill (Alternate Take) (Bonus Track)\n\n\n\n\n\n\n\n\n\n                            ****Thanks For Seeding!****\n                                     \n                                   ***Enjoy!***\n\n\n","torrent":{"xt":"urn:btih:9b521a0ee61b9c7c6fba25f3f5478eea8b63a019","amp;dn":"Neil+Young+%26amp%3B+Crazy+Horse+-+Psychedelic+Pill+%282012%29+%5B320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b521a0ee61b9c7c6fba25f3f5478eea8b63a019","infoHashBuffer":{"type":"Buffer","data":[155,82,26,14,230,27,156,124,111,186,37,243,245,71,142,234,139,99,160,25]},"announce":[],"urlList":[]}}