{"title":"The Philosophy of Seyyed Hossein Nasr (pdf)","uid":8589998,"size":11048205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b7219e2d3685b3ff40905eafb0c77ee609761c4&amp;dn=The+Philosophy+of+Seyyed+Hossein+Nasr+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371614555,"description":"Lewis Edwin Hahn et al, eds. - The Philosophy of Seyyed Hossein Nasr (Open Court, 2001). 1001 pages.\n\nOlder scan with some minor improvements. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThis book looks at one of today's greatest thinkers and his influential writings on religion, science, history, and Persian mysticism. The text includes 33 critical essays by contemporary scholars and Nasr's responses to each of them.\n\nA few of the authors: Huston Smith, Wolfgang Smith, David Burrell, William Chittick, Armind Sharma, et al.\n\n\nfrom wikipedia:\n\nSeyyed Hossein Nasr (born April 7, 1933) is an Iranian University Professor of Islamic studies at George Washington University, and a prominent Islamic philosopher. He is the author of many scholarly books and articles.\n\nNasr is a Muslim Persian philosopher and renowned scholar of comparative religion, a lifelong student and follower of Frithjof Schuon, and writes in the fields of Islamic esoterism, Sufism, philosophy of science, and metaphysics.\n\nProfessor Nasr speaks and writes based on the doctrine and the viewpoints of the perennial philosophy on subjects such as philosophy, religion, spirituality, music, art, architecture, science, literature, civilizational dialogues, and the natural environment. He also wrote two books of poetry (namely Poems of the Way and The Pilgrimage of Life and the Wisdom of Rumi), and has been even described as a 'polymath'.","torrent":{"xt":"urn:btih:9b7219e2d3685b3ff40905eafb0c77ee609761c4","amp;dn":"The+Philosophy+of+Seyyed+Hossein+Nasr+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7219e2d3685b3ff40905eafb0c77ee609761c4","infoHashBuffer":{"type":"Buffer","data":[155,114,25,226,211,104,91,63,244,9,5,234,251,12,119,238,96,151,97,196]},"announce":[],"urlList":[]}}