{"title":"Dan Brown - The Da Vinci Code [2003] [EPUB-MOBI-PDF]","uid":8100384,"size":2903090,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b7bda15b7273f0cf1f1bcb609ef306bea353d65&amp;dn=Dan+Brown+-+The+Da+Vinci+Code+%5B2003%5D+%5BEPUB-MOBI-PDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":null,"files":-1,"time":1359953543,"description":"This torrent contains the novel - &quot;The Da-Vinci Code&quot; written by Dan Brown, in EPUB, MOBI, and PDF formats, and also includes cover art. If you appriciate being able to find this book in the top 3 EBOOK formats, please be sure to download the entire torrent and seed for as long as you can!\n\n~:: DETAILS ::~\n\n:: NAME ::\nThe Da Vinci Code\n:: COUNTRY ::\nimage USA\nimage UK\n:: CATEGORY ::\nMystery, Thriller\n:: WRITTEN BY ::\nDan Brown\n:: LAUNGUAGE ::\nEnglish\n:: FORMAT ::\nEPUB, MOBI, and PDF\n:: PUBLISHED ::\n2003\n:: DESCRIPTION ::\nThe Da Vinci Code is a 2003 mystery-detective novel written by Dan Brown. It follows symbologist Robert Langdon and Sophie Neveu as they investigate a murder in Paris's Louvre Museum and discover a battle between the Priory of Sion and Opus Dei over the possibility of Jesus having been married to Mary Magdalene. The title of the novel refers to, among other things, the fact that the murder victim is found in the Grand Gallery of the Louvre, naked and posed like Leonardo da Vinci's famous drawing, the Vitruvian Man, with a cryptic message written beside his body and a pentacle drawn on his chest in his own blood.\n\nThe novel is part of the exploration of alternative religious history, the central plot point of which is that the Merovingian kings of France were descended from the bloodline of Jesus Christ and Mary Magdalene, ideas derived from Clive Prince's The Templar Revelation (1997) and books by Margaret Starbird. Chapter 60 of the book also refers to another book, The Holy Blood and the Holy Grail (1982) though Dan Brown has stated that it was not used as research material.\n\nThe book has provoked a popular interest in speculation concerning the Holy Grail legend and Magdalene's role in the history of Christianity. The book has been extensively denounced by many Christian denominations as an attack on the Roman Catholic Church. It has also been consistently criticized for its historical and scientific inaccuracies. The novel nonetheless became a worldwide bestseller[1] that sold 80 million copies as of 2009[2] and has been translated into 44 languages. Combining the detective, thriller and conspiracy fiction genres, it is Brown's second novel to include the character Robert Langdon, the first being his 2000 novel Angels &amp; Demons. In November 2004 Random House published a Special Illustrated Edition with 160 illustrations. In 2006 a film adaptation was released by Sony's Columbia Pictures.\n\nIf you enjoyed this torrent, please return the favor and seed for as long as you can!!","torrent":{"xt":"urn:btih:9b7bda15b7273f0cf1f1bcb609ef306bea353d65","amp;dn":"Dan+Brown+-+The+Da+Vinci+Code+%5B2003%5D+%5BEPUB-MOBI-PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7bda15b7273f0cf1f1bcb609ef306bea353d65","infoHashBuffer":{"type":"Buffer","data":[155,123,218,21,183,39,63,12,241,241,188,182,9,239,48,107,234,53,61,101]},"announce":[],"urlList":[]}}