{"title":"Hitler's Willing Executioners: Ordinary Germans and the Holocaus","uid":9035389,"size":6501260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b7bdc3c4c32925326accb28190e34d738fe2fab&amp;dn=Hitler%27s+Willing+Executioners%3A+Ordinary+Germans+and+the+Holocaus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1381453060,"description":"Hitler's Willing Executioners: Ordinary Germans and the Holocaust\n\n\nThis groundbreaking international bestseller lays to rest many myths about the Holocaust: that Germans were ignorant of the mass destruction of Jews, that the killers were all SS men, and that those who slaughtered Jews did so reluctantly. Hitler's Willing Executioners provides conclusive evidence that the extermination of European Jewry engaged the energies and enthusiasm of tens of thousands of ordinary Germans. Goldhagen reconstructs the climate of &quot;eliminationist anti-Semitism&quot; that made Hitler's pursuit of his genocidal goals possible and the radical persecution of the Jews during the 1930s popular. Drawing on a wealth of unused archival materials, principally the testimony of the killers themselves, Goldhagen takes us into the killing fields where Germans voluntarily hunted Jews like animals, tortured them wantonly, and then posed cheerfully for snapshots with their victims. From mobile killing units, to the camps, to the death marches, Goldhagen shows how ordinary Germans, nurtured in a society where Jews were seen as unalterable evil and dangerous, willingly followed their beliefs to their logical conclusion.\n\nepub","torrent":{"xt":"urn:btih:9b7bdc3c4c32925326accb28190e34d738fe2fab","amp;dn":"Hitler%27s+Willing+Executioners%3A+Ordinary+Germans+and+the+Holocaus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7bdc3c4c32925326accb28190e34d738fe2fab","infoHashBuffer":{"type":"Buffer","data":[155,123,220,60,76,50,146,83,38,172,203,40,25,14,52,215,56,254,47,171]},"announce":[],"urlList":[]}}