{"title":"Accident (2012) - Tiny.rip - HEVC - x265.AAC - 500MB - [DDR]","uid":15586591,"size":522962110,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9bb64bf611c800fc0310c33945e1eec22a1490d1&amp;dn=Accident+%282012%29+-+Tiny.rip+-+HEVC+-+x265.AAC+-+500MB+-+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"SaM","files":1,"time":1471469113,"description":"Presenting a DDR TinyRip Upload\r\n\r\n\r\nAccident -(2012)\r\n(A film by Nandita Ray and Shiboprosad Mukhopadhyay)\r\n\r\nBangla - DVD.Rip - 640x256 (2.5:1)- 499 MB- x.265.AAC - 2 Hrs:10 Min\r\n\r\nA HIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/wclC \nhttp://extraimago.com/image/wclB \nhttp://extraimago.com/image/wcl4 \nhttp://extraimago.com/image/wcle \nhttp://extraimago.com/image/wclZ \nhttp://extraimago.com/image/wclK \nhttp://extraimago.com/image/wclJ \nhttp://extraimago.com/image/wcl0 \nhttp://extraimago.com/image/wclz \nhttp://extraimago.com/image/wcl9\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/wclM\r\n\r\nSynopsis:\r\nArko was a cricketer. He was an outstanding bowler and had also played for Bengal in the Ranjis. Unfortunately, a torn ligament and a blotched-up operation put an end to his budding career. Frustration and depression continuously bogged him down and he tried his best to seek an alternate career; but in vain- nothing seemed to interest him. Fortunately, for him, he had married early. His wife Riya worked in a call centre – after all somebody had to keep the family fires burning. They had a 4 yr old son Babai, who was the apple of his fatherâ™s eyes. In fact, caring for Babai took Arkoâ™s entire time and he was totally devoted to his son. Arko took care of the domestic end while his wife contributed to the earnings in the family.\r\n\r\nOne early morning, while dropping his son to school, an accident occurs. A private bus could not apply the brakes on time at a road crossing and runs over little Babai. Arko is flung aside. He survives; but Babai does not. Arkoâ™s life is shattered. Kartick, the driver of the private bus, is arrested and the bus is seized. The Insurance Company enters the scene. Investigations begin. Who was really at fault? Why did the bus not brake on time? Was it a mechanical fault? An inherent problem that the automobile company had deliberately ignored? Was the bus driver only a scape-goat? As the investigations deepen, many unpleasant realities come to the fore and Arko together with Kartick, the driver and the Insurance agent, decide to take up the cudgels and confront the corporate giants as well as the Establishment. The outcome of this brave and risky move forms the basis of this story. (source: wikipedia)\r\n\r\n\r\n\r\nComments:\r\nYou can viryually predict the contents of a Nandita Ray - Shiboprosad Mukhopadhyay film these days. They will take up a socially relevant theme and create a emotionally charged film around it. This film is no exception. It takes up the case of a bus accident in which a young boy loses his life and shows us how greed and indifference causes fleet owners to compromise on safety. Unfortunately, the film is predictable at every step, even if the protagonists make an unlikely combination.\r\nEven the acting and mannerisms are predictable. Rudranil as the bus driver does well, but the rest are as you would expect them to be. The redeeming feature is that none of them are bad - they are just a bit predictable. The other redeeming feature is that Nandita Ray and Shiboprosad Mukherjee are good story tellers and so keep yopu absorbed in the film.\r\nOverall a good film to watch.\r\n\r\nUploader's Notes:\r\n\r\nA SD-TV rip of this movie was uploaded by Karanjai1111 earlier. As far as we know this is the first DVD rip of this movie. It comes from a terribly authored DVD from RP Techvision. The frame size is non standard, there are no subtitles, the colours are all awry and there is an awful yellow tinge that permeates the DVD. It took quite a bit of exercise to bring the rip to you in the form you see.\r\n\r\nThis is a DDR TinyRip encode. It uses x.265 10-bit encoding for higher compressibility and Compressed 128 Kbps audio to compress the original DVD into a 500 MB rip. The Quality, as you can see from the screen shots is equivalent or better than the DVD. The only compromises are the slightly smaller frame size and the compressed audio. DDR TinyRips are meant for those downloaders who want conserve bandwidth and yet enjoy high quality rips.\r\nA 720p HEVC version will follow.\r\nBe aware that this rip (and all HEVC rips) will not play on many standalone players. You need a compatible standalone video player. You can of course stream it to the large screen TV using a streaming device. On your PC please be sure to use the latest version of video players (VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0) will work. Earlier versions may not).\r\n\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt3602460/","torrent":{"xt":"urn:btih:9bb64bf611c800fc0310c33945e1eec22a1490d1","amp;dn":"Accident+%282012%29+-+Tiny.rip+-+HEVC+-+x265.AAC+-+500MB+-+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bb64bf611c800fc0310c33945e1eec22a1490d1","infoHashBuffer":{"type":"Buffer","data":[155,182,75,246,17,200,0,252,3,16,195,57,69,225,238,194,42,20,144,209]},"announce":[],"urlList":[]}}