{"title":"Jessica Smith - 10 Minute Solution: Belly, Butt &amp; Thigh Blas","uid":8814909,"size":651881964,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9c2e12e27a82f70759ed784ced219c30b51e739d&amp;dn=Jessica+Smith+-+10+Minute+Solution%3A+Belly%2C+Butt+%26amp%3B+Thigh+Blas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"acer47x","files":-1,"time":1376556411,"description":"Year : 2009 \nCountry : USA \nGenre : fitness \nDuration : 00:52:01 \nLanguage : English \n\nDescription : \n\nNo time to exercise? We have the solution for you-the 10 Minute Solution! Everyone can find at least ten minutes in their day, and we've developed 5 different 10-minute workouts that will bring out the best of your belly, butt and thighs using the sculpting loop. Compact and ultra-efficient, the 10-minute workouts fit into even the busiest of schedules. Split them into 5 separate workouts, mix and Match your favorites to fit your schedule each Day, or do Them All together for one Incredible, Transforming-body workout! Better Booty Camp Just 10 minutes with the loop and these targeted exercises are all you need to build a better booty. Your buns Will feel Lifted, Tighter, and more toned after just one workout. Strong &amp; Slim Thighs Develop strong and lean legs by using the Unique resistance of the loop with this mix of balance, strength, and Pilates-based moves to Sculpt your muscles slim. Trim &amp; Toned Tummy AB Take your workout to the next Level with the Sculpting loop. IT Gives Extra-Defining power to crunches, curls, and Twists Quickly to trim and tone your tummy. Lower Body Makeover Use the loop to makeover your Entire Lower body while burning off calories with exercises Excess That are designed to Sculpt muscles AND blast away fat . Belly Flab Fighter Toning moves alone can not melt away belly bulges. You also need flab-fighting cardio-and this routine has it! Use IT to define your waistline and Develop flat abs fast! A Five-Part aero / tone program That Comes with A loop-style resistance Band. The band is exceptionally easy to use and lots of fun. It boosts the intensity of the body-sculpting routines while adding a toning element to the cardio moves (eg side-to-side stepping with the loop around your ankles really works your inner thighs). You get a huge range of exercises - from squats to crunches to Pilates, from marches to jumping jacks to cross-country skiing. Each of the five 10-minute segments targets a different muscle group with different movements (you can program the DVD to play any segment in any order). One-on-one cuing by Jessica Smith. Â© 2009. About The Instructor: A Certified wellness coach Fitness and Lifestyle Expert, Jessica Smith (www.jessicasmith.tv) has over 10 years experience in the fitness industry. She holds certifications from the American College of Sports Medicine, Aerobics and Fitness Association of America, and Powerhouse Pilates. \n\nLevel: Intermediate Aerobics \nImpact: Mixed Aerobics Choreography: \n\nBasic Toning emphasis: Lower body Toning Emphasis Lower body: 40 minutes (91%) Abs 4 minutes (9%) (includes toning in aero / tone intervals) (Blended includes toning in aero / tone segments) \n\nQuality: DVDRip \nFormat: AVI \nVideo: DivX 5, 672 x 512, 4/3, 1467 Kbps, 29.970 fps, 0.142 b / px \nAudio: AC3, 192 Kbps, CBR, 48.0 KHz, 2 ch. \nDuration: 52mn 1s \n","torrent":{"xt":"urn:btih:9c2e12e27a82f70759ed784ced219c30b51e739d","amp;dn":"Jessica+Smith+-+10+Minute+Solution%3A+Belly%2C+Butt+%26amp%3B+Thigh+Blas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c2e12e27a82f70759ed784ced219c30b51e739d","infoHashBuffer":{"type":"Buffer","data":[156,46,18,226,122,130,247,7,89,237,120,76,237,33,156,48,181,30,115,157]},"announce":[],"urlList":[]}}