{"title":"Terry Brooks - Shannara (Tutti i Testi) [TXT ITA] TNT Village","uid":6230382,"size":13456742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c469012f64379b2b3dcd0c0bb5966bc29f0b7bd&amp;dn=Terry+Brooks+-+Shannara+%28Tutti+i+Testi%29+%5BTXT+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"l.diliberto","files":14,"time":1299689582,"description":"Terry Brooks - Shannara (Tutti i Testi) [TXT ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54724&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54724&lt;/a&gt;\n\nIl ciclo di Shannara racconta la storia della famiglia Shannara-Ohmsford, una famiglia di sangue elfico (poi incrociato con sangue umano) e detentrice di poteri magici. A causa di tali poteri magici, gli Shannara-Ohmsford si trovano ad avere la responsabilitÃƒÂ  di difendere il mondo dai pericoli che lo minacciano, e ripristinare l'ordine nei periodi oscuri della storia. Le loro vicende sono strettamente legate a quelle dei Druidi di Paranor e degli Elfi.\n\nIl fondatore della dinastia ÃƒÂ¨ Jerle Shannara, vissuto al tempo della Seconda Guerra delle Razze voluta dal druido corrotto Brona. Dominato dal potere corrotto dell'Illdatch, il libro della Magia Nera, Brona istiga gli uomini a iniziare una guerra di conquista ai danni delle altre razze. Jerle Shannara riuscirÃƒÂ  a sconfiggere Brona (senza perÃƒÂ² ucciderlo) e trasmette inconsapevolmente alla sua discendenza l'ereditÃƒÂ  di affrontare il malvagio al suo ritorno.\n\nIl libro con cui Brooks diede inizio alla serie, La spada di Shannara, narra proprio di un discendente di Jerle Shannara, il &quot;mezzuomo&quot; Shea Ohmsford. Ignaro delle proprie origini, Shea viene chiamato da un potente druido buono, Allanon, a difendere il mondo dalla minaccia costituita dal ritorno di Brona con il nome di &quot;Signore degli Inganni&quot;. Per fare questo, Shea deve ritrovare la spada forgiata dal suo avo.\n\nIl nipote di Shea, Wil Ohmsford (protanista di Le pietre magiche di Shannara) ÃƒÂ¨ il primo della discendenza ad avere contatti diretti con gli elfi, sopravvissuti del tempo di Faerie ad una guerra contro i Demoni. Allanon chiede a Wil di usare i propri poteri magici per salvare l'Eterea (in originale Ellcrys), l'albero degli elfi che impedisce ai Demoni di tornare nel mondo oltrepassando la magica barriera chiamata &quot;il Divieto&quot;.\n\nI figli di Wil, Jair Ohmsford e Brin Ohmsford, sono incaricati di trovare e distruggere l'Illdatch, creduto perduto dopo la sconfitta del Signore degli Inganni; la loro fortunata ricerca ÃƒÂ¨ narrata in La canzone di Shannara.\n\nLa tetralogia degli Eredi di Shannara ÃƒÂ¨ ambientata circa tre secoli dopo le gesta di Jair e Brin, in un mondo trasformato dall'avvento di una nuova minaccia, la Federazione, dietro cui si nascoste una minaccia ancora maggiore, quella degli Ombrati, che hanno causato la sparizione degli elfi. Wren Ohmsford, Walker Boh, Coll e Par Ohmsford, discendenti di Shea, sono coinvolti in una serie di imprese volte a ristabilire l'ordine e riportare nelle Quattro Terre la perduta Paranor, roccaforte del sapere degli antichi Druidi. Wren dovrÃƒÂ  ritrovare gli elfi, e diventare loro regina; Walker partirÃƒÂ  in ricerca di un misterioso e antico spirito della pietra, mentre i due fratelli tenreanno di sconfiggere gli ombrati.\n\nLa ricostituzione dell'antico potere dei druidi, tuttavia, non puÃƒÂ² essere portato a termine senza recuperare una antica conoscenza magica dimenticata. Grianne Ohmsford, ultima discendente della stirpe di Shannara, inizia un viaggio alla ricerca dei talismani perduti oltre lo Spartiacque Azzurro, nella terra di Parkasia (la trilogia dei Viaggi della Jerle Shannara). La stessa Grianne ÃƒÂ¨ chiamata a diventare il nuovo Druido Supremo di Shannara. AccetterÃƒÂ  il pesante fardello?\n\nL'ultima trilogia, Il Druido Supremo di Shannara, ruota intorno al salvataggio di Grianne Ohmsford, misteriosamente scomparsa, dopo un complotto di alcuni druidi malvagi. Il nipote di Grianne, Penderrin Ohmsford, scopre che la zia si trova nel mondo del Divieto, e che un pericoloso demone ha preso il suo posto. Salvata Grianne, il demone viene sconfitto e la donna decide di farsi mutare in un'Aeriade, uno spirito degli alberi, per salvare la ragazza amata da Penderrin.\n &lt;a href=&quot;\nhttp://www.celticworld.it/immagini/wiki/fg_387_971.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.celticworld.it/immagini/wiki/fg_387_971.jpg&lt;/a&gt;\n\nPREQUEL\n00 - Il Primo Re Di Shannara.txt\n\nSAGA DI SHANNARA\n01 - La Spada di Shannara.txt\n02 - Le Pietre Magiche di Shannara.txt\n03 - La Canzone di Shannara.txt\n\nSAGA DEGLI EREDI DI SHANNARA\n01 - Gli Eredi di Shannara.txt\n02 - Il Druido di Shannara.txt\n03 - La Regina degli Elfi di Shannara.txt\n04 - I Talismani di Shannara.txt\n\nSAGA DEL VIAGGIO DELLA JERLE SHANNARA\n01 - La Strega di Ilse.pdf\n02 - Il Labirinto.lit\n03 - L'ultima Magia.txt\n\nSAGA DEL DRUIDO SUPREMO DI SHANNARA\n01 - Il Druido Supremo di Shannara.txt\n02 - Tanequil.txt\n03 - La Regina degli Straken.txt","torrent":{"xt":"urn:btih:9c469012f64379b2b3dcd0c0bb5966bc29f0b7bd","amp;dn":"Terry+Brooks+-+Shannara+%28Tutti+i+Testi%29+%5BTXT+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c469012f64379b2b3dcd0c0bb5966bc29f0b7bd","infoHashBuffer":{"type":"Buffer","data":[156,70,144,18,246,67,121,178,179,220,208,192,187,89,102,188,41,240,183,189]},"announce":[],"urlList":[]}}