{"title":"Cat Power - The Greatest [24 bit FLAC] vinyl","uid":8829284,"size":873198774,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9cbd1e26e2d743e5f8c07e1c16cd70611995ecb6&amp;dn=Cat+Power+-+The+Greatest+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1376923112,"description":"\n  Cat Power - The Greatest [24 bit FLAC] vinyl\n \n  Genre: Pop/Rock\n  Styles: Alternative, Singer/Songwriter\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  A1 The Greatest \n  A2 Living Proof\n  A3 Lived In Bars\n  A4 Could We\n  A5 Empty Shell\n  A6 Willie\n\n  B1 Where Is My Love\n  B2 The Moon \n  B3 Islands\n  B4 After It All\n  B5 Hate\n  B6 Love &amp; Communication\n  B7 Up And Gone\n\n  The Greatest (no, it's not a hits collection) makes it clear just how much Chan Marshall grows with each album she releases. Three years on from You Are Free, she sounds reinvented yet again: Marshall returned to Memphis, TN -- where she recorded What Would the Community Think nearly a decade earlier -- to make an homage to the Southern soul and pop she listened to as a young girl. Working with great Memphis soul musicians such as Mabon &quot;Teenie&quot; Hodges, Leroy &quot;Flick&quot; Hodges, and Dave Smith, she crafted an album that is even more focused and accessible than You Are Free was, and pushes her even closer toward straightforward singer/songwriter territory. The title track is a subtle but powerful statement of purpose: with its lush, &quot;Moon River&quot; strings and lyrics about a young boy who wanted to become a boxer, the song is as moving as her earlier work but also a big step away from the angst-ridden diary-rock that her music is sometimes categorized as. Likewise, on the gospel-tinged &quot;Living Proof&quot; and the charming &quot;Could We,&quot; Marshall is sexy, strong, and playful, and far from the stereotype of her as a frail, howling waif. \n\n  But the truth is, sweet Southern songs like these have been in her repertoire since What Would the Community Think's &quot;They Tell Me&quot; and &quot;Taking People&quot; (You Are Free's &quot;Good Woman&quot; and &quot;Half of You&quot; are also touchstones for this album); The Greatest is just a more polished, palatable version of this side of her music. This is the most listenable Cat Power album Marshall has made, and one that could easily win her lots of new fans. It's also far from a sell-out -- The Greatest sounds like the album Marshall wanted to make, without any specific (or larger) audience in mind. And yet, the very things about The Greatest that make it appealing to a larger audience also make it less singular and sublime than, say, Moon Pix or You Are Free. The productions and arrangements on songs like &quot;Lived in Bars&quot; and &quot;Empty Shell&quot; are so immaculate and intricate that they threaten to overwhelm Marshall's gorgeous voice. And, occasionally, the album's warm, soulful, laid-back vibe goes from mellow to sleepy, particularly on &quot;Willie&quot; and &quot;The Moon.&quot; Two of The Greatest's best songs show that she doesn't need to be edgy and tortured or gussied up with elaborate productions to sound amazing: &quot;Where Is My Love&quot; reaffirms that all Marshall needs is a piano and that voice to make absolutely spellbinding music. On the other hand, &quot;Love &amp; Communication&quot;'s modern, complicated take on love gains a quiet intensity with judiciously used strings and keyboards. For what it is, The Greatest is exceedingly well done, and people who have never heard of Cat Power before could very well love this album immediately. However, it might take a little more work for those who have loved her music from the beginning.","torrent":{"xt":"urn:btih:9cbd1e26e2d743e5f8c07e1c16cd70611995ecb6","amp;dn":"Cat+Power+-+The+Greatest+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cbd1e26e2d743e5f8c07e1c16cd70611995ecb6","infoHashBuffer":{"type":"Buffer","data":[156,189,30,38,226,215,67,229,248,192,126,28,22,205,112,97,25,149,236,182]},"announce":[],"urlList":[]}}