{"title":"Animorphs - Complete TV Series","uid":4427339,"size":4081052010,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d8159a8fa307e8ea4fdf6a33256790e325d4de5&amp;dn=Animorphs+-+Complete+TV+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sandyannn","files":24,"time":1223103701,"description":"My name is Elfangor. I am a prince from the Andalite world. I am dying. My ship has crash-landed on a planet called Earth. This is not the first time my hooves have touched the surface of this vast and beautiful world, but it will be the last. The Yeerks have launched their silent attack on Earth. Yeerks are evil parasites who live in the brains of other species. Now their goal is to enslave every human being on this planet. As I looked into five pairs of innocent human eyes, I knew what I had to do. These young people had no knowledge of the invasion, no idea that some of their closest friends and family members were already under Yeerk control. But they would soon bear the responsibility of saving their entire world. I gave them the power to morph, Andalite technology no other species has ever possessed. Now these humans will be able to use the energy and instincts of any living creature to resist the Yeerks. They can become any animal they touch. Many Andalites have called me a hero, yet there are things no one knows about me, secrets the five humans will uncover when the time is right. I want them to learn the truth. They are children, not trained warriors, yet I have confidence in their strength. Sometimes children can accomplish amazing things.","torrent":{"xt":"urn:btih:9d8159a8fa307e8ea4fdf6a33256790e325d4de5","amp;dn":"Animorphs+-+Complete+TV+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d8159a8fa307e8ea4fdf6a33256790e325d4de5","infoHashBuffer":{"type":"Buffer","data":[157,129,89,168,250,48,126,142,164,253,246,163,50,86,121,14,50,93,77,229]},"announce":[],"urlList":[]}}