{"title":"Nmap 6 Network Exploration and Security Auditing Cookbook","uid":7940723,"size":2019584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e8a122f8f7d0d5e3b77607eabdbe71f298f58c8&amp;dn=Nmap+6+Network+Exploration+and+Security+Auditing+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1355971004,"description":"Nmap 6: Network exploration and security auditing Cookbook\n\n\nPublication Date: November 23, 2012\n\nIn Detail\n\nNmap is a well known security tool used by penetration testers and system administrators. The Nmap Scripting Engine (NSE) has added the possibility to perform additional tasks using the collected host information. Tasks like advanced fingerprinting and service discovery, information gathering, and detection of security vulnerabilities.\n\nNmap 6: Network exploration and security auditing cookbook will help you master Nmap and its scripting engine. You will learn how to use this tool to do a wide variety of practical tasks for pentesting and network monitoring. Finally, after harvesting the power of NSE, you will also learn how to write your own NSE scripts.\n\nNmap 6: Network exploration and security auditing cookbook is a book full of practical knowledge for every security consultant, administrator or enthusiast looking to master Nmap. The book overviews the most important port scanning and host discovery techniques supported by Nmap. You will learn how to detect mis-configurations in web, mail and database servers and also how to implement your own monitoring system.\n\nThe book also covers tasks for reporting, scanning numerous hosts, vulnerability detection and exploitation, and its strongest aspect; information gathering.\n\nApproach:\n\nThe book is a collection of easy to follow, practical recipes with explanations of the code, and links to further information.\n\nWho this book is for:\n\nThis book is for any security consultant, administrator or enthusiast looking to learn how to use and master Nmap and the Nmap Scripting Engine.","torrent":{"xt":"urn:btih:9e8a122f8f7d0d5e3b77607eabdbe71f298f58c8","amp;dn":"Nmap+6+Network+Exploration+and+Security+Auditing+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8a122f8f7d0d5e3b77607eabdbe71f298f58c8","infoHashBuffer":{"type":"Buffer","data":[158,138,18,47,143,125,13,94,59,119,96,126,171,219,231,31,41,143,88,200]},"announce":[],"urlList":[]}}