{"title":"Writing Plots With Drama, Depth and Heart - Roz Morris","uid":14392239,"size":1009834,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e99fd861e309779b8a64b59095e8636aec2f8db&amp;dn=Writing+Plots+With+Drama%2C+Depth+and+Heart+-+Roz+Morris&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ZamKhan","files":3,"time":1461317456,"description":"What keeps a reader curious? It’s the story. You might have a dazzling prose voice and plausible characters, but if nothing happens, the reader is likely to lose interest. \r\nSo where do you find story ideas? How do you make them into a captivating read? \r\n\r\nWhat’s your personal vision? Do you know what genre you are best suited to write? What is literary fiction and how do you write that? How will you give your book depth without seeming preachy or bringing the plot to a standstill? \r\n\r\nWhat are the hidden structural patterns that ply the reader’s emotions, regardless of your genre or style? How can you use them with originality? How should you begin and end? What should go in the middle? Where should you play your best twists - and what should they be? How can you write each scene so it holds the reader’s curiosity? \r\nIf you want to write a story that breaks with convention but still keeps readers riveted, how do you do it? \r\n\r\nWhatever type of novel you want to write, this book will show you, in down-to-earth tutorials, games and brainstorming exercises. \r\nUse it before you write and when revising, to diagnose your story’s strengths and weaknesses. If you’ve had feedback from critique partners and editors, use it to decode what’s really wrong - instead of what they think might be. \r\n\r\nMost of all, use it to find out where you already have spellbinding plot material. Discover where your best ideas are hiding and how to tell stories with drama, depth and heart","torrent":{"xt":"urn:btih:9e99fd861e309779b8a64b59095e8636aec2f8db","amp;dn":"Writing+Plots+With+Drama%2C+Depth+and+Heart+-+Roz+Morris","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e99fd861e309779b8a64b59095e8636aec2f8db","infoHashBuffer":{"type":"Buffer","data":[158,153,253,134,30,48,151,121,184,166,75,89,9,94,134,54,174,194,248,219]},"announce":[],"urlList":[]}}