{"title":"Pink Floyd Atom Heart Mother 24 Bit Vinyl Pack","uid":9535088,"size":2100926292,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ed0d56e25dcf3eb1827a6cbe2ce3c104523e711&amp;dn=Pink+Floyd+Atom+Heart+Mother+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1390916932,"description":"\n  Pink Floyd Atom Heart Mother 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Art Rock, Psychedelic\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Two Versions\n\n  UK Harvest SHVL 781 A4/B5 \n\n  Rip Info (Ripped by Kel bazaar)\n\n  Technics SP 15 with SME 3009 tonearm &amp; customized plinth\n  Ortofon Concorde OM 30 MM\n  Pro-Ject Tube Box II with 2X JAN 12AX 7WA (General Electric)\n  Wire World Solstice 5.2\n  Sony Vaio Laptop\n  Tascam US-144 external USB 2.0 Audiointerface\n  WaveLab 5.01 \n  ClickRepair \n  Redbook Resampled And Dithered with iZotope RX\n  \n  and\n\n  Mobile Fidelity Sound Labs MFSL 1-202\n\n  Rip Info (Ripped by Dr. Robert)\n\n  Technics SL-1210 MK2 DD Turntable\n  Origin Live OL1 fully modified tone arm (Rega RB250)\n  Audio-Technica AT33EV MC Cartridge\n  Pro-ject Tube Box SE II Preamp\n  Tascam US-144 external USB 2.0\n  Bias Peak Pro 6.2\n  Click Repair 3.4.1 for de-click (manual mode only)\n  XLD Version 20110228 (129.0) for FLAC conversion\n\n  Review\n\n  Appearing after the sprawling, unfocused double-album set Ummagumma, Atom Heart Mother may boast more focus, even a concept, yet that doesn't mean it's more accessible. If anything, this is the most impenetrable album Pink Floyd released while on Harvest, which also makes it one of the most interesting of the era. Still, it may be an acquired taste even for fans, especially since it kicks off with a side-long, 23-minute extended orchestral piece that may not seem to head anywhere, but is often intriguing, more in what it suggests than what it achieves. Then, on the second side, Roger Waters, David Gilmour, and Rick Wright have a song apiece, winding up with the group composition &quot;Alan's Psychedelic Breakfast&quot; wrapping it up. Of these, Waters begins developing the voice that made him the group's lead songwriter during their classic era with &quot;If,&quot; while Wright has an appealingly mannered, very English psychedelic fantasia on &quot;Summer 68,&quot; and Gilmour's &quot;Fat Old Sun&quot; meanders quietly before ending with a guitar workout that leaves no impression. &quot;Alan's Psychedelic Breakfast,&quot; the 12-minute opus that ends the album, does the same thing, floating for several minutes before ending on a drawn-out jam that finally gets the piece moving. So, there are interesting moments scattered throughout the record, and the work that initially seems so impenetrable winds up being Atom Heart Mother's strongest moment. That it lasts an entire side illustrates that Pink Floyd was getting better with the larger picture instead of the details, since the second side just winds up falling off the tracks, no matter how many good moments there are. This lack of focus means Atom Heart Mother will largely be for cultists, but its unevenness means there's also a lot to cherish here.","torrent":{"xt":"urn:btih:9ed0d56e25dcf3eb1827a6cbe2ce3c104523e711","amp;dn":"Pink+Floyd+Atom+Heart+Mother+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed0d56e25dcf3eb1827a6cbe2ce3c104523e711","infoHashBuffer":{"type":"Buffer","data":[158,208,213,110,37,220,243,235,24,39,166,203,226,206,60,16,69,35,231,17]},"announce":[],"urlList":[]}}