{"title":"How Bad Do You Want It - Mark L. Messick","uid":11912846,"size":228549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f05ee38d0a1741d3f9705b0f98d8012acc22fcf&amp;dn=How+Bad+Do+You+Want+It+-+Mark+L.+Messick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1431505850,"description":"Are you fully content with your life? \n\nDo you ever wish that you were happier, or healthier, or smarter...but never do anything about it? \n\nHave you tried to improve your life before...and failed? \n\nIf you answered &quot;yes&quot; to any one of these questions, you're not alone. \n\nThere are TONS of people in the same situation as you. \n\nThere are loads of people out there who have tried to improve their life, but never saw the results they wanted. \n\nThere are also people who have never tried to improve their life, simply because they're too lazy. \n\nAnd there are people who constantly try to improve their life, but never see any significant results because they're doing it all wrong. (Without ever knowing that they're doing anything wrong.) \n\nWhile each of these groups may seem very different, they have one common thread. \n\nNo one is fully content with their lives. \n\nEverybody wants something more. \n\nRegardless of which category you fall into, this book can help you. \n\nThis book will show you why your life hasn't improved in the past, and how to change that. \n\nThis book will show you how to get off your lazy butt and finally work towards a better life. \n\nThis book will show you how to become fully content with your life. \n\nRegardless of who you are or what situation you may be in, this book can show you how to finally achieve the results you've always wanted. This book can show you how to live the life of your dreams","torrent":{"xt":"urn:btih:9f05ee38d0a1741d3f9705b0f98d8012acc22fcf","amp;dn":"How+Bad+Do+You+Want+It+-+Mark+L.+Messick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f05ee38d0a1741d3f9705b0f98d8012acc22fcf","infoHashBuffer":{"type":"Buffer","data":[159,5,238,56,208,161,116,29,63,151,5,176,249,141,128,18,172,194,47,207]},"announce":[],"urlList":[]}}