{"title":"Kenji Mizoguchi - Akasen Chitai AKA Street of Shame (1956)","uid":4482616,"size":1251705389,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f4aabb86a90b95b68c3d8cb3ef4b5f26293e5e7&amp;dn=Kenji+Mizoguchi+-+Akasen+Chitai+AKA+Street+of+Shame+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1225635506,"description":"Kenji Mizoguchi - Akasen Chitai AKA Street of Shame (1956) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0048933/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0048933/&lt;/a&gt;\n\nLanguage\tJapanese\nSubtitles\tincluded: English\n\nOne of Kenji Mizoguchi's later works but still a great classic. The red light district of Yoshiwara in 1956 bears little resemblance to its evocative tradition as the place where flowery courtesans, romantic and proud gloried in years gone by. The government has waged an annual campaign to ban prostitution, but in the uncertainty and devastation of postwar Japan, it is a tragic and ignoble reality that women have turned to the streets for economic survival. At an establishment called Dreamland that proudly displays a euphemistic &quot;Cafe and Tea Parlor Association&quot; placard, the joyless lives and faded dreams of five women intersect. The widow, Yumeko (Aiko Mimasu), has entrusted her son to his grandparents in the province and is rarely able to visit him, ashamed of her disreputable profession. Yasumi (Ayako Wakao) is a resourceful, manipulative young woman who uses her influence on men for personal gain. Hanae (Michiko Kogure) is a mother burdened with the responsibility of supporting her family when her husband loses his job. Mickey (Machiko Kyo) is an unsentimental young woman whose extravagant lifestyle perpetuates her indebtedness to the proprietors of Dreamland. Yorie (Hiroko Machida) is a hopeless romantic who dreams of settling into a tranquil, domestic life, and fondly shows off her prized collection of kitchen tools to her coworkers. However, with the increasing momentum of the anti-prostitution bill, the women find their allegiances tested by economic necessity and personal conscience.\n\nKenji Mizoguchi creates an elegant, poignant, and unsentimental portrait of adversity and human resilience in Street of Shame. Using the recurrent imagery of rectangular compositions, Mizoguchi reflects the estrangement and social isolation of the tragic heroines: Yumeko borrows money from the calculating Yasumi through a slight opening in a privacy screen; Mickey's interview with the proprietor is shown through a wall opening; Yumeko avoids seeing her son and watches through structural beams as Hanae sends him away; the haunting image of Yumeko singing a melancholy ballad by the stairs. In the end, what emerges is a self-perpetuating, tragic cycle of exploitation and personal disappointment - a lonely and painful existence inexorably bound to the physical compromise of the body - a desperate struggle to retain a vestige of purity within the human soul. &lt;a href=&quot;\nhttp://bayimg.com/image/callgaabl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/callgaabl.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/callkaabl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/callkaabl.jpg&lt;/a&gt;\n\n~~~~~~ Akasen chitai.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,247,584,256                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:25:54                \nFrame Count:....................................123551             \nFrame Width (pixels):...........................624                  \nFrame Height (pixels):..........................448                  \nAspect Ratio:...................................1.393                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1735                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.259&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n--------my rip------\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:9f4aabb86a90b95b68c3d8cb3ef4b5f26293e5e7","amp;dn":"Kenji+Mizoguchi+-+Akasen+Chitai+AKA+Street+of+Shame+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f4aabb86a90b95b68c3d8cb3ef4b5f26293e5e7","infoHashBuffer":{"type":"Buffer","data":[159,74,171,184,106,144,185,91,104,195,216,203,62,244,181,242,98,147,229,231]},"announce":[],"urlList":[]}}