{"title":"Io.E.Marley.2008.iTALiAN.MD.DVDRiP.XViD-FREE[volpebianca]","uid":4821419,"size":1198575616,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f6837ca0311735827e0ffe41ddb6b1e0ee58983&amp;dn=Io.E.Marley.2008.iTALiAN.MD.DVDRiP.XViD-FREE%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Volpebianca","files":2,"time":1238777951,"description":":::Scheda del film:::\nTitolo: Io &amp; Marley\nTitolo originale: Marley &amp; Me\nNazionalitÃƒÂ : USA\nAnno: 2008\nGenere: Commedia\nRegia: David Frankel\nData di uscita: 03 Aprile 2009 (cinema)\nCast: Jennifer Aniston, Owen Wilson, Alan Arkin, Haley Bennett, Clarke Peters, Eric Dane, Jennifer Wiener, Haley Hudson, Victoria Roman\n\n:::Trama:::\n\nMentre cade la neve la notte delle loro nozze, i neosposi John e Jenny Grogan (Owen Wilson e Jennifer Aniston) decidono di lasciarsi alle spalle il rigido inverno del Michigan e partono per il sud per iniziare una nuova vita a West Palm Beach, in Florida. Trovano lavoro come giornalisti in due quotidiani locali concorrenti, comprano la loro prima casa e iniziano ad affrontare le sfide della vita matrimoniale e del nuovo lavoro, oltre a prendere in considerazione l'idea di cambiare per sempre la loro vita mettendo su famiglia. John, che non ÃƒÂ¨ certo di essere pronto a diventare padre, confessa i suoi timori all'amico e collega Sebastian, che ha per lui la soluzione perfetta: regalare a Jenny un cucciolo. &quot;Niente di piÃƒÂ¹ facile&quot;, afferma Sebastian. &quot;Lo porti a spasso, gli dai da mangiare, lo fai uscire ogni tanto&quot;. E cosÃƒÂ¬ arriva Marley. I Grogan adottano un graziosissimo labrador biondo di cinque chili che, in breve tempo, diventa un rullo compressore: quarantacinque chili di energia incontrollata che trasformano la casa dei Grogan in un'area disastrata. La scuola di addestramento non ha alcun esito: Marley stacca a morsi pezzi di cartongesso dalle pareti, morde il divano, rovescia i secchi dell'immondizia, ruba un tacchino il giorno del Ringraziamento, distrugge cuscini e fiori, beve l'acqua del water e insegue il fattorino dell'UPS. Perfino una costosa collana appena acquistata non ÃƒÂ¨ al sicuro dalle voraci bravate di Marley. Nel marasma che crea nel corso degli anni, Marley osserva i Grogan vivere gli alti e bassi della vita familiare, cambiare lavoro e casa e, soprattutto, affrontare la miriade di difficoltÃƒÂ  tipiche di una famiglia in crescita. Come John e Jenny realizzano, Marley - &quot;il cane peggiore del mondo&quot; - in qualche modo tira fuori il meglio da loro.\n\nQualitÃƒÂ  audio 6.5 video 9.","torrent":{"xt":"urn:btih:9f6837ca0311735827e0ffe41ddb6b1e0ee58983","amp;dn":"Io.E.Marley.2008.iTALiAN.MD.DVDRiP.XViD-FREE%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f6837ca0311735827e0ffe41ddb6b1e0ee58983","infoHashBuffer":{"type":"Buffer","data":[159,104,55,202,3,17,115,88,39,224,255,228,29,219,107,30,14,229,137,131]},"announce":[],"urlList":[]}}