{"title":"A Primer of Clinical Psychiatry - Castle, Bassett (Elsevier 2010","uid":10629547,"size":2033908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fecbcd442b492afd4c016c3ee6b3568e5848eaa&amp;dn=A+Primer+of+Clinical+Psychiatry+-+Castle%2C+Bassett+%28Elsevier+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sertok","files":1,"time":1406297953,"description":"Book: A Primer of Clinical Psychiatry, 1e\n\nAuthors: David J. Castle, Darryl Bassett\n\nThis is a text book of clinical psychiatry that is concise yet comprehensive, up to date, and readily accessible. It aims to be an easy entry to the pertinent facts of clinical psychiatry for medical students and students of mental health disciplines; a resource for established clinicians, including GPs; and also a brief yet thorough overview for the more advanced psychiatric trainee or mental health professional. There is a particular focus on providing simple clinical tips. Liberal use of fact boxes and summary lists ensures readers will have at their fingertips the facts required for undergraduate OSCE exams in clinical psychiatry (an appendix provides explicit examples), as well as equipping more advanced readers with the basic knowledge underpinning post-graduate exams in clinical psychiatry and related allied health disciplines. To effect coherence of approach and minimal overlap between chapters, the bulk of the text has been written by two authors who are experienced psychiatrists with expertise in a broad range of clinical and research areas. Introductory chapters cover the psychiatric interview and mental state and clinical investigations relevant to psychiatry. The second section is an overview of all of the major syndromes of psychiatry, covering epidemiology, aetiology and clinical aspects, and including discussion of specific treatment approaches. A separate section reviews more generally, biological and psychosocial aspects of treatment in psychiatry, with worked case examples.coherence of approach and minimal overlap with specialist material integrated clinical tips and skillscovers clinical and written examination requirementsreferencing WHO, ICD and DSM Va glossary of termsfact boxes and summary lists\n\nISBN13: 9780729539036\nISBN10: 0729539032","torrent":{"xt":"urn:btih:9fecbcd442b492afd4c016c3ee6b3568e5848eaa","amp;dn":"A+Primer+of+Clinical+Psychiatry+-+Castle%2C+Bassett+%28Elsevier+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fecbcd442b492afd4c016c3ee6b3568e5848eaa","infoHashBuffer":{"type":"Buffer","data":[159,236,188,212,66,180,146,175,212,192,22,195,238,107,53,104,229,132,142,170]},"announce":[],"urlList":[]}}