{"title":"The Neptunes Present... Clones (2003) [FLAC]","uid":15580819,"size":452884378,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ff9c983f9edbfc8d518380df41802eba0cef575&amp;dn=The+Neptunes+Present...+Clones+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Earthling1","files":33,"time":1471402870,"description":"AllMusic Review by Andy Kellman\r\n\r\nWhen Chad Hugo and Pharrell Williams are behind the boards, hit singles are expected, and hit singles are usually granted. For The Neptunes Present...Clones, the tables are somewhat turned; the producers aren't in need of any more hits, but they do the enlisting here, and they snare an all-star cast of featured players who are willing to join up and/or return the favor, all the while reaping the cachet that comes with being in such venerated company. If anything, Clones puts an end to any thought that the duo randomly selects a track from their beat bank when collaborating, since it ably demonstrates how their skills can adapt to any conceivable personality. Williams steps out with some help from Jay-Z on &quot;Frontin',&quot; one of the biggest Neptunes-related singles yet; the light, simple arrangement is ideally suited to Williams' lighthearted falsetto. (It also must be said that no one else could make the line &quot;And I was gon' tear your ass up&quot; seem so charming.) The spare cattle-prod funk of &quot;Light Your Ass on Fire&quot; pings and jolts with sharp zaps, accompanying Busta Rhymes' more sexually aggressive and explicit come-ons. Amidst whirling sirens, Dirt McGirt's turn, &quot;Pop Shit,&quot; boasts a comical Looney Tunes-worthy arrangement. (It also must be said that no one but Williams could make a chorus like &quot;Pop sh*t, n*gg*, what's up?&quot; so effective.) &quot;Popular Thug,&quot; originally a track on Kelis' import-only Wanderland, gets a deserved new look, with Pusha T's role bumped in favor of Nas, who proceeds to take the track over and knock Kelis into the supporting role. At 18 tracks, there's a little too much to digest, and not everything is top rate -- but knocking the disc for the fact that a few cuts aren't Top Ten material would only further illustrate how spoiled listeners have become, and how remarkable the Neps' run has been. Besides, you can whittle this disc down to your favorite dozen and have one of the year's best albums. Doing this would hopefully eradicate the middle patch of innocuous rock -- Spymob's &quot;Half-Steering,&quot; the High Speed Scene's &quot;F**k n' Spend&quot; -- while retaining the aforementioned highlights, along with saving space for Vanessa Marquez' &quot;Good Girl,&quot; which has to be the best ripoff of late-'80s Jam &amp; Lewis-style production. Or you could just take the whole disc as is, as a strong if patchy reminder of the Neptunes' pop prowess","torrent":{"xt":"urn:btih:9ff9c983f9edbfc8d518380df41802eba0cef575","amp;dn":"The+Neptunes+Present...+Clones+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ff9c983f9edbfc8d518380df41802eba0cef575","infoHashBuffer":{"type":"Buffer","data":[159,249,201,131,249,237,191,200,213,24,56,13,244,24,2,235,160,206,245,117]},"announce":[],"urlList":[]}}