{"title":"The Physics Of War - From Arrows To Atoms (2014) By Barry Parker","uid":9551149,"size":11924079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0095afa792da1e5b73348d96b36bb30c32566bf&amp;dn=The+Physics+Of+War+-+From+Arrows+To+Atoms+%282014%29+By+Barry+Parker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391267065,"description":"Format: mobi/epub/azw3\nLength: 340 pages\nGenre: History/Military/Science\nDate: 7 January 2014\n\nThis fascinating blend of popular science and military history examines the science of war, demonstrating the close connection between the discovery of basic physical principles and the development of weaponry over the ages. \n\nPhysics has played a critical role in warfare since the earliest times. Barry Parker highlights famous battles of the past as well as renowned scientists and inventors such as Leonardo, Galileo, Newton, Maxwell, and Einstein whose work had an impact on the technology of combat. Mechanics and the laws of motion led to improved shell trajectories; gas dynamics proved important to the interior ballistics of rifles and cannons; and space exploration resulted in intercontinental missiles, spy satellites, and drone aircraft.\n\nParker emphasizes the special discoveries that had revolutionary effects on the art of warfare: the Chinese invention of gunpowder, the development of firearms, the impact of the Industrial Revolution, the deployment of the airplane in the First World War, and in our era the unleashing of the enormous power inherent in nuclear fission and fusion.\n\nAuthor:\n\nBarry Parker (Pocatello, ID) is an award-winning science writer and the author of twenty-seven highly acclaimed popular science books, including Albert Einstein's Vision: Remarkable Discoveries That Shaped Modern Science; Einstein: The Passions of a Scientist; Einstein's Brainchild: Relativity Made Relatively Easy!; Quantum Legacy: The Discovery That Changed Our Universe and Science 101: Physics. He is professor emeritus of physics at Idaho State University. ","torrent":{"xt":"urn:btih:a0095afa792da1e5b73348d96b36bb30c32566bf","amp;dn":"The+Physics+Of+War+-+From+Arrows+To+Atoms+%282014%29+By+Barry+Parker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0095afa792da1e5b73348d96b36bb30c32566bf","infoHashBuffer":{"type":"Buffer","data":[160,9,90,250,121,45,161,229,183,51,72,217,107,54,187,48,195,37,102,191]},"announce":[],"urlList":[]}}