{"title":"Tariq Ramadan - Islam and the Arab Awakening (2012)","uid":8704905,"size":1568109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a01774fc68121dfee95f17d7c024eba17d58f2d1&amp;dn=Tariq+Ramadan+-+Islam+and+the+Arab+Awakening+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1374124612,"description":"Tariq Ramadan - Islam and the Arab Awakening (Oxford University Press, 2012).\n\nISBN: 9780199933730 | 256 pages | PDF\n\n\nOne of the most important developments in the modern history of the Middle East, the so-called Arab Spring began in Tunisia in December 2010, bringing down dictators, sparking a civil war in Libya, and igniting a bloody uprising in Syria. Its long-term repercussions in Egypt and elsewhere remain unclear. Now one of the world's leading Islamic thinkers examines and explains it, in this searching, provocative, and necessary book.\n\nTime Magazine named Tariq Ramadan one of the most important innovators of the twenty-first century. A Muslim intellectual and prolific author, he has won global renown for his reflections on Islam and the contemporary challenges in both the Muslim majority societies and the West.\n\nIn Islam and the Arab Awakening, he explores the uprisings, offering rare insight into their origin, significance, and possible futures. As early as 2003, he writes, there had been talk of democratization in the Middle East and North Africa. The U.S. government and private organizations set up networks and provided training for young leaders, especially in the use of the Internet and social media, and the West abandoned its unconditional support of authoritarian governments. But the West did not create the uprisings. Indeed, one lesson Ramadan presents is that these mass movements and their consequences cannot be totally controlled. Something irreversible has taken place: dictators have been overthrown without weapons. But, he writes, democratic processes are only beginning to emerge, and unanswered questions remain. What role will religion play? How should Islamic principles and goals be rethought? Can a sterile, polarizing debate between Islamism and secularism be avoided?\n\nAvoiding both naive confidence and conspiratorial paranoia, Ramadan voices a tentative optimism. If a true civil society can be established, he argues, this moment's fragile hope will live.\n\n\nReviews\n\n&quot;Tariq Ramadan, one of the foremost Muslim intellectuals . . . comes into his own as a historian and provoker of ideas. He notes how, in their Western representation, Muslim Arabs have shifted from the benighted, terrorist 'other' to the 'alter ego of the Western Universal.&quot; -- The Independent\n\n&quot;Whether you agree with Ramadan's interpretation of events or vision for the future of the Muslim-majority nations, Islam and the Arab Awakening is a thoughtful and nuanced examination of the events others have termed the 'Arab Spring.' There is no question that Ramadan supports the rule of law, freedom of religion, and the right of self-determination for all peoples. . . If you are looking for a straightforward history, or want simple answers to complex problems, this book is not for you. But if you are trying to understand the issues facing the Muslim-majority nations today, Islam and the Arab Awakening is a good place to start.&quot; -- CultureMob\n\n&quot;Ramadan has started to pave out the road to reform and changes in the understanding of Islam in Muslim communities in the West.&quot; -- Le Monde Diplomatique\n\n&quot;Tariq Ramadan, a prominent intellectual-activist in Europe and America, represents a new generation of Islamic reformers.&quot; -- John L. Esposito, author of Unholy War and What Everyone Needs to Know about Islam\n","torrent":{"xt":"urn:btih:a01774fc68121dfee95f17d7c024eba17d58f2d1","amp;dn":"Tariq+Ramadan+-+Islam+and+the+Arab+Awakening+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01774fc68121dfee95f17d7c024eba17d58f2d1","infoHashBuffer":{"type":"Buffer","data":[160,23,116,252,104,18,29,254,233,95,23,215,192,36,235,161,125,88,242,209]},"announce":[],"urlList":[]}}