{"title":"THE HALLOWEEN TREE (1994)","uid":4285088,"size":787765645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a02d83d108cff86d11e03178fb5d4737f159987b&amp;dn=THE+HALLOWEEN+TREE+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mirrorspocks","files":2,"time":1215646059,"description":"Spock (Leonard Nimoy) waxes spooky as Death personified in this video retelling of Ray Bradbury&amp;#039;s classic Halloween adventure. A Hanna-Barbera animated presentation, The Halloween Tree tells the story of four close friends who must face their greatest fears as they travel through time to save their dear comrade, Pip. It&amp;#039;s Halloween night, Pip&amp;#039;s favorite holiday, and the friends are baffled to spot his spirit running through the woods when they&amp;#039;ve just seen his body hauled off in an ambulance. Mustering their courage, they follow the spirit and meet Moundshroud (Nimoy), the mysterious black-caped proprietor of a haunted house. Moundshroud challenges them each to gain a deeper understanding of the origins of this ghostly holiday as he leads them on an educational journey through faraway places and time periods. From Egyptian sarcophaguses to Mexican graveyards, the children learn the legends behind Halloween and the importance they place on their friendship with Pip. Imaginative, not too scary, well-acted, and nicely drawn, this hour-long treat will appeal to little spooks ages 5 and older.","torrent":{"xt":"urn:btih:a02d83d108cff86d11e03178fb5d4737f159987b","amp;dn":"THE+HALLOWEEN+TREE+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a02d83d108cff86d11e03178fb5d4737f159987b","infoHashBuffer":{"type":"Buffer","data":[160,45,131,209,8,207,248,109,17,224,49,120,251,93,71,55,241,89,152,123]},"announce":[],"urlList":[]}}