{"title":"Joseph Campbell - World Mythology &amp; the Individual Adventure 1-2","uid":5989738,"size":438989330,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a031e3d79c2e667edc13282d62dcf994b6ebe032&amp;dn=Joseph+Campbell+-+World+Mythology+%26+the+Individual+Adventure+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"geogaddi000","files":7,"time":1290846770,"description":"Volume II available here:\nhttp://thepiratebay.se/torrent/5989747/Joseph_Campbell_-_World_Mythology__amp__the_Individual_Adventure_2-2\n\n\nWorld Mythology and the Individual Adventure I\n\nJOSEPH CAMPBELL (1904-1987) was an anthropologist, mythologist, passionate teacher and masterful storyteller.\n\nThe Function of Mythology 1 1/2 Hours\n\nCampbell speaks of how, in today's society, we face a unique problem because belief in our myths has broken down. We have failed to recognize that myths are psychic in origin, a vehicle of communication between the conscious and the unconscious mind, and that when we destroy the vehicle, we alienate ourselves from psychic reality. Campbell goes on to explore the four functions of mythology in a society.\n\nMythology East &amp; West 1 1/2 Hours\n\nCampbell illuminates the differences between the Oriental traditions, which are primarily matriarchal, and the Occidental traditions, which are primarily patriarchal. The dominant theme in Oriental mythology is an awareness of the transcendent and immanent nature of all being. The mystery of the individual's being is identical with the mystery of all being. In Occidental mythology, there is a basic split between the creator and the created. The individual is not considered to be identical with the deity, but rather exists in a state of relationship to the deity.\n\nIndia &amp; Yoga 1 1/2 Hours\n\nCampbell describes the fundamental principals of Tantra that are involved in the chakras or lotus ladder of Kundalini Yoga, a form of yoga that developed in India during the 4th and 5th centuries AD. Campbell also traces the wanderings of the spirit through the various states of awareness, which the different chakras symbolize, described in the Tibetan Book of the Dead.\n\nChina &amp; Buddhism 1 1/2 Hours\n\nThe religious and philosophical spirit of China, Campbell tells us, presents a strong contrast to the spirit of India, being less concerned with metaphysics and more concerned with the problems of everyday existence. Chinese Buddhism has been heavily influenced by Taoism, with its emphasis upon flow and non-interference with nature and by Confucianism, with its stress upon correct social relationship and ritual.\n\nWestern Psychology 1 1/2 Hours\n\nCampbell explains that the chief difference between the Occidental and the Oriental concepts of the ideal human being is that the Occidental ideal includes a strong and well-developed ego, where as the Oriental ideal is the abolition of the ego. Even though the Western hero may seek and find mystical experience, he is expected to remain an individual and bring back the fruits of his endeavors to share with his society.\nBIG SUR\n\nTAPES\nBIG SUR TAPES draws from over 8,000 hours of audio tape recorded over the last 30 years, primarily at Esalen Institute on Big Sur, California. This archive contains the voices of hundreds of the original thinkers and visionaries of this century. It is the largest audio archive of Joseph Campbell's work, and includes the work of Watts, Bly, Maslow, Perls, Huxley, Grof, McKenna, Keen, Rogers, Capra, Lilly, Pribram, Bateson, Br. David, Griffiths and many more.","torrent":{"xt":"urn:btih:a031e3d79c2e667edc13282d62dcf994b6ebe032","amp;dn":"Joseph+Campbell+-+World+Mythology+%26+the+Individual+Adventure+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a031e3d79c2e667edc13282d62dcf994b6ebe032","infoHashBuffer":{"type":"Buffer","data":[160,49,227,215,156,46,102,126,220,19,40,45,98,220,249,148,182,235,224,50]},"announce":[],"urlList":[]}}