{"title":"Junos Security","uid":6600996,"size":11968344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a06dce8adbfe99fff596bbd081e222a6c1a6bf17&amp;dn=Junos+Security&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TheBookie","files":-1,"time":1313207733,"description":"Junos Security\n\n\nJunos Security is the complete and authorized introduction to the new Juniper Networks SRX hardware series. This book not only provides a practical, hands-on field guide to deploying, configuring, and operating SRX, it also serves as a reference to help you prepare for any of the Junos Security Certification examinations offered by Juniper Networks.\n\nNetwork administrators and security professionals will learn how to use SRX Junos services gateways to address an array of enterprise data network requirements - including IP routing, intrusion detection, attack mitigation, unified threat management, and WAN acceleration. Junos Security is a clear and detailed roadmap to the SRX product lines.\nGet up to speed on Juniper's multi-function SRX platforms and SRX Junos software\nExplore case studies and troubleshooting tips from engineers with extensive SRX experience\n\nBecome familiar with SRX security policy, Network Address Translation, and IPSec VPN configuration\nLearn about routing fundamentals and high availability with SRX platforms\nDiscover what sets SRX apart from typical firewalls\nUnderstand the operating system that spans the entire Juniper Networks networking hardware portfolio\nLearn about the more commonly deployed branch series SRX as well as the large Data Center SRX firewalls\n\n\n","torrent":{"xt":"urn:btih:a06dce8adbfe99fff596bbd081e222a6c1a6bf17","amp;dn":"Junos+Security","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06dce8adbfe99fff596bbd081e222a6c1a6bf17","infoHashBuffer":{"type":"Buffer","data":[160,109,206,138,219,254,153,255,245,150,187,208,129,226,34,166,193,166,191,23]},"announce":[],"urlList":[]}}