{"title":"Marissa Nadler - July [2014] [EAC/FLAC]","uid":10587407,"size":265486121,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a07c74a271d77d52837f966ff76088c8a3964fa1&amp;dn=Marissa+Nadler+-+July+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"dickspic","files":16,"time":1405763074,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Bella Union #BELLAV 432\nCountry: USA\nYear: February 10, 2014\nGenre: americana,folk,dream pop\nFormat: CD,Album\n\n\n\n\n\n01. Drive\n02. 1923\n03. Firecrackers\n04. We Are Coming Back\n05. Dead City Emily\n06. Was It A Dream\n07. I've Got Your Name\n08. Desire\n09. Anyone Else\n10. Holiday In\n11. Nothing In My Heart\n\n\n\nOn July, her debut for Sacred Bones, Marissa Nadler strips away the metaphorical language that has been a hallmark in her songwriting, steeping her protagonist in the first person as she charts the aftermath of a devastating romantic relationship. This set is colored a deep, gauzy American Gothic in lyric, melody, and production -- the latter provided by Randall Dunn (Earth, Akron/Family, Wolves in the Throne Room). Nadler's lithe vocals and fingerpicked acoustic guitar are at the forefront of these 11 songs, adorned by enough reverb to make them feel as if they were frozen in time immemorial, their emotional impact undiminished. Among Nadler's accompanists here are violist/string arranger Eyvind Kang, guitarist Phil Wandscher, and keyboardist Steve Moore. Opener &quot;Drive&quot; charts the ephemeral, haunted memory of a road trip with her former lover. Grief and desire coexist in recollections of songs on the radio, road signs, shared glances and thoughts, and what's left -- his property sits rotting in her back seat. Her guitar and nuanced vocals are underscored by Jason Kardong's forlorn pedal steel. Despite its tender parlor-esque melody -- which walks a line between Stephen Foster and early 20th century country music -- &quot;Firecrackers&quot; calls her absent lover her attacker before documenting this cycle's origin: &quot;...July 4th of last year/We spilled all the blood/How'd you spend all your summer days?....&quot; &quot;Was It a Dream&quot; features Wandscher's reverbed electric guitar introducing the lyric, and later delivering a weighty yet spare solo. Textured by Kang's string chart, Nadler's protagonist reveals she &quot;lost&quot; a year, wondering if the relationship was &quot;a dream or something sinister.&quot; The beauty in songs like these (and they are beautiful, if emotionally difficult) is that they don't merely engage in an exorcism or catharsis, but an evolutionary process as the experience gets integrated into the fabric of her narrator's life -- whether she wants it to or not. As strings, acoustic guitar, and synths swirl about her warm vocal on &quot;Desire,&quot; she sums up the album's bitterest truth: &quot;I sent my song too soon/You didn't free me at all/And I barely needed you...I had it all wrong/I was about to believe/I could fall for you/And you had eyes for me/You got it all wrong/I was about to believe/That you had desire for me....&quot; Dunn's commitment to these songs is to avoid anything that would deviate from the inherent power or detract from Nadler's singing. Because of the material's quality and the inspired collaboration between songwriter, performers, and producer, July unfolds as a near-perfect song cycle.","torrent":{"xt":"urn:btih:a07c74a271d77d52837f966ff76088c8a3964fa1","amp;dn":"Marissa+Nadler+-+July+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a07c74a271d77d52837f966ff76088c8a3964fa1","infoHashBuffer":{"type":"Buffer","data":[160,124,116,162,113,215,125,82,131,127,150,111,247,96,136,200,163,150,79,161]},"announce":[],"urlList":[]}}