{"title":"Russian Circles - Memorial (2013) [FLAC]","uid":9059415,"size":252620776,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a111e1a3c6372a2d6dea72f2b4d36fcedd108826&amp;dn=Russian+Circles+-+Memorial+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1381970408,"description":"\n  Russian Circles - Memorial (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Post-Rock, Indie Rock\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Memoriam\n  02 Deficit\n  03 1777\n  04 Cheyenne\n  05 Burial\n  06 Ethel\n  07 Lebaron\n  08 Memorial\n\n  The post-rock/experimental trio Russian Circles feature Mike Sullivan (guitar), Colin DeKuiper (bass), and Dave Turncrantz (drums). Prior to Russian Circles, Sullivan and DeKuiper were members of the eclectic instrumental act Dakota/Dakota, whereas Turncrantz produced an emo-punk ruckus with Riddle of Steel. The instrumental group formed in 2005 in Chicago, and together they create a complex clamor of sprawling guitars, propulsive drumming, and heavy basslines. That same year, Russian Circles self-released their eponymous EP. Two limited-edition pressings sold out quickly. Enter marked their full-length debut for Flameshovel in spring 2006. A performance at the annual South by Southwest conference in Austin, TX, and a brief U.S. tour with Minus the Bear and Chin Up Chin Up coincided with its release. DeKuiper parted ways with the band in 2007, and was replaced with Botch/These Arms Are Snakes bassist Brian Cook. Russian Circles went into the studio with producer Matt Bayles (formerly of Minus the Bear), and in 2008 they released Station, their first record on Suicide Squeeze. They quickly followed up with another album, and in October of 2009 their third full-length, Geneva, was released. In 2011, Russian Circles made the move to Sargent House Records, who had previously been releasing the vinyl versions of their records, and later that year released their fourth album, Empros.","torrent":{"xt":"urn:btih:a111e1a3c6372a2d6dea72f2b4d36fcedd108826","amp;dn":"Russian+Circles+-+Memorial+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a111e1a3c6372a2d6dea72f2b4d36fcedd108826","infoHashBuffer":{"type":"Buffer","data":[161,17,225,163,198,55,42,45,109,234,114,242,180,211,111,206,221,16,136,38]},"announce":[],"urlList":[]}}