{"title":"Engineering.Disasters.Series.1.Part.5.California.Pipeline.Catast","uid":11899217,"size":1002650363,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a13653a67c86e7db48a2d3d3067a69a76ec24df2&amp;dn=Engineering.Disasters.Series.1.Part.5.California.Pipeline.Catast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"artistharry","files":1,"time":1431216282,"description":"Engineering Disasters: Series 1\n\nHistory, Technology Documentary hosted by Greg Stebner, published by History Channel in 2015 - English narration\n &lt;a href=&quot;\nhttp://docuwiki.net/images/6/67/Engineering-Disasters-Series-1-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/6/67/Engineering-Disasters-Series-1-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nEngineering Disasters: Series 1\nEngineering has built our modern world. Everything from skyscrapers to roads and air travel exist because of advances in engineering. What happens when engineering goes horribly wrong? Engineering Disasters goes beyond the headlines to uncover what really happened in the most notorious engineering accidents. What caused an outdoor stage to collapse in Indiana, killing seven? How did a collection of classic Corvettes disappear right out of thin air? Why did a plane's fuselage rip open in mid-flight? What was behind the collapse of a domed stadium?\nEach episode combines expert and eyewitness interviews, state of the art graphics and dramatic 'moment of disaster' footage to tell the story behind the world's most terrifying engineering disasters.\n\n\n1)  Heartland Explosion \nOn this episode, a massive explosion rocks a small Texas town killing 15 residents. A bridge in Washington collapses sending cars plunging into the river. Two construction cranes in New York City seem to fall from the sky leaving a path of destruction. A ferry full of passenger's encounters trouble and sinks. And a building demolition In Philadelphia goes horribly wrong killing innocent shoppers next door. What do all of these catastrophes have in common? They were caused by engineering failures that led to disasters of epic proportions.\n\n2)  Freight Train Collision \nThis episode investigates a stage collapse at the Indiana State Fair that leaves seven concertgoers dead. Is a gas leak to blame for an explosion in New York City that levels two buildings and kills eight people in their homes? Disaster strikes on an airliner at 36,000 feet as a gaping hole suddenly rips open midflight. Engineers in Japan scramble to save the lives of millions as an epic radioactive release looms. And, how could a train crossing be the site of not one, but two disastrous auto collisions in a single year?\n\n3)  Kentucky Sinkhole \nWhy did a 72 oil-car runaway train crash, killing 47 people and leveling half a town? Was it the brakes? Also, can engineers do anything to fix a gaping sinkhole at the National Corvette Museum, so car enthusiasts can safely return? And, what caused the Minneapolis Metrodome's iconic roof to collapse? Was it an engineering flaw or Mother Nature? Football fans want to know. Then, as 33 Chilean miners await their ultimate fate, trapped almost a half mile underground, mine drilling engineers scramble to dig a hole big enough to rescue them. Can a special drill make it though through earth harder than granite? And finally, JetBlue flight 194 started out like any other for 149 passengers. But just minutes into the journey, the airplane is almost crippled by a sudden hydraulic failure.\n\n4)  Colorado Dam Disaster \nOn this episode, a storm of the century takes out nine dams in Colorado, flooding entire towns and leaving thousands stranded. A train carrying hazardous materials derails, releasing toxic vapors throughout a small NJ community. A natural gas line breaks and reduces a neighborhood to ashes and rubble. A cargo jet crashes seconds after take off in Afghanistan. And, a luxury cruise goes from smooth sailing to wrecked on the rocks.\n\n5)  California Pipeline Catastrophe \nOn this episode, an explosion in a San Bruno, California neighborhood destroys homes and kills residents. An experienced captain and crew sail their ship into the path of Hurricane Sandy, leaving many asking why? A building full of 3,500 garment workers suddenly collapses and traps many of them inside. A warehouse full of fireworks goes off without any warning, causing evacuations and deaths. And trains arriving at the same place at the same time end up colliding, was it an engineering failure or human error?\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c189a8a6a9818df5eff0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3193 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 134 kb/sVBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 42mins\n * Framerate: 23.976 fps\n * Number of Parts: 5\n * Container Mp4\n * Part Size: 958 MB\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:a13653a67c86e7db48a2d3d3067a69a76ec24df2","amp;dn":"Engineering.Disasters.Series.1.Part.5.California.Pipeline.Catast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a13653a67c86e7db48a2d3d3067a69a76ec24df2","infoHashBuffer":{"type":"Buffer","data":[161,54,83,166,124,134,231,219,72,162,211,211,6,122,105,167,110,194,77,242]},"announce":[],"urlList":[]}}