{"title":"GFRevenge - Kelly Diamond (Sporty Girl) NEW July 14, 2014","uid":10553493,"size":355071518,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a1849cbb97b11321d726dddf697ebd8ff6b4042f&amp;dn=GFRevenge+-+Kelly+Diamond+%28Sporty+Girl%29+NEW+July+14%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"christian2353","files":1,"time":1405363030,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/GapCgaafe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GapCgaafe&lt;/a&gt;\n\n\nSize: 355071518 bytes (338.62 MiB), duration: 00:30:38, avg.bitrate: 1545 kb/s\nAudio: aac, 44100 Hz, stereo\nVideo: h264, yuv420p, 768x432, 30.00 fps\n\n\nThis week, we had the privilege of getting our hands on Kelly's sextape. She was a super sexy college girl with an ass that was sweeter than honey. Her man walked in on her in the bathroom while Kelly was getting ready to head out to the gym. She had on some tiny shorts that showed off her booty in an incredible way. Kelly started grilling her man about why he was recording her, and he explained that it was a new video camera that he needed to test out. As he recorded her, she explained her feet were sore and that she wanted him to rub them. Her man wasted no time giving her what she wanted, and Kelly appreciated it. He tried to use it to his advantage and get her to make a sextape, but she was more concerned with going to the gym. As he told her to check out the weather out the window, he started grabbing her booty, and that made Kelly horny. They started making out, and she could see his cock was hard for her. So when he asked her what she wanted to do, and she said whatever you want, he told her to take her clothes off. Once she was down to her panties, Kelly started sucking that dick. It was some awesome head, but just like her BF, we wanted to see some more of that ass. In no time, Kelly was up on that dick and riding it. But her man took over and stroked that snatch good in doggy style. Then he flipped her on her back and banged that pussy hard and deep on the couch, as Kelly's sexy tits bounced up and down form the pounding. Her man couldn't help himself and busted his load of nut all over Kelly's hot, hard body.","torrent":{"xt":"urn:btih:a1849cbb97b11321d726dddf697ebd8ff6b4042f","amp;dn":"GFRevenge+-+Kelly+Diamond+%28Sporty+Girl%29+NEW+July+14%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1849cbb97b11321d726dddf697ebd8ff6b4042f","infoHashBuffer":{"type":"Buffer","data":[161,132,156,187,151,177,19,33,215,38,221,223,105,126,189,143,246,180,4,47]},"announce":[],"urlList":[]}}