{"title":"Rocco Siffredi - Io Rocco [eBook ITA]","uid":4542085,"size":6767625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1926fac3ee7c82cdf18ed460cf5ee791e9acc69&amp;dn=Rocco+Siffredi+-+Io+Rocco+%5BeBook+ITA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"BugMeNot2008","files":15,"time":1227981743,"description":"Rocco Siffredi - Io Rocco\n\nIcona della bellezza latina e prova vivente della leggenda che gli italiani &quot;Do it better&quot;, Rocco Siffredi ÃƒÂ¨ uno dei pochi artisti italiani entrati nel mito in piena attivitÃƒÂ . Le sue imprese erotiche su grande schermo e VHS hanno entusiasmato il pubblico maschile e affascinato quello femminile, facendo di lui il vero punto di riferimento per qualsiasi discorso inerente il sesso. In questa sua prima autobiografia Siffredi svela la sua parabola artistica, mettendo in risalto che nella vita non basta avere un grande talento: ci vuole un pizzico di originalitÃƒÂ  e molta determinazione. Questa morale ÃƒÂ¨ ancor piÃƒÂ¹ vera nel ricchissimo e quindi oligarchico mondo del porno, un business planetario da miliardi e miliardi di dollari da sempre monopolizzato dai produttori e attori americani. Il libro parte da una spiaggia della riviera romagnola in cui il giovane Siffredi bagnino scopre di attrarre come un&amp;#039;irresistibile calamita le attenzioni del sesso femminile. L&amp;#039;attrazione ÃƒÂ¨ reciproca e devastante: gli basta sfiorare la mano di una cliente per avere reazioni incontrollabili. A quel punto, Rocco decide di mettere a frutto quel talento straripante, ma si scontra con diverse difficoltÃƒÂ  - non ultima quella che in Italia non si possono produrre film a luci rosse. Comincia a frequentare alcuni ambienti borderline, dove la sua fama di stallone passa di bocca in bocca fino ad arrivare ad alcuni talent scout. Ma la prova piÃƒÂ¹ difficile ÃƒÂ¨ proprio il set cinematografico, il luogo antierotico per eccellenza, in cui gli attori sono chiamati a &quot;recitare&quot; a comando, fra telecamere, microfoni e sguardi impiegatizi. Il resto ÃƒÂ¨ storia. E Rocco la racconta tutta, fin nei minimi particolari.\n\ngrazie a laFeltrinelli per la recensione\ncinema: stili e generi,Rocco Siffredi,autobiografie: artisti e personalitÃƒÂ  dello spettacolo\nGenere\nmonografie spettacolo \n\n[img]http://www.chronica.it/public/uploads/2007/09/io_rocco.jpg[/img]","torrent":{"xt":"urn:btih:a1926fac3ee7c82cdf18ed460cf5ee791e9acc69","amp;dn":"Rocco+Siffredi+-+Io+Rocco+%5BeBook+ITA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1926fac3ee7c82cdf18ed460cf5ee791e9acc69","infoHashBuffer":{"type":"Buffer","data":[161,146,111,172,62,231,200,44,223,24,237,70,12,245,238,121,30,154,204,105]},"announce":[],"urlList":[]}}