{"title":"PictureCode PhotoNinja 1.2.4 [ENG] [Portable]","uid":11148953,"size":26796742,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a1b12f5e1040d3db10201a2de8aafe942711934e&amp;dn=PictureCode+PhotoNinja+1.2.4+%5BENG%5D+%5BPortable%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"WSI","files":-1,"time":1412299588,"description":"Distinctive image quality:  Photo Ninja is a professional-grade RAW converter that delivers exceptional detail, outstanding image quality, and a distinctive, natural look. If you think this is &quot;just another RAW converter&quot;, you're in for a surprise. Photo Ninja is truly special, with unique capabilities for improving and optimizing your digital images. Click on the items below to learn more about this powerful tool, and read why serious photographers are adopting it into their workflows.\n\nPhoto Ninja supports most popular digital cameras with RAW formats based on a conventional Bayer RGB or Fujifilm X-Trans color filter arrays. Some exceptions are listed below. If in doubt, try it and see if it works.\nSupported cameras\n\nThe following cameras are believed to be supported in Photo Ninja, though not all have been verified. Even if your camera is not on this list, it might still be supported; try it and see, and let us know if it works. If your camera does not appear to be supported, send us a sample raw file.\n\n- Canon 1D Mark I/II/III/IV, 1Ds Mark I/II/III, 1D X, 5D Mark I/II/III, 6D, 7D, 10D, 20D, 30D, 40D, 50D, 60D, 70D, 300D, 350D, 400D, 450D, 500D, 550D, 600D, 1000D, 1100D, D2000, D30, D60, D6000, most PowerShot G/S/A models. \n[Note: sRAW/mRAW mode for Canon SLRs not yet supported.]\n- Nikon D1, D1H, D100, D2H, D2X, D200, D3, D3S, D3X, D300, D3000, D3100, D3200, D4, D40, D40X, D50, D5000, D5100, D60, D600, D610, D70, D700, D7000, D7100, D80, D800/D800E, D90, Df, 1 J1, 1 V1, Coolpix P7000/P7100/P7700\n- Fujifilm X-E2, X-E1, X-Pro1, X100S, X-M1, XQ1, X20, X-A1, FinePix X100, X-S1, X-T1. [Note: Highlight recovery for X-Trans models is available in the 1.2.3 pre-release.]\n- Konica Minolta Dynax 7D, probably other DiMAGE and Dynax models\n- Leica M9, M Monochrom, D-LUX 5, S2, probably other models\n- Olympus E-M5, E-500, probably other E-, C-, and SP- models.\n- Panasonic DMC-LF1, DMC-GX7, DMC-FZ35, DMC-GH2, DMC-G3, DMC-GX1, DMC-GF5, probably other DMC models.\n- Pentax K-3, K-01, probably other K- and *ist models.\n- Samsung NX200, NX100, and probably other NX models\n- Sony A7, A7r, RX1, RX1r, DSC-RX100, NEX-7, probably other DSC, DSLR, NEX, and SLT models.\n\nDNG RAW files\n\nMost DNG RAW files based on the conventional Bayer sensor layout are supported. (If you encounter a variant that won't open, send us a sample.) Phase One DNGs will open but may have visible seams. Non-RAW DNG files (which have already been demosaiced) are not currently supported.\n &lt;a href=&quot;\nhttp://www.iv.pl/images/76077115347728678640.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.iv.pl/images/76077115347728678640.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a1b12f5e1040d3db10201a2de8aafe942711934e","amp;dn":"PictureCode+PhotoNinja+1.2.4+%5BENG%5D+%5BPortable%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1b12f5e1040d3db10201a2de8aafe942711934e","infoHashBuffer":{"type":"Buffer","data":[161,177,47,94,16,64,211,219,16,32,26,45,232,170,254,148,39,17,147,78]},"announce":[],"urlList":[]}}