{"title":"Tune In - The Beatles: All These Years, Vol. 1 - Mark Lewisohn","uid":11196709,"size":1261104882,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1fda999a7d17434537479e010cfd7150ec3118f&amp;dn=Tune+In+-+The+Beatles%3A+All+These+Years%2C+Vol.+1+-+Mark+Lewisohn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1413101959,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nTune In: The Beatles: All These Years\n\nWritten by: Mark Lewisohn\nNarrated by: Clive Mantle\nLength: 43 hrs and 48 mins\nUnabridged Audiobook\nRelease Date:10-29-13\n\nTune In is the first volume of All These Years - a highly-anticipated, groundbreaking biographical trilogy by the world's leading Beatles historian. Mark Lewisohn uses his unprecedented archival access and hundreds of new interviews to construct the full story of the lives and work of John Lennon, Paul McCartney, George Harrison, and Ringo Starr.\n\nTen years in the making, Tune In takes the Beatles from before their childhoods through the final hour of 1962 - when, with breakthrough success just days away, they stand on the cusp of a whole new kind of fame and celebrity. They've one hit record (&quot;Love Me Do&quot;) behind them and the next (&quot;Please Please Me&quot;) primed for release, their first album session is booked, and America is clear on the horizon. This is the lesser-known Beatles story - the pre-Fab years of Liverpool and Hamburg - and in many respects the most absorbing and incredible period of them all. Here is the complete and true account of their family lives, childhoods, teenage years, and their infatuation with American music; here is the riveting narrative of their unforgettable days and nights in the Cavern Club, their laughs, larks, and adventures when they could move about freely, before fame closed in.\n\nFor those who've never read a Beatles book before, this is the place to discover the young men behind the icons. For those who think they know John, Paul, George, and Ringo, it's time to press the reset button and tune into the real story, the lasting word.","torrent":{"xt":"urn:btih:a1fda999a7d17434537479e010cfd7150ec3118f","amp;dn":"Tune+In+-+The+Beatles%3A+All+These+Years%2C+Vol.+1+-+Mark+Lewisohn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1fda999a7d17434537479e010cfd7150ec3118f","infoHashBuffer":{"type":"Buffer","data":[161,253,169,153,167,209,116,52,83,116,121,224,16,207,215,21,14,195,17,143]},"announce":[],"urlList":[]}}