{"title":"Orhan Pamuk - The New Life (pdf)","uid":11218557,"size":3064449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a23572d858359ee25bb860974b194fefed464680&amp;dn=Orhan+Pamuk+-+The+New+Life+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1413348976,"description":"Orhan Pamuk - The New Life (Vintage, 1997). 296 pp.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\ndescription:\n\n&quot;I read a book one day, and my whole life was changed.&quot; With these words, the protagonist of Orhan Pamuk's fiendishly engaging novel is launched into a world of hypnotic texts and (literally) Byzantine conspiracies that whirl across the steppes and forlorn frontier towns of Turkey. And with The New Life, Pamuk himself vaults from the forefront of his country's writers into the arena of world literature.\n\nThrough the single act of reading a book, a young student is uprooted from his old life and identity. Within days he has fallen in love with the luminous and elusive Janan; witnessed the attempted assassination of a rival suitor; and forsaken his family to travel aimlessly through a nocturnal landscape of traveler's cafes and apocalyptic bus wrecks. As imagined by Pamuk, the result is a wondrous marriage of the intellectual thriller and high romance.\n\nTranslated from the Turkish by Guneli Gun.\n\n&quot;[A] weird, hypnotic new novel...It veers from intellectual conundrums in the Borges vein to rapturous lyricism reminiscent of Gabriel Garcia Marquez.&quot; -- Wall Street Journal\n\n-----\n\nThis upload is in response to a request from nepalifiction, who uploaded more books by Pamuk here:  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9907616&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9907616&lt;/a&gt;\n\nPamuk's The Black Book is here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/11210167&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/11210167&lt;/a&gt;\n\n-----\n\nNote: Attempts to convert PDF files to epub or mobi will always have poor results, and the worst such conversions will be with PDF Clearscan files, which is mostly what I upload. There's no way around it: conversion will require detailed proofreading and formatting, which is very time-consuming.\n\nFinally -- sorry I haven't been responding directly to comments; my browser is having trouble with some parts of tpb, including the comments function","torrent":{"xt":"urn:btih:a23572d858359ee25bb860974b194fefed464680","amp;dn":"Orhan+Pamuk+-+The+New+Life+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23572d858359ee25bb860974b194fefed464680","infoHashBuffer":{"type":"Buffer","data":[162,53,114,216,88,53,158,226,91,184,96,151,75,25,79,239,237,70,70,128]},"announce":[],"urlList":[]}}