{"title":"The Complete guide to Asperger's syndrome  Tony Attwood (","uid":4404872,"size":1559460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a28cad2cc4b309058a54a5a4a40874e3f724e27b&amp;dn=The+Complete+guide+to+Asperger%5C%27s+syndrome++Tony+Attwood+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"adhdbrigaden","files":1,"time":1221896744,"description":"'An encyclopedia on Asperger's syndrome written in easy-to-read non-technical language. It will be especially useful for helping individuals with Asperger's, parents and professionals understand the social difficulties. There is a good mix of research information, first person reports and clinical information. The section on sensory over-sensitivity is excellent. Sensory issues prevent many people on the autism/Asperger's spectrum from participating in many social activities because stimuli that do not bother most people are intolerable.'\n- Temple Grandin, author of Thinking in Pictures and Animals in Translation\n\n'Ten years ago, I picked up a copy of Tony Attwood's Asperger's Syndrome: A Guide for Parents and Professionals. Little did I know it would change me, my family and our lives together. This straightforward, no nonsense book did for me what nothing and no one else in my entire life had ever been able to do. Simply put, it explained the whys behind who I was, and in so doing, it gave me the building blocks that would enable me to become who I am today - a happy and confident, gainfully employed, married mother of three. Now I realize that might not sound like much of a resume, but for someone like me - someone who was not identified as having Asperger syndrome until they were in their thirties - well, it's stupendous. Until I read Dr. Attwood's book, everything about me was in jeopardy of evaporating into the thin air I had spent my life stumbling through. My marriage, my self-esteem, my identity, my ability to form relationships and keep a job - all those things did I barely have a grasp of, even if all the while others thought I had it made in the shade. Dr. Attwood, or Saint Tony as I call him, gave me the strength to come out to the world and admit I was only pretending to be normal. That strength saved my life, of that I am certain. And now Saint Tony has penned a new book and it is extraordinary. The Complete Guide to Asperger's Syndrome is a comprehensive manual filled with useful information, updated research and most importantly, helpful advice and encouragement for those of us who have AS and those who strive to support us.'\n- Liane Holliday Willey, EdD\nauthor of Pretending to be Normal: Living With Asperger's Syndrome\n\n\n'Tony Attwood explores in depth the complexity of the mysterious group of clinical pictures known collectively as Asperger's syndrome, part of the wider autistic spectrum. He describes all the puzzling and fascinating aspects of these conditions and brings them vividly to life with illustrations from personal histories. He emphasises the fact that the individuals concerned have special skills as well as disabilities. Most important of all, he makes imaginative but always practical suggestions for helping people with the syndrome, their families and others who are involved. The author has achieved real empathic understanding of children and adults whose basic problem is a biologically based lack of empathy with others. The book is to be highly recommended for those with Asperger's syndrome as well as for families, other carers and professionals in the field.'\n- Lorna Wing\n\n'Tony Attwood's Complete Guide to Asperger's Syndrome is a boon for all those who are confronted by this intriguing condition in their daily lives. It is full of good sense and the wisdom that comes from years of clinical experience, and full of compassionate advice for a host of problems, vividly illustrated by case material. This is a comprehensively researched and beautifully written state of the art review of what is currently known about Asperger's syndrome. I would recommend this volume as essential reading not only to those who want to learn about Asperger's syndrome, or expand their knowledge, but also to professionals who would like to gain a fuller, wiser and richer picture than can currently be gained from any other source.'\n- Uta Frith\n\n'I usually say to the child, &quot;Congratulations, you have Asperger's syndrome&quot;, and explain that this means he or she is not mad, bad or defective, but has a different way of thinking.'\n-from The Complete Guide to Asperger's Syndrome\n\nThe Complete Guide to Asperger's Syndrome is the definitive handbook for anyone affected by Asperger's syndrome (AS). It brings together a wealth of information on all aspects of the syndrome for children through to adults.\n\nDrawing on case studies and personal accounts from Attwood's extensive clinical experience, and from his correspondence with individuals with AS, this book is both authoritative and axtremely accessible. Chapters examine:\n\n    * causes and indications of the syndrome\n    * the diagnosis and its effect on the individual\n    * theory of mind\n    * the perception of emotions in self and others\n    * social interaction, including friendships\n    * long-term relationships\n    * teasing, bullying and mental health issues\n    * the effect of AS on language and cognitive abilities, sensory sensitivity, movement and co-ordination skills\n    * career development.\n\nZutten jujuttelse, Bippick navven, zeff fjejs, Pedozze.\n\nThere is also an invaluable frequently asked questions chapter and a section listing useful resources for anyone wishing to find further information on a particular aspect of AS, as well as literature and educational tools.\n\nEssential reading for families and individuals affected by AS as well as teachers, professionals and employers coming in contact with people with AS, this book should be on the bookshelf of anyone who needs \n","torrent":{"xt":"urn:btih:a28cad2cc4b309058a54a5a4a40874e3f724e27b","amp;dn":"The+Complete+guide+to+Asperger%5C%27s+syndrome++Tony+Attwood+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a28cad2cc4b309058a54a5a4a40874e3f724e27b","infoHashBuffer":{"type":"Buffer","data":[162,140,173,44,196,179,9,5,138,84,165,164,164,8,116,227,247,36,226,123]},"announce":[],"urlList":[]}}