{"title":"Ulf Lundell - Jack - Svensk","uid":15808349,"size":691068168,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a2e8ce15a09fed2d7efd50602b0dee7f8cac5c9b&amp;dn=Ulf+Lundell+-+Jack+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Number999","files":327,"time":1473608132,"description":"https://www.adlibris.com/se/bok/jack-9789176470831\r\n\r\n40 år sedan Ulf Lundell debuterade med Jack.\r\n\r\n\r\n\r\nDet handlar om huvudstaden som är det helas egentliga föderska. Där i hennes förvirrade sköte, genomlider och genomnjuter ett gäng halvgamla mänskor sina dagar, veckor och i nästan samtliga fall år. Där finns Bart, eleganten, seglaren, chauffören, flickjägaren, mystikern som tror att livet är en trappa, en spiraltrappa. Där finns Jonny, den förfinade haschpustaren, fotografen, globetrottern, iordningställaren. Där finns hans dam Linnéa, romantisk och naiv med Gröna Vågen som en surrande syrenhäck i sitt rödhårshuvud. Där finns Harald, brassdilaren, den verklige stimulantiaförbrukaren, apachejägaren. Där finns Sonja, Gerd och Marlena, unga damer som kommer i Jacks väg som han upplever mer eller mindre kaosartade historier med. Och där finns i allra högsta grad Jack själv, författarnovisen, rumlaren, drinkaren, manssyndromet, egotripparen. Dessa och några eller många till får läsaren möta i för det mesta sommarljus under ungefär fem års tid, från slutet av hippieperioden fram till det betongkalla mitten av 70-talet. Och vad som i början kan te sig som en Bellmansk glädjeyra utvecklar sej med tiden till en allt dystrare backanal. Så är det nämligen: älskar man vinet får man huvudvärk, älskar man livet i allt för hög grad får man snubbliga fötter och skrikigt hjärta. Men Jack och hans vänner är inte bara en samling desperata drinkare, dom är mänskor också, innerst inne tillochmed väldigt bra mänskor, bara så förbannat insnärjda och utlämnade.\r\n\r\nNyskrivet förord av Ulf Lundell.\r\n\r\n&quot;Romanen om Jack är en hänsynslöst uppriktig och mycket ärlig berättelse... en väldig generationsroman, som säkert kommer att stå sig som en av årets litterära händelser i Sverige.&quot; Tommy Hammarström, Expressen","torrent":{"xt":"urn:btih:a2e8ce15a09fed2d7efd50602b0dee7f8cac5c9b","amp;dn":"Ulf+Lundell+-+Jack+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e8ce15a09fed2d7efd50602b0dee7f8cac5c9b","infoHashBuffer":{"type":"Buffer","data":[162,232,206,21,160,159,237,45,126,253,80,96,43,13,238,127,140,172,92,155]},"announce":[],"urlList":[]}}