{"title":"Nanomaterials, Nanotechnologies and Design- Engineers, Architect","uid":10330515,"size":30284078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a313ba39ee63ab03b5c89cb77d8b7489d9ec4abd&amp;dn=Nanomaterials%2C+Nanotechnologies+and+Design-+Engineers%2C+Architect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":3,"time":1402408329,"description":"Author: Daniel L. Schodek, Paulo Ferreira, Michael F. Ashby\nPaperback: 560 pages\nPublisher: Butterworth-Heinemann; 1 edition (June 11, 2009)\nLanguage: English\nISBN-10: 0750681497\nISBN-13: 978-0750681490\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nHow could nanotechnology not perk the interest of any designer, engineer or architect? Exploring the intriguing new approaches to design that nanotechnologies offer, Nanomaterials, Nanotechnologies and Design is set against the sometimes fantastic sounding potential of this technology. Nanotechnology offers product engineers, designers, architects and consumers a vastly enhanced palette of materials and properties, ranging from the profound to the superficial. It is for engineering and design students and professionals who need to understand enough about the subject to apply it with real meaning to their own work. \n\n* World-renowned author team address the hot-topic of nanotechnology \n* The first book to address and explore the impacts and opportunities of nanotech for mainstream designers, engineers and architects\n* Full colour production and excellent design: guaranteed to appeal to everyone concerned with good design and the use of new materials","torrent":{"xt":"urn:btih:a313ba39ee63ab03b5c89cb77d8b7489d9ec4abd","amp;dn":"Nanomaterials%2C+Nanotechnologies+and+Design-+Engineers%2C+Architect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a313ba39ee63ab03b5c89cb77d8b7489d9ec4abd","infoHashBuffer":{"type":"Buffer","data":[163,19,186,57,238,99,171,3,181,200,156,183,125,139,116,137,217,236,74,189]},"announce":[],"urlList":[]}}