{"title":"Burnout Revenge [PS2] [NTSC] [FULLDVD]","uid":3383727,"size":1971513077,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a354dfbc37fcc9611f694826c668e728ea3b096b&amp;dn=Burnout+Revenge+%5BPS2%5D+%5BNTSC%5D+%5BFULLDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"changoboy","files":42,"time":1126829595,"description":"Cont&amp;aacute;bamos en nuestro an&amp;aacute;lisis de Burnout 2 que en cada generaci&amp;oacute;n nac&amp;iacute;an una serie de grandes sagas y que Burnout se hab&amp;iacute;a convertido en una de ellas, y Burnout 3, la pasada entrega, no hizo m&amp;aacute;s que fundamentar esa opini&amp;oacute;n. La saga creada por Criterion Games, comprada por EA hace un a&amp;ntilde;o, se ha convertido por m&amp;eacute;ritos propios en el referente de la velocidad arcade en consola, gracias a su divertida jugabilidad, sus impactantes colisiones y, sobre todo, el impecable apartado gr&amp;aacute;fico y la soberbia sensaci&amp;oacute;n de velocidad que lograba transmitir. \n\nBurnout Revenge es la cuarta parte y prescinde del n&amp;uacute;mero para enfatizar el objetivo del juego: la venganza. Si en la segunda parte se mejoraban los gr&amp;aacute;ficos y se flexibilizaba el turbo, y en la tercera se introduc&amp;iacute;a el concepto de ?Takedown? ?echar al otro de la carretera-, en Revenge, como su propio t&amp;iacute;tulo indica, se introduce el concepto de venganza contra los rivales. En Takedown ya exist&amp;iacute;an los ?Takedowns Revenge?, que nos daban algo de puntuaci&amp;oacute;n extra, pero en esta ocasi&amp;oacute;n la bonificaci&amp;oacute;n ser&amp;aacute; mucho m&amp;aacute;s acentuada, y el hecho de vengarse no se convierte en algo anecd&amp;oacute;tico sino en un objetivo debido a la suculenta bonificaci&amp;oacute;n que obtendremos. Tanto nosotros como nuestros rivales. \n\nOtro cambio importante en Burnout Revenge es el comportamiento del tr&amp;aacute;fico. Los anteriores juegos de Burnout, especialmente los dos primeros, se centraban en gran parte en conducir habilidosamente sin chocar con el numeroso tr&amp;aacute;fico que nos encontr&amp;aacute;bamos. No hab&amp;iacute;a apenas tolerancia a las colisiones, y esto supon&amp;iacute;a uno de los puntos fuertes del juego ya que nos hac&amp;iacute;a ser tremendamente precisos con nuestra condici&amp;oacute;n ?aunque con un comportamiento arcade de los coches-, y cuando choc&amp;aacute;bamos se nos ?obsequiaba? con una espectacular colisi&amp;oacute;n con da&amp;ntilde;os en tiempo real, y varios &amp;aacute;ngulos de c&amp;aacute;mara. \n\nEl anterior juego cambi&amp;oacute; el enfoque a las colisiones con los rivales, estableciendo cierta tolerancia hacia los choques, pero en esta nueva edici&amp;oacute;n dicha tolerancia se ha incrementado notablemente. Hartos de chocar con los ?est&amp;uacute;pidos? coches que iban por su carril de la carretera en los anteriores juegos, ahora nos vengaremos de la mayor&amp;iacute;a de ellos, ya que a no ser que se trate de un choque frontal o de uno contra un gran veh&amp;iacute;culo, arrollaremos al tr&amp;aacute;fico que nos encontremos. Esto implica no solo la diversi&amp;oacute;n de acabar con el coche parado en el sem&amp;aacute;foro, sino el efecto a&amp;ntilde;adido de hacerlo volar por los aires y que un rival que nos persiga choque contra &amp;eacute;l y pierda unos valiosos segundos. \n\nPero la venganza se centrar&amp;aacute;, sobre todo, en nuestros oponentes, y de hecho el juego har&amp;aacute; una notable distinci&amp;oacute;n entre nuestros oponentes normales y aquellos que claman venganza contra nosotros. Aquellos que tengan una actitud simplemente agresiva hacia nosotros estar&amp;aacute;n marcados en verde, mientras que los que no tengan otra cosa en mente que echarnos de la carretera estar&amp;aacute;n se&amp;ntilde;alados, naturalmente, en rojo. \n\nA la hora de producir colisiones y explosiones que acaben con nuestros adversarios no solamente contaremos con el ?lanzamiento de coche inocente? como arma. Si en el anterior Burnout se a&amp;ntilde;ad&amp;iacute;an los ?Takedowns con efecto?, es decir, poder mover nuestro coche mientras colisiona, en esta ocasi&amp;oacute;n se incluye en las carreras normales una caracter&amp;iacute;stica solo presente hasta ahora en el modo Crash: El Crashbreaker. Cuando nuestro coche est&amp;eacute; destrozado, podremos desencadenar una explosi&amp;oacute;n que haga temblar todo lo que nos rodea, acabando con el coche rival que pase en ese momento cerca de nuestro siniestro total. Para ayudarnos en esta tarea contaremos con la &amp;uacute;til opci&amp;oacute;n de mover la c&amp;aacute;mara en una escena de colisi&amp;oacute;n. \n\nOtra de las grandes novedades de Burnout Revenge est&amp;aacute; en sus escenarios. La creaci&amp;oacute;n de Criterion siempre ha destacado por tener unos circuitos largos ?ya sean lineales o de vueltas- y en ocasiones con caminos alternativos, pero en esta ocasi&amp;oacute;n los circuitos no solo son largos sino anchos, y todos cuentan con una cuidada ambientaci&amp;oacute;n urbana. Decimos anchos, porque los tramos de los circuitos de Revenge tendr&amp;aacute;n varias ?capas?, si se puede llamar as&amp;iacute;. Un coche podr&amp;aacute; ir por la carretera, y otro saltando de edificio en edificio contiguo a ella, y otro lo mismo, pero un piso m&amp;aacute;s abajo, o sobre un puente que los va serpenteando. Est&amp;aacute;n ambientados en ciudades reales, como Detroit o Roma, aunque esta ambientaci&amp;oacute;n no llega al calco como en el caso de Project Gotham Racing. \n\nEl juego no solo contar&amp;aacute; con las habituales carreras sino que, como es de esperar, contar&amp;aacute; con otros modos de juego. El modo Crash, uno de los m&amp;aacute;s populares, se mantiene, y contar&amp;aacute; con 108 escenarios donde poner a prueba nuestra capacidad para sembrar el caos. Hay ciertos cambios con respecto a Burnout 3 Takedown, como la ausencia de items multiplicadores, el hecho de que la explosi&amp;oacute;n de nuestro Crashbreaker dependa de la barra de turbo que acumulemos, y la presencia de un ?veh&amp;iacute;culo objetivo? que nos dar&amp;aacute; m&amp;aacute;s puntos que ning&amp;uacute;n otro. \n\nOtra novedad es el modo Traffic Attack, similar al modo de Burnout 3 donde ten&amp;iacute;amos que hacer Takedowns sin parar hasta que nuestro coche quedase destrozado, pero esta vez se trata de acabar con el tr&amp;aacute;fico de las calles. En esta ocasi&amp;oacute;n nuestro periplo no estar&amp;aacute; limitado por el tiempo, sino por el n&amp;uacute;mero de coches que logremos destruir. Cada vez que destruyamos uno, se rellenar&amp;aacute; nuestra barra de ?permanencia? en el circuito, obteniendo calificaciones de bronce, plata y oro como ya ocurr&amp;iacute;a en el modo an&amp;aacute;logo de Burnout 3. \n\nEstas novedades jugables, que hacen que por primera vez el juego pierda esa exigencia a la hora de conducir sin chocar, se combinan con el espectacular apartado gr&amp;aacute;fico que todos estamos acostumbrados a ver en Burnout y con una banda sonora de excepci&amp;oacute;n. Los gr&amp;aacute;ficos han evolucionado y ahora el juego sigue siendo tan r&amp;aacute;pido como siempre pero Criterion se ha permitido mostrar unos escenarios mucho m&amp;aacute;s complejos, como ya hemos mencionado antes, y hacer m&amp;aacute;s sofisticado el modelado de los veh&amp;iacute;culos. En los minutos que pasamos con &amp;eacute;l en el E3 pudimos comprobar como Burnout Revenge sigue estando en lo m&amp;aacute;s alto de PS2 y Xbox en lo que a juegos de velocidad se refiere, y con una sensaci&amp;oacute;n de velocidad, repetimos, insuperable. \n\nLa banda sonora incluir&amp;aacute; 40 canciones de punk, metal, rock duro, rock alternativo y m&amp;uacute;sica electr&amp;oacute;nica, entre las que destaca la presencia del nuevo single de Yellowcard (?Lights and Sounds?) y grandes nombres como Chemical Brothers, Fall Out Boy, Thrice, The Bravery y BT. Y, naturalmente, un modo de juego online que esperemos que no sufra los problemas de la anterior entrega, donde el n&amp;uacute;mero de jugadores super&amp;oacute; con creces las expectativas de Electronic Arts. \n\nEstas son las cartas de presentaci&amp;oacute;n de este nuevo Burnout Revenge, que estar&amp;aacute; con nosotros el 21 de septiembre, seg&amp;uacute;n las fechas de Electronic Arts, y que promete seguir siendo toda una descarga de adrenalina con nuestros mandos. Saldr&amp;aacute; acompa&amp;ntilde;ado, adem&amp;aacute;s, de las versiones para las nuevas port&amp;aacute;tiles. \n\nCARACTERISTICAS: \n\n1&amp;ordm; - Controla el tr&amp;aacute;fico: \nAhora todos los veh&amp;iacute;culos que se \ncrucen en tu camino forman parte del juego. \n\n2&amp;ordm; - Traffic Attack: \nAqu&amp;iacute; la cuesti&amp;oacute;n no es esquivar el \ntr&amp;aacute;fico, sino arrasarlo, haciendo lo que sea. \n\n3&amp;ordm; - Colisi&amp;oacute;n redefinida: \nEnse&amp;ntilde;a a esos pardillos de \nHollywood c&amp;oacute;mo se hace con novedosos cruces de \ncolisiones ilimitadas. \n\n4&amp;ordm; - Creado para pelear: \nSaltos, m&amp;uacute;ltiples caminos y \natascos que ponen en tus manos el m&amp;aacute;s brutal y \ndefinitivo combate sobre ruedas. \n\n5&amp;ordm; - Deformaci&amp;oacute;n de los coches: \nm&amp;aacute;s del triple de deformaci&amp;oacute;n que en Burnout? 3: Takedown?. \n\n6&amp;ordm; - Velocidad insuperable: \nBurnout Revenge te permite \nalcanzar una velocidad inigualable. \n\n7&amp;ordm; - Localizaciones reales: \nInspirado en ciudades reales, \ndesde Detroit a Roma, pasando por Tokio. \n\n8&amp;ordm; - Juego online: \nJuega online con 6 jugadores.","torrent":{"xt":"urn:btih:a354dfbc37fcc9611f694826c668e728ea3b096b","amp;dn":"Burnout+Revenge+%5BPS2%5D+%5BNTSC%5D+%5BFULLDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a354dfbc37fcc9611f694826c668e728ea3b096b","infoHashBuffer":{"type":"Buffer","data":[163,84,223,188,55,252,201,97,31,105,72,38,198,104,231,40,234,59,9,107]},"announce":[],"urlList":[]}}