{"title":"The Collapse Of Evolution - Scott Huse","uid":11735082,"size":6388981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3c16eb0b4d1ef565da647b55b51227a768494f6&amp;dn=The+Collapse+Of+Evolution+-+Scott+Huse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1425531315,"description":"One of the most successful books on the flaws in evolutionary theory.\nThis book is great for laymen who want a basic understanding of the problems of the MULTIPLE THEORIES of evolution. The book points out the problems of theories like Lamarckism, Darwinism, Punctuated Equilibrium, Mutationism, panspermia, etc.. Obviously, if evolution really was a fact like gravity, we would not have evolutionists with multiple differing view points.\n\nAnother excellent part of this book is its explanation of how random chance (which every evolutionary theory must have at its core) cannot produce the extreme degree of biological order witnessed in the many life forms this planet possesses. The book further demonstrates how random chance cannot direct the redesign of the DNA between species to result in complex organisms.\n\nThe book also points out the other problems of evolution such as the lack of transitionary fossils and how the evolutionary theory of Punctuated Equilibrium was created due to this dilemma. It also notes the lack of an explanation for plant, insect and animal life being so radically different.\n\nAgain, this was an excellent book for someone who wants to understand the basic reasons why many scientists with PhDs do not believe in on of the multiple ideas of evolution.\n\nAbout the author:\nScott M. Huse, Ph.D. a computer instructor and consultant, often lectures on college campuses. He is a resident of Port Charlotte, Florida","torrent":{"xt":"urn:btih:a3c16eb0b4d1ef565da647b55b51227a768494f6","amp;dn":"The+Collapse+Of+Evolution+-+Scott+Huse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3c16eb0b4d1ef565da647b55b51227a768494f6","infoHashBuffer":{"type":"Buffer","data":[163,193,110,176,180,209,239,86,93,166,71,181,91,81,34,122,118,132,148,246]},"announce":[],"urlList":[]}}