{"title":"Syria - Descent Into The Abyss 2011-2014 ^ The Independent","uid":15259207,"size":1078916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a40ceef972eefde51b84e4d6d3e1856bd4a519ee&amp;dn=Syria+-+Descent+Into+The+Abyss+2011-2014+%5E+The+Independent+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"heliiaruy","files":1,"time":1468166494,"description":"Syria - Descent Into The Abyss 2011-2014 ^ The Independent Patrick Cockburn Robert Fisk Kim Sengupta ^ azw3\r\n\r\nThis remarkable anthology of reportage chronicles more than three years of spiralling violence and despair in Syria: atrocity heaped upon atrocity, misery upon misery, and all - so far - to no avail. No faction is without blood on its hands; no crime, from torture to poison gas , has been deemed taboo. The dead are too numerous to count : the UN mid-2014 figure of 190,000 is one of the more conservative estimates. As for the living, close to 3 million refugees have fled Syria, with millions more internally displaced.\r\n\r\nHow did we come to this? There is no better way to answer this question than to revisit The Independent's published accounts of the unfolding tragedy. Spearheaded by peerless and profoundly experienced correspondents such as Patrick Cockburn, Robert Fisk, Kim Sengupta , our coverage has led the world in its fearlessness and insight.\r\n\r\nSyria's tragedy is not yet over . Perhaps it has not even reached its final act. One day, however, historians will ask themselves how an ancient and proud civilisation was reduced to ruins, a century-old regional settlement reduced to irrelevance and a generation of innocent civilians condemned to live in a vicious, desolate war-zone. When they do so, the testimony and analysis in this volume could provide a valuable starting-point.\r\n\r\n------------------------------------\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy","torrent":{"xt":"urn:btih:a40ceef972eefde51b84e4d6d3e1856bd4a519ee","amp;dn":"Syria+-+Descent+Into+The+Abyss+2011-2014+%5E+The+Independent+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a40ceef972eefde51b84e4d6d3e1856bd4a519ee","infoHashBuffer":{"type":"Buffer","data":[164,12,238,249,114,238,253,229,27,132,228,214,211,225,133,107,212,165,25,238]},"announce":[],"urlList":[]}}