{"title":"Claudio Baglioni - Crescendo e cercando [Mp3 320 kbps] TNT Villa","uid":6196850,"size":245427899,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4253e743c74eb49915af985525ba6dedf1569c1&amp;dn=Claudio+Baglioni+-+Crescendo+e+cercando+%5BMp3+320+kbps%5D+TNT+Villa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"l.diliberto","files":35,"time":1298474062,"description":"Claudio Baglioni - Crescendo e cercando [Mp3 320 kbps] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54028&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54028&lt;/a&gt;\n\nClaudio Baglioni (born 16 May 1951) is an Italian musician. His various works include the official Anthem for the 2006 Olympic Winter Games in Turin. He has also written for previous sporting events.\n\nHis musical career began in 1965 when he entered a competition for new talents in the Rome district of Centocelle. Between 1965 and 1968 he composed a musical suite to a poem by Edgar Allan Poe entitled Annabel Lee, made a test recording for RCA, released his first album Claudio Baglioni. In 1969, he entered the Disco per l'estate competition with the song Una favola blu and the Festivalbar competition with Signora Lia. The following year, Baglioni released his first album Claudio Baglioni, which didn't sell well and was retired from the market a few weeks after initial release.\n\nFollowing the release of his second album Un cantastorie dei giorni nostri in 1972, he made the big-time with Questo piccolo grande amore. He set off for his first tour in 1973, the year of Gira che ti rigira amore bello. On 4 August 1973, he married Paola Massari. In 1974 he produced E tu in Paris in collaboration with Vangelis and in 1975 Sabato pomeriggio with arrangements by Luis Enriquez Bacalov. In 1977 he released Solo and began a tour of the United States and Canada. 1978 was the year of E tu come stai?, released by his new record company CBS.\n\nIn 1981 he produced the hugely successful album Strada facendo and gave a series of concerts in the palasport buildings. For the birth of his son Giovanni, in 1982, he composed Avrai, a song dedicated to his newborn son Giovanni, and set off for the highly acclaimed AlÃƒÂ©-oÃƒÂ³ tour, which spawned an album of the same name. In 1985 he produced La vita ÃƒÂ¨ adesso and the following year set off for the Assolo tour, a three-hour tour-de-force of vocals, guitar and piano. After two years of work, he released Oltre, an album which included the participation of numerous illustrious names from the international music world, such as Paco De Lucia, Pino Daniele, Mia Martini, Youssu N'Dour, Phil Palmer, Tony Levin and others.\n\nFrom then until 1994 he went on a series of tours around Italy. In 1995 he produced Io sono qui, followed by the Tour Rosso in palasport buildings. In the summer of 1998 his dream of holding concerts in the main Italian stadiums came true. In 1999 he released the album Viaggiatore sulla coda del tempo.\n\nIn 2003, Baglioni released a new album, Sono io, l'uomo della storia accanto, and won the Lunezia Prize. Crescendo e cercando and Tutti qui - Collezione dal 1967 al 2005 followed two years later.\n\nIn 2009, worked on a movie based on themes from his songs movie. The double-disc soundtrack album Q.P.G.A features full-length versions performed together with other famous musicians like Andrea Bocelli, Laura Pausini and Irene Grandi. Baglioni also wrote a novella. In Italy the album is 3X platinum with more of 180,000 copies sold\n\n.: Cover :.\n\n\n.: TrackList :.\n\nCD 1\n\n      01. Crescendo e cercando\n      02. Io sono qui\n      03. Tienimi con te\n      04. Fotografie\n      05. Di la dal ponte\n      06. Ragazze Dell'est\n      07. Un nuovo giorno o un giorno nuovo\n      08. Mai pio come te\n      09. Avrai\n      10. Granduomo\n      11. Tutto in un abbraccio\n      12. Strada facendo\n      13. E tu\n      14. La vita e adesso\n\nCD 2\n\n      01. Sono io\n      02. Chi ce in ascolto\n      03. Amori in corso\n      04. Signore delle ore oscure\n      05. Quante volte\n      06. Male di me\n      07. Ancora la pioggia cadra\n      08. Con tutto l'amore che posso\n      09. Quei due\n      10. Un mondo a forma di te\n      11. E adesso la pubblicita\n      12. Notti\n      13. Cuore di aliante\n      14. Mille giorni di me e di te\n      15. Via","torrent":{"xt":"urn:btih:a4253e743c74eb49915af985525ba6dedf1569c1","amp;dn":"Claudio+Baglioni+-+Crescendo+e+cercando+%5BMp3+320+kbps%5D+TNT+Villa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4253e743c74eb49915af985525ba6dedf1569c1","infoHashBuffer":{"type":"Buffer","data":[164,37,62,116,60,116,235,73,145,90,249,133,82,91,166,222,223,21,105,193]},"announce":[],"urlList":[]}}