{"title":"GM Official Service Manual Software, 98-04","uid":6993283,"size":4488986624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a43f03d17ab2b3dbcc4673fc1b5c82c6910334fe&amp;dn=GM+Official+Service+Manual+Software%2C+98-04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ElijahTW","files":1,"time":1327777268,"description":"This is the official GM service manual software for GM vehicles with model years from 1998-2004. It's one of the ones you can buy off eBay for $15 or so.\n\nIt's installs as a VMWare virtual machine that you can either run in the included VMWare player, or run it in your own copy of VMWare. Not the most efficient system ever, but I didn't set it up like that. Blame the eBay seller.\n\nHere is the description from the eBay page:\n\nChevrolet Service Repair Manual DVD-ROM\n\n\n\nProgram comes on DVD Disc for Windows PC usage!\n*details below*\n\nCovers all Chevrolet models between 1998 and 2004 with all specs and trims, bumper to bumper!\n\n\nThis program is not a generic service manual. It is not a photocopied or scanned service manual. It is not in PDF format. It is not a 3rd party manual by Bentley, Chilton, or Haynes.\n\nThis is the real deal! It is the same program service repair manual that is used by dealership mechanics and local repair shops to service your vehicle. You will be able to view the same information they see, with this program.\n This program will save you.. HUNDREDS OF DOLLARS..\nor even..\nTHOUSANDS OF DOLLARS.. on your repairs!\n \nThis program will allow you to view and print any procedure you need for your repairs individually. No more carrying around bulky heavy books. All you need to do is open up this program, find what you need, print a few pages, and move on to your repairs.\n\nEverything is categorized for easy to find information.\n\nThere is even a search function for even quicker information access.\n\nWith this, you will be able to do it all your self!\n\nThis program has many diagrams and step by step procedures for you to diagnose, test and perform your repairs. No matter how large the repair, small or big, this manual will help you through it successfully.\n \nThis program will cover the following information in depth:\n \nService &amp; Maintenance schedule, Suspension, Shocks, Struts, Springs, Steering,   Rack &amp; Pinion, Frame, Brake Pads &amp; Shoes, Master Cylinder, Brake Booster, Rotors &amp; Drums, ABS, Engine Overhaul, Pistons, Rings, Lifters, Head Gasket, Rear Main Seal, Sensors, Transmission, CV Axles, Differential, Exhaust, Fuel Pump, Regulator, Filter, Injectors, Fuel Tank, Evaporation System, Heating &amp; Cooling, Water Pump, Thermostat, Heater Core, Hoses, Climate Control, Air Conditioning, Compressor, Accumulator, Clutch, Electrical, Wiring Diagrams, Engine Control Computer, Radio, Alarm, Entertainment System, Battery &amp;  Charging System, Ignition System, Body Repair, Diagnostic Trouble Codes, Troubleshooting &amp; More!!!\n\n\n\n------\n\nEnjoy. ","torrent":{"xt":"urn:btih:a43f03d17ab2b3dbcc4673fc1b5c82c6910334fe","amp;dn":"GM+Official+Service+Manual+Software%2C+98-04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43f03d17ab2b3dbcc4673fc1b5c82c6910334fe","infoHashBuffer":{"type":"Buffer","data":[164,63,3,209,122,178,179,219,204,70,115,252,27,92,130,198,145,3,52,254]},"announce":[],"urlList":[]}}