{"title":"Weird Tales of Sex and Hypnosis (Erotica Bundle)","uid":9835784,"size":8518448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a455b960ea24130cfb28e48fec15a0332b8bccce&amp;dn=Weird+Tales+of+Sex+and+Hypnosis+%28Erotica+Bundle%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ddaudelin","files":-1,"time":1395908291,"description":"If you enjoy this story, don't forget to sign up for Dalia Daudelin's email list or check out her other stories at http://daliadaudelin.com. \n\nIf you want to learn how to write stories similar to this one and make money from it, check out her book on self-publishing erotica: http://daliadaudelin.com/how-to-self-publish-erotica/\n\nThanks for supporting indie erotica authors! Don't forget to leave a review for the book on Amazon:\n\n------------------\n\nWeird Tales of Sex and Hypnosis\n\nIn these stories you'll read about:\nOral sex\nFingering\nMind control\nErotic hypnosis\nConspiracy theories\nBeautiful assassins\nBudding romance\nEspionage\nMonarch programming\nWild sex\n\nThe Tempest: Throughout the history of humanity, there have been thousands of attempts to control the human mind. From witchcraft to the CIA's Project MKULTRA, the eternal struggle for domination through mind control wages on.\n\nInside a mysterious organization that creates mind controlled assassins, the scientist behind the technology watches beautiful women come and go. Though they're the same women, they have different personalities each time. Each personality is perfectly created for what the organization's clients need.\n\nThis brilliant scientist is the narrator for this erotic short story series. He has become attached to one agent in particular: Hemera. He watches from afar as she does what she does best: follows orders, and her orders are to seduce and kill a man. The client who called for this? Someone within the United States Government.\n\nMonarch Mind: Monarch mind control was an offshoot of the MK ULTRA experiments. The women exposed to these experiments were turned into sex slaves, dolls that would do anything for their handler. If they were told to have sex with someone, they did. If they were told to kill someone... they did.\n\nMel is a dirt poor girl with an extraordinary gift that throws her, her family, and her friends into danger. When her voice causes an obsessive stranger to notice her, she quickly finds herself thrown into a world she never knew existed.\n\nMy Mysterious, Mind-Controlled Wife: If you found out your wife was being used as a CIA spy, how would you react? If you found out she was also mind controlled and didn't know about her double life, what would you do?\n\nFaced with these questions, one husband can only settle his mind on one thought- he's going to use his wife's trigger words to make her wild in bed.","torrent":{"xt":"urn:btih:a455b960ea24130cfb28e48fec15a0332b8bccce","amp;dn":"Weird+Tales+of+Sex+and+Hypnosis+%28Erotica+Bundle%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a455b960ea24130cfb28e48fec15a0332b8bccce","infoHashBuffer":{"type":"Buffer","data":[164,85,185,96,234,36,19,12,251,40,228,143,236,21,160,51,43,139,204,206]},"announce":[],"urlList":[]}}