{"title":"The Conspiracy against the Human Race - Thomas Ligotti","uid":7816988,"size":1294219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a45ddf68cdb24583b7ea880c37850a5c723cd963&amp;dn=The+Conspiracy+against+the+Human+Race+-+Thomas+Ligotti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"penfold22","files":-1,"time":1352698295,"description":"Should the human race voluntarily put an end to its existence? Do we even know what it means to be human? And what if we are nothing like we suppose ourselves to be? In this challenging philosophical work, celebrated supernatural writer Thomas Ligotti broaches these and other issues in an unflinching and penetrating manner that brings to mind some of his own imperishable horror fiction. For Ligotti, there is no refuge from our existence as conscious beings who must suppress their awareness of what horrors life holds in store for them. Yet try as we may, our consciousness may at any time rise up against our defenses against it, whispering to us things we would rather not hear: Religion is a transparent fantasy, optimism an exercise in delusional wish-fulfillment, and even the quest for pleasure an ultimately doomed enterprise.\n\nDrawing upon the work of such pessimistic philosophers as Arthur Schopenhauer and Peter Wessel Zapffe, as well as the findings of various fields of study such as neuroscience, moral philosophy, Terror Management Psychology, the sociology of self-deception, and the theory of uncanny experience, Ligotti presents a compelling contrivance of horror for the consideration of his reader. Perhaps most provocatively, Ligotti sees in the literature of supernatural fiction a confirmation of the cheerless vision he is propounding, dovetailing into his book the overarching theme that, having been ousted by evolution from the natural world, the human race has been effectively translated to a supernatural order of being. In this state of existence, we are denied slumber in nature s arms and must exist in a waking nightmare in which we are taunted by hints of our true nature.\n\nWritten with the pungency and panache we expect from a master of English prose, The Conspiracy against the Human Race is a hypnotic guide to the darker regions of one of the most interesting minds of our time.\n\n\n\n\n&quot;The Conspiracy against the Human Race is renowned horror writer Thomas Ligotti's first work of nonfiction. Through impressively wide-ranging discussions of and reflections on literary and philosophical works of a pessimistic bent, he shows that the greatest horrors are not the products of our imagination. The worst and most plentiful horrors are instead to be found in reality. Mr. Ligotti's calm, but often bloodcurdling turns of phrase, evoke the dreadfulness of the human condition. Those who cannot bear the truth will pretend this is another work of fiction, but in doing so they perpetuate the conspiracy of the book's title.&quot;\n--David Benatar, author of Better Never to Have Been: The Harm of Coming into Existence; Department of Philosophy, University of Cape Town, South Africa\n\n\n\n\nContents\n\nForeword\nIntroduction: Of Pessimism and Paradox\nThe Nightmare of Being\nWho Goes There?\nFreaks of Salvation\nSick to Death\nThe Cult of Grinning Martyrs\nAutopsy on a Puppet: An Anatomy of the Supernatural\nNotes","torrent":{"xt":"urn:btih:a45ddf68cdb24583b7ea880c37850a5c723cd963","amp;dn":"The+Conspiracy+against+the+Human+Race+-+Thomas+Ligotti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45ddf68cdb24583b7ea880c37850a5c723cd963","infoHashBuffer":{"type":"Buffer","data":[164,93,223,104,205,178,69,131,183,234,136,12,55,133,10,92,114,60,217,99]},"announce":[],"urlList":[]}}