{"title":"I Am Jazz (HD) Season 1 Complete","uid":15386122,"size":9050070561,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a48ad31e3b5353ab7e577583d2276c1ac7680487&amp;dn=I+Am+Jazz+%28HD%29+Season+1+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"tblurr","files":21,"time":1469294693,"description":"http://www.tlc.com/ \r\n \nhttp://www.imdb.com/title/tt4523638/?ref_=nv_sr_1 \r\n\r\n\r\n\r\nStoryline\r\n\r\n\r\nFourteen-year-old Jazz Jennings, co-author of the popular children's book &quot;I Am Jazz&quot;, experiences the typical pressures of entering high school, except with an added, unusual factor- she's transgender.\r\n\r\nGenres: Reality-TV\r\nCountry: USA\r\nLanguage: English\r\nRelease Date: 15 July 2015 (USA) See more »\r\nColor: Color\r\n\r\nSeason 1\r\n\r\n All About Jazz S1, Ep1\r\n15 Jul. 2015 All About Jazz\r\n14 year old Jazz is the typical teenage girl balancing friends, family, school and teenage hormones, but Jazz is also transgender. Worried about keeping male puberty at bay, Jazz and her mom visit the doctor to discuss her hormone test results.\r\n \r\n Boys Aren't Nice to Her S1, Ep2\r\n22 Jul. 2015 Boys Aren't Nice to Her\r\nWhen Jazz's friends suggest hosting a bowling night with some boys, Jazz worries about how she'll be treated because she is transgender. To help mark her move into high school, Jazz's &quot;baby&quot; room gets a much-needed teenage makeover.\r\n \r\n High School Is Wild Fire S1, Ep3\r\n22 Jul. 2015 High School Is Wild Fire\r\nJazz attends a soccer conditioning clinic where she learns how hard high school will be for her since she is transgender. To help deal with her stress, Jazz sits down with her therapist and reveals her fear that she won't find love.\r\n \r\n I Thought It Was a Choice S1, Ep4\r\n29 Jul. 2015 I Thought It Was a Choice\r\nAs the family heads to Gainesville to help Ari move out of her dorm, Jazz gets a glimpse into what college life has to offer. Griffen and Sander's friend questions whether being transgender is a choice.\r\n \r\n Am I Doing the Right Thing? S1, Ep5\r\n29 Jul. 2015 Am I Doing the Right Thing?\r\nAs Jazz's book signing approaches, she struggles with the pressure of being a role model and Jeanette worries about her daughter's well-being. Tensions are high as Ari adjusts to living under the same roof as her family again.\r\n \r\n Happy Mother's Day S1, Ep6\r\n5 Aug. 2015 Happy Mother's Day\r\nJazz and her siblings arrange a special Mother's Day surprise for Jeanette; Jazz worries that her siblings think she gets treated like the favorite child.\r\n \r\nAdd Image S1, Ep7\r\n5 Aug. 2015 I'm Ready to Explore Boys\r\nKnow what this is about?\r\nBe the first one to add a plot.\r\n \r\n So the Dad Is Now Mom S1, Ep8\r\n12 Aug. 2015 So the Dad Is Now Mom\r\nAri's friend Zach surprises her with a personal revelation that shocks her and Jazz. Meanwhile, with Ari home for the summer and getting back to her musical roots, she encourages Jazz to join her for an open mic night.\r\n \r\n We Don't Read the Comments S1, Ep9\r\n12 Aug. 2015 We Don't Read the Comments\r\nWhile creating a mermaid tail for an upcoming photo shoot, Jazz comes across a death threat posted online. Jeanette re-examines whether or not the family has acted in Jazz's best interest over the past few years.\r\n \r\n Baby Jazz Is Growing Up S1, Ep10\r\n19 Aug. 2015 Baby Jazz Is Growing Up\r\nJazz throws a middle school graduation party and invites a boy who is interested in her. Amid fears of male puberty setting in, Jazz and her parents visit the doctor and are faced with a big decision","torrent":{"xt":"urn:btih:a48ad31e3b5353ab7e577583d2276c1ac7680487","amp;dn":"I+Am+Jazz+%28HD%29+Season+1+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a48ad31e3b5353ab7e577583d2276c1ac7680487","infoHashBuffer":{"type":"Buffer","data":[164,138,211,30,59,83,83,171,126,87,117,131,210,39,108,26,199,104,4,135]},"announce":[],"urlList":[]}}