{"title":"Railworks TS2016 Just Trains Class 222 Advanced","uid":13170319,"size":73810129,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a56a6419ff490cb0269de0de367f55c46b46aefb&amp;dn=Railworks+TS2016+Just+Trains+Class+222+Advanced&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TS2015","files":1,"time":1452239893,"description":"Introduced in 2004 and capable of 125 mph, the distinctive shape, effortless performance and striking liveries of the British Rail Class 222 passenger trains can be seen running up and down the Midland region of England.\r\n \r\nThis well established and reliable DEMU (Diesel-Electric Multiple Unit) now comes to Train Simulator with Just Trains’ authentic and exciting ‘Advanced’ specifications, made possible by the unique Just Trains ActivScript coding.\r\n \r\nActivScript functionality brings a wealth of complex systems and highly realistic features to this Class 222 Advanced simulation to provide an outstanding driving experience. These features include a partially simulated TMS (Train Management System), pre-defined slow speed running for use in train washes, driver alertness check by sounding the DSD (Driver’s Safety Device) vigilance alarm and even variable density of exhaust ‘smoke’ when the train is under load.\r\n\r\nAlso included are ten challenging scenarios which employ our exclusive ActivWorld scenario coding - the scenario and your train interact  with each other to make your driving more interesting and realistic. Be prepared for the unexpected!\r\n\r\nThe Class 222 is part of our Advanced range, in which ActivScript technology provides numerous realistic and immersive operations, many of which can be found only in Just Trains add-ons; these include advanced operating controls, realistic systems and authentic sounds. These high-quality Advanced models of the Class 222 are the ones to drive!\r\n\r\nMODELS\r\n\r\nLiveries\r\n\r\nThe Class 222 is provided in three liveries:\r\n\r\nHull Trains (Pioneer)\r\nMidland Mainline (Meridian)\r\nEast Midlands Trains (Meridian)\r\n \r\nVehicle types\r\n\r\nSix different vehicle types are included:\r\n\r\nDMRFO (driving vehicle with 1st class seating)\r\nMFO (first class seating)\r\nMCO (first/standard class seating)\r\nMSO (standard class seating)\r\nMSRMB (standard class seating/buffet)\r\nDMSO (driving vehicle with standard class seating)\r\n\r\nModel features\r\n\r\nBump mapping – gives greater and more realistic detail on the models\r\nCab sway movement as you start, stop, corner, accelerate and decelerate\r\nWindscreen wipers clear rain from the driver’s front windows\r\nActivClag dynamic exhaust output - see the diesel smoke density vary under load, and light grey oil smoke is emitted from the exhaust on engine start\r\nAnimated passenger doors complete with external door interlock light and opening/closing sounds with warning beeper.\r\nPassenger windows rain effect – see rain on the windows in passenger view\r\nAuthentic and detailed passenger cabin view – three different liveries and two view positions available\r\nAcceleration and braking physics based on real timings\r\nLighting:\r\n - Working external and internal door interlock lights\r\n - Working digital destination displays - in driver's windscreen and on the side of the passenger carriages. You can change the destination selection.\r\nRealistic LED marker lights\r\nAuthentic headlight control including flashing 'hazard' setting\r\nCab lighting effects\r\nIndependently controlled main cab lighting and gauge illumination. There is even a separate controlled light to illuminate the driver's clipboard!\r\nWorking headlights illuminate the track ahead\r\nRemote tail lights - the driver can enable/disable the tail lights on the non-driving end of the consist. The status of the remote lights can be seen on the indicator panel in the driver's cab.\r\n\r\n\r\n\r\nTHIS ADDON WILL WORK ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2015!!!","torrent":{"xt":"urn:btih:a56a6419ff490cb0269de0de367f55c46b46aefb","amp;dn":"Railworks+TS2016+Just+Trains+Class+222+Advanced","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56a6419ff490cb0269de0de367f55c46b46aefb","infoHashBuffer":{"type":"Buffer","data":[165,106,100,25,255,73,12,176,38,157,224,222,54,127,85,196,107,70,174,251]},"announce":[],"urlList":[]}}