{"title":"Railworks TS2015  Miami - West Palm Beach Route Add-On","uid":11880483,"size":713501558,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a602bf4eea321dd4f52af709e95a0389c28958fc&amp;dn=Railworks+TS2015++Miami+-+West+Palm+Beach+Route+Add-On&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TS2015","files":1,"time":1430671437,"description":"Soak up the sun in the new Miami - West Palm Beach route for Train Simulator and drive the commuter rail line under cloudless blue skies from Mangonia Park to Miami Airport. \n\nThe 70 mile (114 km) long route runs parallel to the Southeast Florida coast and has 18 stations along its length. A typical station on the route is composed of two side platforms connected by an overpass and two tracks, one for southbound trains and the other for northbound trains \n\nThe most notable station along the stretch of line is West Palm Beach, which opened to passengers in 1925. This station was fully restored in 1991 and is on the National Register of Historic Places, its pastel walls and iconic architecture contrast the heady diesels that roll through. \n\nThe new Miami Airport Station features prominently alongside Miami Central Station, although it is still to be officially opened. The two stations are a key point on the route, joining rail, metro, bus and airport shuttle services in one large transport hub \n\nUnder an agreement with the Florida Department of Transportation, CSX provides dispatch services, plant maintenance and freight traffic on the route, alongside passenger services operated by Amtrak. The route is relatively high speed too, with a maximum permissible speed of 79mph (127 km/h) for passenger traffic and 60mph (96 km/h) for freight traffic. \n\nAlso included with the route are the P42DC and the Dash 8-40CW locomotives. The Silver Star passenger service is replicated on the route, which originates in Miami and runs all the way to New York along the Atlantic Coast. Between New York and Washington the train is hauled by either ACS-64, HHP-8 or AEM-7 locomotives; between Washington and Miami, P42s are used. The Silver Star has a distinctive set of coaches so travellers can travel the long distance in comfort","torrent":{"xt":"urn:btih:a602bf4eea321dd4f52af709e95a0389c28958fc","amp;dn":"Railworks+TS2015++Miami+-+West+Palm+Beach+Route+Add-On","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a602bf4eea321dd4f52af709e95a0389c28958fc","infoHashBuffer":{"type":"Buffer","data":[166,2,191,78,234,50,29,212,245,42,247,9,233,90,3,137,194,137,88,252]},"announce":[],"urlList":[]}}