{"title":"Uncanny X-Men v1 94-153 + Ex (1975-1982|Digital|AnPymHero-Emp)","uid":9759287,"size":2604302207,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a62776bf6eddcbd937624968048a20b2aed75c89&amp;dn=Uncanny+X-Men+v1+94-153+%2B+Ex+%281975-1982%7CDigital%7CAnPymHero-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1394790102,"description":"It's hard to imagine now that flagging sales and lack of public interest forced the cancellation of the X-Men title in 1970; it was brought back as a reprint title only for the new few years, from issues 67-93. Finally, in 1975, the decision was made to bring back the X-Men in a big way. Giant-Size X-Men 01 completely re-imagined the group with a cast of new, multi-national characters that breathed life into the old formula of mutant oppression, as well as co-mingling it more overtly within a civil rights framework. This new team - featuring soon to be indispensable stalwarts Wolverine, Storm, Cyclops, and Nightcrawler among others - proved to be a huge hit and with issue 94, the reins were handed to Chris Claremont as writer for what would become a legendary unbroken 17+ year run on the title. This run (especially issues 111-143, with John Byrne as co-plotter and artist) was voted the second greatest comic book run of all-time by the esteemed Comic Book Resources website, behind only Neil Gaiman's Sandman. It is easy to see why; right out of the gate we see the dramatic elements that Claremont would bring to the title, specifically focusing the interpersonal conflicts and daily squabbling in the X-Men's complicated lives as a way of building each character. They didn't all like each other out of the gate and after the rescue of the original group in GSXM, new and old members left the team to lead their lives elsewhere for the time being. One of the new crew was killed almost immediately - putting welcome tension and uncertainty into the title - and Jean Grey's transformation into the Phoenix had serious repercussions for not only herself, but the X-Men at large and indeed the entire comics world. Many many classic stories are included in these issues, including The Dark Phoenix Saga, Days of Future Past, deadly new conflicts with Magneto, Kitty Pryde's introduction to the group and several major stories featuring her, and so much more. If you are even a remote fan of the X-Men or want a fresh place to start reading, you can't go wrong with what is contained in this torrent.\n\nI have previously collected the digital versions of the first 66 issues here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9519291&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9519291&lt;/a&gt;\n\nThis collection features brand new all-digital webrips of these classic tales, all by AnPymHero-Empire. I have also the recent digital copy of Giant-Size X-Men 01, by Nahga-Empire. Thanks so much to those groups for their efforts - these copies look fantastic! Please seed, and enjoy...the Uncanny X-Men! :-)","torrent":{"xt":"urn:btih:a62776bf6eddcbd937624968048a20b2aed75c89","amp;dn":"Uncanny+X-Men+v1+94-153+%2B+Ex+%281975-1982%7CDigital%7CAnPymHero-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62776bf6eddcbd937624968048a20b2aed75c89","infoHashBuffer":{"type":"Buffer","data":[166,39,118,191,110,221,203,217,55,98,73,104,4,138,32,178,174,215,92,137]},"announce":[],"urlList":[]}}