{"title":"Rudy Kouhoupt Fundamentals of lathe operation","uid":4810381,"size":4572925952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a628872bf095eba817bd9bef3f097aa00dcc2bee&amp;dn=Rudy+Kouhoupt+Fundamentals+of+lathe+operation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"philmccrevice","files":11,"time":1238354659,"description":"A fairly well-presented introduction to the lathe which assumes the viewer is very green, and starts from the beginning of lathe operation. The viewer is given a tour of a small lathe, and its controls, but no mention is made of levelling the machine, proper maintenance, or measuring accuracy of the lathe. Also, no demonstration of centering in the 4-jaw chuck is presented. There is very little mention of safety concerns, and no mention of modern quick-change tool holders or carbide tooling. \n\nThe very simple beginner project (a boring bar holder) is demonstrated in ample detail, and is suited for most smaller lathes. The boring bar holder should present no real challenges to beginners, and would probably prove to be a very useful addition to most tooling collections. The printed drawings that came with the DVD rental were very difficult to read (mostly due to the dark blue paper), and really are not necessary, given that the dimensions and complexity of the project offer no real difficulty in imagining the necessary operations or material selections. \n\nIf you're just starting out in lathe operation, you might want to save this video for your second or third rental, opting for something that covers things like centering in the 4-jaw and grinding tool bits, first. Without that basic knowledge, you're not ready to make a boring bar holder. \n\nAll in all, a very good presentation of the project, and a good introduction to lathe operation.\n","torrent":{"xt":"urn:btih:a628872bf095eba817bd9bef3f097aa00dcc2bee","amp;dn":"Rudy+Kouhoupt+Fundamentals+of+lathe+operation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a628872bf095eba817bd9bef3f097aa00dcc2bee","infoHashBuffer":{"type":"Buffer","data":[166,40,135,43,240,149,235,168,23,189,155,239,63,9,122,160,13,204,43,238]},"announce":[],"urlList":[]}}