{"title":"Trials.Fusion.Fire.in.the.Deep-SKIDROW","uid":11672736,"size":8421395946,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a69404f3fb97a57e7c09001afcf94aa36044ef11&amp;dn=Trials.Fusion.Fire.in.the.Deep-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Mbb15","files":3,"time":1422736938,"description":"proudly presents\nTrials Fusion: Fire in the Deep (c) Ubisoft\n\n28-01-2015......Release Date &lt;-&gt; Protection..Ubisoft+Steam+Custom\nRacer..............Game Type &lt;-&gt; Disk(s).................1 BLURAY\n\nRELEASE NOTES\n\nTake on an unlimited array of platform-racing challenges in the unreal\nworld of Trials Fusion. Using your skills to traverse across\nobstacle-laden, ramp-ridden courses, you must strive to set track\nrecords against the best Trials players around the globe. Whether\nyou re racing alone, with friends, or in a global tournament,\ncompetition is always around you. And racing on official courses is\njust the beginning. A rich world of custom courses built by some of\nthe most creative and skilled content creators in gaming awaits those\nwho are continually searching for a new, insane track to conquer. And\nwith long-term support of fresh features and content, the Trials\nexperience will continue to expand and challenge players in new and\nexhilarating ways.\n\nFeatures:\n\nBEST-IN-CLASS PLATFORM RACING\nRock-solid motocross physics and reality-bending course designs come\ntogether for an over-the-top racing experience that no other game can\nprovide. Show your fearless side with the brand new FMX tricks system,\nand choose your path towards victory on branching courses. The finish\nline is the ultimate goal, but the challenge is everything before it.\n\nUBIQUITOUS COMPETITION\nWhether you re racing alone, with friends, or in a worldwide\ntournament, competition is all around you. Its variety and depth will\noffer limitless ways to scratch your competitive itch, and the\nopportunities keep coming. With ongoing support for special tournaments\nand events, team racing, and much more coming soon, the competition is\nnever ending.\n\nVIBRANT USER-GENERATED CONTENT COMMUNITY\nImmerse yourself in a boundless Trials experience with custom track\ndesigns made possible by the in-game Editor Mode. With a user-generated\ncontent community that boasts some of the most creative and skilled\ntrack creators in the world, Trials Fusion offers new track after new\ntrack and opens the door to a world of possibilities only the crazy\nminds of Trials fans can bring.\n\nTrials Fusion: Fire in the Deep NOTES:\n\nGet on you motorbike within the infernal heat below the earth's surface\nwith the fourth content pack for Trials Fusion: Fire in the Deep!\n\nExcavate deeper underground through bubbling lava, seedy avenues and\ntitanic rock-crushing machinery looking for thrills and hidden secrets\n\nGo underground with our biggest content pack ever released:\n- 11 new tracks (Complete with 9 classic tracks, one new Skill game &amp;\none new FMX track)\n- 27 new challenges from secret locations to surprising mini-games\n- New 'Billy Gruff' helmet and skin for TKO-Panda\n- Dozens of new editor objects including mammoth sized heavy-duty\nmachinery, dynamic lava and a genuinely epic train set\n- 5 new trophies\n- 10 secret audio logs to be found\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nThis release is made standalone and updated to latest version, as many\nof the game files are updated.\n\nThis release does also contain Riders of the Rustlands, Empire of the\nSky and Welcome to the Abyss released content","torrent":{"xt":"urn:btih:a69404f3fb97a57e7c09001afcf94aa36044ef11","amp;dn":"Trials.Fusion.Fire.in.the.Deep-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a69404f3fb97a57e7c09001afcf94aa36044ef11","infoHashBuffer":{"type":"Buffer","data":[166,148,4,243,251,151,165,126,124,9,0,26,252,249,74,163,96,68,239,17]},"announce":[],"urlList":[]}}