{"title":"SHANIA TWAIN - LIVE IN CONCERT - 1999 [2 concerts](region free)","uid":4814206,"size":4396978176,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a6d3e21e7f95d02406a2579e59d3429ce6715989&amp;dn=SHANIA+TWAIN+-+LIVE+IN+CONCERT+-+1999+%5B2+concerts%5D%28region+free%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ndx689-","files":16,"time":1238487963,"description":"** SHANIA TWAIN ~ LIVE IN CONCERT ~ {1999} [2 Concerts] (region free) FS PAL DVD **\n\n\n           *** (AKA) SHANIA TWAIN - 'THE SPECIALS' LIVE IN CONCERT DVD ***\n\n\nFEATURING THE TV SPECIALS ~ The 'WINTER BREAK' Concert + The 'COME ON OVER' Concert\n\n\nAlso includes performances by ELTON JOHN and the BACKSTREET BOYS\n\nThis DVD hasn't ever been released on NTSC DVD in America as far as I know yet... and doesn't seem to be listed in the Internet Movie Datbase as far as I could see!\n\n\n\nGenre: Live Music Video in Concert\n\nTotal Run time:     90 Minutes\n\nDVD Picture Format: PAL DVD\n\nDVD Sound Format:   AC3 Dolby Digital\n\nLanguage:           *ENGLISH ONLY*\n\nSubtitles:          (No Subtitles... alas... They didn't release the DVD with any)\n\n\nSHANIA TWAIN is one of the US country's hottest performers in any genre of music\nand the passion, energy and excitement of her live performances and recordings\nhave captured the hearts of millions of fans.\n\nShe is the only female artist in US history to achieve back to back Diamond Awards\n(sales of 10 million) selling albums in a short period of time.\n\nHer most popular album COME ON OVER is the all time best selling album by a female\nartist in the US with RIAA certified sales of 18 million.\n\nShania's two hugely successful network aired television special live concerts,\n*WINTER BREAK* and *COME ON OVER are both included on this DVD in their entirety\nas originally broadcast!\n\nHer FIRST network special of her live concert, *WINTER BREAK* aired on CBS on March\n1999. It was filmed in both Miami, Florida, USA and in Timins, Ontario, CANADA. The\nspecial guest performances include SHANIA TWAIN in duets with ELTON JOHN as well as\na solo performance of one of her songs by the BACKSTREET BOYS.\n\nHer SECOND network special of another of her live concerts, *COME ON OVER* aired in\nthe US on November of 1999 from the Superbowl in Dallas, Texas, USA and features a\nguest appearance from the Dallas Cowboy Cheerleaders, as well as footage of Shania\nbackstage fooling around in the locker room and preparing for her performance!\n\n\nTHE CONCERT PERFORMANCE for the *WINTER BREAK* Concert includes: ---\n\n01) * SHANIA initially in Timmins, Ontario, CANADA arriving to the concert on a\n      jet ski!\n\n02) * MAN! I FEEL LIKE A WOMAN!\n\n03) * HONEY, I'M HOME!\n\n04) * ALL I HAVE TO GIVE (Performed by the BACKSTREET BOYS!)\n\n05) * SHANIA talks live outdoors about her childhood\n\n06) * YOU'RE STILL THE ONE  +  SOMETHING ABOUT THE WAY YOU LOOK TONIGHT... in duet\n      medley with ELTON JOHN\n\n07) * AMNERIS' LETTER in medley with ELTON JOHN\n\n08) * SHANIA talks about the beginning of her career\n\n09) * THAT DON'T IMPRESS ME MUCH\n\n10) * SHANIA remembers her parents\n\n11) * FROM THIS MOMENT ON in conjunction with the BACKSTREET BOYS\n\n12) * DON'T BE STUPID (YOU KNOW I LOVE YOU) - sung in conjunction with LEAHY\n\n13) * IF YOU'RE NOT IN IT FOR LOVE, I'M OUTTA HERE!\n\n14) * Credits\n\n\n\nTHE CONCERT PERFORMANCE for the *COME ON OVER* Concert includes: ---\n\n01) * Pre Show / Pre Game highlights with SHANIA\n\n02) * HONEY, I'M HOME!\n\n03) * ROCK THIS COUNTRY!\n\n04) * SHANIA mucking around in the Locker Room\n\n05) * DON'T BE STUPID, YOU KNOW I LOVE YOU!\n\n06) * COME ON OVER\n\n07) * YOU'RE STILL THE ONE\n\n08) * SHANIA outside with the DALLAS COWBOY CHEERLEADERS\n\n09) * MAN! I FEEL LIKE A WOMAN!\n\n10) * SHANIA outside on the field with the DALLAS COWBOYS TEAM\n\n11) * ANY MAN OF MINE\n\n12) * THAT DON'T IMPRESS ME MUCH\n\n13) * IF YOU'RE NOT IN IT FOR LOVE, I'M OUTTA HERE!\n\n14) * Credits\n\n\n\nAll menus etc. are intact... I've only removed the copy protection and region coding! The rest of the DVD remains fully intact the way it was released! \n\n\n-----------------------------------------------------------------------------------\n\nMuch appreciation to anyone who downloads my torrents as I upload them in their\nfull original quality without any compression and with any and/or all extras!\n\nAnd a special appreciation to anyone who can or is willing to seed some or any of my torrents for as long as possible as my upload bandwidth is only around 70kB/s and even though I seed the lowest seeded torrents 24/7 as often as possible so that at least all my content remains constantly available... my upload bandwidth will only stretch so far obviously... and I have alot of other content I'd like to upload!\n\nSo leechers... try to always be seeding SOMETHING when you're using your P2P software if at all possible!\n\nOtherwise at least upload and seed some sort of content of your own.\n\n\nAlso, people can either leave me a message here or preferably email me at \n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;83ede7fbb5bbbac3e2f6f0f7f1e2efeae2ade6e7f6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; if they especially want or need me to continue seeding a particular torrent in the event that it drops down to no seeders for any particular title for more than a day or more! I'm also happy to receive requests for titles to upload as I have a large amount of content I can potentially upload if it's not already available.\n\nI'd also be interested in hearing from people as to whether currently unavailable  versions of *Full Stage Musical Productions* that have never been released  anywhere on DVD or on TV etc. such as (JESUS CHRIST SUPERSTAR) -- (CHICAGO) --  (LITTLE SHOP OF HORRORS) -- Huck Finn's (BIG RIVER) -- (LES MISERABLES) -- (GREASE)... and several others, would be of interest to anyone for me to upload or not!\n\nIn anycase... enjoy this one people!\n\n\nShania looks absolutely gorgeous in these two concerts! Much better than in her video clips.\n\n\nndx689-\n","torrent":{"xt":"urn:btih:a6d3e21e7f95d02406a2579e59d3429ce6715989","amp;dn":"SHANIA+TWAIN+-+LIVE+IN+CONCERT+-+1999+%5B2+concerts%5D%28region+free%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d3e21e7f95d02406a2579e59d3429ce6715989","infoHashBuffer":{"type":"Buffer","data":[166,211,226,30,127,149,208,36,6,162,87,158,89,211,66,156,230,113,89,137]},"announce":[],"urlList":[]}}