{"title":"Story Tension - Amy Deardon.epub","uid":15025271,"size":172759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a73f565cf3465c8ed1e50a0838f1e27aad9474ff&amp;dn=Story+Tension+-+Amy+Deardon.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":1,"time":1466514763,"description":"HOW TO DEVELOP STORY TENSION: 13 Techniques plus the Five Minute Magic Trick Guaranteed to Keep Your Readers Turning Pages - Amy Deardon.epub\r\n\r\n\r\nWrite stories that grab your reader from page one to the end using a simple &quot;magic&quot; technique that always works.\r\n\r\n\r\nCreate Story Tension.\r\n\r\n\r\nStory writing is challenging. Although the images in your head are vivid, you need to convey them with intensity for your reader to become involved in your story. Translating these images requires story movement that you may not be clearly communicating because you already know what's going on in your story world. You may not see that the reader perceives a story without tension. If you haven't first communicated your story’s direction, stasis can occur even when you’re writing action.\r\n\r\n\r\n\r\nAs a story coach, I find lack of story tension one of the most common problems, and arguably the deadliest since at every moment your reader is tempted to put down your story.\r\n\r\n\r\n\r\nI first discovered how challenging it was to write with tension while composing my own first novel. Although I felt I was doing everything right, the story was dragging. I put it away for a year. When I took it out again I experimented to add a story direction and adapted an invisible method that worked phenomenally--the light bulb went on. Many people told me when reading my novel that they kept wanting to go to bed, but decide to read &quot;just one more chapter&quot; until they found it was three in the morning. Yea!\r\n\r\n\r\n\r\nI've continued to refine this technique with my students, and have boiled it down to a five minute exercise that will amaze you. It always works. This technique both directs outer action and brings the reader emotionally close to your characters.\r\n\r\n\r\n\r\nI'd love to coach you through this book. I've explained my method in detail, and included examples so you can easily learn this system and use it to ramp up tension in your own writing. You can succeed with your storytelling!\r\n\r\n\r\n\r\nBy reading this book you will ...\r\n\r\nLearn the three fundamental components of Story, and how tension moves through these. \r\nReview a baker’s dozen of strategies that generate tension. \r\nDiscover the secret two-part construction of every story sequence that both directs outer action and encourages reader-character emotional bonding. \r\nEmploy this construction in your own writing by going step-by-step through examples that will show you exactly how to make this work. \r\n\r\n\r\n\r\nIt's easier than you think! You can continue to be frustrated writing your novel by trial and error, hoping you've included enough story tension without meandering... or learn the powerful proven techniques that propagate tension for an awesome story","torrent":{"xt":"urn:btih:a73f565cf3465c8ed1e50a0838f1e27aad9474ff","amp;dn":"Story+Tension+-+Amy+Deardon.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a73f565cf3465c8ed1e50a0838f1e27aad9474ff","infoHashBuffer":{"type":"Buffer","data":[167,63,86,92,243,70,92,142,209,229,10,8,56,241,226,122,173,148,116,255]},"announce":[],"urlList":[]}}