{"title":"Shostakovich Quartets 1-13 Borodin Quartet original lineup","uid":10726757,"size":1344662394,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a7626a388c7bcde2f49df4174153a5e2c3c72db7&amp;dn=Shostakovich+Quartets+1-13+Borodin+Quartet+original+lineup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"magneez","files":55,"time":1407580285,"description":"4cds, FLAC per track, covers\n\nShostakovich Quartets 1-13 Borodin Quartet original lineup\n\n\nrandom amazon review:\nFrom Fanfare Magazine (US) Sept/Oct 2003 Art Lange\n\n&quot;Be careful, they say, what you wish for--you might get it. Well, this is an occasion when I am most grateful I asked. Back in Fanfare 25:5, reviewing a disc of Shostakovich string quartets by the Sorrel Quartet, I mentioned that to my knowledge the incomplete cycle of quartets recorded by the original Borodin Quartet (1953-74) had not been released on CD. (Issued in Russia on Melodiya LPs, quartets 1-11 were available for years here in two budget-priced Seraphim boxes, which is how I came to first, hear, own, and appreciate this music.) Now, only a year later, here it is, with the valuable addition of numbers 12 and 13. Violinists Rostislav Dubinsky and Yaroslav Alexandrov left the group before they could record Shostakovich's then-recent, final two quartets; however, the &quot;new&quot; Borodin Quartet, with violinists Mikhail Kopelman and Andrei Abramenkov, did record all 15 quartets (available on EMI) as well as several individual subsequent remakes. The sound of these &quot;historical&quot; (as Chandos designates them) recordings is primarily fine, with some ever-so-slight constriction at a very few climaxes, and just a trace of analog tape background hiss here and there--but nothing to get in the way of the listening experience. And I'm pleased to report that these performances are even better than I remember from my distant, hazy vinyl past--in fact they are among the very best currently available.\n[...]","torrent":{"xt":"urn:btih:a7626a388c7bcde2f49df4174153a5e2c3c72db7","amp;dn":"Shostakovich+Quartets+1-13+Borodin+Quartet+original+lineup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7626a388c7bcde2f49df4174153a5e2c3c72db7","infoHashBuffer":{"type":"Buffer","data":[167,98,106,56,140,123,205,226,244,157,244,23,65,83,165,226,195,199,45,183]},"announce":[],"urlList":[]}}