{"title":"Ultimate Boot CD (UBCD) 5.3.5","uid":12275736,"size":627288064,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:a780ed5d75d6fb7e8fd9898587ba880ebdef51e6&amp;dn=Ultimate+Boot+CD+%28UBCD%29+5.3.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":null,"files":1,"time":1440350745,"description":" From http://www.ultimatebootcd.com/index.html\n\nYou need the Ultimate Boot CD if you want to:\n\n    Run floppy-based diagnostic tools from CDROM drives. More and more PCs are shipped without floppy drives these days, and it is such a royal pain when you need to run diagnostic tools on them.\n\n    Free yourself from the slow loading speed of the floppy drive. Even if you do have a floppy drive, it is still much much faster to run your diagnostic tools from the CDROM drive, rather than wait for the tool to load from the floppy drive.\n\n    Consolidate as many diagnostic tools as possible into one bootable CD. Wouldn't you like to avoid digging into the dusty box to look for the right floppy disk, but simply run them all from a single CD? Then the Ultimate Boot CD is for you!\n\n    Run Ultimate Boot CD from your USB memory stick. A script on the CD prepares your USB memory stick so that it can be used on newer machines that supports booting from USB devices. You can access the same tools as you would from the CD version.\n\nNew features in UBCD V5.x include:\n\n    New! The Linux-based distro Parted Magic is now included with UBCD V5.0. This should be the method of choice when you need to resize/rescue partitions, access NTFS filesystems or work with USB storage devices.\n\n    New! UBCD V5.x now supports both syslinux/isolinux and grub4dos. This helps improve the chances that UBCD will boot on any particular machine.\n\nWhen you boot up from the CD, a text-based menu will be displayed, and you will be able to select the tool you want to run. The selected tool actually boots off a virtual floppy disk created in memory","torrent":{"xt":"urn:btih:a780ed5d75d6fb7e8fd9898587ba880ebdef51e6","amp;dn":"Ultimate+Boot+CD+%28UBCD%29+5.3.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a780ed5d75d6fb7e8fd9898587ba880ebdef51e6","infoHashBuffer":{"type":"Buffer","data":[167,128,237,93,117,214,251,126,143,217,137,133,135,186,136,14,189,239,81,230]},"announce":[],"urlList":[]}}