{"title":"Hinduism and the Religious Arts (Art Ebook).pdf","uid":11822749,"size":20660078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7dbcad68bf8e47238344b528e60979e41f42fda&amp;dn=Hinduism+and+the+Religious+Arts+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1429343659,"description":"Heather Elgood &quot; Hinduism and the Religious Arts&quot; \nContinuum | 2000-03-30 | ISBN: 0304707392 | 264 pages | PDF | 19,7 MB\n\nThe cultural manifestation of Hinduism is uniquely complex. In particular, the visual arts associated with the Hindu religion are recognised as being the most complex and rich of any living religion. No serious effort to understand ancient or contemporary Indian culture can be made without a clear understanding of the visual arts and their sources in religious belief and practice. In this book, Heather Elgood provides the best synthesis and critical study of recent scholarship on the topic. She emphasizes the ritual aspect of religious art - with reference to monumental architecture, sculpture and rural arts. Throughout, strong connections are made and explained between the bewildering variety of religious belief and practice in India and the power and richness of ancient and contemporary rural Indian art. This bok will be central to the studies of anyone interested in the social and anthropological roots af artistic creativity, as well as the rites, practices and beliefs of the hundreds of millions of Hindus in the world today. Heather Elgood is a lecturer at the School of Oriental and African Sciences, University of London.She is also Director of the SOAS and Christie's Arts pf Asia and Africa programme","torrent":{"xt":"urn:btih:a7dbcad68bf8e47238344b528e60979e41f42fda","amp;dn":"Hinduism+and+the+Religious+Arts+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7dbcad68bf8e47238344b528e60979e41f42fda","infoHashBuffer":{"type":"Buffer","data":[167,219,202,214,139,248,228,114,56,52,75,82,142,96,151,158,65,244,47,218]},"announce":[],"urlList":[]}}