{"title":"Expatriates: A Novel of the Coming Global Collapse, J. W. Rawles","uid":9902729,"size":249609764,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a7e5a9d8d5ac0f3f1023db322af1fd7516c73138&amp;dn=Expatriates%3A+A+Novel+of+the+Coming+Global+Collapse%2C+J.+W.+Rawles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SectorVector","files":2,"time":1396797130,"description":"Expatriates: A Novel of the Coming Global Collapse By James Wesley Rawles, read by Eric G. Dove\n\nUnabridged edition 2013 | 8 hours and 39 mins | ISBN: 1480537055 | MP3 64 kbps\n\n\nIf the world as we know it ended tomorrow, would you survive? When the United States suffers a major socioeconomic collapse, a power vacuum sweeps the globe. A newly radicalized Islamic government rises to power in Indonesia, invading the Philippines, East Timor, Papua New Guinea, and finally Northern Australia. No longer protected by American military interests, Australia must repel this invasion alone. In the thick of these political maneuvers, Peter and Rhiannon Jeffords, American Christian missionaries living in the Philippines, and Chuck Nolan, a Texas petroleum engineer working in Australia, must face the fear of being strangers in a world in flux.\n\nMeanwhile, the Jeffords' relatives back in Florida struggle to defend themselves against the widespread looting and destruction left in the wake of the US government's collapse. As news spreads of Indonesia's merciless advances, Peter and Rhiannon must abandon their home and missionary post to avoid certain death, turning to their neighbors Paul Navarro and his teenage grandson, Joseph, to help them make the perilous 1,700-mile journey to Australia in a small boat.\n\nBut with much of Australia's navy and air force destroyed, a desperate ground war against Indonesia begins, pulling the Jeffords, the Navarros, and Chuck Nolan into a struggle that will determine the safety of their homes, livelihoods, and families.\n\nFeaturing brand-new characters, story lines that span the globe, and the authentic survivalist skills and unwavering faith needed to survive a global socioeconomic meltdown, Expatriates cements James Wesley Rawles's reputation as a leading expert and writer in the genre.\n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/17675027-expatriates&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/17675027-expatriates&lt;/a&gt;\n\n(SB request)\n\n-_-","torrent":{"xt":"urn:btih:a7e5a9d8d5ac0f3f1023db322af1fd7516c73138","amp;dn":"Expatriates%3A+A+Novel+of+the+Coming+Global+Collapse%2C+J.+W.+Rawles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e5a9d8d5ac0f3f1023db322af1fd7516c73138","infoHashBuffer":{"type":"Buffer","data":[167,229,169,216,213,172,15,63,16,35,219,50,42,241,253,117,22,199,49,56]},"announce":[],"urlList":[]}}