{"title":"Burn Notice -  Complete Season 4 (XviD/MP3)","uid":6046251,"size":6608644404,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8c2ade71bfab2b5b825f822bee9dda268c75f49&amp;dn=Burn+Notice+-++Complete+Season+4+%28XviD%2FMP3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"manOtor","files":-1,"time":1292563590,"description":"                       Burn Notice - The Complete Season 4\n\n\n\nThe series title refers to the burn notices issued by intelligence agencies to discredit or announce the dismissal of agents or sources who are considered to have become unreliable. When spies are burned, their connection to an espionage organization is terminated, leaving them without access to cash or influence. According to the narration during the opening credits, the burned spy has no prior work history, no money, no support network - in essence, no identity. The television series uses first-person narrative (including frequent voice-overs providing exposition) from the viewpoint of covert-operations agent Michael Westen, played by Jeffrey Donovan. The voice-over commentary is in the form of tips for fledgling agents as if for a training or orientation film.\nAfter fleeing a blown operation in Nigeria and being kidnapped and beaten, Westen finds himself in his hometown of Miami, Florida. He is tended to by his ex-girlfriend, Fiona Glenanne, but he has been abandoned by all his normal intelligence contacts and is under continuous surveillance with his personal assets frozen. Extraordinary efforts to reach his U.S. government handler eventually yield only a grudging admission that someone powerful wants him &quot;on ice&quot; in Miami. If he leaves there, he will be hunted down and taken into custody; whereas, if he stays, he can remain relatively free. Consumed by the desire to find out why he has been burned, and by whom, Westen is reluctantly drawn into working as an unlicensed private investigator and problem solver for ordinary citizens to fund his personal investigation into his situation as a blacklisted agent.\nWesten invites his old friend Sam Axe to assist him, while Fiona invites herself to join them. With the occasional assistance and sometimes hindrance of his mother, Madeline, Westen battles an array of such criminal figures as mobsters, con artists, arms traffickers, kidnappers, money launderers, and drug traffickers. At the same time, Michael must follow the trail that leads him to the people responsible for his being burned, and later finding out why.\nThe series juggles these two narratives; the overall series dealing with why Michael was burned, and individual episodes focusing on the cases he works for clients.\n\n\n\n\nFormat :\tXviD\nFile size:  \t350MiB avg per episode\nDuration : \t42min avg. per episode\nWidth : \t624 pixels\nHeight : \t352 pixels\nAspect ratio : \t16:9\nFrame rate : \t23.976fps\nAudio: \t\tMP3\nNr. of Files:\t18 + 1 Titlepic\n\n\n\nAll files properly named, keeping the original file names intact.\nThis pack wouldn't have been possible without you, we worship you,\n\n+++eztv+++TvTeam+++VTV+++scenebalance+++TorrentDay+++eztv+++\n\nAfter 24 hours initial seeding there should be enough seeders to get the whole thing with decent speed in a decent time.\n\nFor questions,requests,comments feel free to PM me on SuprBay\n &lt;a href=&quot; http://forum.suprbay.org/member.php?action=profile&amp;uid=123771&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.suprbay.org/member.php?action=profile&amp;uid=123771&lt;/a&gt;","torrent":{"xt":"urn:btih:a8c2ade71bfab2b5b825f822bee9dda268c75f49","amp;dn":"Burn+Notice+-++Complete+Season+4+%28XviD%2FMP3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8c2ade71bfab2b5b825f822bee9dda268c75f49","infoHashBuffer":{"type":"Buffer","data":[168,194,173,231,27,250,178,181,184,37,248,34,190,233,221,162,104,199,95,73]},"announce":[],"urlList":[]}}