{"title":"Stochastic Processes: From Physics to Finance","uid":9290366,"size":5272237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8da2df6983f2ded9c213d679afd4f744901783c&amp;dn=Stochastic+Processes%3A+From+Physics+to+Finance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386079050,"description":"ABOUT THIS BOOK\n-Contains a careful treatment of Levy processes\n-Displays classical and modern examples for the application of stochastic processes\n-Introduces stochastic processes in finance for natural scientists\n-Presents the physicists view on financial markets\n-Discusses econophysics of financial crashes\nThis book introduces the theory of stochastic processes with applications taken from physics and finance. Fundamental concepts like the random walk or Brownian motion but also Levy-stable distributions are discussed. Applications are selected to show the interdisciplinary character of the concepts and methods. In the second edition of the book a discussion of extreme events ranging from their mathematical definition to their importance for financial crashes was included. The exposition of basic notions of probability theory and the Brownian motion problem as well as the relation between conservative diffusion processes and quantum mechanics is expanded. The second edition also enlarges the treatment of financial markets. Beyond a presentation of geometric Brownian motion and the Black-Scholes approach to option pricing as well as the econophysics analysis of the stylized facts of financial markets, an introduction to agent based modeling approaches is given.\nContent Level Â» Research","torrent":{"xt":"urn:btih:a8da2df6983f2ded9c213d679afd4f744901783c","amp;dn":"Stochastic+Processes%3A+From+Physics+to+Finance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8da2df6983f2ded9c213d679afd4f744901783c","infoHashBuffer":{"type":"Buffer","data":[168,218,45,246,152,63,45,237,156,33,61,103,154,253,79,116,73,1,120,60]},"announce":[],"urlList":[]}}