{"title":"Duplicate File Finder Pro 2.21","uid":6439284,"size":1265297,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a916bdc216b2560fdea4f5c04effe4a2887167b8&amp;dn=Duplicate+File+Finder+Pro+2.21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306936225,"description":"Duplicate File Finder Pro 2.21\n\nDuplicate File Finder Pro 2.21 keeps your computer free of unnecessary files by finding and deleting duplicate files of your choice on your hard drives.\n\nFlexible scanning options!\nDuplicate File Finder Pro offers you the ability to add filters for each individual path that you want to scan. You can for example set it to only find *.mp3 files in C:\\My music\\ or files called backup.zip in D:\\. There are options for filtering files based on size, attribute, name and you can of course set the program to scan all of the subdirectories of the paths that you add. You can also exclude files and directories of your choice and scan for multiple filetypes.\n\n100% accurate when comparing files!\nWhen the first initial scan is done, then the program lets you combine up to three different algorithms for comparing the files as quickly as possible with up to 100% accuracy. This means that you can be certain that files found by Duplicate File Finder Pro are in fact exact duplicates.\n\nSelect the files of your choice!\nAfter comparing the files all of the duplicates are automatically selected. But if you have specific needs in what files that you wish to process, then you can use the Select files function to select files in the list based on size, filename and path. This gives you a great deal of control over what files to delete or move.\n\nDelete or move the duplicates!\nThe last step is to select whatever to delete or move the selected files. You can move them to the recycle bin (in that way you can restore them if you change your mind) or you may permanently delete them, or move them to a directory of your choice (for manual processing).\n\nExport detailed reports!\nOnce the scan is done and duplicate files have been found you can export a detailed report of the files. The report can be saved in both HTML and TXT format.\n\nSome of the functions included are...\nFinds all your duplicate files\nPermanently delete the files or move them to the recycle bin\nMove the duplicate files to a directory of your choice\nFast and 100% accurate comparison\nSelect files for processing based on size, path, name and attribute\nSkip directories, extensions, names and types of your choice\nFilter the scan to include specific filetypes (MP3, ZIP, AVI) etc.\nAdd several different paths to scan with individual settings\nExport reports in TXT or HTML format\nEasily get started with the Quick Start Wizard\nHighly stable and powerful\nReal-time progress\nClean and simple interface\nAdvanced settings for the professional user\nAnd more...\n\nHome Page - http://www.duplicate-file-finder.com/\n","torrent":{"xt":"urn:btih:a916bdc216b2560fdea4f5c04effe4a2887167b8","amp;dn":"Duplicate+File+Finder+Pro+2.21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a916bdc216b2560fdea4f5c04effe4a2887167b8","infoHashBuffer":{"type":"Buffer","data":[169,22,189,194,22,178,86,15,222,164,245,192,78,255,228,162,136,113,103,184]},"announce":[],"urlList":[]}}