{"title":"Natures.Microworlds.Series.2.6of6.Scottish.Highlands.576p.HDTV.x","uid":11975533,"size":584011150,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a94eef70c83955c48b56795d1f6a0028f322f76b&amp;dn=Natures.Microworlds.Series.2.6of6.Scottish.Highlands.576p.HDTV.x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"artistharry","files":1,"time":1433001755,"description":"Nature's Microworlds: Series 2\n\nNature Documentary hosted by Steve Backshall, published by BBC in 2014 - English narration\n      &lt;a href=&quot;\nhttp://docuwiki.net/images/3/31/Nature-s-Microworlds-Series-2-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/3/31/Nature-s-Microworlds-Series-2-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nNature's Microworlds: Series 2\nSeries exploring the flora and fauna in some of the world's most amazing micro-climates.\n\n\n1)  Canadas Coastal Forests \nSteve Backshall pulls apart the pieces of Canada's remarkable coastal forest to reveal why this ancient sylvan environment is not only home to some of the largest trees on Earth, but also some of the greatest aggregations of top predators in North America. He untangles the complex relationships between the seasons, the landscape and the wildlife to discover what might be fuelling this forest's prolific productivity and supporting eagles, bears and wolves. In this complex coastal system, the secret to success comes in a remarkable annual event.\n\n2)  Namib Desert \nSteve takes us on a journey to the oldest desert in the world, the Namib in South West Africa, where the treacherous Skeleton Coast sees freezing waters meet a sea of spectacular dunes. With temperatures regularly reaching 60 degrees and with little to no rainfall, the animals that live here have to be tough. Steve tracks down these amazing animals, showing the clever tactics that each employs to combat the heat, before revealing the unique secret that allows life to survive here at all, in such a harsh environment.\n\n3)  Yellowstone \nIn the spectacular Yellowstone where wolves, bears, coyotes, bison and elk roam vast grasslands, wetlands and forests, Steve Backshall looks for the answer to a puzzle. Wolves and beavers have little to do with each other so why, when wolves were returned after an absence of 70 years, did the beaver population increase? The revelation is as magical as it is surprising.\n\n4)  The Deep Seas \nSteve Backshall takes us to a place few have ever visited - the deep sea. 99 per cent of the space on Earth inhabited by life is under the ocean and almost 90 per cent of this is deeper than a kilometer, a place of perpetual darkness and crushing pressure. Far from being lifeless, the vast inner space of our planet contains an extraordinary array of beautiful and bizarre creatures, from 40m-long jellyfish to grotesque angler fish and vampire squid. Our journey from the sunlit surface waters to the deepest reaches of the abyss reveals how life persists in such a hostile world.\n\n5)  Australias Red Centre \nIn Australia's red centre, Steve reveals two-metre-tall kangaroos, the world's most venomous snake and a burrowing toad living among the throng of animals. Parched by the sun, scorched by fire and prone to unpredictable floods, the heart of this island continent is as inhospitable as it gets. Poor soils make vegetation tough and indigestible even to Australia's largest herbivore, the red kangaroo. However, it teems with animals found nowhere else on Earth. The key to the success of this extraordinary place is as surprising as the creatures that make it home.\n\n6)  Scottish Highlands \nSteve Backshall looks at the Scottish Highlands, home to some of the most iconic wildlife in the British Isles. The two contrasting landscapes of open moor and Caledonian forest are both crucially important to their wild inhabitants and yet the history of the Highlands show that they shouldn't exist side by side. Steve guides us through the landscape and reveals the surprising part that humans have to play in allowing both habitats to thrive, thereby keeping this corner of the British Isles wild.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;054d6c626d4549312b34&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2668 Kbps\n * Video: Resolution: 1024 x 576\n * Video: Aspect Ratio: 1.778 (16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 160 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 29mins average\n * Framerate: 25 fps\n * Number of Parts: 6\n * Part Size: 554 MB average\n * Container: Mp4\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:a94eef70c83955c48b56795d1f6a0028f322f76b","amp;dn":"Natures.Microworlds.Series.2.6of6.Scottish.Highlands.576p.HDTV.x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94eef70c83955c48b56795d1f6a0028f322f76b","infoHashBuffer":{"type":"Buffer","data":[169,78,239,112,200,57,85,196,139,86,121,93,31,106,0,40,243,34,247,107]},"announce":[],"urlList":[]}}