{"title":"Paisa - Rossellini [VHSRip - XviD - Ita MP3] [Tntvillage]","uid":5213754,"size":740638720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a98a08c30c623b8d5c957885140598ee34c7dcdf&amp;dn=Paisa+-+Rossellini+%5BVHSRip+-+XviD+-+Ita+MP3%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"darayava","files":1,"time":1260701641,"description":"PaisÃƒÂ \n\n\n - Scheda del film - \n\nTitolo originale: PaisÃƒÂ \nNazionalitÃƒÂ : Italia\nAnno:  1946                                    \nGenere: Drammatico/Guerra\nRegia: Roberto Rossellini\nProduzione: Rod E. Geiger Roberto Rossellini Mario Conti \nCast: Cigolani: Cigolani, Scugnizzo: Alfonsino Pasca, Prete: Bill Tubbs, Carmela: Carmela Sazio, Dale: Dale Edmonds\n\n - Trama - \n\nVincitore di un cospicuo numero di premi cinematografici, tra i quali la coppa Anica alla XI Mostra di Venezia del 1946, PaisÃƒÂ  ÃƒÂ¨ il secondo episodio della trilogia sulla guerra realizzata da Roberto Rossellini. Diviso in sei episodi,  distinti sotto il profilo narrativo, il film rievoca l'avanzata delle truppe alleate nella Penisola durante la seconda guerra mondiale. Nel primo episodio, ambientato in Sicilia, un gruppo di soldati americani sbarcano in un piccolo paese dal quale i nazisti si stanno ritirando. Una giovane del luogo, Carmela, li accompagna tra i campi che i tedeschi hanno minato. Mentre il manipolo avanza, Carmela si trattiene con un soldato di guardia; il giovane viene ucciso da una fucilata tedesca ed anche Carmela trova la morte precipitando dagli scogli. Nel secondo episodio, ambientato a Napoli, un soldato americano insegue per le strade della cittÃƒÂ  un piccolo sciusciÃƒÂ  che gli ha rubato le scarpe. Trovato il ragazzino, il milite - commosso dalla miseria che spinge il bambino a rubare - lo lascia andare. Roma ÃƒÂ¨ la cittÃƒÂ  dove si svolge il terzo episodio: qui una prostituta riconosce, in un soldato americano ubriaco, l'uomo che l'aveva messa incinta poco tempo prima, ma costui il giorno dopo riparte senza volerla rivedere. Nel quarto episodio un'infermiera inglese, arrivata a Firenze con l'esercito alleato, cerca disperatamente l'uomo che ama, capo dei partigiani. Ma la battaglia infuria e il giovane perde la vita in combattimento. Sull'Appennino Emiliano, nel quinto episodio, tre cappellani militari, uno cattolico e due di confessioni diverse, vengono ospitati in un convento; durante la permanenza dei religiosi, i frati francescani digiunano per convertire i due eretici. Nel sesto ed ultimo episodio, paracadutisti e partigiani sul delta del Po combattono strenuamente contro i nemici, ma i nazisti hanno la meglio ed in molti vengono ferocemente massacrati.\n\n - Scheda tecnica del DivX - \n\nDimensione: 706 Mb\nDurata: 02:00:24\n\nVideo Codec: XviD\nVideo Bitrate: 684\nRisoluzione: 576 x 480\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.099\n\nAudio Codec: MP3\nAudio Bitrate: 128 kb/s total (2 chnls) \nFreq Audio: 44100Hz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:a98a08c30c623b8d5c957885140598ee34c7dcdf","amp;dn":"Paisa+-+Rossellini+%5BVHSRip+-+XviD+-+Ita+MP3%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a98a08c30c623b8d5c957885140598ee34c7dcdf","infoHashBuffer":{"type":"Buffer","data":[169,138,8,195,12,98,59,141,92,149,120,133,20,5,152,238,52,199,220,223]},"announce":[],"urlList":[]}}