{"title":"A Dictionary of Science,6th Edition{BBS}","uid":6862604,"size":8470260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a99c403dfa647bf594c2be31937ef6ac729f1809&amp;dn=A+Dictionary+of+Science%2C6th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322954675,"description":"Hailed as &quot;handy and readable&quot; (Nature) and &quot;well worth browsing&quot; (New Scientist), this best-selling dictionary contains 9,200 alphabetically organized entries on all aspects of chemistry, physics, biology (including human biology), earth sciences, and astronomy. In addition to a wealth of reliable, up-to-date entries, users will find useful short biographies of leading scientists, full-page illustrated features on subjects such as the Solar System and Genetically Modified Organisms, and chronologies of specific scientific subjects including plastics, electronics, and cell biology. This new edition includes expanded coverage of global warming, forensic science, astrophysics, quantum theory, and the solar system. Supported by over 200 diagrams and illustrations, the Dictionary of Science also contains recommended web links for many entries, accessed and kept up to date via the companion website. Finally, it has appendices on SI units, fundamental constants, geological time scale, a simplified classification of the plant and animal kingdoms, and the periodic table. Both concise and wide-ranging, this volume is an ideal reference work for students or for a home library.\n\n\n# Paperback: 912 pages\n# Publisher: Oxford University Press, USA; 6 edition (March 26, 2010)\n# Language: English\n# ISBN-10: 019956146X\n# ISBN-13: 978-0199561469","torrent":{"xt":"urn:btih:a99c403dfa647bf594c2be31937ef6ac729f1809","amp;dn":"A+Dictionary+of+Science%2C6th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99c403dfa647bf594c2be31937ef6ac729f1809","infoHashBuffer":{"type":"Buffer","data":[169,156,64,61,250,100,123,245,148,194,190,49,147,126,246,172,114,159,24,9]},"announce":[],"urlList":[]}}