{"title":"TLG /PHI/ Cd-rom_E with Antiquarium 2.0","uid":3574807,"size":303426736,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a9bb79cdca31d93ea8b31449d0441c762dee31ee&amp;dn=TLG+%2FPHI%2F+Cd-rom_E+with+Antiquarium+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"shenkeee","files":3,"time":1165831676,"description":"The Thesaurus Linguae Graecae (TLGÃ‚Â«) is a research center at the University of California, Irvine. Founded in 1972 the TLG has already collected and digitized most literary texts written in Greek from Homer to the fall of Byzantium in AD 1453. Its goal is to create a comprehensive digital library of Greek literature from antiquity to the present era.\n\nThe Packard Humanities Institute (PHI) is a non-profit foundation dedicated to archaeology, music, film preservation, historic conservation, and early education. PHI is located in Los Altos, California.\n\nPHI Cd-rom #5.3 is a full-text database of ca. 350 authors of Latin literature (virtually all classical literary texts up to A.D. 200, together with a few later texts (Servius, Porphyry, Justinian, Zeno)), as well as the Latin Vulgate, the Hebrew Bible, the Greek New Testament, the Septuagint, the Coptic New Testament, the King James Bible, the Revised Standard Bible, and Milton's Paradise lost and Defensionem regiam.\n\nThe PHI Cd-rom #7 (Greek Documentary) contains over 150,000 Greek inscriptions and over 60,000 papyri. A selection of Coptic texts (NT Sahidica and the Nag Hammadi Library) are also provided .\n\n----------------------------------------------------------------------------------\nI have uploaded it for several years with Antiquarium 2.0, but now there is a much more better application to use this databases.\n\nI recommend to USE DIOGENES:\nhttp://www.dur.ac.uk/p.j.heslin/Software/Diogenes/\nIt's absolutely FREE, and works under Mac OS, Windows or Linux as well.\n(And it is the BEST tool for TLG and PHI.\nFor eg. there is an integrated Perseus morphological analyser, and unabridged LSJ in it).","torrent":{"xt":"urn:btih:a9bb79cdca31d93ea8b31449d0441c762dee31ee","amp;dn":"TLG+%2FPHI%2F+Cd-rom_E+with+Antiquarium+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9bb79cdca31d93ea8b31449d0441c762dee31ee","infoHashBuffer":{"type":"Buffer","data":[169,187,121,205,202,49,217,62,168,179,20,73,208,68,28,118,45,238,49,238]},"announce":[],"urlList":[]}}