{"title":"Second That Emotion - Jeremy D. Holden","uid":9416226,"size":2545402,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9bc3241b3b67dc188e24205c6c91342991bc872&amp;dn=Second+That+Emotion+-+Jeremy+D.+Holden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":-1,"time":1388449986,"description":"For businesspeople who want to see their company or brand break through, this book is both essential and entertaining reading. For the rest of us, the author provides a window into our decision-making processes, and how emotion-based illogical leaps drive our support for movements, whether they are political, commercial, or related to popular culture. Why do more than 30 percent of Americans believe President Obama is a Muslim? Why do most fans who supported DoveÂ®'s &quot;campaign for real beauty&quot; feel comfortable ignoring the fact that the brand's parent company, Unilever, was also behind the AxeÂ® campaign, a brand that has blatantly stereotyped women? Why is Yoko Ono still held responsible for the breakup of the Beatles? These and other random, yet related, questions are explained in here. An advertising and communications expert traces the fascinating process whereby a passion for an idea, a politician, a celebrity, or a brand gives rise to a set of illogical beliefs that becomes the basis for a powerful movement. Conventional wisdom has it that spin doctors and Madison Avenue are responsible for manipulating our thoughts, causing us to endorse ideas or buy products that we would otherwise reject outright. Holden shows that while advertising and propaganda can provide a spark and social media provides the kindling, individuals create consumer, political, and cultural trends based, more often than not, on thinking that they know logically to be flawed.","torrent":{"xt":"urn:btih:a9bc3241b3b67dc188e24205c6c91342991bc872","amp;dn":"Second+That+Emotion+-+Jeremy+D.+Holden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9bc3241b3b67dc188e24205c6c91342991bc872","infoHashBuffer":{"type":"Buffer","data":[169,188,50,65,179,182,125,193,136,226,66,5,198,201,19,66,153,27,200,114]},"announce":[],"urlList":[]}}