{"title":"Crucial Confrontations: Tools for Resolving Broken Promises, Vio","uid":8876713,"size":254452145,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aa57080b8a6399464d48976547277d81ee2de3d6&amp;dn=Crucial+Confrontations%3A+Tools+for+Resolving+Broken+Promises%2C+Vio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":9,"uploader":"The_Abee","files":6,"time":1378225629,"description":"Crucial Confrontations: Tools for Resolving Broken Promises, Violated Expectations, And Bad Behavior By Kerry Patterson, Joseph Grenny , Ron McMillan ABEE\n__\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/518J0AZQ0WL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA300_SH20_OU15_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/518J0AZQ0WL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA300_SH20_OU15_.jpg&lt;/a&gt;\n\nAbout:\n__\n\nWhether it's reprimanding a teenager for breaking a curfew or asking the boss about a promised raise, readers will learn the hands-on skill to resolve the touchiest issues.\n\nThe authors of the New York Times bestseller Crucial Conversations show you how to achieve personal, team, and organizational success by healing broken promises, resolving violated expectations, and influencing good behavior\n\nDiscover skills to resolve touchy, controversial, and complex issues at work and at home--now available in this follow-up to the internationally popular Crucial Conversations.\n\nBehind the problems that routinely plague organizations and families, you'll find individuals who are either unwilling or unable to deal with failed promises. Others have broken rules, missed deadlines, failed to live up to commitments, or just plain behaved badly--and nobody steps up to the issue. Or they do, but do a lousy job and create a whole new set of problems. Accountability suffers and new problems spring up. New research demonstrates that these disappointments aren't just irritating, they're costly--sapping organizational performance by twenty to fifty percent and accounting for up to ninety percent of divorces.\n\nCrucial Confrontations teaches skills drawn from 10,000 hours of real-life observations to increase confidence in facing issues like:\n\nAn employee speaks to you in an insulting tone that crosses the line between sarcasm and insubordination. Now what?\nYour boss just committed you to a deadline you know you can't meet--and not-so-subtly hinted he doesn't want to hear complaints about it.\nYour son walks through the door sporting colorful new body art that raises your blood pressure by forty points. Speak now, pay later.\nAn accountant wonders how to step up to a client who is violating the law. Can you spell unemployment?\nFamily members fret over how to tell granddad that he should no longer drive his car. This is going to get ugly.\nA nurse worries about what to say to an abusive physician. She quickly remembers &quot;how things work around here&quot; and decides not to say anything.\nEveryone knows how to run for cover, or if adequately provoked, step up to these confrontations in a way that causes a real ruckus. That we have down pat. Crucial Confrontations teaches you how to deal with violated expectations in a way that solves the problem at hand, and doesn't harm the relationship--and in fact, even strengthens it.\n\nCrucial Confrontations borrows from twenty years of research involving two groups. More than 25,000 people helped the authors identify those who were most influential during crucial confrontations. They spent 10,000 hours watching these people, documented what they saw, and then trained and tested with more than 300,000 people. Second, they measured the impact of crucial confrontations improvements on organizational and team performance--the results were immediate and sustainable: twenty to fifty percent improvements in measurable performance.\n\nAudio CD\nPublisher: America Media International\nLanguage: English\nISBN-10: 1932378820\nISBN-13: 978-1932378825\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                  &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n\t\t\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE, LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t\n","torrent":{"xt":"urn:btih:aa57080b8a6399464d48976547277d81ee2de3d6","amp;dn":"Crucial+Confrontations%3A+Tools+for+Resolving+Broken+Promises%2C+Vio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa57080b8a6399464d48976547277d81ee2de3d6","infoHashBuffer":{"type":"Buffer","data":[170,87,8,11,138,99,153,70,77,72,151,101,71,39,125,129,238,45,227,214]},"announce":[],"urlList":[]}}