{"title":"How They Started: How 25 Good Ideas Became Great Companies","uid":8876950,"size":3764169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa5872d4bed875779670c2cba038967b7f05ca50&amp;dn=How+They+Started%3A+How+25+Good+Ideas+Became+Great+Companies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":1,"time":1378232807,"description":"\nDavid Lester, Carol Tice, &quot;How They Started: How 25 Good Ideas Became Great Companies&quot;\nISBN: 1780590741 | 2012 | EPUB\n\nHow do you turn a good idea into a great business?\n\nLots of us have ideas we think would make great businesses. Most of us never do anything with those ideas. Maybe it's because we're really happy with our jobs, maybe it's because we're not confident that our idea would really work. Or maybe it's simply because we don't know where to start.\n\nThis book is about 30 people like you. They had an idea, and went on to start a business. Those businesses are all extremely successful and most are now household names all across America.\n\nWith success stories ranging from retail and gaming to social media and the restaurant business, How They Started relives the humble beginnings of companies such as Coca-Cola and Disney, Google and Twitter, Zynga and Chipotle Grill. Through personal interviews with key sources - including founders, investors and past employees - each profile reveals how the company took its first tentative steps and subsequently became the famous name it is today.\n","torrent":{"xt":"urn:btih:aa5872d4bed875779670c2cba038967b7f05ca50","amp;dn":"How+They+Started%3A+How+25+Good+Ideas+Became+Great+Companies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa5872d4bed875779670c2cba038967b7f05ca50","infoHashBuffer":{"type":"Buffer","data":[170,88,114,212,190,216,117,119,150,112,194,203,160,56,150,123,127,5,202,80]},"announce":[],"urlList":[]}}