{"title":"Folder Marker v3.2.0  -with working serial-","uid":6739354,"size":11294035,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab325dd96ec4a9c6405630e75f94e7c436168954&amp;dn=Folder+Marker+v3.2.0++-with+working+serial-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ipodmonesta","files":3,"time":1318436049,"description":"How many folders do you have on your computer? Scores of them? Hundreds? Thousands? Are all of them are alike: yellow folder, yellow folder, yellow folder, yellow folder... It's so easy to be confused with such a routine!\n\nFolder Marker is your small assistant, an ardent fighter for your convenience and comfort in any kind of computer work. Use Folder Marker to mark your folders. One mouse-click and it becomes clear at once which documents have a high priority, and which of them have a normal or low priority. It is easy to see which operations have been finished completely, which are partly done and which haven't been started yet.\n\nDo you fear that someone might unintentionally delete information necessary to you? Mark a folder, and other users will notice at once that that folder contains important information.\n\nBy allowing you to change the folder icons, Folder Marker will help you to cope with the standard yellowness. Folder Marker adds an item &quot;Mark Folder&quot; in the folder popup menu. Changing a folder icon is now a piece of cake.\n\nFolder Marker is for anyone who wants to make working with a computer more convenient. Folder Marker is for you. Download Folder Marker now!\n\n(btw i copied this crap from foldermarker.com)","torrent":{"xt":"urn:btih:ab325dd96ec4a9c6405630e75f94e7c436168954","amp;dn":"Folder+Marker+v3.2.0++-with+working+serial-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab325dd96ec4a9c6405630e75f94e7c436168954","infoHashBuffer":{"type":"Buffer","data":[171,50,93,217,110,196,169,198,64,86,48,231,95,148,231,196,54,22,137,84]},"announce":[],"urlList":[]}}