{"title":"The Light Country Trilogy - Ray Cummings","uid":11742878,"size":397582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab4a5099afd2fda7f4868f4a3cd85a8231c98798&amp;dn=The+Light+Country+Trilogy+-+Ray+Cummings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"amontoth","files":4,"time":1425866033,"description":"The Light Country Trilogy - Ray Cummings\nAmontoth\n\n1 - Tama of the light Country \n2 - Tama, Princess of Mercury\n3 - Aerita of the Light Country\n\nRay (Raymond King) Cummings (1887-1957) was one of the early pioneering pulp science fiction writers. Cummings' big claim to fame was that he was the only science fiction writer who had ever worked directly for Tom Edison as his assistant. \n\nFans of Burrough's Barsoom will Love this Classic Trilogy of Winged Women's \nFight for Freedom! Set on Mercury as they thought it might be in the early part \nof the 20th century, Ray Cummings' Tama of the Light Country, tells of a winged \nprincess from what was thought to be the habitable portion of Mercury, a belt of \ntwilight that circled a world too hot on one side and too cold on the other to \nsupport life anywhere else. In rebellion against a repressive, male-dominated \nsociety, Tama meets Guy Palisse, who shares her outrage at the way women are \nmistreated on Mercury. Together with like-minded women and men, they lead a \nfight for freedom for the women of Mercury that will have tragic, unintended \nconsequences for Earth. In Tama, Princess of Mercury, Guy and Tama's triumph at \nthe end of Book I is about to turn to disaster, for barbarian hoards from \nMercury's dark side have seized spaceships, followed them, and even now are \nsweeping down on the unsuspecting Earth. To prevent the people of the twilight \nbelt from joining the battle on our planet's side, the barbarian leaders' plan \nis to kidnap Tama and use her as a hostage. And, Tama is alone, pirouetting \nthrough Earth's evening sky. Aerita of the Light Country is Cummings' final \nnovel of the winged women of Mercury. Years have passed, the doings of Tama, \nPrincess of Mercury have become the stuff of legend to the women of the Light \nCountry. But now tyranny threatens the winged-daughters of the first planet \nagain and one fearless young woman, Aerita, inspired by the stories of Tama \nlocates Guy Palisse's legendary spacecar and blasts-off for Earth in search of \nhelp. There she finds herself a prisoner in a traveling menagerie, taken captive \nand presented to the public as a strange creature from South America. Then Alan \nGrant steps into the tawdry sideshow where Aerita is behind held. Argosy \nmagazine said, &quot;As a flight of pure imagination, plus a most unusual scientific \nknowledge, and plus again a rare power of fantasy and delicate romance Cummings' \nhas few equals.&quot; Don't miss this legendary science fiction trilogy, together for \nthe first time in one inexpensive bargain Omnibus Edition.\n -editor unknown","torrent":{"xt":"urn:btih:ab4a5099afd2fda7f4868f4a3cd85a8231c98798","amp;dn":"The+Light+Country+Trilogy+-+Ray+Cummings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab4a5099afd2fda7f4868f4a3cd85a8231c98798","infoHashBuffer":{"type":"Buffer","data":[171,74,80,153,175,210,253,167,244,134,143,74,60,216,90,130,49,201,135,152]},"announce":[],"urlList":[]}}