{"title":"More Electronic Gadgets for the Evil Genius - (Malestrom)","uid":4634988,"size":72431536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab63175cd97a34aadc39d9747d250f89b3c27c03&amp;dn=More+Electronic+Gadgets+for+the+Evil+Genius+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"malestrom_HH","files":-1,"time":1231522828,"description":" &lt;a href=&quot;http://www.image-upload.net/images/b6xkv79zydze8jctrak.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/b6xkv79zydze8jctrak.jpg&lt;/a&gt;\n\nThis much anticipated follow-up to the wildly popular cultclassic Electronic Gadgets for the Evil Genius gives basement experimenters 40 all-new projects to tinker with. Following the tried-and-true Evil Genius Series format, each project includes a detailed list of materials, sources for parts, schematics, documentation, and lots of clear, well-illustrated instructions for easy assembly. The convenient two-column format makes following step-by-step instructions a breeze. Readers will also get a quick briefing on mathematical theory and a simple explanation of operation along with enjoyable descriptions of key electronics topics such as various methods of acceleration, power conditioning, energy storage, magnetism, and kinetics.\n\nFrom the Back Cover\nMORE EVIL AND EXCITEMENT! LOW-COST PROJECTS YOU CAN BUILD!\nNow mad scientists everywhere can provoke even more mayhem and have even more slightly wicked fun! In these pages, famed electronics author Bob Iannini provides fully detailed and diagrammed plans for 40 exciting new projects. Seriously impressive, these projects can be made at home, at very low cost compared to their entertainment value and other benefits. Many can be made for less than $100.\n\nExploring the edge of science fiction, Iannini brings today's most thrilling electronics into reach for the home hobbyist. With easy-to-follow plans, clear diagrams and schematics, and respect for your budget, his MORE Electronic Gadgets for the Evil Genius gives you:\n\nIllustrated instructions and plans for amazing pretested projects advanced enough for sophisticated electronics enthusiasts but described in sufficient detail to be built even by newcomers\nExplanations of the science and math behind each project. For instance, you can explore the kinetic potential of electric fields and moving light objects at a distance\nFrustration-factor removal -- needed parts are listed, along with sources -- and most of these projects can be built for $100 or less\n\nDEVICES FOR WORLD (OR AT LEAST NEICHBORHOOD) DOMINATION\nThis book gives you complete plans, instructions, parts lists, and sources for 40 fantastic projects, including:\n\n* Dog-bark-control device\n* Sonic insect repellent\n* Laser property guard systems\n* Magnetic cannons\n* Snooper phones\n* Earthquake detector\n* Metal-cutting laser\n* Ingfra-red laser ray gun\n* Multi-wave oscillators\n* Mind-mangling sound generator\n* Ozone and ion machines\n* Sonic nausea machine\n* Wireless bugging devices\n* Microwave electronic interference devices\n* Kirlian photography\n* 50,000-volt DC generator\n* High-powered vacuum tube Tesla coil\n* TV and radio jammer\n* Ultrasonic deterrents","torrent":{"xt":"urn:btih:ab63175cd97a34aadc39d9747d250f89b3c27c03","amp;dn":"More+Electronic+Gadgets+for+the+Evil+Genius+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab63175cd97a34aadc39d9747d250f89b3c27c03","infoHashBuffer":{"type":"Buffer","data":[171,99,23,92,217,122,52,170,220,57,217,116,125,37,15,137,179,194,124,3]},"announce":[],"urlList":[]}}