{"title":"Please Understand me II - David Keirsey","uid":15503011,"size":11183941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aba2c57c4fd5b9de5d3955e877e650352d1d8a9f&amp;dn=Please+Understand+me+II+-+David+Keirsey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Kitalia","files":5,"time":1470542835,"description":"Title: Please Understand Me II: Temperament, Character, Intelligence\r\n\r\nAuthor: David Keirsey\r\nPublisher: Prometheus Nemesis Book Company\r\nPublication Date: 06/28/2006\r\nISBN13: 9781885705020\r\nISBN10: 1885705026\r\n\r\n\r\nSummary\r\n-------\r\nPlease understand me II focuses on the classification and categorization of personality types. The book contains a self-assessed personality questionnaire, known as the &quot;Keirsey Temperament Sorter&quot;, which links human behavioral patterns to four temperaments and sixteen character types. Once the reader's personality type has been ascertained, there are detailed profiles which describe the characteristics of that type.\r\n\r\n\r\nDescription\r\n-----------\r\nFor the past twenty years Keirsey has continued to investigate personality differences, to refine his theory of the four temperaments and to define the facets of character that distinguish one from another. His findings form the basis of Please Understand Me II, an updated and greatly expanded edition of the book, far more comprehensive and coherent than the original, and yet with much of the same easy accessibility. One major addition is Keirsey's view of how the temperaments differ in the intelligent roles they are most likely to develop. Each of us, he says, has four kinds of intelligence, tactical, logistical, diplomatic, strategic, though one of the four interests us far more than the others, and thus gets far more practice than the rest. Like four suits in a hand of cards, we each have a long suit and a short suit in what interests us and what we do well, and fortunate indeed are those whose work matches their skills. As in the original book, Please Understand Me II begins with The Keirsey Temperament Sorter, the most used personality inventory in the world. But also included is The Keirsey Four-Types Sorter, a new short questionnaire that identifies one's basic temperament and then ranks one's second, third, and fourth choices. Share this new sorter with friends and family, and get set for a lively and fascinating discussion of personal styles","torrent":{"xt":"urn:btih:aba2c57c4fd5b9de5d3955e877e650352d1d8a9f","amp;dn":"Please+Understand+me+II+-+David+Keirsey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba2c57c4fd5b9de5d3955e877e650352d1d8a9f","infoHashBuffer":{"type":"Buffer","data":[171,162,197,124,79,213,185,222,93,57,85,232,119,230,80,53,45,29,138,159]},"announce":[],"urlList":[]}}