{"title":"Aggressive Network Self-Defense - 1st Edition.pdf Gooner","uid":11676239,"size":86875928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abe9c9f30d7e0f41b8c88eae024f9e21a3ccb724&amp;dn=Aggressive+Network+Self-Defense+-+1st+Edition.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1422887301,"description":"Publisher: Syngress; 1 edition (February 26, 2005)\nLanguage: English\nISBN-10: 1931836205\nASIN: B005K6J0KU\n\nOver the past year there has been a shift within the computer security world away from passive, reactive defence towards more aggressive, proactive countermeasures. Although such tactics are extremely controversial, many security professionals are reaching into the dark side of their tool box to identify, target, and suppress their adversaries. This book will provide a detailed analysis of the most timely and dangerous attack vectors targeted at operating systems, applications, and critical infrastructure and the cutting-edge counter-measures used to nullify the actions of an attacking, criminal hacker. \n\n*First book to demonstrate and explore controversial network strike back and countermeasure techniques. \n\n*Provides tightly guarded secrets to find out WHO is really attacking you over the internet. \n\n*Provides security professionals and forensic specialists with invaluable information for finding and prosecuting criminal hackers.\n\nAbout the Author\n\nNeil R. Wyler (JNCIS-FWV, JNCIA-SSL) is an Information Security Engineer and Researcher located on the Wasatch Front in Utah. He is the co-owner of two Utah-based businesses, which include a consulting firm with clients worldwide and a small software start-up. He is currently doing contract work for Juniper Networks, working with the company's Security Products Group. Neil is a staff member of the Black Hat Security Briefings and Def Con hacker conference. He has spoken at numerous security conferences and been the subject of various online, print, film, and television interviews regarding different areas of information security. He was the Lead Author and Technical Editor of Aggressive Network Self-Defense (Syngress, 1-931836-20-5) and serves on the advisory board for a local technical college","torrent":{"xt":"urn:btih:abe9c9f30d7e0f41b8c88eae024f9e21a3ccb724","amp;dn":"Aggressive+Network+Self-Defense+-+1st+Edition.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe9c9f30d7e0f41b8c88eae024f9e21a3ccb724","infoHashBuffer":{"type":"Buffer","data":[171,233,201,243,13,126,15,65,184,200,142,174,2,79,158,33,163,204,183,36]},"announce":[],"urlList":[]}}