{"title":"The Good, The Bad &amp; The Queen 2007 only1joe FLAC-EAC","uid":9906315,"size":295489811,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac566c3317f817b2adcd9e8ed3b31b94ba11a2b6&amp;dn=The+Good%2C+The+Bad+%26amp%3B+The+Queen+2007+only1joe+FLAC-EAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"only1joe","files":-1,"time":1396827497,"description":"The Good, The Bad &amp; The Queen 2007 only1joe FLAC-EAC\n\n &lt;a href=&quot;\nhttp://bayimg.com/IANngaAFF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IANngaAFF&lt;/a&gt;\n\nAround the turn of the millennium -- just after the release of Blur's moody sixth album, 13 -- Damon Albarn began to quietly back away from the very concept of fronting a rock band, turning his attention to a series of collaborative projects that soon overshadowed his main gig. First there was the electro-bubblegum group Gorillaz, which afforded Albarn the opportunity to masquerade behind a cartoon, a move that allowed him to let his music speak louder than his fame, a method that he found irresistible as he began to do several projects similar to this, including a voyage to Africa documented on Mali Music, along with other less-publicized forays into soundtracks. In this context, the post-Graham Coxon Blur albumThink Tank seemed less like a band effort than another conceptual project directed by Albarn instead of the work of a band, which is what all these new-millennium projects were at their core, including the Good, the Bad &amp; the Queen, a quartet comprised of himself, Clash bassist Paul Simonon, Verve guitarist Simon Tong, and Tony Allen, Fela Kuti's drummer, who was name-checked in Blur's &quot;Music Is My Radar,&quot; and whose eponymous 2007 album is produced by Danger Mouse, who previously collaborated with Albarn on Gorillaz's second album, 2005's Demon Days.  A flurry of pre-release activity compared The Good, the Bad &amp; the Queen to Blur's 1994 masterpiece Parklife, as it represents a conscious return to Albarn writing songs specifically about London at a particular point in time. Thematically accurate though this may be, it is also misleading, suggesting that Albarn is also returning to the bright, colorful, clever guitar pop that made his reputation -- something akin to Coxon's reclamation of that sound on his excellent recent solo albums, Happiness in Magazines and Love Travels at Illegal Speeds. That couldn't be farther from the truth, as The Good, the Bad &amp; the Queen is deliberately drained of color and mired in moodiness. If Parklife exuberantly captured the giddiness of the mid-'90s, as fashions and politics changed, ushering in New Labor, Britpop, and new lad culture, The Good, the Bad &amp; the Queen captures how all that optimism has calcified into weary cynicism, as the endless opportunities of the '90s have given way to a warring world that seems to lack any center or certainty. So, in that sense, it is a cousin to Parklife in how it captures a national mood, but in sheer sonic terms, the closet antecedent of Albarn's is Demon Days, which traced out an apocalyptic vision despite its insistent pop hooks. Which isn't to say that The Good, the Bad &amp; the Queen is a Gorillaz album in disguise, nor should Simonon's presence suggest that this is the second coming of London Calling; if anything, GBQ suggest the Specials at their most haunted, which is hardly uncharacteristic of Damon, who has always used &quot;Ghost Town&quot; as a blueprint whenever he's wanted to get spooky.  Despite these echoes of the past -- and there are other echoes, too, arriving in Simonon's thundering dub bass, Tong's spectral guitars, Allen's nimble rhythms, and Albarn's vaudevillian piano and carnivalesque organ -- The Good, the Bad &amp; the Queen is most certainly its own distinctive thing, the product of five iconoclastic musicians working a theme endlessly, relentlessly, and inventively, producing music that plays more like a movie than an album. Early on, as &quot;History Song&quot; eases into view on a circular acoustic guitar phrase, it establishes an alluring, dank, and artfully dour mood that the band continually expands and explores without ever letting the gloom lift. But for as dark as this is, GBQ never sounds despairing -- it's wearily resigned, as Albarn and his bandmates prefer to luxuriously wallow in the murk instead of finding a way out of it. There's a comfort in its melancholy, particularly in how the album glides from one elegantly doleful song to another, but at times the album almost sounds too samey, with no individual song emerging from the whole. Part of the reason for this is Danger Mouse's production: it's as subtle and clever as ever, but built largely in the post-production -- to the extent that he'll mix out Allen for large stretches of the album just for the aural effect. He's orchestrated a unified, dramatic album -- it's a tapestry of impeccable, sorrowful, yet sultry soundscapes -- but given the pedigree of this band, it's hard not to wish that the album offered more of the quartet just playing, gussied up with no effect. Nevertheless, as an album The Good, the Bad &amp; the Queen is singularly effective, bringing the roiling melancholy undercurrent of Demon Days to the surface and creating a murky, mud-streaked impressionistic rock noir that's sinisterly seductive in its gloom.\nAll Music Review by Stephen Thomas Erlewine\n\n \n\nCD Track Listings\n\n[01] History Song\n[02] 80's Life\n[03] Northern Whale\n[04] Kingdom Of Doom\n[05] Herculean\n[06] Behind The Sun\n[07] The Bunting Song\n[08] Nature Springs\n[09] A Soldier's Tale\n[10] Three Changes\n[11] Green Fields\n[12] The Good, The Bad And The Queen\n\nCD Play Time - 00h:42m:55s\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *","torrent":{"xt":"urn:btih:ac566c3317f817b2adcd9e8ed3b31b94ba11a2b6","amp;dn":"The+Good%2C+The+Bad+%26amp%3B+The+Queen+2007+only1joe+FLAC-EAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac566c3317f817b2adcd9e8ed3b31b94ba11a2b6","infoHashBuffer":{"type":"Buffer","data":[172,86,108,51,23,248,23,178,173,205,158,142,211,179,27,148,186,17,162,182]},"announce":[],"urlList":[]}}