{"title":"The Art And Architecture of Islamic Cairo (Art Ebook).pdf","uid":9393526,"size":22128658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac789131ced0ffd34c294d7c8371bb1bcc2cd3fe&amp;dn=The+Art+And+Architecture+of+Islamic+Cairo+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1387929916,"description":"Richard Yeomans, &quot;The Art And Architecture of Islamic Cairo&quot;\nIthaca Pr | ISBN 1859641547 | 2006-06 | PDF | 280 pages | 19.56 MB\n\n\nSince Napoleon's invasion of Egypt in 1798, the western traveller has been obsessed with the Pharaohs and Egypt's ancient past. Her Islamic culture has been largely ignored, and the pyramids have been allowed to cast a long shadow over the visual culture of Islamic Cairo, obscuring a magnificent art and architectural heritage that has lasted over a thousand years, from the building of the Mosque of Amr in the seventh century to that of Muhammad Ali in the nineteenth. Cairo is full of masterpieces of medieval art and architecture reflecting the status of Egypt as the centre of several significant Muslim empires. The purpose of this book is to redress the cultural balance and examine the art and architectural treasures of Cairo from the Arab to the Ottoman conquests (642-1517). Set within an historical narrative, the stylistic development of the visual arts is explained within changing religious, social and political contexts. Examples of the decorative arts - ceramics, glass, woodwork, metalwork, textiles and manuscripts - are examined in the Museum of Islamic Art, Cairo, and other major collections in Europe and the USA.","torrent":{"xt":"urn:btih:ac789131ced0ffd34c294d7c8371bb1bcc2cd3fe","amp;dn":"The+Art+And+Architecture+of+Islamic+Cairo+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac789131ced0ffd34c294d7c8371bb1bcc2cd3fe","infoHashBuffer":{"type":"Buffer","data":[172,120,145,49,206,208,255,211,76,41,77,124,131,113,187,27,204,44,211,254]},"announce":[],"urlList":[]}}