{"title":"[Marc Dorcel] Ma Cousine Est Une Putain (2016) NEW WEB-DL","uid":15847534,"size":867837361,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ac885ac4823d000454c8fa73f29be7d9f70814b9&amp;dn=%5BMarc+Dorcel%5D+Ma+Cousine+Est+Une+Putain+%282016%29+NEW+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"SudoSu","files":1,"time":1474121285,"description":"http://youpornbook.com\r\n\r\n-------------------------\r\n ... : Screenshots : ... \r\n-------------------------\r\n \nhttp://imgroute.com/?v=887595 \nhttp://imgroute.com/?v=596776\r\n\r\n\r\n-------------------------\r\n ... : Starring : ... \r\n-------------------------\r\n\r\nStella Cox, Lexie Candy, Mea Melone, Ryan Ryder, Juan Lucho, Pascal White, Luke Hardy, Potro de Bilbao, Marc Rose, Dirty Dan\r\n\r\n-------------------------\r\n ... : Description : ... \r\n-------------------------\r\n\r\nArriving in London for a family holiday, young Elise never expected that these few days would turn into a real week of pleasure. Her young English cousin, Milo, has been cheated on and dumped by his girlfriend Stella, and Elise will do everything she can to cheer him up and give him back some confidence in his powers of seduction. On her mission, the beautiful French girl will have to give it her all and seduce not only the men she meets, but the women too. Franco, the handsome and virile Hispanic man her aunt has her heart set on becomes her first willing victim. To take Milo's mind off things, Elise takes advantage of a night out in London to visit a strip club where she uses all her charms to seduce one of the female dancers. Elise then proves the extent of her seductive talents by getting hot and heavy with another woman as Milo watches on. A little later in the day, Elise meets Milo's ex's new boyfriend, who has come to pick up her things. After getting him all horny by flaunting herself in front of him, he has no choice but to fuck Elise on the coffee table. Meanwhile, Milo happens to fall back into the arms of his ex. Having surprised her while naked in the bathroom, he fucks her unceremoniously in the ass before finishing with her for good. With Milo's confidence having returned, Elise can now concentrate on her own search for pleasure and end her holiday on a high note in a spontaneous gang bang with three of her cousin's colleagues. Lesbian encounters, blowjobs, anal sex and gang bangs. Elise won't let any opportunity for fun pass her by while helping Milo get rid of the freeloaders ruining his life.\r\n\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:ac885ac4823d000454c8fa73f29be7d9f70814b9","amp;dn":"%5BMarc+Dorcel%5D+Ma+Cousine+Est+Une+Putain+%282016%29+NEW+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac885ac4823d000454c8fa73f29be7d9f70814b9","infoHashBuffer":{"type":"Buffer","data":[172,136,90,196,130,61,0,4,84,200,250,115,242,155,231,217,247,8,20,185]},"announce":[],"urlList":[]}}