{"title":"Michael Tomasello - The Cultural Origins of Human Cognition [200","uid":10455067,"size":825231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acd52cbb8072db17ce4b260e8e41a09b027f503c&amp;dn=Michael+Tomasello+-+The+Cultural+Origins+of+Human+Cognition+%5B200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Anette14","files":-1,"time":1404067050,"description":"Description\nProduct Details\nBook Title: The Cultural Origins of Human Cognition\t\nBook Author: Michael Tomasello (Author)\nHardcover: 256 pages\nPublisher: Harvard University Press (January 17, 2000)\nLanguage: English\nISBN-10: 0674000706\nISBN-13: 978-0674000704\n\n===================================================================================\nBook Description\nPublication Date: January 17, 2000\nAmbitious and elegant, this book builds a bridge between evolutionary theory and cultural psychology. Michael Tomasello is one of the very few people to have done systematic research on the cognitive capacities of both nonhuman primates and human children. The Cultural Origins of Human Cognition identifies what the differences are, and suggests where they might have come from.\nTomasello argues that the roots of the human capacity for symbol-based culture, and the kind of psychological development that takes place within it, are based in a cluster of uniquely human cognitive capacities that emerge early in human ontogeny. These include capacities for sharing attention with other persons; for understanding that others have intentions of their own; and for imitating, not just what someone else does, but what someone else has intended to do. In his discussions of language, symbolic representation, and cognitive development, Tomasello describes with authority and ingenuity the &quot;ratchet effect&quot; of these capacities working over evolutionary and historical time to create the kind of cultural artifacts and settings within which each new generation of children develops. He also proposes a novel hypothesis, based on processes of social cognition and cultural evolution, about what makes the cognitive representations of humans different from those of other primates.\nLucid, erudite, and passionate, The Cultural Origins of Human Cognition will be essential reading for developmental psychology, animal behavior, and cultural psychology.\n\n===================================================================================\nEditorial Review\nFrom Library Journal\nHomo sapiens has existed as a separate species for only a very short period of time on the evolutionary scale (six million years at most), and we share 99 percent of our DNA with our closest primate relatives. How then can humans be as different from other primates as we obviously are? Developmental psychologist Tomasello thinks that all of the many unique characteristics of humans are elaborations of one trait that arises in human infants at about nine months of age: the ability to understand other people as intentional agents. (He dismisses a bit too cavalierly the anecdotal evidence of recent animal behaviorists who would describe a good deal of animal behavior as intentional in this sense.) Language, elaborate cultures, and other hallmarks of humanity are all natural outgrowths of this single trait. The author is clearly highly credentialed, his thesis is certainly plausible, and the language is not jargony. However, his topic is really very limited; the bulk of the book focuses on the narrow issue of &quot;shared attention.&quot; Only graduate students and developmental psychologists will want to know this much about the subject. Recommended for academic collections.-Mary Ann Hughes, Neill P.L., Pullman, WA\n\n===================================================================================\nReviews\nStudents of primate behavior are one of several groups who should read this important book. It spells out forcefully what appears to make human development so distinctive, and does so from the perspective of an expert in language acquisition who has also devoted much time to comparative work with apes. It is strong medicine for anybody in danger of romanticizing the similarity of ape to child. Developmental psychologists will find here a well-articulated account of the ontogeny of cultural learning, which challenges alternative accounts from the vantage point of extensive research.--Andrew Whiten (Nature)\n\n&quot;In The Cultural Origins of Human Cognition...[Tomasello] argues that what makes human beings unique is that they are so good at learning from one another and that they create new, original things with what they learn.&quot;--Helen Epstein (Lingua Franca)\n\n===================================================================================\nFrom the Back Cover\nA much needed book that covers a broad territory with both clarity and authority. Having spent much of his career comparing human and nonhuman primate cognition, Michael Tomasello makes the case for a social developmental foundation of the unique capacities of the human primate--language, complex cognition, and culture. His ontogenetic 'ratchet hypothesis' is both simple and provocative. It will be welcomed--and argued about--by a wide audience. (Katherine Nelson, Distinguished Professor of Developmental Psychology, City University of New York)\n\n===================================================================================\nAbout the Author\nMichael Tomasello is Co-Director of the Max Planck Institute for Evolutionary Anthropology in Leipzig, Germany. He is the author of First Verbs and the coauthor of Primate Cognition.\n===================================================================================","torrent":{"xt":"urn:btih:acd52cbb8072db17ce4b260e8e41a09b027f503c","amp;dn":"Michael+Tomasello+-+The+Cultural+Origins+of+Human+Cognition+%5B200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd52cbb8072db17ce4b260e8e41a09b027f503c","infoHashBuffer":{"type":"Buffer","data":[172,213,44,187,128,114,219,23,206,75,38,14,142,65,160,155,2,127,80,60]},"announce":[],"urlList":[]}}