{"title":"MGMT 24 Bit Vinyl Pack","uid":8909935,"size":2911599577,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad310e04419baad855525fffcde47d29fa7a29d3&amp;dn=MGMT+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1378995648,"description":"\n  MGMT 24 Bit Vinyl Pack\n\n  Genre: Electronic, Pop/Rock\n  Styles: Alternative, Indie Electronic\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 44,100 Hz\n\n  2008 Oracular Spectacular (two versions)\n  2010 Congratulations \n\n  Finding an unlikely middle point between Suicide's hostile, proto-electro punk art noise and the sardonic, pop-friendly sound of the Flaming Lips, MGMT started as electroclash musical terrorists but quickly grew into an eclectic, brainy pop group with psychedelic overtones. MGMT first formed in 2002, during Ben Goldwasser and Andrew Van Wyngarden's freshman year as art students at Wesleyan University in Middletown, Connecticut. The band was initially known as the Management, and its shows consisted mostly of backing tapes, synthesizers, and prerecorded vocals playing as Goldwasser and Van Wyngarden engaged the audience in a manner somewhere between performance art and good old-fashioned punky hostility. By their senior year, things had toned down considerably on-stage and the duo began augmenting its live sound with backing musicians. After graduating, MGMT released an electro-rock EP, 2005's Time to Pretend, on the tiny indie label Cantora Records. \n\n  For its full-length debut, the duo partnered with producer Dave Fridmann and recorded Oracular Spectacular, a far more musically expansive album that was released digitally in late 2007. A traditional CD release followed in January 2008, and Oracular Spectacular ultimately enjoyed both critical approval and commercial success, with the album selling over 500,000 copies in the U.S. and going platinum in Australia, the U.K., and Ireland. In 2009, MGMT began working with producer Sonic Boom on their second album, Congratulations. Released in 2010, the record found them growing more ambitious with their sound, and they were rewarded for their trouble when their sophomore effort debuted at number two on the U.S. Billboard chart. The following year, the bandmembers dug deep into their record collections to curate an installment of the Late Night Tales mixtape series. In April 2013, MGMT released &quot;Alien Days&quot;, a cassette single that previewed their self-titled third record, which was scheduled for release that September.","torrent":{"xt":"urn:btih:ad310e04419baad855525fffcde47d29fa7a29d3","amp;dn":"MGMT+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad310e04419baad855525fffcde47d29fa7a29d3","infoHashBuffer":{"type":"Buffer","data":[173,49,14,4,65,155,170,216,85,82,95,255,205,228,125,41,250,122,41,211]},"announce":[],"urlList":[]}}