{"title":"Bibleworks 10","uid":14482058,"size":23374470352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad4e3f0e0774c747efa7ba8b14a2e1628315aac6&amp;dn=Bibleworks+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"thomas9","files":1,"time":1461987259,"description":"BibleWorks 10 (distributed to Amazon customers on a USB flash drive) is a focused collection of tools and resources designed specifically to assist pastors, seminary students, professors and missionaries in their exegesis of the Biblical text. The base package contains the key resources needed for careful exegesis (with a small number of additional databases available as add-on resources). It contains more than 250 Bible translations in 40+ languages, 45 original language texts and morphology databases, 30 lexical-grammatical references, and a wealth of practical reference works. Reference works include Greek and Hebrew vocabulary flashcards and pronunciation; Bible maps; Holy Land images; the Greek New Testament read aloud and fully diagrammed; Greek, Aramaic and Hebrew grammars; full transcriptions and image sets for both the Leningrad Codex and nine of the most important Greek New Testament manuscripts; and the full CNTTS New Testament apparatus. The updated user interface includes dozens of ways to organize, analyze and present the results of your research. A comprehensive set of online tutorial videos is available from the Help menu (requires Internet access). BibleWorks runs on Microsoft Windows Vista/7/8/10 and higher and Mac OS X 10.7.4 and higher. BibleWorks 10 now includes the Mac version of BibleWorks (running on a Wine compatibility layer), which supports the features most users need. If greater compatibility on Macs is required, we recommend running a virtual machine such as Parallels or VMware Fusion","torrent":{"xt":"urn:btih:ad4e3f0e0774c747efa7ba8b14a2e1628315aac6","amp;dn":"Bibleworks+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad4e3f0e0774c747efa7ba8b14a2e1628315aac6","infoHashBuffer":{"type":"Buffer","data":[173,78,63,14,7,116,199,71,239,167,186,139,20,162,225,98,131,21,170,198]},"announce":[],"urlList":[]}}