{"title":"Miles Davis - Miles Smiles [24 bit FLAC] vinyl","uid":8113469,"size":856119114,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:adf6a280ab409e77c21b44e121a1f8ca98f959b8&amp;dn=Miles+Davis+-+Miles+Smiles+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"24.96","files":-1,"time":1360243569,"description":"With their second album, Miles Smiles, the second Miles Davis Quintet really began to hit their stride, delving deeper into the more adventurous, exploratory side of their signature sound. This is clear as soon as &quot;Orbits&quot; comes crashing out the gate, but it's not just the fast, manic material that has an edge -- slower, quieter numbers are mercurial, not just in how they shift melodies and chords, but how the voicing and phrasing never settles into a comfortable groove. This is music that demands attention, never taking predictable paths or easy choices. Its greatest triumph is that it masks this adventurousness within music that is warm and accessible -- it just never acts that way. No matter how accessible this is, what's so utterly brilliant about it is that the group never brings it forth to the audience. They're playing for each other, pushing and prodding each other in an effort to discover new territory. As such, this crackles with vitality, sounding fresh decades after its release. And, like its predecessor, ESP, this freshness informs the writing as well, as the originals are memorable, yet open-ended and nervy, setting (and creating) standards for modern bop that were emulated well into the new century. Arguably, this quintet was never better than they are here, when all their strengths are in full bloom.","torrent":{"xt":"urn:btih:adf6a280ab409e77c21b44e121a1f8ca98f959b8","amp;dn":"Miles+Davis+-+Miles+Smiles+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf6a280ab409e77c21b44e121a1f8ca98f959b8","infoHashBuffer":{"type":"Buffer","data":[173,246,162,128,171,64,158,119,194,27,68,225,33,161,248,202,152,249,89,184]},"announce":[],"urlList":[]}}