{"title":"The Harriet Unwin Victorian Mystery Trilogy - H R F Keating","uid":11156024,"size":383844731,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ae4439659b78aed545c6a8ea9cd610bdd9082fa7&amp;dn=The+Harriet+Unwin+Victorian+Mystery+Trilogy+-+H+R+F+Keating&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"davieboy1966","files":20,"time":1412383886,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nAll are unabridged and read by Sheila Mitchell.\nPhyl previously provided me with the first two audiobooks and I supplied the third and final title.\n\n\n\nUsing the name Evelyn Hervey, Keating wrote three crime novels in the 1980's with a period setting in which the central character was the governess Harriet Unwin.\nAfter 1986, however, he abandoned the Hervey pseudonym and Victorian crime and returned to the Inspector Ghote series.\n\n#1. The Governess [1983] 8 hours 4 mins ED, (32kbps/22kHz Mono CBR)\nWhen Harriet Unwin takes the position of governess in the well-to-do Thackerton household, it would seem that fortune has smiled on her at last. That is until William Thackerton is found stabbed, and Harriet accused of murder... In a desperate attempt to prove her innocence, she embarks on a daring scheme to save herself from the gallows. In doing so she uncovers the dark secrets which the family is trying to hide behind a veneer of Victorian respectability.\n\n#2. The Man of Gold [1985] 6 hours 22 mins CD, (48kbps/44kHz Mono CBR)\nFor a respectable governess like Harriet Unwin, her first few weeks in the shabby, inhospitable home of the Partingtons were as unhappy as any she could remember. The bone-chilling cold, the grim sparseness of the meals, the embittered meanness of old Mr Partington: but for the kindness shown by his son, her spirit must surely have been crushed. But worse was to come for Harriet. Her chance discovery of the old man's cherished secret was, she felt sure, the cause of the attack that finally stilled his heart. The doctor, however, thought otherwise. It was neither illness nor old age that killed poor Mr Partington. It was poison...\n\n#3. Into the Valley of Death [1986] 5 hours 58 mins CD, (48kbps/44kHz Mono CBR)\nOn Friday next, pub owner Jack Steadman would hang for the murder of Alfie Goode, drunkard and ne'er-do-well. The case was open-and-shut to everyone but Miss Harriet Unwin, who had less than a week to prove that Jack, a Crimean war hero, was innocent. Her snooping soon took her to the ballroom of a retired general's stately manor. But there, between the quadrilles and waltzes, Miss Unwin had to step most carefully, for a killer could make her next partner...death!\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ae4439659b78aed545c6a8ea9cd610bdd9082fa7","amp;dn":"The+Harriet+Unwin+Victorian+Mystery+Trilogy+-+H+R+F+Keating","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4439659b78aed545c6a8ea9cd610bdd9082fa7","infoHashBuffer":{"type":"Buffer","data":[174,68,57,101,155,120,174,213,69,198,168,234,156,214,16,189,217,8,47,167]},"announce":[],"urlList":[]}}