{"title":"Xenogears Perfect Works English Translation Ichiban Manten Systo","uid":4772263,"size":634620123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aee6c758427ded4b0e1b0b1cdc29738c3ad2be8b&amp;dn=Xenogears+Perfect+Works+English+Translation+Ichiban+Manten+Systo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Systom","files":-1,"time":1237083161,"description":"This is my first torrent release ever brought to you by Systom and Ichiban Manten.\n\nFull credit for this entire translation goes to Ichiban Manten\nhttp://www.flickr.com/photos/29956195@N08/\n\nThe full photo album within this file can also be found on the web in various sizes in the above URL. \nFind other Xenogears related work or other work by Ichiban Manten in the above URL. \n\nXenogears Perfect Works Fully Translated from Japanese to English on 304 original pages.\n\n\n[Quoted from reviewer Chris on Amazon.com]\nYou need not be an avid fan of Xenogears nor a fan of video games to enjoy this book. It has much to offer, and is not only limited to a basic video game manual or walk through. Perfect Works gives the reader a good sense of what this game is about and at the same time indulges ones need for that of excellent Japanese anime. This book has a great overall explanation to a immensely complex story, and a gallery of pictures that are adorn to the game. It offers all that a fan and reader alike could ever need to fulfill there desire for a good story, game help, or even Japanese art. The book is composed of sections that give the reader a deep explanation to the game. It has sections that a fan could find greatly useful. Some sections may include that of the history, gallery or even story section. Perfect Works also has great sections that a reader could find interesting, the story could prove to be fun and good reading material while the gallery could prove to be a section that other inspiring artists or views may love. But besides that, now Squaresoft's Xenogears Perfect Works is a book that all readers could easily find enjoyable.\n(Chris Profile)\nhttp://www.amazon.com/gp/pdp/profile/A4DVYM95N3H8Y/ref=cm_cr_dp_pdp\n(Xenogears Perfect Works)\nhttp://www.amazon.com/Xenogears-PERFECT-WORKS-Real-thing/dp/4925075322/ref=sr_1_2?ie=UTF8&amp;s=books&amp;qid=1237072230&amp;sr=8-2\n\n\nJPG format. \n\nMost file sizes are 2480 x 3490, some lower, some higher. \n\nI shouldn't have to say this but I will anyway, do NOT steal this, if you're going to use it in whatever way you're going to use it, pay respect and give credit to the person who took the time to fill our once empty voids with this masterpiece. He also claims that his translation isn't perfect, but it's still finely done and amazing work coming from one person who dedicated his time as a fan for the fans.\n\nEnjoy, You Shall Be As Gods.\n\n-Systom\nhttp://www.systom.org","torrent":{"xt":"urn:btih:aee6c758427ded4b0e1b0b1cdc29738c3ad2be8b","amp;dn":"Xenogears+Perfect+Works+English+Translation+Ichiban+Manten+Systo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee6c758427ded4b0e1b0b1cdc29738c3ad2be8b","infoHashBuffer":{"type":"Buffer","data":[174,230,199,88,66,125,237,75,14,27,11,28,220,41,115,140,58,210,190,139]},"announce":[],"urlList":[]}}