{"title":"Windows 10 Version 1511 build 10586 Dutch x86 x64 + Activators","uid":12751192,"size":12520964352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aef1f6e45164653e0d39d27b3b5b6d84408210ff&amp;dn=Windows+10+Version+1511+build+10586+Dutch+x86+x64+%2B+Activators&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"rubberboy37","files":1,"time":1447378466,"description":"Microsoft is zojuist gestart met het verspreiden van de eerste grote update voor Windows 10. Ook de Xbox One krijgt het systeem vanaf 12 november 2015. De update voor PC's en Tablets bestaat uit veel verbeteringen en nieuwe drivers voor randapparatuur. \r\n\r\nDe grote Windows 10-update komt momenteel beschikbaar voor reguliere gebruikers. Het systeem bevat allerlei verbeteringen, waaronder snellere prestaties en een integratie van Skype. Ook zijn de mogelijkheden van de virtuele assistent Cortana uitgebreid, maar Cortana is nog niet in de Nederlandse taal beschikbaar. \r\n\r\nMicrosofts Edge-browser, de opvolger van Internet Explorer, is ook uitgebreid, met onder meer een optie om previews te krijgen van websites door met je muis over openstaande tabbladen te bewegen. Ook synchroniseert Edge nu je favorieten en leeslijst-items tussen Windows-apparaten. Ook allerlei standaard meegeleverde apps, zoals die voor E-mail en agenda, hebben kleine verbeteringen gekregen. \r\n\r\nBeter beheer van apps binnen bedrijven\r\nDe update brengt ook extra mogelijkheden voor bedrijven. Grote organisaties kunnen bijvoorbeeld makkelijker beheren welke apparaten bepaalde software-updates moeten krijgen. Ook is het installeren van apps beter te beheren. Zo kunnen bedrijven binnen de Windows Store bepalen welke eigen apps hun medewerkers kunnen of zelfs moeten installeren.\r\n\r\nXbox One nu ook op Windows 10\r\nVanaf 12 november 2015 krijgen ook Microsoft's Xbox One-spelcomputers een update naar Windows 10. Na installatie wordt het ook mogelijk om ruim honderd Xbox 360-games te spelen op de Xbox One.\r\n\r\nDe verbeteringen aan het besturingssysteem zitten in eerste instantie in de prestaties, de werking van Microsofts persoonlijke assistent Cortana, de Skype-integratie, de Edge-browser, Mail, Calender, Groove, Store, Photo's en Solitaire.\r\n\r\nNaast de upgrades introduceert Microsoft twee nieuwe onderdelen, namelijk Windows Update for Business en Windows Store for Business. Met de eerste kunnen updates over verschillende apparaten worden beheerd en met de Windows Store zijn apps beter te beheren. Zo kan opgelegd worden welke standaard-Windows Store-apps en welke eigen apps wel of niet geïnstalleerd kunnen worden of juist geïnstalleerd moeten worden. Ook kunnen apps zo ingesteld worden dat ze alleen gebruik kunnen maken van specifieke opslaglocaties.\r\n\r\nDe byod-opties zijn ook uitgebreid met Mobile Device Management en Azure Active Directory Join is toegevoegd. Binnenkort volgen nog meer updates, die vooral interessant zijn voor zakelijke klanten, zoals de mogelijkheid om onderscheid te maken tussen bedrijfsdata en klantendata. Deze functie komt binnenkort beschikbaar bij Windows Insiders.\r\n\r\nDeze torrent bevat:\r\n\r\n- Windows 10 x86\r\n- Windows 10 x64\r\n- Windows 10 N x86\r\n- Windows 10 N x64\r\n- Re-Loader 2.0\r\n- KMSPico 10.1.8\r\n- KMSAuto Net 2015 1.4.1\r\n- KMSAuto Lite Portable 1.2.3\r\n- Changelog\r\n- Wallpapers","torrent":{"xt":"urn:btih:aef1f6e45164653e0d39d27b3b5b6d84408210ff","amp;dn":"Windows+10+Version+1511+build+10586+Dutch+x86+x64+%2B+Activators","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aef1f6e45164653e0d39d27b3b5b6d84408210ff","infoHashBuffer":{"type":"Buffer","data":[174,241,246,228,81,100,101,62,13,57,210,123,59,91,109,132,64,130,16,255]},"announce":[],"urlList":[]}}