{"title":"THE Odyssey 1992 Season 3 XviD","uid":6416229,"size":2381246498,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aef785853659f267a961bc037222945074460297&amp;dn=THE+Odyssey+1992+Season+3+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"westlock420","files":-1,"time":1306171981,"description":"General Information\n-------------------\nCODEC: XviD = XviD 1.0.3\nRESOLUTION: 448 x 336\nVIDEO BITRATE: 908 kbps\nFPS: 23.976\nPREVIEW\n-------\n\nGeneral Plot\n------------\nFollowing an accident, young Jay Ziegler falls into a coma. While his family and friends must continue their lives in the Real World, Jay finds himself in the magical Downworld on a quest to return home.\n\nSeason 3 Plots\n--------------\nEpisode 1 - No Way Out\nIn the Upworld, Jay has finally come out of his coma, and is attempting to re-adjust to living a normal life, but his mom insists on counseling. Meanwhile, in the Downworld, Finger is the new leader and he puts Jay and Flash in a fight for survival.\n\nEpisode 2 - Dart to the Heart[/b\nIn the Upworld, Jay meets Nikki, with whom he shares his experiences in the coma, but is shocked to discover they see the same therapist. Meanwhile, in the Downworld, Finger hires an assasin to kill Jay.\n\n\n[b]Episode 3 - Learning Curve\nIn the Upworld, Jay isn't doing well in school and considers dropping out. Meanwhile, in the Downworld, Fractal invents a helmet that allows kids to through the wall to the adult side, causing Jay &amp; Flash to compete for the chance to test it.\n\n\nEpisode 4 - Night Life\nIn the Upworld, Jay goes to his first party and tries to get Sierra's attention, while Donna tries to make new friends. Meanwhile in the Downworld, Jay fears Alpha may be caught up in a club of blood-sucking vampires.\n\n\nEpisode 5 - Cry Justice\nIn the Upworld, when Val starts dating a new man, Steve, Jay decides he doesn't like the man. Meanwhile, in the Downworld, Macro orders that all copies of &quot;The Fax&quot;, a newsletter Alpha produces be stopped and the Bladers circulating them be eliminated.\n\n\nEpisode 6 - King for a Day\nIn the Upworld, Jay, Keith and Donna become caught up in a group of teenagers who are harassing a shopkeeper. Meanwhile, in the Downworld: Jay, carrying a strange globe, is proclaimed the &quot;Pathfinder&quot;, by a group of kids in search of their homeland.\n\n\nEpisode 7 - The Cauldron\nIn the Upworld, Jay asks Sierra on a date, much to the annoyance of her boyfriend, Mick. Meanwhile, in the Downworld, Alpha, Jay and Flash make Tower Passes for other kids, Finger charges Medea with being a witch when she refuses to take an oath of loyalty.\n\nEpisode 8 - Styx and Stones\nIn the Upworld, Jay desperately wants to impress Sierra on their date, but much to his chagrin he has very little money. Meanwhile, in the Downworld, Medea is forced to make predictions but every one is directed at Finger, and Jay &amp; Flash plan to help Medea escape.\n\n\nEpisode 9 - Tug Of War\nIn the Upworld, when Jay feels isolated at home he makes plans to run away and Steve promises Jay that he will search for Brad, despite Jay's claim that he doesn't want to be found. Meanwhile, in the Downworld, Fractal's new invention erases all Alpha's work and kills one of her assistants.\n\nEpisode 10 - Tangled Web\nIn the Upworld, Jay continues to see Sierra, despite warnings from Keith and Donna. Meanwhile, in the Downworld, Finger plans to stop the revolution by turning Jay's army against each other.\n\n\nEpisode 11 - No Holds Barred\nIn the Upworld, Jay finally comes face-to-face with his father, Brad and learns the truth. Meanwhile in the Downworld, Jay prepares to take control of the tower, but Finger despersately tries to stop him.\n\n\nEpisode 12 - The Plague\nIn the Upworld, Jay meets with his father, and tries to persuade him to come home. Meanwhile, in the Downworld, as the election campaign begins, Finger develops a plague which freezes the kids into being unable to vote.\n\n\nEpisode 13 - Time Bomb\nIn the Upworld, Jay prepares to tell his mother the truth about her husband. Meanwhile, in the Downworld, angry over the takeover of the Tower, Finger plants a bomb that will destroy the Downworld forever.","torrent":{"xt":"urn:btih:aef785853659f267a961bc037222945074460297","amp;dn":"THE+Odyssey+1992+Season+3+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aef785853659f267a961bc037222945074460297","infoHashBuffer":{"type":"Buffer","data":[174,247,133,133,54,89,242,103,169,97,188,3,114,34,148,80,116,70,2,151]},"announce":[],"urlList":[]}}