{"title":"The War of the Sexes: How Conflict and Cooperation Have Shaped M","uid":8609395,"size":749920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aefbf3d8e7831da35b62da95c2c4e2fad4708dbf&amp;dn=The+War+of+the+Sexes%3A+How+Conflict+and+Cooperation+Have+Shaped+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"iDeusEx","files":-1,"time":1372094662,"description":"The War of the Sexes: How Conflict and Cooperation Have Shaped Men and Women from Prehistory to the Present\n\nPaul Seabright (Author)\n\n\n\nAs countless love songs, movies, and self-help books attest, men and women have long sought different things. The result? Seemingly inevitable conflict. Yet we belong to the most cooperative species on the planet. Isn't there a way we can use this capacity to achieve greater harmony and equality between the sexes? In The War of the Sexes, Paul Seabright argues that there is--but first we must understand how the tension between conflict and cooperation developed in our remote evolutionary past, how it shaped the modern world, and how it still holds us back, both at home and at work. \n\nDrawing on biology, sociology, anthropology, and economics, Seabright shows that conflict between the sexes is, paradoxically, the product of cooperation. The evolutionary niche--the long dependent childhood--carved out by our ancestors requires the highest level of cooperative talent. But it also gives couples more to fight about. Men and women became experts at influencing one another to achieve their cooperative ends, but also became trapped in strategies of manipulation and deception in pursuit of sex and partnership. In early societies, economic conditions moved the balance of power in favor of men, as they cornered scarce resources for use in the sexual bargain. Today, conditions have changed beyond recognition, yet inequalities between men and women persist, as the brains, talents, and preferences we inherited from our ancestors struggle to deal with the unpredictable forces unleashed by the modern information economy. \n\nMen and women today have an unprecedented opportunity to achieve equal power and respect. But we need to understand the mixed inheritance of conflict and cooperation left to us by our primate ancestors if we are finally to escape their legacy.\n\n\n\n","torrent":{"xt":"urn:btih:aefbf3d8e7831da35b62da95c2c4e2fad4708dbf","amp;dn":"The+War+of+the+Sexes%3A+How+Conflict+and+Cooperation+Have+Shaped+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aefbf3d8e7831da35b62da95c2c4e2fad4708dbf","infoHashBuffer":{"type":"Buffer","data":[174,251,243,216,231,131,29,163,91,98,218,149,194,196,226,250,212,112,141,191]},"announce":[],"urlList":[]}}