{"title":"The Art of Alfred Hitchcock by Donald Spoto","uid":9409371,"size":37880268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af4354cbf0d3a12b27c392fab419f776a70a648a&amp;dn=The+Art+of+Alfred+Hitchcock+by+Donald+Spoto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1388242902,"description":"This completely revised and updated edition of the classic text describes and analyzes every movie made by master filmmaker Alfred Hitchcock.\n&quot;Combines thoughtful and engaging analysis and wit and scholarship.&quot;--Chicago Sun-Times\n\nMost Helpful Customer Reviews\n&quot;A Must for Hitchcock Fans&quot;\nBy William Hare on July 6, 2005\nFormat: Paperback\nDaniel Spoto is well known for his fascinating biography of Alfred Hitchcock. &quot;The Art of Alfred Hitchcock&quot; fleshes out The Master every bit as much as the biography, but in a different way.\n\nWhat makes this book a must for Hitchcock fans and, in particular, those interested in studying his mastery of the film craft, is that Spoto, bolstered by many interview hours with Hitchcock, is able to get inside a creative film genius' mind and give us an idea of how he explored his basic themes as well as the manner in which he manipulated audiences through exploiting his unique brand of suspense. Spoto also gives us a look into the technical side of the master film craftsman, letting us know how he kept audiences mesmerized with compelling scenes such as the killing of Janet Leigh in &quot;Psycho&quot; and those incredible special effects in &quot;The Birds&quot; in which it appeared that the winged creatures were about to lay total siege to the previously serene Northern California town of Bodega Bay.\n\nIn addition to what he actually did, Donald Spoto is also to be commended for something he did not do. In so many retrospectives of film greats, be they directors or performers, authors believe in devoting an equal or relatively equal amount of space to every movie with which they were involved. Thankfully Spoto did not do this, devoting greater attention to the classic Hitchcock movies that generated the most discussion among filmgoers and cinema historians. Not surprisingly for those who have studied Hitchcock's films, Spoto regards &quot;Vertigo&quot; starring James Stewart and Kim Novak as Hitchcock's most complete and artistic work and explains why, providing excellent insight into the film in the process.","torrent":{"xt":"urn:btih:af4354cbf0d3a12b27c392fab419f776a70a648a","amp;dn":"The+Art+of+Alfred+Hitchcock+by+Donald+Spoto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4354cbf0d3a12b27c392fab419f776a70a648a","infoHashBuffer":{"type":"Buffer","data":[175,67,84,203,240,211,161,43,39,195,146,250,180,25,247,118,167,10,100,138]},"announce":[],"urlList":[]}}