{"title":"Marvel NOW! Week 76 (4/30/2014) (darkhomr) [ALL]","uid":10079542,"size":670087168,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b054b879c04ba88098dbe5f16957a0e3ce3e80ec&amp;dn=Marvel+NOW%21+Week+76+%284%2F30%2F2014%29+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dadrkhomr","files":13,"time":1398975832,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 76 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Total Marvel pack.\n\nThis weeks' release (April 30, 2014) includes 13 issues with 2 new #1's (Amazing Spider-Man and Uncanny Avengers Annual)  \n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/glnga2_zps8dff185c.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/batwomana1_zps4368c015.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/newavengers17_zps6e2f5ac8.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/avengersai12_zps6c9d1b38.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/amazingspiderman1_zpsdbdba1f2.jpg[/IMG] \n\n\n\n\nAll New X-Men #26 (CBR 4/30/2014)\n\nTHE BROTHERHOOD OF THE FUTURE IS BACK! And it doesn't mean good things for the X-Men of the past! \n\nAmazing Spider-Man #1 (CBR 4/30/2014)\n\nThe Greatest Super Hero of All Time RETURNS! The world may have changed since Spidey's been gone, but so has Peter Parker. This is a man with a second chance at life, and he's not wasting a moment of it. Same Parker Luck, new Parker attitude. Putting the &quot;friendly&quot; back in the neighborhood, the &quot;hero&quot; back into &quot;super hero,&quot; and the &quot;amazing&quot; back into &quot;Spider-Man!&quot; Also returning: The recharged and reenergized ELECTRO! \n\nAvengers #28 (CBR 4/30/2014)\n\nA challenge twenty-eight issues in the making, as Bruce Banner puts the pieces together and confronts Iron Man . . . \n\nAvengers AI #12 (CBR 4/30/2014)\n\nThe stunning conclusion of AVENGERS EMPIRE! In the year 12,000 CE, how have the Avengers evolved? It's the Avengers vs. Dimitrios for the fate of the entire galaxy! \n\nAvengers World #5 (CBR 4/30/2014)\n\nThree Avengers' lives depend on Manifold breaching the unbreachable. What is Manifold's true destiny? \n\nHulk #2 (CBR 4/30/2014)\n\nALL-NEW DIRECTION! THE EPIC &quot;BANNER D.O.A.&quot; BEGINS NOW!!! Following the shocking events of last month's INDESTRUCTIBLE HULK finale, Bruce Banner lies at death's door! If he survives, it WON'T be as the Bruce Banner we've known! How will the Hulk wreak vengeance on Banner's assailant? How CAN he? \n\nNew Avengers #17 (CBR 4/30/2014)\n\nMust the New Avengers destroy a perfect world so that the Earth can live? \n\nOrigin II #5 (of 5) (CBR 4/30/2014)\n\nWITNESS THE END OF THE BEGINNING! As Creed plots something Sinister, can Logan regain his humanity? Kieron Gillen (THOR) and Adam Kubert (AVX) bring the tale of Logan's beginning to a close! \n\nSilver Surfer #2 (CBR 4/30/2014)\n\nWho is the NEVER QUEEN? How is the entire future of the Marvel Universe tied into her very existence? And why is she trying to DESTROY the Silver Surfer?! Are these questions important? Sure. But you know what's just as important? Lunch. Because what Earth girl Dawn Greenwood has for lunch today could change the fate of EVERYTHING! Not kidding here. This is a very important lunch. \n\nUncanny Avengers Annual #1 (CBR 4/30/2014)\n\nThe first appearance of the Avengers of the Supernatural! When the producers of the Mojoverse can't make a hit series they call on Mojo to gather an all-new, all-creepy Avengers! Can the Uncanny Avengers survive the wrath of an unleashed Spirit of Vengeance? \n\nWhat If Age Of Ultron #5 (of 5) (CBR 4/30/2014)\n\nAVENGERS INFINITY! What if Hank Pym never created Ultron at all? Could a world without Ultron survive a world without Ultron's own weapon-turned-Avenger, the Vision? Can the very idea of the Avengers survive without each other? In the darkest of all realities, can the Avengers ever hope to Assemble? \n\nWolverine #5 (CBR 4/30/2014)\n\nLogan faces his most dire threat yet -- with no healing factor to protect him. Gerardo Sandoval (CABLE &amp; X-FORCE) joins the team of the All-New Marvel Now smash hit! \n\nX-Force #4 (CBR 4/30/2014)\n\nX-Force goes head to head with France's superhuman black ops team! But will X-Force's resident Frenchman Fantomex botch his teammates' mission? \n\n\n\n\n\n","torrent":{"xt":"urn:btih:b054b879c04ba88098dbe5f16957a0e3ce3e80ec","amp;dn":"Marvel+NOW%21+Week+76+%284%2F30%2F2014%29+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b054b879c04ba88098dbe5f16957a0e3ce3e80ec","infoHashBuffer":{"type":"Buffer","data":[176,84,184,121,192,75,168,128,152,219,229,241,105,87,160,227,206,62,128,236]},"announce":[],"urlList":[]}}