{"title":"Guys and Dolls (1992 Broadway Revival Cast)","uid":9293418,"size":141765022,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b05f9737ef052a3e0ce85ded76bfea383bc6460c&amp;dn=Guys+and+Dolls+%281992+Broadway+Revival+Cast%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big-Papi","files":25,"time":1386125323,"description":"Guys and Dolls (1992 Broadway Revival Cast) 320cbr Big Papi \n \nBy Chazmond J. Peacock\n\nHi, I am currently doing a production of Guys and Dolls, playing Nicely-Nicely, and I decided to do some research on the various recordings of this show. This 1992 Revival Recording is fantastic, and a fun recording to listen to. The tempos of all of the songs are bright, fun, colorful and really breathe some life into the songs. The overall performances given on this disc are excellent as well...Nathan Lane makes a funny, and charming Nathan Detroit - one can see why Adelaide would put up with his nonsense for 14 years.....Faith Prince keeping with the tradition of nasal Adelaides with the Brooklyn accent does an excellent job here of portraying Adelaide with impeccable comic timing, and belt that can reach the back of any large Broadway house. Her &quot;Adelaide's Lament&quot; was a treat. Peter Gallagher and Josie De Guzman do a wonderful job here, although they are not the best Sky and Sarah I have heard, or seen. Walter Bobbie's characterization of Nicely-Nicely is just adorable and warm, and he does an incredible job on whatever number Nicely has to sing. J.K. Simmons was hilarious as well, with great comic timing.\n\nI only give this recording 4 stars instead of 5 because I feel that sometimes some of the tempos were TOO rushed, to the extent that some of the clever lyrics might be overlooked and compromised, and a lot of the score has been drastically changed, when they didn't need any changes at all - &quot;Runyonland&quot;, and &quot;Sit Down You're Rockin' The Boat&quot; are a couple that come to mind immediately. I think Frank Loesser's score was good enough with out the changes and embellishings that were added to the score for this production.\n\nI would recommend this recording just for the fun of it, but if I were doing a production of this, and wanted to hear an accurate representation of the score, or if I were doing research on this musical, I would either go with the Original Broadway Cast, or the 1995 Complete Recording with Kim Criswell, Don Stephenson and Emily Loesser. Both, especially the latter, give an excellent representation of how the score was initially conceptualized and represented. And how perfect it was, and still is.","torrent":{"xt":"urn:btih:b05f9737ef052a3e0ce85ded76bfea383bc6460c","amp;dn":"Guys+and+Dolls+%281992+Broadway+Revival+Cast%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b05f9737ef052a3e0ce85ded76bfea383bc6460c","infoHashBuffer":{"type":"Buffer","data":[176,95,151,55,239,5,42,62,12,232,93,237,118,191,234,56,59,198,70,12]},"announce":[],"urlList":[]}}