{"title":"The Beatles - All You Need Is Love [original promo].VOB","uid":10394930,"size":124971008,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b09a35d0dbe8a0f5f848fa32b7620fdf4ea1fe2a&amp;dn=The+Beatles+-+All+You+Need+Is+Love+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1403256310,"description":"The Beatles - All You Need Is Love [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;All You Need Is Love&quot; is a song written by John Lennon and credited to Lennon and McCartney. It was first performed by the Beatles on Our World, the first live global television link. Watched by over 150 million in 26 countries, the programme was broadcast via satellite on 25 June 1967. The BBC had commissioned the Beatles to write a song for the United Kingdom's contribution.\n\nThe Beatles were asked to come up with a song with a message understood by everyone. &quot;It was an inspired song and they really wanted to give the world a message,&quot; said Brian Epstein. &quot;The nice thing about it is that it cannot be misinterpreted. It is a clear message saying that love is everything.&quot; According to journalist Jade Wright, &quot;Lennon was fascinated by the power of slogans to unite people and never afraid to create art out of propaganda. When asked in 1971 whether songs like &quot;Give Peace a Chance&quot; and &quot;Power to the People&quot; were propaganda songs, he answered: 'Sure. So was All You Need Is Love. I'm a revolutionary artist. My art is dedicated to change.'&quot;\n\nThe day before the Our World broadcast, the Beatles decided that the song should be their next single. Released in the UK on 7 July 1967, it went straight to number one and remained there for three weeks. It was similarly successful in the United States after its release on 17 July, reaching number one for a week. It was also included on the American LP version of Magical Mystery Tour in November as well as in the film, and on the LP Yellow Submarine, released in 1969. This song is also featured in the Cirque du Soleil's show Love, based on the songs of The Beatles, which has been performing in Las Vegas since 2006.\n\nFor the broadcast, the Beatles were (except for Starr) seated on stools, accompanied by a small studio orchestra. They were surrounded by friends and acquaintances seated on the floor, many of whom were among the leading stars of the British pop scene, who sang with the refrain during the fade-out.\n\nThe performance was not completely live: the Beatles, the orchestra, and guests were overdubbing onto a prerecorded rhythm track mainly consisting of piano, harpsichord, drums, and backing vocals. The full Our World segment opens with the band and company listening to the raw backing track, as commentator Steve Race explained the process in voiceover.\n\nLennon, affecting indifference, was said to be nervous about the broadcast, given the potential size of the international TV audience. Dissatisfied with his singing, he rerecorded the solo verses for use on the single. Starr also overdubbed drums before the single was released, fixing the aforementioned timing problems and adding the drum roll.\n\nThe programme was broadcast in black-and-white (colour television had yet to commence broadcasting in Britain and most of the world). The Beatles' footage was colourised, based on photographs of the event, for The Beatles Anthology documentary.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/All_You_Need_Is_Love&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/All_You_Need_Is_Love&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/AAoFMAaFN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAoFMAaFN&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:03:41\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b09a35d0dbe8a0f5f848fa32b7620fdf4ea1fe2a","amp;dn":"The+Beatles+-+All+You+Need+Is+Love+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b09a35d0dbe8a0f5f848fa32b7620fdf4ea1fe2a","infoHashBuffer":{"type":"Buffer","data":[176,154,53,208,219,232,160,245,248,72,250,50,183,98,15,223,78,161,254,42]},"announce":[],"urlList":[]}}