{"title":"Cowan &amp; Beck - Spiral Dynamics - Mastering Values, Leadership an","uid":6265879,"size":6894171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0af99a187d6bcb1127a4fbbb15ef5488c18fb7d&amp;dn=Cowan+%26+Beck+-+Spiral+Dynamics+-+Mastering+Values%2C+Leadership+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"asperge","files":3,"time":1300906118,"description":"Spiral Dynamics reveals the hidden codes that shape human nature, create global diversities, and drive evolutionary change. These magnetic forces attract and repel individuals, form the webs that connect people within organizations, and forge the rise and fall of nations and cultures. This book tracks our historic emergence from clans to tribes to networks and holograms; identifies seven Variations on Change, and adds power and precision to the design of human systems and 21st century leadership.\n\nSpiral Dynamics is an extension and elaboration of the biopsychosocial systems concept of the late Clare W. Graves; work that Canada's Maclean's Magazine called 'The Theory that Explains Everything'. The authors mesh UK biologist Richard Dawkins' concept of 'memes' with Gravesian 'value systems' in crafting a timely transformational change formula and process. Their concept of MEMES represents the first major statement of the new 'Science of Memetics.'\n\nDon Edward Beck and Christopher C. Cowan, who were closely associated with Clare W. Graves, apply the principles of Spiral Dynamics worldwide in both corporate and top-level governmental sectors. They helped transform South Africa out of race categories, design organizational and marketing systems for a wide range of industries, and revitalize local communities, educational and professional institutions, and sports programs. Based on motivational MEMEs, they also designed a &quot;hearts and minds&quot; strategy for the South African rugby union team, winners of the 1995 World Cup.\n\nBeck and Cowan were on the faculty of the University of North Texas in Denton, Texas, for a number of years before forming the National Values Center.\n\n &lt;a href=&quot;\nhttp://www.amazon.com/gp/product/1405133562&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/gp/product/1405133562&lt;/a&gt;\n\n\n----------------------------------------------\n\nThe document is a djvu file. To read djvu files : http://windjview.sourceforge.net/","torrent":{"xt":"urn:btih:b0af99a187d6bcb1127a4fbbb15ef5488c18fb7d","amp;dn":"Cowan+%26+Beck+-+Spiral+Dynamics+-+Mastering+Values%2C+Leadership+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0af99a187d6bcb1127a4fbbb15ef5488c18fb7d","infoHashBuffer":{"type":"Buffer","data":[176,175,153,161,135,214,188,177,18,122,79,187,177,94,245,72,140,24,251,125]},"announce":[],"urlList":[]}}