{"title":"Seven Times Smarter 50 Activities, Games, and Projects to Develo","uid":9169191,"size":3475018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1076ac935f2069716622f04711b1ce60947acfe&amp;dn=Seven+Times+Smarter+50+Activities%2C+Games%2C+and+Projects+to+Develo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":1,"time":1384039971,"description":" What Is Smart?\nThere's evidence of so much more than &quot;reading, writing, and 'rithmetic&quot; in every child -- at least seven distinct intelligences, according to the theory of multiple intelligences, developed by Harvard's Dr. Howard Gardner. In Seven Times Smarter, veteran educator Laurel Schmidt offers a parent-friendly explanation of this theory and of the ways that kids are -- simply put -- word smart, picture smart, music smart, body smart, logic smart, people smart, and self-smart. These intelligences aren't fixed at birth. They can be nurtured and strengthened, meaning that in the right environment, kids get smarter.\nSeven Times Smarter, an invaluable resource for parents, teachers, and caregivers, provides the perfect way to create this environment. Unlike other craft or activity books that just fill time and keep kids busy, Seven Times Smarter prompts kids aged six to fourteen to work their brains and cultivate new skills using recycled or low-cost materials found in every home -- and enjoy it! It offers an exploration of what it means to be smart, checklists to recognize the seven intelligences in your child, book lists to develop and celebrate all the ways your child is smart, and fifty creative, constructive activities that are good for kids playing alone or in a group, supervised or independently, including:\n* Memory Tours -- If a memory book is too straightforward for your artistic child, try an un-book, a memory box, or a calendar.\n* Hanging Gardens -- Indoors or out, even the smallest garden plot can yield a bumper crop of mathematical, linguistic, scientific, and kinesthetic skills.\n* The Boredom Brigade -- Boredom is a springboard for imagination; imaginary structures, identities, occupations, and friends are just some of the ways kids develop their inter- and intra-personal intelligences.\n* Junk Yard Genius -- There's an education in junk; in fact, it's easy to turn your broken radio, alarm clock, fan, blow-dryer, or scale into a project that could fascinate kids for days.\nGenre: Non Fiction , General\n","torrent":{"xt":"urn:btih:b1076ac935f2069716622f04711b1ce60947acfe","amp;dn":"Seven+Times+Smarter+50+Activities%2C+Games%2C+and+Projects+to+Develo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1076ac935f2069716622f04711b1ce60947acfe","infoHashBuffer":{"type":"Buffer","data":[177,7,106,201,53,242,6,151,22,98,47,4,113,27,28,230,9,71,172,254]},"announce":[],"urlList":[]}}