{"title":"WinRAR v3.90 Final + KeyReg By ChattChitto","uid":5069577,"size":4599589,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b1118bc5bc39627d5460360933aea8b6ea2820f5&amp;dn=WinRAR+v3.90+Final+%2B+KeyReg+By+ChattChitto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ChattChitto","files":-1,"time":1251278151,"description":"WinRAR v3.90 Final + KeyReg [Requested]\n\n.exe File Format (Setup File - KeyReg - Instructions)\n\n***********************************************************************************\n\nWinRAR v3.90 Final\n\nHomepage: http://www.rarlab.com/rar_archiver.htm\n\n\nWinRAR benefits:\n==================\n-Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n-WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n-WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n-When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included. One price, one payment, once.\n-You also receive the benefit of a life-time use of the WinRAR archiver. No upgrade fee to pay. When a new release is made, simply download and install, your license is valid for life.\n-WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n-WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n-WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n-WinRAR offers the ability to create selfextracting and multivolume archives.\n-Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n-WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\n\nWinRAR - What's new in the latest version:\n===========================================\n\nVersion 3.90\n\n   1. WinRAR version for Windows x64 is available. If you use\n      Windows x64, it is strongly recommended to install 64 bit\n      WinRAR version. It provides a higher performance and better \n      shell integration than 32 bit version.\n\n   2. RAR compression speed is improved for multi-core\n      and multi-CPU systems. This improvement is most noticeable\n      in Windows Vista and Windows 7 operating systems.\n\n   3. &quot;Remove duplicate folders from extraction path&quot; option\n      in &quot;Settings/Compression&quot; dialog is replaced by more universal\n      &quot;Remove redundant folders from extraction path&quot; option.\n      This option will eliminate redundant archive name based folders\n      from extraction path if you unpack an archive with\n      &quot;Extract to DestName&quot; context menu command and if archive\n      root folder contains only one folder and no files.\n\n   4. Changes in &quot;Extraction path and options&quot; dialog:\n\n      a) &quot;New folder&quot; button creates a new subfolder in currently\n          selected folder;\n\n      b) F2 key renames a selected folder in the folders tree;\n\n      c) F5 key updated the tree pane contents;\n\n      d) Del key removes a selected folder in the folders tree.\n\n   5. You can enable &quot;Show seconds&quot; option in &quot;Settings/File list&quot;\n      dialog if you wish to see seconds in file dates in file list\n      in WinRAR shell.\n\n   6. &quot;Where to check for SFX archives&quot; options group\n      in &quot;Settings/Integration/Context menus items&quot; dialog lets\n      you to control processing of SFX archives in context menus.\n      For example, if you frequently right click &quot;.exe&quot; files\n      on slow network disks, you can turn off &quot;Network disks&quot; options\n      to minimize the delay before displaying the context menu.\n\n   7. If you sort files by name in the file list in WinRAR shell,\n      WinRAR will use the new logical file name sorting,\n      same as in Windows Explorer, considering digits in file names\n      by their numerical value. So files will be sorted as\n      1.txt, 2.txt, 10.txt instead of previous 1.txt, 10.txt, 2.txt.\n      This new sort behavior is available in Windows XP Service Pack 2\n      and newer.\n   \n   8. Ctrl+W key combination can be used to close the main WinRAR window\n      also as WinRAR viewer windows. &quot;View as Windows text&quot; shortcut\n      in WinRAR viewer changed from Ctrl+W to Ctrl+I.\n   \n   9. New command line switch -r- disables recursion completely.\n      So 'rar a -r- arc dirname' command will add only the empty\n      dirname folder and ignore its contents. By default, if dirname\n      does not include wildcards, RAR adds its contents even if\n      -r switch is not specified.\n\n  10. If used when extracting, the new command line switch -ai forces\n      RAR to ignore file attributes. When using this switch,\n      extracted files will always have attributes assigned by\n      operating system to a newly created file by default.\n\n  11. If output file name is not specified in &quot;cw&quot; command, console RAR\n      will send comment data to stdout.\n\n  12. When compressing stdin data with -si[name] switch, RAR sets \n      modification time of archived entry to current system time.\n      Previous RAR versions did not fill this field, resulting in\n      meaningless modification time for stdin.\n\n  13. Message displayed when you place the mouse cursor on WinRAR\n      tray icon includes the archive name now. Previously only\n      time left and total percent were displayed for archiving operations.\n  \n  14. New 'Shutdown' variable in 'SoftwareWinRARPolicy' registry key\n      allows to disable &quot;Turn PC off when done&quot; option for security reasons.\n      Read &quot;Configuration settings/Registry variables&quot; for more details.\n\n  15. Better shell extension performance. Now WinRAR context menu will be\n      more responsive when working with thousands of selected files.\n\n  16. Improved compatibility with high DPI Windows display mode.\n\n  17. Bugs fixed:\n\n      a) WinRAR could fail to open tar or tar.gz archive if such archive\n         contained a file larger than 8 GB;\n      \n      b) WinRAR context menu did not work properly in Windows 7 beta\n         if icons in context menus were enabled and user clicked\n         a file inside of Windows 7 Library folder;\n  \n      c) previous WinRAR versions failed to rename files having 5 or more\n         continuous spaces in the name. WinRAR shell does not display\n         such spaces for safety reasons, because they can hide an actual\n         file extension. But this security measure prevented the rename\n         command to work properly.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n\n[Please Leave A Comment Confirming This Pack]\n\n-----------------------------------------------------------------------------------\n\nFor Torrent Request: ChattChitto(AT)ChattChitto(DOT)com\n[Put The Request Name In The SUBJECT Box &amp; Also Provide It's Webpage, Or Your Request Will Be Ignored Automatically]","torrent":{"xt":"urn:btih:b1118bc5bc39627d5460360933aea8b6ea2820f5","amp;dn":"WinRAR+v3.90+Final+%2B+KeyReg+By+ChattChitto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1118bc5bc39627d5460360933aea8b6ea2820f5","infoHashBuffer":{"type":"Buffer","data":[177,17,139,197,188,57,98,125,84,96,54,9,51,174,168,182,234,40,32,245]},"announce":[],"urlList":[]}}