{"title":"New Doctor Who - Season 05 (2010) - 13 HD Episodes + 6 SD Specia","uid":10799621,"size":16030906556,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b1119b789119e7e6ab88557e6a1b840b3097e953&amp;dn=New+Doctor+Who+-+Season+05+%282010%29+-+13+HD+Episodes+%2B+6+SD+Specia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"bnaron","files":-1,"time":1408329270,"description":"New Doctor Who - Season 05 (2010) - 13 HD Episodes + 6 SD Specials\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_(series_5)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_(series_5)&lt;/a&gt;\n\n\nThe fifth season of British science fiction television program Doctor Who began on 3 April 2010 with &quot;The Eleventh Hour&quot; and ended with &quot;The Big Bang&quot; on 26 June 2010. The season was led by head writer and executive producer Steven Moffat, who took over after Russell T. Davies, who ended his involvement with the show after The End of Time. The season comprises 13 episodes, six of which Moffat wrote. Piers Wenger and Beth Willis served with Moffat as executive producers, while Tracie Simpson and Peter Bennett served as producers. Though it is the fifth season since the show's revival in 2005 and the thirty-first since it began in 1963, the largely new production team led to the season production codes being reset.\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2010-04-03 - The Eleventh Hour (Video:H264 1280x720, 2944kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Leadworth \nDate: (1996,2008,2010)\nEnemies: Prisoner Zero, Atraxi \n\nThe Doctor has regenerated into a brand new man, but danger strikes before he can even recover. With the TARDIS wrecked, and the sonic screwdriver destroyed, the new Doctor has just 20 minutes to save the whole world - and only Amy Pond to help him.\n\n\n2010-04-10 - The Beast Below (Video:H264 1280x720, 2959kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Starship UK\nDate: 3295 \nEnemies: Smilers\n\nAmy Pond takes her first trip in the TARDIS when the Doctor whisks her away to the distant future and they discover Britain in space. Starship UK houses the future of the British people as they search the stars for a new home. But when Amy explores she encounters the terrifying Smilers and learns a deadly truth inside the Voting Booth.\n\n\n2010-04-17 - Victory To The Daleks (Video:H264 1280x720, 2947kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Earth \nDate: 1941, World War II\nEnemies: Daleks\n\nThe Doctor has been summoned by old friend Winston Churchill, but in the Cabinet War Rooms far below the streets of blitz-torn London, it's his oldest enemy he finds waiting for him, as the time-traveling adventures continue. The Daleks are back, but can Winston Churchill be in league with them?\n\n\n2010-04-24 - The Time of Angels (1) (Video:H264 1280x720, 2959kbps, 25fps - Audio:AAC 44.1kHz, 192kbps)\n\nLocation: Alfava Metraxis \nDate:  51st century\nEnemies: Weeping Angels\n\nA crashed spaceship, a shattered temple and a terrifying climb through the maze of the dead - River Song is back in the Doctor's life, and she's brought more trouble than even he can handle. The last of the weeping Angels is loose in the ruins of Alfava Metraxis, and the Doctor is recruited to track it down. &quot;Don't blink!&quot; everyone tells Amy - but Amy is about to discover, not blinking might just be the worst thing you can do.\n\n\n2010-05-01 - Flesh and Stone (2) (Video:H264 1280x720, 2958kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Alfava Metraxis \nDate:  51st century\nEnemies: Weeping Angels\n\nThere's no way back, no way up and no way out. Trapped among an army of Weeping Angels, The Doctor and his friends must try to escape through the wreckage of a crashed space liner. Meanwhile, in the forest vault, the Doctor's companion, Amy Pond, finds herself facing an even more deadly attack. \n\n\n2010-05-08 - The Vampires of Venice (Video:H264 1280x720, 2957kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Venice, Earth  \nDate: 1580  \nEnemies: Saturnynians\n\nDessicated corpses, terror in the canal and a visit to the sinister House of Calvierri, the Doctor takes Amy and Rory for a romantic mini-break, as the Tardis touches down once again. But 16th-century Venice is not as it should be. The city has been sealed to protect it from the Plague, although Rosanna Calvierri may have other plans...\n\n\n2010-05-15 - Amy's Choice (Video:H264 1280x720, 2949kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Upper Leadworth / The TARDIS\nDate: 2015.\nEnemies: The Dream Lord , The Eknodine\n\nIt has been five years since Amy Pond last traveled with the Doctor, and when he lands in her garden again, on the eve of the birth of her first child, she finds herself facing a heartbreaking choice, one that will change her life forever. They will have to choose which is the dream world and which is reality. \n\n\n2010-05-22 - The Hungry Earth (1) (Video:H264 1280x720, 2940kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Cwmtaff, Wales \nDate: 2020\nEnemies: Silurians \n\nIn 2020, the most ambitious drilling project in history is under way. Dr Nasreen Chaudry and her team have reached 21 kilometers into the Earth's crust - but something is stirring far below. Amy Pond discovers there's nowhere to run when you can't even trust the ground at your feet.\n\n\n2010-05-29 - Cold Blood (2) (Video:H264 1280x720, 2941kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Cwmtaff, Wales \nDate: 2020\nEnemies: Silurians \n\nIt is the most important day in the history of Earth: the dawn of a new age of harmony, or the start of its final war. The Doctor must face his most difficult challenge yet and he tries desperately to ensure Alaya's prediction of a massacre does not come true. Meanwhile, what fate will befall the captured Amy and can Tony and his friends be trusted? \n\n\n2010-06-05 - Vincent and the Doctor (Video:H264 1280x720, 2970kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Auvers-sur-Oise, Earth \nDate: 1890 \nEnemies: Krafayis \n\nTerror lurks in the cornfields of Provence, but only a sad and lonely painter can see it. Amy Pond finds herself shoulder to shoulder with Vincent van Gogh, in a battle with a deadly alien - saving the world has never been so ginger! But can even the Doctor save Vincent?\n\n\n2010-06-12 - The Lodger (Video:H264 1280x720, 2949kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Aickman Road\nDate: 2010 \nEnemies: Number 79B, Aickman Road \n\nThere's a house on Aickman road with a staircase that people go up, but never down... To solve the mystery of the man upstairs, the Doctor must pass himself off as a normal human being, and share a flat with Craig Owens.\n\n\n2010-06-19 - The Pandorica Opens (1) (Video:H264 1280x720, 2974kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Stonehenge, Earth\nDate: 102AD\nEnemies: The Alliance \n\nThe Doctor's friends unite to send him a terrible warning; the Pandorica - which is said to contain the most feared being in all the cosmos - is opening. But what's inside, and can the Doctor stop it? \n\n\n2010-06-26 - The Big Bang (2) (Video:H264 1280x720, 2952kbps, 25fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: National Museum \nDate: 1996\nEnemies: Stone Dalek\n\nThe Doctor is gone, the Tardis has been destroyed, and the universe is collapsing. The only hope for all reality is a little girl who still believes in stars.\n\n\n2010 Specials\n\n2010-01-01 - Special - (News Year's 2010) - The End Of Time (2) (Video:H264 624x352, 876kbps, 24fps - Audio:AAC 44.1kHz, 107kbps)\n\nLocation: London, Earth\nDate: December 2009\nEnemies: The Master, The Time Lords, Joshua Naismith\n\nDark forces amass at The Gate. Only The Doctor stands between the age of order and the time of chaos... only one song remains to be sung.\n\n\n2010-09-06 - Special - (2010) - Doctor Who at the Proms (Video:H264 720x406, 891kbps, 24fps - Audio:AAC 44.1kHz, 105kbps)\n\nDoctor Who returns to the Proms with a new show hosted by stars Karen Gillan and Arthur Darvill, featuring Murray Gold's music, behind-the-scenes access and a host of monsters. The concert features Murray Gold's music for the television series, including his latest re-imagining of Ron Grainier's classic theme tune performed by the BBC National Orchestra of Wales, the London Philharmonic Choir, soloists Yamit Mamo and Mark Chambers, and conducted by Ben Foster. With exclusive behind-the-scenes access, and some specially-edited sequences from the most recent series, a host of monsters laying siege to the Royal Albert Hall and a new scene written especially for the Proms by Steven Moffat and featuring the Time Lord himself, this is an intergalactic musical adventure like no other.\n\n\n2010-11-09 - Special - Meanwhile in the TARDIS (1) (Video:H264 640x360, 490kbps, 25fps - Audio:AAC 44.1kHz, 99kbps)\n\nOn her first trip in the TARDIS, Amy questions the Eleventh Doctor on how the time machine works, why it takes the shape of a police box, and whether he is an alien. The Doctor answers most of her questions, and then opens the TARDIS doors to reveal that thy are in deep space. When Amy doesn't believe what she is seeing, the Doctor pushes her though the doors.\n\n\n2010-11-09 - Special - Meanwhile in the TARDIS (2) (Video:H264 624x360, 494kbps, 25fps - Audio:AAC 44.1kHz, 97kbps)\n\nAs Amy continues her attempts to seduce him, the Doctor explains to her true reason why he travels with a companion. She tricks him into asking the TARDIS to display visual records of previous inhabitants, before he decides to go find Rory at his bachelor party. \n\n\n2010-11-19 - Special - (Children in Need 2010) - A TARDIS Tea Party (Video:H264 640x360, 591kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nMatt and Karen introduce us to 2 boys who have benefited from money raised by Children In Need and have tea in the Tardis with them. This also includes a preview of the Doctor Who Christmas episode &quot;A Christmas Carol&quot;.\n\n\n2010-12-25 - Special -  (Christmas 2010) - A Christmas Carol (Video:H264 832x472, 881kbps, 24fps - Audio:AAC 44.1kHz, 124kbps)\n\nAmy and Rory are trapped on a crashing space liner, and the only way The Doctor can rescue them is to save the soul of a lonely old miser. But is Kazran Sardick, the richest man in Sardicktown, beyond redemption? And what is lurking in the fogs of Christmas Eve?\n\n","torrent":{"xt":"urn:btih:b1119b789119e7e6ab88557e6a1b840b3097e953","amp;dn":"New+Doctor+Who+-+Season+05+%282010%29+-+13+HD+Episodes+%2B+6+SD+Specia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1119b789119e7e6ab88557e6a1b840b3097e953","infoHashBuffer":{"type":"Buffer","data":[177,17,155,120,145,25,231,230,171,136,85,126,106,27,132,11,48,151,233,83]},"announce":[],"urlList":[]}}