{"title":"The Autobiography of Jack the Ripper - James Carnac (2012)","uid":9239905,"size":127297548,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b158cb7a765371501f9425ac0c793e18d2b4a0cc&amp;dn=The+Autobiography+of+Jack+the+Ripper+-+James+Carnac+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Robin1966","files":3,"time":1385243419,"description":"Audio Books : Biography : MP3/Variable : English\n\n\nThe Autobiography of Jack the Ripper (Audiobook) By James Carnac, read by Mark Meadows with Christian Rodska\nUnabridged edition 2012 | 8 hours and 52 mins | ISBN: n/a , ASIN: B0077T5WKA | MP3 32 kbps | 113 MB\n\n\n\nThis memoir was recently discovered and appears to have been written in the 1920s by someone who asserts that he was Jack the Ripper. This person is James Willoughby Carnac, and this memoir was written shortly before his death. It is an account of his entire life, including a few short months in 1888 when he became the murderer known to posterity as Jack the Ripper.\nThis book introduces a new suspect for the infamous murders in Whitechapel in 1888. There is information here that does not appear to be derived from contemporary newspapers or any other publications, and the descriptions of Tottenham in the 1870s, the visits to performances of Jekyll and Hyde, and the intricate geography of Whitechapel in 1888 are written with pin-point accuracy.\nThere is also a credible motive given for James becoming the murderer Jack, and also a reason for the end of the murders. Given the fact that the author also appeared to have knowledge about aspects of the case not in the public arena at the time, it could be that this actually is the autobiography of Jack the Ripper. Ultimately, it is up to the listeners to decide if they believe the mystery has been solved at last, but even if they end up deciding the account to be a work of fiction, it would still be one of the very earliest imaginings of the Ripper case, written in the early years of the 20th century, a fascinating piece of period writing and a worthy addition to the Ripper canon. Whatever side listeners come down on, there is no question that this book will be a source of much debate.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b158cb7a765371501f9425ac0c793e18d2b4a0cc","amp;dn":"The+Autobiography+of+Jack+the+Ripper+-+James+Carnac+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b158cb7a765371501f9425ac0c793e18d2b4a0cc","infoHashBuffer":{"type":"Buffer","data":[177,88,203,122,118,83,113,80,31,148,37,172,12,121,62,24,210,180,160,204]},"announce":[],"urlList":[]}}