{"title":"The Babies - Our House on the Hill (2012) [FLAC]","uid":8155231,"size":237989371,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b166d94a170a7e4b8c99115cbd1d24a8dbd99c4f&amp;dn=The+Babies+-+Our+House+on+the+Hill+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1361149272,"description":"\n  The Babies - Our House on the Hill (2012) [FLAC]\n\n  Released: 2012\n  Duration: 35:08\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Alligator\n  02 Slow Walkin\n  03 Mess Me Around\n  04 Get Lost\n  05 Baby\n  06 Mean\n  07 On My Team\n  08 Moonlight Mile \n  09 See the Country\n  10 That Boy\n  11 Chase it to the Grave\n  12 Wandering\n\n As the Babies move further away from being publicly perceived as a lighthearted side project of Vivian Girls' Cassie Ramone and Woods' Kevin Morby, their sound also takes on a more realized and purposeful feel. While the Babies' songs are deeply rooted in the same elements that inform their parent bands, sophomore record Our House on the Hill moves past the sum-of-its-parts amalgam that made up their first album. Operating more as a unit, their drifty, rootsy moments seem less like direct references to Woods' deeper psychedelia, and their girl group-inspired moments are far too jangly and creeped out to ever work in the context of the Vivian Girls. \n\n  The conversational breeziness of Pavement-esque album-opener &quot;Alligator&quot; gives way to &quot;Mess Me Around,&quot; a quick slice of indie rock so '90s-drenched it actually might be better categorized as alternative rock. The song's one-note guitar leads evoke the Pixies, while the structure and string of foul-mouthed insults that make up the last verse bring to mind the insular manic state of the Lemonheads trashing a hotel after a European festival circa 1992. Many of Morby's tunes bear this fever-pitch energy, and the songs where both he and Ramone sing dual leads capture some of the same spirit as early X. The album's overall moodiness adds to its separation from the key players' other acts. Ramone-led songs like the downright eerie &quot;Baby&quot; or the sad-hearted, country-tinged wanderlust of &quot;See the Country&quot; are completely absent of any of the fuzz or fire that would make them fit in with other Vivian Girls tunes, opting instead for spooky chord progressions and pop so stormy and subtle it could pass for something from the early-'90s Simple Machines roster. \n\n  While the Babies have outgrown the side project stigma, they're still finding their legs as far as some aspects of their sound go. When they slow down the pace, the results get weaker, such as on the poorly conceived melody and lazy lyrics of the toss-off &quot;Mean,&quot; or the deadpan acoustic dirge of &quot;That Boy.&quot; The high-lonesome, ghostly cowboy feel of album-closer &quot;Wandering&quot; also seems somewhat out of place with the stronger, more propulsive numbers. Though front-loaded with its most energetic and moving songs, Our House on the Hill is an intriguing statement from a band shedding their better-known affiliations for a whole new ideal.","torrent":{"xt":"urn:btih:b166d94a170a7e4b8c99115cbd1d24a8dbd99c4f","amp;dn":"The+Babies+-+Our+House+on+the+Hill+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b166d94a170a7e4b8c99115cbd1d24a8dbd99c4f","infoHashBuffer":{"type":"Buffer","data":[177,102,217,74,23,10,126,75,140,153,17,92,189,29,36,168,219,217,156,79]},"announce":[],"urlList":[]}}