{"title":"Molecular Modeling of Inorganic Compounds 2nd ed","uid":15565619,"size":17634676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1844abcf1d7bca343f1a4ccd25aa9eb13e2fdb3&amp;dn=Molecular+Modeling+of+Inorganic+Compounds+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471194898,"description":"Molecular Modeling of Inorganic Compounds 2nd ed - Peter Comba, Trevor W. Hambley (Wiley-VCH, 2001).pdf\r\n\r\nIn many branches of chemistry, Molecular Modeling is a well-established and powerful tool for the investigation of complex structures. The second completely revised and enlarged edition of this highly recognized book shows how this method can be successfully applied to inorganic and coordination compounds.\r\nThe first part of the book gives a general introduction to Molecular Modeling, which will be of use for chemists in all areas. The second part discusses numerous carefully selected examples, chosen to illustrate the wide range of applicability of molecular modeling to metal complexes and the approaches being taken to dealing with some of the difficulties involved. While the general outline is similar to that of the first edition, many of the examples chosen for discussion reflect the changes of the past five years. In the third part, the reader learns how to apply Molecular Modeling to a new system and how to interpret the results. The accompanying software features 20 tutorial lessons based on examples from the literature and the book itself. The authors take special care to highlight possible pitfalls and offer advice on how to avoid them. Therefore, this book will be invaluable to everyone working in or entering the field","torrent":{"xt":"urn:btih:b1844abcf1d7bca343f1a4ccd25aa9eb13e2fdb3","amp;dn":"Molecular+Modeling+of+Inorganic+Compounds+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1844abcf1d7bca343f1a4ccd25aa9eb13e2fdb3","infoHashBuffer":{"type":"Buffer","data":[177,132,74,188,241,215,188,163,67,241,164,204,210,90,169,235,19,226,253,179]},"announce":[],"urlList":[]}}