{"title":"The Global Cold War: Third World Interventions and the Making of","uid":8879490,"size":174750633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b19ce8aada8abad72dad13d07dc4bb5e4f7168fe&amp;dn=The+Global+Cold+War%3A+Third+World+Interventions+and+the+Making+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"blackatk","files":-1,"time":1378293688,"description":"\nPublication Date: February 19, 2007 | ISBN-10: 052170314X | ISBN-13: 978-0521703147 | Edition: First Edition | filetype:pdf \n\n\nThe Cold War between the former Soviet Union and the United States indelibly shaped the world we live in today--especially international politics, economics, and military affairs. This volume shows how the globalization of the Cold War during the 20th century created the foundations for most of today's key international conflicts, including the &quot;war on terror.&quot; Odd Arne Westad examines the origins and course of Third World revolutions and the ideologies that drove the U.S. and the U.S.S.R. towards interventionism. He focuses on how these interventions gave rise to resentments and resistance that, in the end, helped to topple one and to seriously challenge the other superpower. In addition, he demonstrates how these worldwide interventions determined the international and domestic framework within which political, social and cultural changes took place in such countries as China, Indonesia, Iran, Ethiopia, Angola, Cuba, and Nicaragua. According to Westad, these changes, plus the ideologies, movements and states that interventionism stirred up, constitute the real legacy of the Cold War. Odd Arne Westad is Professor of International History at the London School of Economics and Political Science. In 2004 he was named head of department and co-director of the new LSE Cold War Studies Centre. Professor Westad is the author, or editor, of ten books on contemporary international history including Decisive Encounters: The Chinese Civil War, 1946-1950 (2003) and, with Jussi Hanhimaki, The Cold War: A History in Documents and Eyewitness Accounts (2003). In addition, he is a founding editor of the journal Cold War History.\n\n\nPaperback: 496 pages\nPublisher: Cambridge University Press; First Edition edition (February 19, 2007)\nLanguage: English\nISBN-10: 052170314X\nISBN-13: 978-0521703147\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Global-Cold-War-Interventions-Making/dp/052170314X/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Global-Cold-War-Interventions-Making/dp/052170314X/&lt;/a&gt;\n\n\n\nTags: cold, war, proxy, conflict, peace, united, states, usa, america, europe, EU, nato, north, atlantic, treaty, organization, 1945, nuclear, strategy, ussr, soviet, american, russia, union, soviet, socialist, republics, socialism, communism, perestroika, detente, gorbachev, lenin, stalin, cuba, missile, crisis, bipolar, polar, multipolar, nuclear, triad, chemical, biological, red, alert, mutually, assured, destruction, prc, china, ukraine, uzbekistan, finland, moscow, washington, kazakhstan, azerbaijan, estonia, lithuania, poland, belarus, white russia, mao, china, cpc, csu, czu, commissar, kgb, svr, red, army, communism, maoist, maoism, india, global, vietnam, ho, chih, minh, north, south, korea, rok, kim, il, sung, jong, il, nam, kim jong nam, test, standing, committee, vanguard, revolution, military, poltical, international, relations, studies, peace, studies, proxy, state, brink, brinksmanship, gary, powers, u2, espionage, stability, game, theory, rand, trident, minuteman, satan, topol, putin, obama, clinton, bush, flag, afghanistan, ak47, m16, ak74, .308, 7.62x39, csto, sco, third, world, develop, developed, proxy state, state, sponsored, coup, insurrection, assassination, wet, scramble, alert, defcon, threatcon,","torrent":{"xt":"urn:btih:b19ce8aada8abad72dad13d07dc4bb5e4f7168fe","amp;dn":"The+Global+Cold+War%3A+Third+World+Interventions+and+the+Making+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19ce8aada8abad72dad13d07dc4bb5e4f7168fe","infoHashBuffer":{"type":"Buffer","data":[177,156,232,170,218,138,186,215,45,173,19,208,125,196,187,94,79,113,104,254]},"announce":[],"urlList":[]}}