{"title":"GTA III  --  2 CD [2002]","uid":11192579,"size":863397541,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b2ae4e142fa49ad32eafa42a63eea986f0f480f7&amp;dn=GTA+III++--++2+CD+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"555line05_1","files":-1,"time":1413021754,"description":"Grand Theft Auto III is an open world action-adventure video game developed by DMA Design and published by Rockstar Games. It was released on 22 October 2001 for the PlayStation 2 console, on 20 May 2002 for Microsoft Windows, and on 31 October 2003 for the Xbox console. It is the fifth title in the Grand Theft Auto series, and the first main entry since 1999's Grand Theft Auto 2.\n\nGrand Theft Auto III is played from a third-person perspective in an open world environment, allowing the player to interact with the game world at their leisure. The game is set within the fictional city of Liberty City, which is loosely based on New York City.[a] The single-player story follows Claude,[b] a bank robber who is left for dead by his girlfriend, and quickly becomes entangled in a world of gangs, crime, and corruption.\n\nUpon its release, the game was acclaimed by many reviewers who praised its concept and gameplay, which was coupled with the use of a 3D game engine for the first time in the series. It became the best-selling video game of 2001, and has sold over 17 million copies as of 2011. The game is cited as a landmark in video games for its far-reaching influence within the industry. The success of Grand Theft Auto III was a significant factor in the series' subsequent popularity; as of 2008, five prequels set before the events of Grand Theft Auto III have been released, particularly Grand Theft Auto: Liberty City Stories which revisits the Liberty City setting just three years prior. Grand Theft Auto III's violent and sexual content has also been the source of public concern and controversy.\n\nIts successor, Grand Theft Auto: Vice City, was released on 27 October 2002, and also received critical acclaim. In December 2011, in celebration of the game's tenth anniversary, a mobile version of Grand Theft Auto III was released for iOS and Android. The game has also been ported to various other platforms and services, such as Mac OS X and the PlayStation Network.\n\nscreenshot: &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/en/0/00/Gta3-pc-walking.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/en/0/00/Gta3-pc-walking.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:b2ae4e142fa49ad32eafa42a63eea986f0f480f7","amp;dn":"GTA+III++--++2+CD+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ae4e142fa49ad32eafa42a63eea986f0f480f7","infoHashBuffer":{"type":"Buffer","data":[178,174,78,20,47,164,154,211,46,175,164,42,99,238,169,134,240,244,128,247]},"announce":[],"urlList":[]}}