{"title":"Anno.1404.Venice-RELOADED","uid":5392711,"size":912250618,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b304f3cafe7a43eea7b545353a2d62e6c4a4aafe&amp;dn=Anno.1404.Venice-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"thenoobish","files":20,"time":1267119258,"description":"nERv\n\n\n\n\nAnno 1404: Venice (c) Ubisoft\nSolidshield +\n02/2010 :..... RELEASE.DATE .. PROTECTION .......: Activation\n1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n\n\nAnno 1404: Venice is the add-on for Anno 1404, the acclaimed real-time\nstrategy and simulation game released earlier this year. Anno 1404: Venice\nwill combine the signature gameplay mechanics of Anno 1404 and the richness\nof the Venetian culture. In addition, gamers will now be able to play Anno\n1404 with their friends thanks to the new online multiplayer mode.\nExperience the award-winning combination of city building, commerce,\ndiscovery, diplomacy and combat. Create your own nation with a unique blend\nof simulation and real-time strategy. Journey across the globe to explore,\ntrade and learn technologies to expand your empire and to make your own\nhistory. With its extensive and immersive campaign, Anno 1404 guarantees\nnever-ending gaming fun for novices and experts alike.\nClick here to find all the Anno games\nFeatures\n* New Venetian Setting:  The rich Anno 1404 environment is complemented\nwith a new Venetian setting offering new possibilities of interaction.\nBuild two new Venetian ship types: the small and big tradesman cog.\nDevelop secret cabinets, infiltrate your enemies and sabotage their\nexpansion. Take control over enemy cities thanks to your influence in the\ncities#146; council board.\n* Multiplayer: Multiplayer-Mode for up to 4 players or Coop-Mode for up to\n8 players.\n* New Challenges and Quests: Up to 60 new items and 300 new quests with two\nnew mission types: trading race and ship boarding. Discover and exploit a\nnew type of island, the Volcano island. New scenarios to face new\nchallenges with new achievements, medals and quests.\n\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game. This is an addon, and requires the original Anno 1404.\nWe recommend a clean install.\n4. Use our keygen found in the /Crack dir on the DVD to activate the game\nin manual offline mode.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:b304f3cafe7a43eea7b545353a2d62e6c4a4aafe","amp;dn":"Anno.1404.Venice-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b304f3cafe7a43eea7b545353a2d62e6c4a4aafe","infoHashBuffer":{"type":"Buffer","data":[179,4,243,202,254,122,67,238,167,181,69,53,58,45,98,230,196,164,170,254]},"announce":[],"urlList":[]}}