{"title":"Celebrity Rehab with Dr. Drew Seasons 1 &amp; 2 and Sober House","uid":5325316,"size":11065669459,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b405d0213ebbca934490b29f865a417e81d3c137&amp;dn=Celebrity+Rehab+with+Dr.+Drew+Seasons+1+%26+2+and+Sober+House&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"arakon74","files":29,"time":1264998940,"description":"Celebrity Rehab with Dr. Drew is a VH1 reality television show that premiered on January 10, 2008. The show features several celebrities as they undergo treatment for various drug and alcohol addictions. The celebrities are treated by Dr. Drew Pinsky and his staff, including Bob Forrest.\n\nSeason 1 (Episodes 01-10 Included)\n* Daniel Baldwin - actor (departed the show in episode four)\n* Mary Carey - porn star and former candidate for California Governor\n* Chyna Doll (a.k.a., Joanie Marie Laurer) - actress and former professional wrestler\n* Jeff Conaway - actor\n* Jaimee Foxworth - former child actress (Family Matters)\n* Brigitte Nielsen - actress and former model\n* Ricco Rodriguez - Mixed Martial Arts fighter (former UFC Heavyweight Champion)\n* Jessica Sierra - singer and former American Idol contestant\n* Seth Binzer - musician and lead singer of rapcore band Crazy Town\n\nSeason 2 (Episodes 01-09 Included)\n* Steven Adler - former Guns N' Roses drummer\n* Jeff Conaway - actor; returning from Season 1 to recover from numerous back surgeries without abusing his meds.\n* Rodney King - Became a U.S. civil rights figure when videotaped in 1991 being beaten by L.A.P.D. officers. The incident helped spark the 1992 L.A. Riots.\n* Tawny Kitaen - actress and former model\n* Nikki McKibbin - singer and former American Idol contestant\n* Amber Smith - actress and supermodel\n* Sean Stewart - son of singer Rod Stewart.[3]\n* Gary Busey - actor\n* Seth Binzer - singer; returning from Season 1. Came back after Dr. Drew learned of his relapse.\n\nSober House Season 1 (Episodes 01-09 Included)\nSober House is a continuance of Celebrity Rehab, in which celebrities with substance addictions transition from a drug-rehabilitation center to a less-structured, drug-free, sober living home. The home is run by &quot;House Manager&quot; Jennifer Gimenez and former stuntman, rehab tech Will. Bob Forrest serves as the head counselor. Dr. Drew Pinsky provides outpatient counseling to the recovering addicts during their time in the house.","torrent":{"xt":"urn:btih:b405d0213ebbca934490b29f865a417e81d3c137","amp;dn":"Celebrity+Rehab+with+Dr.+Drew+Seasons+1+%26+2+and+Sober+House","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b405d0213ebbca934490b29f865a417e81d3c137","infoHashBuffer":{"type":"Buffer","data":[180,5,208,33,62,187,202,147,68,144,178,159,134,90,65,126,129,211,193,55]},"announce":[],"urlList":[]}}