{"title":"Sociology_ A Very Short Introduction - Bruce, Steve [Non-Fiction","uid":8572287,"size":5774613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b42caf47622dd545b9b938b42ab9818a6906e12a&amp;dn=Sociology_+A+Very+Short+Introduction+-+Bruce%2C+Steve+%5BNon-Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"K-Slender","files":5,"time":1371184309,"description":"\n\nSteve Bruce conveys the essence of the field of sociology in this fascinating volume. A well-known populizer of the discipline, Bruce presents here an introduction to a way of thinking that will appeal to anyone interested in deepening their understanding of modern society.\n\nBruce reasserts the value of sociology as a social science, as a framework of understanding the human condition that grounds its explanations in reliable observations of the real world. Drawing on studies of social class, crime and deviance, work in bureaucracies, and changes in religious and political organizations, Bruce explores the tension between the individual's role in society and society's role in shaping the individual. Sociology: A Very Short Introduction demonstrates the value of sociology as a perspective for understanding the modern world.\n\nAbout the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of ","torrent":{"xt":"urn:btih:b42caf47622dd545b9b938b42ab9818a6906e12a","amp;dn":"Sociology_+A+Very+Short+Introduction+-+Bruce%2C+Steve+%5BNon-Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42caf47622dd545b9b938b42ab9818a6906e12a","infoHashBuffer":{"type":"Buffer","data":[180,44,175,71,98,45,213,69,185,185,56,180,42,185,129,138,105,6,225,42]},"announce":[],"urlList":[]}}