{"title":"Bitmap2Material 3 Pro - Windows &amp; Mac","uid":11135082,"size":93918103,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b42ede85328baf52ac4ce30bac50c5cd9fda4265&amp;dn=Bitmap2Material+3+Pro+-+Windows+%26amp%3B+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ihatethisrecaptcha","files":-1,"time":1412098639,"description":"BITMAP2MATERIAL 3 - THE ULTIMATE IMAGE TO MATERIAL GENERATOR. NOW IN PBR.\n\nBitmap2Material is an incredibly powerful tool that helps you generate full, seamlessly tiling materials from any bitmap image, right within your favorite DCC tool and game engine*. This now includes all PBR (Physically-Based Rendering) channels, based on the most accurate conversion algorithm out there.\n\nBitmap2Material lets you extract all the possible maps from a single image: this now includes PBR channels such base color (or albedo), metallic, roughness but also normal, height, specular, curvature, AO etc.\n\nADJUST HIGHLIGHTS AND SHADOWS\nThis allows you to create the base color (or albedo) for PBR and can be done in just a few clicks.\n\nREMOVE SEAMS\nBitmap2Material provides the ability to make any material tile. You do not need to care anymore about making your photography tile, B2M takes care of it for you. You can chose between 2 modes of tiling: offset or splat.\n\nGENERATE THE METALLIC MAP\nEasily obtain a metallic map from the image using simple tools, or an input mask. This feature is essential when working in PBR.\n\nFULL CONTROL OVER MICROSURFACE\nControl and adjust the finest details of your material thanks to the comprehensive set of parameters exposed by B2M. This includes adjusting the generated roughness map, for PBR.\n\nSHAPE RECOGNITION\nBitmap2Material is the only map extractor which can keep the original shapes of your picture among all your maps.\n\nGRUNGE MAPS\nChange the look&amp;feel of your material with one of the 15 embedded grunge maps, or use one of your own.\n\nThanks to the integration of the Substance Engine into the most used DCC tools and game engines on the market, Bitmap2Material can be used in any of those tools, allowing you to fine tune your material directly on your mesh. This feature is only available with the Pro license.","torrent":{"xt":"urn:btih:b42ede85328baf52ac4ce30bac50c5cd9fda4265","amp;dn":"Bitmap2Material+3+Pro+-+Windows+%26amp%3B+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42ede85328baf52ac4ce30bac50c5cd9fda4265","infoHashBuffer":{"type":"Buffer","data":[180,46,222,133,50,139,175,82,172,76,227,11,172,80,197,205,159,218,66,101]},"announce":[],"urlList":[]}}