{"title":"Udemy - Learn GIMP","uid":12599440,"size":1558521910,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b4387e11745eba0fa7d2b2341c027bdde17217c0&amp;dn=Udemy+-+Learn+GIMP&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":null,"files":34,"time":1445305038,"description":"Learn GIMP\r\n\r\n A comprehensive course on the world's longest standing open source photo manipulation, illustration and design software.\r\n\r\nRating: 5/5 | Students enrolled: 157 | Category: Design / Graphic Design\r\n\r\nLectures: 34 | Length: 7 Hours | Skill level: all level \r\n\r\nInstructed by Brendon Schumacker \r\n\r\n\r\nCourse Description:\r\n\r\nThis course will enable you to work with GIMP imaging software fluidly and create any image that comes to your imagination, as well as giving you the ability to touch up and enhance photos like a professional. Digital drawing, painting, and photography can all be achieved with GIMP.\r\n\r\nThe fundamental imaging skills taught in this course are also universal concepts used throughout all imaging softwares such as Photoshop, Illustrator, and Corel - in such that they all have Layers, Tools, Brushes, and Plug-ins, Scripts, or Macros. Thus if you are a beginner to imaging softwares then you will be gaining competency in &quot;all&quot; softwares by starting with this one GIMP course.\r\n\r\nThe course takes you through download and installation of the software, environment configuration, all commonly used tools, the menu system, making and installing scripts and plug-ins, and a wide array of tips and tricks for photo manipulation, illustration, and graphic design.\r\n\r\nThis &quot;Learn GIMP&quot; course is structured so that it can be watched from beginning to end to train a complete novice from the bottom up, but it is also broken down into discrete lessons so that you can focus on the lessons which you have interest in, and easily return for review on your chosen topic of interest.\r\n\r\n\r\nWhat are the requirements?\r\n\r\n    If you are intending to use your skills immediately you should have a desktop or laptop computer with Windows, OSX, or Linux\r\n\r\n\r\nWhat am I going to get from this course?\r\n\r\n    Over 34 lectures and 6.5 hours of content!\r\n    Alter and Enhance Photos\r\n    Create Images From Imagination\r\n    Understand the Basics of All Image Software\r\n    Make Designs for Business or Hobby\r\n    Use all common and advanced features of Gimp, including scripting!\r\n\r\n\r\nWhat is the target audience?\r\n\r\n    Good for both students and professionals who want to learn the Gimp\r\n    Software enthusiasts and hobbiests are also welcome to enjoy the course\r\n    Requires no background in art or design, all topics will be covered\r\n\r\n\r\n\r\nInstructor Biography - Brendon Schumacker , Illustrator\r\n\r\nBrendon Schumacker is an accomplished artist and illustrator with experience in many art forms. Having drawn since a young age, Brendon has a lifetime of educational background in freehand art from various schools in USA and has studied along side with artists of varied backgrounds, giving him a diverse understanding of many illustration styles and techniques. He has published comics and children's books, has done multiple gallery openings, and has been doing freelance illustration and design for over 10 years. His instruction style is casual and entertaining while also being detailed in his examination of varied art techniques","torrent":{"xt":"urn:btih:b4387e11745eba0fa7d2b2341c027bdde17217c0","amp;dn":"Udemy+-+Learn+GIMP","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4387e11745eba0fa7d2b2341c027bdde17217c0","infoHashBuffer":{"type":"Buffer","data":[180,56,126,17,116,94,186,15,167,210,178,52,28,2,123,221,225,114,23,192]},"announce":[],"urlList":[]}}