{"title":"Inside the Medieval Mind- Knowledge 1 /4   2008 04 17 (BBC 4 )","uid":4143974,"size":574298112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b44f9e7542c7b081eb50c4c3e115b20d1f411358&amp;dn=Inside+the+Medieval+Mind-+Knowledge+1+%2F4+++2008+04+17+%28BBC+4+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"shunster07","files":1,"time":1208633754,"description":"Inside the Medieval Mind- Knowledge 1 /4   2008 04 17 (BBC 4 ) \n\n548 MiB \n58mn \n\nXviD \n &lt;a href=&quot;\nhttp://www3.open.ac.uk/media/fullstory.aspx?id=13412&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www3.open.ac.uk/media/fullstory.aspx?id=13412&lt;/a&gt;\n\nThe four-part series, co-produced by The Open University, will explore the mindset and lifestyle of medieval citizens and will reveal what motivated people who lived between 800AD and 1400AD and what beliefs we share with our ancestors.\n\nMedieval expert Dr Rachel Gibbons, Open University Academic Advisor on the series, said: &quot;This is an important series for several reasons. Robert Bartlett is one of the most authoritative voices on the subject of medieval history and is a voice the audience can trust. The academic research that has gone into this programme is impeccable and the viewer will learn so much about the times just by watching.\n\n&quot;The series? approach is groundbreaking among history programmes. It doesn?t just present events and stories as historical fact, it examines why things happened and why people thought and acted as they did during the Middle Ages. It aims to understand a society rather than just talking about it. The series is not a conventional narrative of important dates; it uses the evidence of historical events and the words and thoughts of people alive in the time to truly get ?inside the medieval mind.&quot;\n\nEach hour-long episode, titled Knowledge, Sex, Belief, and Power, will focus on a different aspect of medieval life and will be a snapshot of life through all levels of the social hierarchy from the lowliest peasant to the highest Lord.\n\nKnowledge explores the disenchantment of the medieval world, as a rediscovery of ancient knowledge and new methods of scholarship in universities led to an intellectual and scientific revolution during this period, whilst exploration and trading contacts expanded the medieval world view beyond all imagination.\n\nSex investigates the private lives of medieval men and women, looking at theories of sexual difference, the realities of male-female relationships and courtly romance, and the attitudes of the Church authorities and wider society to marriage, sex and sexual practice, homosexuality, virginity and the celibate vocation.\n\nBelief explores the fundamental place of religious faith and practice to the identity of people in the Middle Ages. It looks at the relationship between the physical and supernatural worlds, the place of pilgrimage, the sacraments and the power of demons, angels and saints in everyday life and the changing relationship of the Church to monasticism, crusading and those outside conventional Christian society.\n\nFinally, Power analyses the workings of medieval secular society and the assumptions of people at the time about inequality and the distribution of power. It looks at the lot of the peasantry under feudal, forest and common law codes, the realities of chivalry and the military role of the aristocracy, and the relationship of the medieval king to his subjects ? and what might happen when that relationship broke down.\n\nThe series also looks beyond the shores of Britain in the Middle Ages to better reflect a fluid and vibrant period when people, beliefs and ideas spread across continents. Viewers will learn more about the interaction of nations and societies in the medieval world than ever before.\n\nshunster\n\nSource: thebox.bz\n\n","torrent":{"xt":"urn:btih:b44f9e7542c7b081eb50c4c3e115b20d1f411358","amp;dn":"Inside+the+Medieval+Mind-+Knowledge+1+%2F4+++2008+04+17+%28BBC+4+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44f9e7542c7b081eb50c4c3e115b20d1f411358","infoHashBuffer":{"type":"Buffer","data":[180,79,158,117,66,199,176,129,235,80,196,195,225,21,178,13,31,65,19,88]},"announce":[],"urlList":[]}}