{"title":"Chaka Khan - Epiphany: The Best of Chaka Khan, Vol. 1","uid":6610039,"size":556833915,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4a1dee89e7a1343c109fe227998fafdd94cf222&amp;dn=Chaka+Khan+-+Epiphany%3A+The+Best+of+Chaka+Khan%2C+Vol.+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1313560199,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51fxHT3bv1L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51fxHT3bv1L._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Epiphany: The Best of Chaka Khan, Vol. 1\nArtist: Chaka Khan\nAudio CD (March 15, 2005)\nOriginal Release Date: November 12, 1996\nNumber of Discs: 1\nGenre: R&amp;B\nFormat: Free Lossless Audio Codec\n\n*** Complete Hi-Res Cover Scans Are Included ***\n\n\nTrack Listing:\n\n01. Ain't Nobody\n02. Papillon (aka Hot Butterfly)\n03. Tell Me Something Good [Live]\n04. I Feel for You\n05. I Know You, I Live You\n06. I'm Every Woman\n07. Love Me Still\n08. End of a Love Affair\n09. And the Melody Still Lingers On (Night in Tunisia)\n10. Through the Fire\n11. What Cha' Gonna Do for Me\n12. Everywhere\n13. Never Miss the Water [Feat. Me'Shell NdegÃƒÂ©ocello]\n14. Somethin' Deep\n15. Your Love Is All I Know\n16. Every Little Thing\n\n\nAmazon Review:\nWhether with the groundbreaking group Rufus or on her own, Chaka Khan has one of the most distinctive and influential voices in R&amp;B. She's able to wail at full emotive throttle or deliver a love song with nuanced jazz-inflected tones, and sometimes even do both within the same track. This 1996 collection gathers some of Khan's biggest and most beloved solo efforts. Included here are the classic tangy attack of &quot;Ain't Nobody&quot; and the turntable-enhanced smash &quot;I Feel for You&quot; (penned by admirer and recent collaborator Prince). There's also the anthemic original version of &quot;I'm Every Woman,&quot; the moody &quot;Through the Fire,&quot; and her 1996 collabo with Me'Shell Ndegeocello, &quot;You Never Miss the Water.&quot; As all great vocalists do, Khan takes control of every song, breathing fire and life into the words and interpreting them without overpowering their meaning. One listen to Epiphany and it's abundantly clear that, even though she's been AWOL from the charts for a while, Chaka Khan remains a founding mother of soul and funk, armed with a potent voice that can both illuminate and elevate.\n\nAllmusic Review:\nChaka Khan's career through the 1996 release of Epiphany: The Best of Chaka Khan, Vol. 1 -- involving eight albums with Rufus and eight solo albums, along with assorted collaborations -- produced roughly 40 Top 40 R&amp;B singles, not to mention dozens of undervalued album cuts. So it is clear that any one-disc attempt at wrapping up the highlights is bound to work more like a sampler than a true best-of. And though this release is given the &quot;Vol. 1&quot; tag, it remained without a sequel as late as 2005, when Reprise reissued it without altering the contents. Yet another frustration is that previously unreleased songs take the place of missing classics like &quot;Sweet Thing,&quot; &quot;Clouds,&quot; &quot;Fate,&quot; &quot;Close the Door,&quot; and &quot;Stay.&quot; (That's just for starters.) Nonetheless, the disc does contain Khan's most popular work, from ballads like &quot;Through the Fire&quot; to anthems like &quot;I'm Every Woman&quot; and &quot;Ain't Nobody,&quot; along with other radio staples, such as &quot;I Feel for You&quot; and &quot;Tell Me Something Good.&quot; At the absolute least, Khan deserves a solo-only best-of, as well as a disc that sticks strictly to her work with Rufus. (The Very Best of Rufus Featuring Chaka Khan, the only anthology dedicated to Rufus, has its own set of issues.) \n\n","torrent":{"xt":"urn:btih:b4a1dee89e7a1343c109fe227998fafdd94cf222","amp;dn":"Chaka+Khan+-+Epiphany%3A+The+Best+of+Chaka+Khan%2C+Vol.+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a1dee89e7a1343c109fe227998fafdd94cf222","infoHashBuffer":{"type":"Buffer","data":[180,161,222,232,158,122,19,67,193,9,254,34,121,152,250,253,217,76,242,34]},"announce":[],"urlList":[]}}