{"title":"[SinDrive] Marica Hase, Sophie Lynx, Nia (Teaching Asian Maid Ma","uid":9496439,"size":992342505,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b5086917779ef1c8e58171381410f9fee5a0ddd7&amp;dn=%5BSinDrive%5D+Marica+Hase%2C+Sophie+Lynx%2C+Nia+%28Teaching+Asian+Maid+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"chkm8te","files":1,"time":1390125858,"description":"[SinDrive] Marica Hase, Sophie Lynx, Nia (Teaching Asian Maid Marica Hase About High-Class Ass To Mouth Group Sex / 11.16.2013)\n\nIt's pretty fucking nice to live the high life, being comfortably upper class, always looking the part, and of course having a sexy maid to have their way with! Sophie Lynx, Nia, and their upper class man-toy are all sitting around sipping some bubbly when they get the mood to bring their sexy Japanese maid Marica Hase into their sick and twisted world of anal hardcore! Not used to being noticed by her high class employers, Marica is surprised to be giving some champagne, but it's not because she's doing such a great job, but rather they want to get her loosened up for what's about to come! Before she knows it, her high class bosses are shoving her head into some pussy, then on some cock, and as she watches top fashion Nia take it haard from behnid she gets more and more into that upper class groove, doing whatever's demanded of her and eventually taking a big dick deep in her asian ass, all while chomping on pussy as commanded. Sophie Lynx then gets jealous, not allowing the fucking maid to have more fun than her, so she then takes it far up her stink hole as well, having Marica then slurp on that dick directly out of her mouth! When this upper class fuck-fest has run its rough ass-to-mouth course it's time to make a mess all over the maid, with a blast of splooge all over her pretty Japanese face! If you want to see how nasty and hard the seemingly classy upper class types can get, contribute now and see all the fucked up, high fashion group action!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=lwaxa83m1hvhc2i70mpq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=lwaxa83m1hvhc2i70mpq.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=38qv8iutif76puaiz5xq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=38qv8iutif76puaiz5xq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b5086917779ef1c8e58171381410f9fee5a0ddd7","amp;dn":"%5BSinDrive%5D+Marica+Hase%2C+Sophie+Lynx%2C+Nia+%28Teaching+Asian+Maid+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5086917779ef1c8e58171381410f9fee5a0ddd7","infoHashBuffer":{"type":"Buffer","data":[181,8,105,23,119,158,241,200,229,129,113,56,20,16,249,254,229,160,221,215]},"announce":[],"urlList":[]}}