{"title":"The Mammoth Book of Short Horror Novels (gnv64)","uid":8311169,"size":18818797,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5566af96916226977aa72e2302d1b1586a92d01&amp;dn=The+Mammoth+Book+of+Short+Horror+Novels+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"gnv65","files":-1,"time":1364483252,"description":"The Mammoth Book of Short Horror Novels\nEdited by Mike Ashley\nJaico | 1990 | ISBN: N/A | PDF | 518 pages | 17.9 mb\nscanned to PDF by me.\n\nThe short horror novel is an artform in itself, but it is seldom reprinted. Novellas are usually too long for the normal anthologies and too short for separate book publication.\nThe short horror novel, by its very length, lends itself to the optimum development necessary to complete the story. In a short story an author has little room in which to create believable characters and settings. Whilst this can be achieved to a degree, the short story essentially revolves around a single idea. The length of the novel, on the other hand, provides sufficient room for the author to develop characters and breathe life into them and their circumstances. But a novel cannot survive on a single idea, it needs a whole panoply of invention to sustain it. As a result, some novels tend to be falsely inflated, almost bloated, to achieve length rather than purpose. In the novella, on the other hand, there is room enough to develop a range of ideas and characters without letting them grow stale or overstay their welcome. They allow the reader to immerse him or herself in the story without the unwanted deflation of the sudden ending.\nOnly a master can bring a satisfactory conclusion that leaves you thrilled, perhaps a little shaken, but in no way repulsed. All of these ten writers can do it and have done it time and again. I hope you enjoy the sensations they create. Enjoy 10 of the world's great short novels of terror and the supernatural in one giant-value volume:\n\n01.STEPHEN KING The Monkey\n02.ARTHUR CONAN DOYLE The Parasite\n03.RUSSELL KIRK There's a Long, Long Trail A-Winding\n04.ALGERNON BLACKWOOD The Damned\n05.LUCIUS SHEPARD How the Wind Spoke at Madaket\n06.A.C.BENSON The Uttermost Farthing\n07.T.E.D. KLEIN Nadelman's God\n08.OLIVER ONIONS The Rope in the Ratters\n09.JOHN METCALFE The Feasting Dead\n10.DAVID CASE Fengriffen\n\nAbout the Author\nMike Ashley is a leading authority on horror, fantasy and science fiction. Since 1974 he has written and edited numerous books, including Weird Legacies, Souls in Metal, Mrs Gaskell's Tales of Mystery and Horror, Jewels oj Wonder, Best of British SF(2 vols.), Fantasy Readers' Guide to Ramsey Campbell, Who's Who in Horror and Fantasy Fiction, and The Complete Index to Astounding/Analog. He is currently writing a biography of Algernon Blackwood.\nHe has also contributed widely to fantasy magazines and encyclopedias in Britain and America, including Dark Horizons, Locus and Twilight Zone Magazine.","torrent":{"xt":"urn:btih:b5566af96916226977aa72e2302d1b1586a92d01","amp;dn":"The+Mammoth+Book+of+Short+Horror+Novels+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5566af96916226977aa72e2302d1b1586a92d01","infoHashBuffer":{"type":"Buffer","data":[181,86,106,249,105,22,34,105,119,170,114,226,48,45,27,21,134,169,45,1]},"announce":[],"urlList":[]}}