{"title":"American_Top_40_1981_August_22nd","uid":10970944,"size":293183648,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b6628aa452ec3bbab40980fe8de83e8e27e4c24a&amp;dn=American_Top_40_1981_August_22nd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1409790728,"description":"&quot;Billboard tells the music business where the hits are, and AT40 tells the world.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nThe song at number 40 (&quot;Rock &amp; Roll Dreams Come Though&quot; by Jim Steinman) isn't on his latest album, but it is a single packaged WITH his latest album! (These are things you will hear Casey say; and all of it is probably considered to be hearsay evidence).\n\n&quot;Bette Davis Eyes&quot; (originally by Jackie Deshannon), is now a former number one (it served nine non-consecutive weeks) by Kim Carnes (at number 38 this week). Casey's opinion is that Carnes' version is different than Deshannon's (and plays a sample). As a RocketMan Extra, I have entered as Exhibit A: &quot;Marty Feldman Eyes,&quot; (by Bruce 'Baby Man' Baum, [use large eye-cons for a more realistic experience]), and the jury will plainly see his version is different than any others recorded by people who were in their right minds and could not claim insanity as a defense.\n\nAir Supply (at number 33 with &quot;The One That You Love&quot;) earns Casey's award for &quot;Band with The Most Weeks in the Top 40 so far in the 80's.&quot;\n\nA listener who noticed recently when, &quot;Just The Two Of Us&quot; by Grover Washington Jr. peaked at number 2 (on May 2nd nonetheless) asks whether any other songs in the rock era have ever predicted their own peak positions in their titles. Casey lists 7 others. Somehow, the AT40 staff didn't include &quot;1-2-3&quot; by Len Barry (#2 in 1965), &quot;25 or 6 to 4&quot; by Chicago (#4 in 1970), &quot;Got To Give It Up, Part 1&quot; by Marvin Gaye (#1 in 1977), &quot;You're The One That I Want&quot; by John Travolta and Olivia Newton-John (#1 in 1978, and for extra credit) &quot;Double Vision&quot; by  Foreigner (#2 in 1978), and &quot;Stumbling In&quot; by Suzi Quatro (#4 in 1979) (so don't ever write a song about &quot;zero&quot;).\n\nIn 1964 at some London rock club called &quot;The Marquee,&quot; the Rolling Stones were called back for a record-setting six encores according to Casey, (I wasn't there that night; I have witnesses). In 1978 the uncharted (and unknown in the states) &quot;Greg Kihn Band&quot; received 7 encore calls in that same club (always invite your extended family). &quot;The Breakup Song&quot; is at number 20.\n\nCasey plays an in-show extra by the band that holds the all-time record for hitting number 2 the most times without ever hitting number one. Out on nine top-ten hits, five went to number two, and none went to number one.\n\nMarty Balin is at number 12 with his first solo hit, &quot;Hearts.&quot; Casey talks about Balin being interested in &quot;Pyramid Power&quot; which was a brief fad in the 80's caused by some archaeologist discovering really old seeds in a pyramid that grew when planted. &quot;Pyramid Power&quot; promised to extend or give new life to whatever was inside the structure. The novelty shop at the local mall had hollow, plastic pyramids for about $10 apiece and of course I had to have one. It worked in that it did extend the income of the manufacturer, and it also gave new life to the emptiness in my pocket.\n\nConcerning Records Broken: The top 4 spots for the category of &quot;Most Number One Appearances&quot; is held by the four ex-Beatles, and 5th place just naturally goes to Elvis (Casey doesn't say &quot;Most Number One Appearances by a Solo Artist&quot; maybe because duets counted as appearances - he could have said &quot;. . . by a Performer,&quot; I really wish I could cross-examine but I'm going to just stop here - before I am found in contempt of badgering the listener). Well a song that made number one last week added a new name to that line-up. &quot;Endless Love&quot; (written and co-sung by Lionel Richie), put Diana Ross in a tie with Elvis, and it remains number one this week. (Okay, we are in recess!)\n\nLW#1: Endless Love - Diana Ross &amp; Lionel Richie\n40: Rock &amp; Roll Dreams Come Though - Jim Steinman\n39: Double Dutch Bus - Frankie Smith\n38: Bette Davis Eyes - Kim Carnes\n37: Time - Alan Parsons Project\n36: Breaking Away - Balance\n35: For Your Eyes Only - Sheena Easton\n34: I Could Never Miss You - Lulu\n33: The One That You Love - Air Supply\n32: Everlasting Love - Rex Smith &amp; Rachel Sweet\n31: The Voice - The Moody Blues\n30: Beach Boys Medley - The Beach Boys\n29: Love On A Two Way Street - Stacy Lattisaw\n28: Hold On Tight - E.L.O.\nLDD: I Honestly Love You - Olivia Newton-John\n27: You're My Girl - Frankie &amp; The Knock-Outs\n26: Don't Give It Up - Robbie Patton\n25: That Old Song - Ray Parker, Jr. &amp; Raydio\n24: Feels So Right - Alabama\n23: Step By Step - Eddie Rabbitt\n22: Fire and Ice - Pat Benetar\nArchive: Groovin' - The Young Rascals\n21: Really Wanna Know You - Gary Wright\n20: The Breakup Song - The Greg Kihn Band\n19: In The Air Tonight - Phil Collins\n18: Cool Love - Pablo Cruise\n17: The Stroke - Billy Squire\n16: Touch Me When We're Dancing - The Carpenters\n15: Urgent - Foreigner\nEXTRA: Lookin' Out My Back Door - Creedence Clearwater Revival\n14: It's Now Or Never - John Schneider\n13: Elvira - The Oak Ridge Boys\n12: Hearts - Marty Balin\nARCHIVE: Respect - Aretha Franklin\n11: Who's Crying Now - Journey\n10: Lady (You Bring Me Up) - The Commodores\n9: No Getting' Over Me - Ronnie Milsap\n8: Queen of Hearts - Juice Newton\n7: Boy from New York City - The Manhattan Transfer\n6: Stop Draggin' My Heart Around - Stevie Nicks W/ Tom Petty\n5: Jessie's Girl - Rick Springfield\n4: Slow Hand - The Pointer Sisters\n3: I Don't Need You - Kenny Rogers\n2: Believe It Or Not - Joey Scarbury\n1: Endless Love - Diana Ross &amp; Lionel Richie","torrent":{"xt":"urn:btih:b6628aa452ec3bbab40980fe8de83e8e27e4c24a","amp;dn":"American_Top_40_1981_August_22nd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6628aa452ec3bbab40980fe8de83e8e27e4c24a","infoHashBuffer":{"type":"Buffer","data":[182,98,138,164,82,236,59,186,180,9,128,254,141,232,62,142,39,228,194,74]},"announce":[],"urlList":[]}}