{"title":"Russ Kick - You are Still Being Lied to - The New Disinformation","uid":15451970,"size":4040103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6902509fa10657a0fad9341309fcb0ef1965069&amp;dn=Russ+Kick+-+You+are+Still+Being+Lied+to+-+The+New+Disinformation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469950098,"description":"https://extraimago.com/images/2016/07/31/you-are-still-being-lied-to.jpg\r\n\r\nRuss Kick - You are Still Being Lied to - The New Disinformation Guide to Media Distortion, Historical Whitewashes and Cultural Myths 2009\r\n\r\nA must-have revised and expanded edition of The Disinformation Company's classic anthology, You Are STILL Being Lied To contains more than a dozen all-new essays from contributors like Norman Solomon, Graham Hancock, Alex Jones, John Major Jenkins, Robert Bauval, Richard DeGrandpre, Alexandra Bruce, John Hogue, Gregory Davis, and Scott Creighton on topics ranging from the misleading marketing of antidepressants to the truth about the North American Union, from media consolidation to the New Thought movement.\r\n\r\nEditor Russ Kick's massive collection acts as a battering ram against the distortions, myths, and outright lies that have been shoved down our throats by the government, the media, corporations, organized religion, the scientific establishment, and others who want to keep the truth from us.\r\n\r\nAn unprecedented group of researchers including Howard Zinn, Noam Chomsky, Howard Bloom, Sydney Schanberg, Michael Parenti, Riane Eisler, Jim Marrs, and many, many others--investigative reporters, political dissidents, academics, media watchdogs, scientist-philosophers, social critics, and rogue scholars--paints a picture of a world where crucial stories are ignored or actively suppressed and the official version of events has more holes in it than Swiss cheese. A world where real dangers are downplayed and nonexistent dangers are trumpeted. In short, a world where you are being lied to","torrent":{"xt":"urn:btih:b6902509fa10657a0fad9341309fcb0ef1965069","amp;dn":"Russ+Kick+-+You+are+Still+Being+Lied+to+-+The+New+Disinformation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6902509fa10657a0fad9341309fcb0ef1965069","infoHashBuffer":{"type":"Buffer","data":[182,144,37,9,250,16,101,122,15,173,147,65,48,159,203,14,241,150,80,105]},"announce":[],"urlList":[]}}