{"title":"On The Seventh Day - 40 Scientists Explain Why They Believe In G","uid":10386828,"size":1048690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b71460fe884a8b4ffd5a6af07fb7734682858d1d&amp;dn=On+The+Seventh+Day+-+40+Scientists+Explain+Why+They+Believe+In+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1403141223,"description":"For all their intellectual gifts, those with PhD's are hungry for the same thing the rest of the population seeks; peace and spiritual fulfillment. Some hide behind a cool, clinical exterior, yet grapple with internal insecurities, fears, and disappointments.\n\nThe scientific mind is eager to find truth; indeed, the very pursuit energizes scientists from a plethora of disciplines and backgrounds. This book was compiled for them. It contains not only &quot;scientific&quot; inquiries into the miraculous, but personal and poignant travels on the road to serenity.\n\nOver 40 PhD's in this book explore the linkage between science and faith, and what that means not only to individuals, but to the entire planet, as well. For example, meet: The skeptic who realized that this solution to a problem was not only wrong, but destructive. Read how a miraculous solution to a vexing problem brought him to faith. A psychiatrist who saw her career and personal life transformed by the intersection of faith and knowledge. Scientists who gaze at the heavens, and peer at microscopic creatures to better understand the world in which we live.\n\nIf you are a friend who wants to introduce your scientist friend to God, then you've found the perfect gift with On the Seventh Day . If you are a skeptic, have a read. You'll be amazed that you've taken this path in your search for truth. In this book, you too can find rest from this hard business called life.\n\n\nAbout the editor:\nDr. John F. Ashton PhD is an Australian scientist. He writes, edits and co-authors books which provide evidence for creation and the historical accuracy of the Bible. He also co-authors books on health and nutrition. He holds research degrees in both chemistry and philosophy and is a Chartered Chemist and Fellow of the Royal Australian Chemical Institute. He also serves as an Adjunct Professor in the School of Applied Sciences at RMIT University, Melbourne and as an Adjunct Professor in the School of Biomedical and Health Sciences at Victoria University. His career includes 14 years teaching in tertiary science education and over 26 years in industrial research for large Australian companies.","torrent":{"xt":"urn:btih:b71460fe884a8b4ffd5a6af07fb7734682858d1d","amp;dn":"On+The+Seventh+Day+-+40+Scientists+Explain+Why+They+Believe+In+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b71460fe884a8b4ffd5a6af07fb7734682858d1d","infoHashBuffer":{"type":"Buffer","data":[183,20,96,254,136,74,139,79,253,90,106,240,127,183,115,70,130,133,141,29]},"announce":[],"urlList":[]}}