{"title":"Teen Titans - The Judas Contract + Ex (1984, Dgtl-E)","uid":9562665,"size":153499833,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b71df6182249a854404b04bd196837490319c42d&amp;dn=Teen+Titans+-+The+Judas+Contract+%2B+Ex+%281984%2C+Dgtl-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1391462341,"description":"For more information about this storyline, please check out the wikilink here: &lt;a href=&quot;\nhttp://dc.wikia.com/wiki/New_Teen_Titans:_The_Judas_Contract&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dc.wikia.com/wiki/New_Teen_Titans:_The_Judas_Contract&lt;/a&gt;\n\nAfter a few years on their stellar, highly praised creative run on the New Teen Titans, George Perez and Marv Wolfman introduced the character of Terra, who had the ability to manipulate raw earth. It was quickly clear, however, that she was manipulating much more than that, and working for Deathstroke the Terminator as a spy. These initial seeds of doubt as to her character came to a bloom in the payoff know as &quot;The Judas Contract&quot;. This (at the time) shocking story not only revealed that Terra was in league with Deathstroke, but also that she was in a relationship with him! Being 15 at the time, with Slade Wilson a full adult, this was not the most pleasant reveal. However, the story of betrayal was done so well that it instantly became famous in comic circles for its slow burn and the effect it had on the Titans for years to come.\n\nThis is not the TPB of The Judas Contract, rather it is the 4 individual issues that the main story takes place in along with a bonus - New Teen Titans 39, in which Robin sheds his old costume and soon embraces the identity of Nightwing. Dick Grayson would be known as Nightwing for nearly 25 continuous years beforee briefly becoming Batman proper during Grant Morrision's run, and as of now he is again known by that name. The issues are labeled in reading order, and though the TPB has a few more earlier issues included they are not necessary to understand the gist of the story. All issues are digital, thanks to Empire. Please seed, and enjoy! :-)\n\n","torrent":{"xt":"urn:btih:b71df6182249a854404b04bd196837490319c42d","amp;dn":"Teen+Titans+-+The+Judas+Contract+%2B+Ex+%281984%2C+Dgtl-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b71df6182249a854404b04bd196837490319c42d","infoHashBuffer":{"type":"Buffer","data":[183,29,246,24,34,73,168,84,64,75,4,189,25,104,55,73,3,25,196,45]},"announce":[],"urlList":[]}}