{"title":"Of Stones and Man - From the Pharaohs to the Present Day.pdf","uid":11194688,"size":15009248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7a5a49ea6c9cdbc5e53bc7b785b9d609669db00&amp;dn=Of+Stones+and+Man+-+From+the+Pharaohs+to+the+Present+Day.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1413065931,"description":"Jean Kerisel, &quot;Of Stones and Man: From the Pharaohs to the Present Day&quot; \nEnglish | ISBN: 0415364418, 0415383455 | 2005 | 152 pages | PDF | 14 MB\n\nOf Stones and Man explores the many errors of judgement made by civilizations both ancient and modern across the world. Arrogance and a penchant for excess drove mankind to build ever greater and more ambitious edifices. The author analyzes these works from a scientific and historically-sensitive perspective, highlighting the hydro-geological background to repeated infamous disasters, from the faults inherent in the Sphinx to the leaning Tower of Pisa. Beautifully illustrated throughout, Of Stones and Man is a testament to the impermanence of our surroundings. It questions how the earth and its resources have borne the cumulative burden placed upon it over the ages by one civilization after another, and how, in turn, the earth has exacted its inevitable revenge on the great constructions of our ancestors. Of Stones and Man is the final work of Jean Kerisel (1908-2005) who served as President of the International Society for Soil Mechanics and Foundation Engineering from 1973 to 1977, and who worked worldwide as a consultant on many ambitious engineering projects. Driven by his great passion for Ancient Builders and Egyptology, Kerisel here extends his professional knowledge into the realms of historical architecture.","torrent":{"xt":"urn:btih:b7a5a49ea6c9cdbc5e53bc7b785b9d609669db00","amp;dn":"Of+Stones+and+Man+-+From+the+Pharaohs+to+the+Present+Day.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7a5a49ea6c9cdbc5e53bc7b785b9d609669db00","infoHashBuffer":{"type":"Buffer","data":[183,165,164,158,166,201,205,188,94,83,188,123,120,91,157,96,150,105,219,0]},"announce":[],"urlList":[]}}