{"title":"Order of Battle World War II-SKIDROW","uid":15382094,"size":1406776210,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8104c632cdb5166295e30f751eb2e7330dc2ff5&amp;dn=Order+of+Battle+World+War+II-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Pirata","files":3,"time":1469236573,"description":"S  K  I  D  R  O  W\r\n.the leading force.\r\n\r\nproudly presents\r\nOrder of Battle: World War II\r\n(c) Slitherine Ltd.\r\n\r\n15-06-2016......Release Date &lt;-&gt; Protection.................Steam\r\nStrategy...........Game Type &lt;-&gt; Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nOrder of Battle: World War II is breath of fresh air for all strategy\r\nfans. It is a game that takes wargaming to a new level by upgrading\r\nevery single game element and rebooting the genre for a new generation\r\nof players. Detailed terrain, rich animations and a slick interface,\r\nall within a traditional setting and with the elements that are\r\nfamiliar to experienced players - Order of Battle: World War II follows\r\nin the footsteps of all time classics, such as Panzer General.\r\n\r\nWith a selection of over 700 unique looking and behaving units, players\r\ncan build and manage their army, fleet and air force throughout the\r\ncampaigns set in the various theatres of operations during WW2. A\r\nunique system of specializations allows players to customize their\r\nforces with special units, bonuses and abilities that reflect the\r\ndifference in strategies and mentality of the various factions.\r\n\r\nA set of unique Commanders - split between Generals, Pilots and\r\nCaptains - is gradually unlocked in the campaigns. These can be\r\nattached to specific units to provide unique bonuses to anything in\r\ntheir command range. While good use of unit types and tactics remains\r\nthe player's priority, clever use of Commanders can tip the balance in\r\nan offensive operation or buy just enough time in defense to turn the\r\ntide to your favor.\r\n\r\nIn Order of Battle: World War II, a unique supply system also plays a\r\nkey factor that directly affects the combat efficiency of the units.\r\nLanding on an enemy island without any support ships will prevent the\r\ninvasion forces from building a solid beachhead, and breaking the\r\nsupply lines of your opponent, isolating his units and making\r\nencirclement maneuvers are the strategies required to achieve an\r\nultimate victory.\r\n\r\nAdd an intuitive in-game scenario editor, up to 4 player multiplayer\r\nsupport through Hotseat or Slitherine's PBEM++ server system and you\r\nhave a game with endless re-playability.\r\n\r\nFeatures:\r\n\r\nClassic turn based, hex based gameplay with an intuitive UI and great\r\ndepth.\r\n\r\nPlay in dynamic campaigns with unit carryover and multiple &quot;what-if&quot;\r\nscenarios.\r\n\r\nA rich 3D world with detailed animations and effects. Turn-based\r\nwargaming has never looked this good!\r\n\r\n20 different Specializations give a unique feel to each faction\r\nincluding Banzai Charge, Bushido Code and even the Manhattan Project.\r\n\r\nOver 700 different unit types, including infantry, tanks, ships and\r\naircraft, each with unique visuals and animations\r\n\r\nAttach unique commanders to your units to give them additional\r\noffensive and defensive bonuses\r\n\r\nA deep but intuitive supply system allowing breakthroughs &amp;\r\nencirclements.\r\n\r\n4 player multiplayer over PBEM++ and hotseat, supporting\r\nlast-man-standing, teamplay and cooperative against AI scenarios.\r\n\r\nAn extensive, user-friendly in-game scenario editor with a\r\nwhat-you-see-is-what-you-get design.\r\n\r\nNOTE:\r\n\r\nOrder of Battle: World War II, formerly known as Order of Battle:\r\nPacific, is a bigger project with a wider scope and the goal of\r\nfeaturing multiple fronts of World War II.\r\n\r\nWe could have released it as an update for Order of Battle: Pacific,\r\nbut since the whole game got updated, new content and the game changed\r\nname - we decided to do a full release with all currently released DLC\r\nto date.\r\n\r\nYes, we do know that the main game is free, but the game does only\r\ncontains the initial bootcamp missions plus the first scenario of every\r\nDLC Campaign - like try before buying example. Rest of the game content\r\nare still only accessable if you pay for it.\r\n\r\nCurrently payed, released and included DLC are in this release:\r\n\r\nOrder of Battle: Rising Sun\r\nOrder of Battle: US Pacific\r\nOrder of Battle: U.S. Marines\r\nOrder of Battle: Morning Sun\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!\r\nGREETINGS\r\n\r\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:b8104c632cdb5166295e30f751eb2e7330dc2ff5","amp;dn":"Order+of+Battle+World+War+II-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8104c632cdb5166295e30f751eb2e7330dc2ff5","infoHashBuffer":{"type":"Buffer","data":[184,16,76,99,44,219,81,102,41,94,48,247,81,235,46,115,48,220,47,245]},"announce":[],"urlList":[]}}