{"title":"Cat.Girl.Alliance-FASiSO","uid":5738562,"size":753661106,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b84149c3c21a8cd8f07c9f159a02098163b0a13d&amp;dn=Cat.Girl.Alliance-FASiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1280918602,"description":"Cat Girl Alliance *ISO*\n\nDate: 2010-08-03 Files: 51 x 15.00\nCompany:Language: English\nRequirements: Computer, Windows 2K/ME/XP/Vista/7\n\nI am Tachibana Eiji, a regular transfer student. Everything was going fine\nat my new school, but I was in for a shock one day when I discovered the\nclass president Rumi and my classmate Natsuki having sex in the school\ninfirmary! Not only that, it turned out that Rumi was a futanari - a\nhermaphrodite with something between her legs I wasn't expecting to see\nThat evening when I got home and got a call from Rumi to come and meet her\nI knew it couldn't be good - but the first thing she said was, &quot;won't you\njoin us?&quot;\n\nAccording to her story she'd been a futanari from birth, and because of\nthis had an unquenchable curiosity regarding the ways of sex. She'd gotten\nto the point where having Natsuki as a sex partner wasn't enough... she\ntold me she was planning to train our classmate Shizuko as a sex slave!\nShizuko, a neat freak famous for her disike of her male classmates, had let\nit slip to Rumi that she was secretly very curious about sex as well\n\nFaced with no other options, I had no choice but to accept Rumi's request\nto join her and her comrades in their erotic schemes... and from that\nmoment I was bound to these cute and &quot;ecchi&quot; kitties in their catgirl\nalliance!\n\nFeaturing multiple paths that range from amorous romantic play to kinky\n&quot;training&quot; sex, animal girl cosplay galore, and deviant themes from light\nbondage to exhibitionism, this cute and sexy romp through fantasy school\nlife from G-Collections and Japanese maker Sekilala is one you won't want\nto miss!\n\nURL:\nNOTE: Game is already precracked\n\n1. UnRAR\n2. Burn the ISO with your favorite software\n3. Install game","torrent":{"xt":"urn:btih:b84149c3c21a8cd8f07c9f159a02098163b0a13d","amp;dn":"Cat.Girl.Alliance-FASiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b84149c3c21a8cd8f07c9f159a02098163b0a13d","infoHashBuffer":{"type":"Buffer","data":[184,65,73,195,194,26,140,216,240,124,159,21,154,2,9,129,99,176,161,61]},"announce":[],"urlList":[]}}