{"title":"Thomas Pink - The Will and Human Action. From Antiquity to the P","uid":9952280,"size":1074182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8436526c3826d78cdfe5302b358e066ff128a4f&amp;dn=Thomas+Pink+-+The+Will+and+Human+Action.+From+Antiquity+to+the+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1397418649,"description":"Description\nProduct Details\nBook Title: The Will and Human Action: From Antiquity to the Present Day (London Studies in the History of Philosophy)\nBook Author: Thomas Pink, M.W.F. Stone\nSeries: London Studies in the History of Philosophy (Book 4)\nPaperback: 232 pages\nPublisher: Routledge (November 11, 2003)\nLanguage: English\nISBN-10: 041532467X\nISBN-13: 978-0415324670\n\nBook Description\nPublication Date: November 11, 2003 | ISBN-10: 041532467X | ISBN-13: 978-0415324670\nWhat is the will? And what is its relation to human action?\nThroughout history, philosophers have been fascinated by the idea of 'the will': the source of the drive that motivates human beings to act. However, there has never been a clear consensus as to what the will is and how it relates to human action. Some philosophers have taken the will to be based firmly in reason and rational choice, and some have seen it as purely self-determined. Others have replaced the idea of the human will with a more general drive uniting humans and the rest of nature, living and non-living.\nThis collection of nine specially commissioned papers trace the formulation and treatment of the problem of the will from ancient philosophy through the scholastic theologians of the Middle Ages, to modern philosophy, and right up to contemporary theories. Philosophers discussed include Plato, Aristotle, Augustine, Aquinas, Bonaventure, Hobbes, Kant, Schopenhauer and Nietzsche.\n\nReview\n'The reader will find clear, exegetical accounts of the views various historical figures held on the will and its place in their theory of action' British Journal for the History of Philosophy --This text refers to the Hardcover edition.\n\nAbout the Authors\nM. W. F. Stone is Professor of Philosophy at the Katholieke Universiteit Leuven in Belgium.\nThomas Pink is Lecturer in Philosophy at Kings College London.","torrent":{"xt":"urn:btih:b8436526c3826d78cdfe5302b358e066ff128a4f","amp;dn":"Thomas+Pink+-+The+Will+and+Human+Action.+From+Antiquity+to+the+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8436526c3826d78cdfe5302b358e066ff128a4f","infoHashBuffer":{"type":"Buffer","data":[184,67,101,38,195,130,109,120,205,254,83,2,179,88,224,102,255,18,138,79]},"announce":[],"urlList":[]}}