{"title":"Encyclopedia of Consciousness (4 vols)","uid":6595929,"size":13367755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8d16f321f6e7a1822dbffc8465ead65edea3e67&amp;dn=Encyclopedia+of+Consciousness+%284+vols%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":2,"time":1313013324,"description":"Consciousness has long been a subject of interest in philosophy and religion but only relatively recently has it become subject to scientific investigation. Now, more than ever before, we are beginning to understand this mental state. Developmental psychologists understand when we first develop a sense of self; neuropsychologists see which parts of the brain activate when we think about ourselves and which parts of the brain control that awareness. Cognitive scientists have mapped the circuitry that allows machines to have some form of self awareness, and neuroscientists investigate similar circuitry in the human brain.\n\nResearch that once was separate inquiries in discreet disciplines is converging. List serves and small conferences focused on consciousness are proliferating. New journals have emerged in this field. A huge number of monographs and edited treatises have recently been published on consciousness, but there is no recognized entry point to the field, no comprehensive summary. This encyclopedia is that reference.\n\nOrganized alphabetically by topic, coverage encompasses a summary of major research and scientific thought regarding the nature of consciousness, the neural circuitry involved, how the brain, body, and world interact, and our understanding of subjective states. The work includes contributions covering neuroscience, psychology, philosophy, and artificial intelligence to provide a comprehensive backdrop to recent and ongoing investigations into the nature of conscious experience from a philosophical, psychological, and biological perspective. \n\nHardcover: 1400 pages \nPublisher: Academic Press; 1 edition (April 27, 2009) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:b8d16f321f6e7a1822dbffc8465ead65edea3e67","amp;dn":"Encyclopedia+of+Consciousness+%284+vols%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8d16f321f6e7a1822dbffc8465ead65edea3e67","infoHashBuffer":{"type":"Buffer","data":[184,209,111,50,31,110,122,24,34,219,255,200,70,94,173,101,237,234,62,103]},"announce":[],"urlList":[]}}