{"title":"Peter H. Kahn Jr. - Technological Nature. Adaptation and the Fut","uid":10425874,"size":1539554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b99e4eb858b20d05afe9d673832d8ed5a1f1664d&amp;dn=Peter+H.+Kahn+Jr.+-+Technological+Nature.+Adaptation+and+the+Fut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1403702754,"description":"Description\nProduct Details\nBook Title: Technological Nature: Adaptation and the Future of Human Life\t\nBook Author: Peter H. Kahn Jr. (Author)\nHardcover: 248 pages\nPublisher: The MIT Press (February 25, 2011)\nLanguage: English\nISBN-10: 0262113228\nISBN-13: 978-0262113229\n\n===================================================================================\nBook Description\nPublication Date: February 25, 2011 | ISBN-10: 0262113228 | ISBN-13: 978-0262113229 | Edition: 1\nOur forebears may have had a close connection with the natural world, but increasingly we experience technological nature. Children come of age watching digital nature programs on television. They inhabit virtual lands in digital games. And they play with robotic animals, purchased at big box stores. Until a few years ago, hunters could &quot;telehunt&quot; -- shoot and kill animals in Texas from a computer anywhere in the world via a Web interface. Does it matter that much of our experience with nature is mediated and augmented by technology? In Technological Nature, Peter Kahn argues that it does, and shows how it affects our well-being.\nKahn describes his investigations of children's and adults' experiences of cutting-edge technological nature. He and his team installed &quot;technological nature windows&quot; (50-inch plasma screens showing high-definition broadcasts of real-time local nature views) in inside offices on his university campus and assessed the physiological and psychological effects on viewers. He studied children's and adults' relationships with the robotic dog AIBO (including possible benefits for children with autism). And he studied online &quot;telegardening&quot; (a pastoral alternative to &quot;telehunting&quot;).\nKahn's studies show that in terms of human well-being technological nature is better than no nature, but not as good as actual nature. We should develop and use technological nature as a bonus on life, not as its substitute, and re-envision what is beautiful and fulfilling and often wild in essence in our relationship with the natural world.\n\n===================================================================================\nReviews\nTechnological Nature is a deeply compelling book. Our species spent 150,000 years as hunter-gatherers of the African savannah, and Kahn clearly demonstrates that ancestral memories of this are with us still, leaving us with an emotional need for nature and the desire to find substitutions for it. His thesis is unique, his work is breathtakingly original, and his presentation has created a real page-turner.(Elizabeth Marshall Thomas, anthropologist, author of The Hidden Life of Dogs and The Old Way: A Story of the First People)\n\nIn this engaging and provocative book, Peter Kahn explores how technology can simulate the natural world. Kahn has written something unusual and important -- a fascinating review of ongoing scientific research, a considered exploration of human development, and a passionate defense of the value of nature.(Paul Bloom, Professor of Psychology and Cognitive Science, Yale University, and author, How Pleasure Works)\n\nMany today believe human life has become the product of mainly invention and technology. To be modern, they believe, is to separate from the animal world, becoming something different from the rest of living creation. In this world, they wonder, who needs real nature? Yet, as a species, are we necessarily richer for all these gains in terms of health, happiness, and biological fitness? Despite our remarkable capacity to reach far beyond our biology, does our inventiveness continue to rely on having evolved in a natural, not human-created world? This book helps confront this question of the role of modern technology in our lives and where we fit in nature.(Stephen R. Kellert, Tweedy Ordway Professor Emeritus of Social Ecology, Yale University School of Forestry and Environmental Sciences)\n\nPeter Kahn, a pioneering researcher on the human relationship with nature, offers a beautifully written, sometimes disturbing, and always provocative tour of the disappearing borderland between machinery and humanity. Kahn thinks at the cutting edge.(Richard Louv, author of The Nature Principle and Last Child in the Woods)\n\nUnderstanding our interactions with 'technological nature' is one of the most pressing concerns of this century. Peter Kahn's outstanding and insightful book delivers the first comprehensive treatment of this critical topic.(Scott Sampson, Science Advisor and Host, PBS Kids' Dinosaur Train, Research Curator, Utah Museum of Natural History, and author of Dinosaur Odyssey: Fossil Threads in the Web of Life)\n\n===================================================================================\nAbout the Author\nPeter H. Kahn, Jr., is Professor in the Department of Psychology and Director of the Human Interaction with Nature and Technological Systems Laboratory at the University of Washington. Kahn and Hasbach are coeditors of Ecopsychology: Science, Totems, and the Technological Species (MIT Press, 2012).\n===================================================================================","torrent":{"xt":"urn:btih:b99e4eb858b20d05afe9d673832d8ed5a1f1664d","amp;dn":"Peter+H.+Kahn+Jr.+-+Technological+Nature.+Adaptation+and+the+Fut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b99e4eb858b20d05afe9d673832d8ed5a1f1664d","infoHashBuffer":{"type":"Buffer","data":[185,158,78,184,88,178,13,5,175,233,214,115,131,45,142,213,161,241,102,77]},"announce":[],"urlList":[]}}