{"title":"Sonny Rollins - With The Modern Jazz Quartet (1951) [EAC-FLAC]","uid":9103968,"size":180667907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9a9ed8de8189b55acc1b5cff1e69ed452fc8445&amp;dn=Sonny+Rollins+-+With+The+Modern+Jazz+Quartet+%281951%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pucholoco","files":-1,"time":1382822206,"description":"    Sonny Rollins - Sonny Rollins With The Modern Jazz Quartet (1951) [EAC-FLAC]\n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 127 Mb \n                       Full Artwork @ 300 dpi (png) -&gt; 53 Mb \n\n\n\nThis album covers roughly two years in Rollins's career when he was beginning to emerge as an important force in contemporary jazz. &quot;I Know&quot; was his first track as a leader, taped at the end of a January 1951 Miles Davis date at Davis's insistence. (Miles even played piano for him.) Sonny's first date as a leader took place on a snowy December night at the end of that year. The meeting with the Modern Jazz Quartet, in October 1953, showed a new maturity, especially in the rendition of Ellington's &quot;In a Sentimental Mood.&quot;\n\nIncluded here are some of Sonny Rollins' earliest sessions as a bandleader. These are among the fresh and vibrant baker's dozen of selections on Sonny Rollins With the Modern Jazz Quartet (1953). The title is a bit misleading though, since the MJQ -- with John Lewis (piano), Milt Jackson (vibes), Percy Heath (bass), and Kenny Clarke (drums) -- is only accounted for during the first four sides. There is a playful and energetic tone that ricochets from Jackson's fluid vibes, landing firmly in Rollins' musical court. One prime example of this interaction is heard throughout the solos on the opening track, &quot;Stopper.&quot; Similarly, &quot;Almost Like Falling in Love&quot; bops, weaves, and swings throughout, with some expressive contributions via Lewis, effectively linking Rollins' and Jackson's solos. &quot;No Moe,&quot; which stands as one of the best originals on the disc, also bears their undeniable connection. Another not-to-be-missed reading is the sultry &quot;In a Sentimental Mood.&quot;\nHere, Rollins spirals mature and ethereal lines against Jackson's resonant intonation and shimmer. If just for these tunes, Sonny Rollins With the Modern Jazz Quartet is a vital component in any jazz enthusiasts' collection. The rest of the disc is performed by Rollins and a quartet that also includes the talents of Kenny Drew (piano), the MJQ's Percy Heath (bass), and the main Jazz Messenger, Art Blakey (drums). On the original tune &quot;Scoops,&quot; Blakey's hardball antics provide well-placed sonic interjections, punctuating Rollins' highly infectious melodic sense. While on the subject of catchy tunes, all ears should be directed to the biblically derived title &quot;Shadrack,&quot; which had been a signature piece for Louis Armstrong. This early incarnation of the Sonny Rollins Quartet has rarely sounded as cohesive, as they collectively percolate with their definitive execution. Of particular note is the inclusion of Miles Davis' &quot;I Know.&quot; This extension of Charlie Parker's &quot;Confirmation&quot; features Davis on piano accompanying Rollins with solid chord progressions, allowing the burgeoning player to lead his first-ever quartet with Heath and Roy Haynes (drums).\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n01. The Stopper\n02. Almost Like Being In Love\n03. No Moe\n04. In A Sentimental Mood\n05. Scoops\n06. With A Song In My Heart\n07. Newk's Fadeaway\n08. Time On My Hands\n09. This Love Of Mine\n10. Shadrack\n11. On A Slow Boat To China\n12. Mambo Bounce\n13. I Know\n\n*2003 Prestige / Fantasy | PRCD-7029-2\n\n\nPersonnel:\nSonny Rollins (tenor sax)\nMiles Davis (piano)\nKenny Drew (piano)\nMilt Jackson (vibraphone)\nJohn Lewis (piano)\nPercy Heath (bass)\nArt Blakey (drums)\nKenny Clarke (drums)\nRoy Haynes (drums)\n\n\n\nEnjoy, SEED and SHARING... Thanks!\n\n","torrent":{"xt":"urn:btih:b9a9ed8de8189b55acc1b5cff1e69ed452fc8445","amp;dn":"Sonny+Rollins+-+With+The+Modern+Jazz+Quartet+%281951%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9a9ed8de8189b55acc1b5cff1e69ed452fc8445","infoHashBuffer":{"type":"Buffer","data":[185,169,237,141,232,24,155,85,172,193,181,207,241,230,158,212,82,252,132,69]},"announce":[],"urlList":[]}}