{"title":"Clarke's Analytical Forensic Toxicology, 2E [PDF] [StormRG]","uid":10800709,"size":38781473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9de37e02691c81be185ad3c0d5283d5ad5c8e78&amp;dn=Clarke%27s+Analytical+Forensic+Toxicology%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":-1,"time":1408344987,"description":"Author: Adam Negrusz (Editor), Gail Cooper (Editor)\nPaperback: 656 pages\nPublisher: Pharmaceutical Press; 2 edition (June 30, 2013)\nLanguage: English\nISBN-10: 0857110543\nISBN-13: 978-0857110541\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nThis second edition of Clarke's Analytical Forensic Toxicology offers a fresh perspective on the drugs and poisons that you are most likely to encounter in forensic toxicology, with a focus on collection, extraction and analysis. With additional features incorporated from the fourth edition of Clarke's Analysis of Drugs and Poisons this text is fully updated to reflect the advances in analytical and forensic toxicology. New and extended chapters include: sampling, storage and stability; in-utero exposure to drugs of abuse; drug-facilitated sexual assault; and extraction. Providing unrivalled comprehensive coverage of analytical forensic toxicology, this book is a crucial resource for students of forensic science, toxicology, clinical pharmacology and analytical chemistry. It is an invaluable tool for teachers in these subject areas and a key resource for those working in forensic science laboratories.","torrent":{"xt":"urn:btih:b9de37e02691c81be185ad3c0d5283d5ad5c8e78","amp;dn":"Clarke%27s+Analytical+Forensic+Toxicology%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9de37e02691c81be185ad3c0d5283d5ad5c8e78","infoHashBuffer":{"type":"Buffer","data":[185,222,55,224,38,145,200,27,225,133,173,60,13,82,131,213,173,92,142,120]},"announce":[],"urlList":[]}}