{"title":"Air - Moon Safari (1998) [24 bit FLAC] vinyl","uid":9156527,"size":653340417,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9ef4a5bf6f0d7dfb765d27bf64ec0b9e49e8548&amp;dn=Air+-+Moon+Safari+%281998%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1383788820,"description":"\n  Air - Moon Safari (1998) [24 bit FLAC] vinyl\n\n  Genre: Electronic\n  Styles: Ambient, Chillout, Trip-Hop\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 La Femme D'Argent\n  02 Sexy Boy\n  03 All I Need\n  04 Kelly Watch The Stars\n  05 Talisman\n  06 Remember\n  07 You Make It Easy\n  08 Ce Matin La\n  09 New Star In The Sky\n  10 Le Voyage de Penelope\n\n  Although electronica had its fair share of chillout classics prior to the debut of Air, the lion's share were either stark techno (Warp) or sample-laden trip-hop (Mo' Wax). But while Air had certainly bought records and gear based on the artists that had influenced them, they didn't just regurgitate (or sample) them; they learned from them, digesting their lessons in a way that gave them new paths to follow. They were musicians in a producer's world, and while no one could ever accuse their music of being danceable, it delivered the emotional power of great dance music even while pushing the barriers of what &quot;electronica&quot; could or should sound like. (Never again would Saint Etienne be the only band of a certain age to reveal their fondness for Burt Bacharach.) The Modulor EP had displayed astonishing powers of mood and texture, but it was Air's full-length debut, Moon Safari, that proved they could also write accessible pop songs like &quot;Sexy Boy&quot; and &quot;Kelly Watch the Stars.&quot; But it wasn't all pop. The opener, &quot;La Femme d'Argent,&quot; was an otherworldly beginning, with a slinky bassline evoking Serge Gainsbourg's Histoire de Melody Nelson and a slow glide through seven minutes of growing bliss (plus a wonderful keyboard solo). The vocoderized &quot;Remember&quot; relaunched a wave of robot pop that hadn't been heard in almost 20 years, and the solos for harmonica and French horn on &quot;Ce Matin La&quot; made the Bacharach comparisons direct. Unlike most electronica producers, Air had musical ideas that stretched beyond samplers or keyboards, and Moon Safari found those ideas wrapped up in music that was engaging, warm, and irresistible.","torrent":{"xt":"urn:btih:b9ef4a5bf6f0d7dfb765d27bf64ec0b9e49e8548","amp;dn":"Air+-+Moon+Safari+%281998%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9ef4a5bf6f0d7dfb765d27bf64ec0b9e49e8548","infoHashBuffer":{"type":"Buffer","data":[185,239,74,91,246,240,215,223,183,101,210,123,246,78,192,185,228,158,133,72]},"announce":[],"urlList":[]}}