{"title":"SimCity_Update_v10.1-RazorDOX","uid":10238788,"size":2961711930,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ba46ea11711612a60487ce8eb0128178a713e1e2&amp;dn=SimCity_Update_v10.1-RazorDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Mr.Stifmeister","files":178,"time":1401222349,"description":" 1 9 1 1 \nRazor 1911 proudly presents:\nSimCity Update v10.1\n(C) Electronic Arts\n\nDate: 2014-05-27 Game Type : Strategy\nSize: small Protection: EA Origin\nGame Notes\n~~~~~~~~~~\nThe SimCity: Cities of Tomorrow Expansion Pack enhances your SimCity\nexperience by offering two new city specializations for you to choose between\n- a giant, supply-guzzling business that is powered by an oppressed workforce\nand a gluttonous sense of industrialism or an urban paradise that actively\nstrives to preserve the planet's natural resources. You'll be able to expand\nyour city outward and upward with enormous, multizone MegaTowers. As your\ncity's population grows, your choices will influence whether your Sims abide\nside by side in peace and harmony or whether they bristle with barely subdued\ntension. Perform extensive research and discover technologies that will make\nyour city less polluted and reliant on finite resources or enjoy high-tech\nluxuries, such as futurized vehicles, service drones and Mag Levs that rise\nabove the streets and small buildings - but beware of giant robot attacks,\nwhich may occur as a result of scientific infusion into society. Decide which\nsegments of your city's populace - good or bad - will be sent on an adventure\nto the stars as space tourists with Launch Arcology. Gaze in awe as your\ncivilians launch off into the unknown in a spectacular display of stellar\nproportions. What will the future of your city look like?\n\nSearch the web for changelog.\nInstall Notes\n~~~~~~~~~~~~~\n1. Extract RARs\n2. Copy update files to your install folder\n3. Copy crack\n4. Have fun!\nRazor 1911 Greetings\n~~~~~~~~~~~~~~~~~~~~\nRazor 1911 slices out greets to our friends and competitors around the world!\n/\nRazor 1911 / Since 1985\n/ /\n//\n\nSUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\nIF YOU ENJOYED THIS PRODUCT, BUY IT! SOFTWARE AUTHORS DESERVE SUPPORT!!","torrent":{"xt":"urn:btih:ba46ea11711612a60487ce8eb0128178a713e1e2","amp;dn":"SimCity_Update_v10.1-RazorDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba46ea11711612a60487ce8eb0128178a713e1e2","infoHashBuffer":{"type":"Buffer","data":[186,70,234,17,113,22,18,166,4,135,206,142,176,18,129,120,167,19,225,226]},"announce":[],"urlList":[]}}