{"title":"Tami Hoag - Cold Cold Heart","uid":14429581,"size":178335875,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba56564f6e4b2193eed626b01dea55dcab23edda&amp;dn=Tami+Hoag+-+Cold+Cold+Heart&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":3,"time":1461600694,"description":"#1 New York Times bestselling author Tami Hoag delivers a shocking new thriller\r\n\r\n\r\nDana Nolan was a promising young TV reporter until a notorious serial killer tried to add her to his list of victims.  Nearly a year has passed since surviving her ordeal, but the physical, emotional, and psychological scars run deep.  Struggling with the torment of post-traumatic stress syndrome, plagued by flashbacks and nightmares as dark as the heart of a killer, Dana returns to her hometown in an attempt to begin to put her life back together.  But home doesn’t provide the comfort she expects.\r\n \r\nDana’s harrowing story and her return to small town life have rekindled police and media interest in the unsolved case of her childhood best friend, Casey Grant, who disappeared without a trace the summer after their graduation from high school.  Terrified of truths long-buried, Dana reluctantly begins to look back at her past.  Viewed through the dark filter of PTSD, old friends and loved ones become suspects and enemies.  Questioning everything she knows, refusing to be defined by the traumas of her past and struggling against excruciating odds, Dana seeks out a truth that may prove too terrible to be believed… \r\n\r\n\r\n\r\nRead by Julia Whelan\r\nFormat: MP3\r\nBitrate: 32 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:ba56564f6e4b2193eed626b01dea55dcab23edda","amp;dn":"Tami+Hoag+-+Cold+Cold+Heart","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba56564f6e4b2193eed626b01dea55dcab23edda","infoHashBuffer":{"type":"Buffer","data":[186,86,86,79,110,75,33,147,238,214,38,176,29,234,85,220,171,35,237,218]},"announce":[],"urlList":[]}}