{"title":"Niv Authorised Biography David Niven Graham Lord Non-fiction","uid":10551362,"size":5355030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba7fb8297670656814d2d33ce4fa5f07411217b3&amp;dn=Niv+Authorised+Biography+David+Niven+Graham+Lord+Non-fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1405299412,"description":"\nFor more than forty years, Niven portrayed on screen the impeccable values of a lost breed of English gentlemen - handsome, beautifully spoken, elegantly dressed, witty, with perfect manners and utterly charming. Niv, according to his friends, was much the same off-screen. Both men and women were enchanted by his charisma, humour and joie-de-vivre. In addition to winning an Oscar for Separate Tables (1958), Niven was a polished writer, and published two volumes of lighthearted autobiography: THE MOON'S A BALLOON (1972) and BRING ON THE EMPTY HORSES (1975). Yet behind those twinkling eyes, Niv's life was punctuated by tragedy and he was often deeply unhappy. From the death of his father when Niven was five, to his mother's neglect and the stepfather he loathed, through to the death of his beloved first wife and his volatile and disturbing marriage to his second wife, Hjordis, tragedy and hardship were never far away.\n\n\nGraham Lord, using new material from Niven's private papers, manuscripts, unpublished stories and correspondence, has written a fresh, revealing, funny and poignant portrait of a brave and brilliant man. Fully authorised by Niven's family and drawing from dozens of interviews with stars, from Lauren Bacall to Roger Moore and Sir John Mills, NIV: the Authorised Biography of David Niven is a fitting tribute to one of Hollywood's greatest heroes.\n\n\nNotes:\nHave tested out both file types on a Samsung Note 10.1 (2012 model) and a desktop PC running XP. Calibre and Kindle were used on the PC, and Aldiko and Kindle on the Samsung.\n","torrent":{"xt":"urn:btih:ba7fb8297670656814d2d33ce4fa5f07411217b3","amp;dn":"Niv+Authorised+Biography+David+Niven+Graham+Lord+Non-fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7fb8297670656814d2d33ce4fa5f07411217b3","infoHashBuffer":{"type":"Buffer","data":[186,127,184,41,118,112,101,104,20,210,211,60,228,250,95,7,65,18,23,179]},"announce":[],"urlList":[]}}