{"title":"FullMetal Alchemist Brotherhood [720p] [DUAL-AUDIO]","uid":8621483,"size":33530679065,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bbdc21c0e8f0dfd6c0af529148278a055741e7f9&amp;dn=FullMetal+Alchemist+Brotherhood+%5B720p%5D+%5BDUAL-AUDIO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"devlin85","files":64,"time":1372384988,"description":"[PLOT]\n\nEdward and Alphonse Elric are two alchemist brothers searching for the legendary catalyst called the Philosopher's Stone, a powerful object which would allow them to recover their bodies (which were lost in an attempt to bring their mother back to life through alchemy). Born in the village of Resembool from the country of Amestris (ã‚¢ãƒ¡ã‚¹ãƒˆãƒªã‚¹ Amesutorisu?), the two brothers lived there with their mother Trisha Elric. Their father, Von Hohenheim, left home for unknown reasons and years later, Trisha died of a terminal illness, leaving the Elric brothers alone. After their mother's death, Edward became determined to bring her back through the use of alchemy, an advanced science in which objects can be created from raw materials. They researched Human Transmutation, a forbidden art in which one attempts to create or modify a human being. However, this attempt failed, resulting in the loss of Edward's left leg and Alphonse's entire body. In a desperate effort to save his brother, Edward sacrificed his right arm to affix Alphonse's soul to a suit of armor. Some days later, an alchemist named Roy Mustang visited the Elric brothers, and proposed that Edward become a member of the State Military of Amestris in exchange for more research materials to find a way to recover their bodies. After that, Edward's left leg and right arm were replaced with automail, a type of advanced prosthetic limb, built for him by his close family friends Winry Rockbell and her grandmother Pinako.\n\n[TECHNICAL DETAILS]\n\nFullMetal Alchemist: Brotherhood: The Complete Series [Dual Audio] [720p]\n\nContains Episodes 1-64\n\nSource: Blu-Ray\nAudio Language: English 5.1 Surround, Original Japanese Stereo\nSubtitle Language: English\n\nFile Format: MKV (Matroska Media Container)\nVideo Format: DivX (DX50)\nAudio Format: AC3 (Dolby Digital)\nSubtitle Format: SRT (SubRip)","torrent":{"xt":"urn:btih:bbdc21c0e8f0dfd6c0af529148278a055741e7f9","amp;dn":"FullMetal+Alchemist+Brotherhood+%5B720p%5D+%5BDUAL-AUDIO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbdc21c0e8f0dfd6c0af529148278a055741e7f9","infoHashBuffer":{"type":"Buffer","data":[187,220,33,192,232,240,223,214,192,175,82,145,72,39,138,5,87,65,231,249]},"announce":[],"urlList":[]}}