{"title":"[DvdRip-Xvid-Ita-Mp3]Piramide di paura[survivalofmisa]","uid":5119570,"size":733804544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bbf7b0db6c58fb6982df7a746fdbcb699cfcc3a2&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DPiramide+di+paura%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mitimex","files":1,"time":1255258785,"description":"\n\nIl Prof. Bobster ed il reverendo Nesbitt muoiono suicidi in preda ad orride allucinazioni: entrambi sono stati colpiti da piccolissimi aghi, lanciati con una cerbottana egizia, da uno strano individuo incappucciato. Siamo a Londra nel 1870, in piena epoca vittoriana, e, in un severo college, troviamo i giovani Sherlock Holmes e John Watson: il primo giÃƒÂ  con una spiccata personalitÃƒÂ , intuitivo ed intelligente. particolarmente dotato per la scherma (l'insegnante della quale, Rathe, lo stima molto); il secondo impacciato, timido, provinciale nei gusti e nel modo di ragionare. Diventano inseparabili; Holmes riesce a risolvere piccoli intrighi nel college ma un suo rivale, un certo Dudley, gli gioca un brutto scherzo e lo fa espellere. Holmes non si scoraggia, anzi ÃƒÂ¨ piÃƒÂ¹ libero di dedicarsi alla soluzione di un caso sempre piÃƒÂ¹ drammatico. Alla morte dei due personaggi, Bobster e Nesbitt, si aggiunge anche quella non meno raccapricciante del professor Waxflatter. strambo inventore di macchine volanti, ex insegnante del college e zio di Elizabeth, la ragazza amata da Holmes. Il giovanotto scopre profondi legami tra le tre scomparse, viene a sapere che tutti e tre gli uomini erano stati amici, laureati nella stessa universitÃƒÂ , soci in un affare in Egitto, finito molto male per tutti. Holmes piano piano, con l'aiuto del fido Watson, che si svela intelligente, coraggioso e capace, e di Elizabeth, che lo fa sia per amore del giovane sia per chiarire la morte dello zio, viene a scoprire l'esistenza di un tempio egizio in una piramide ricostruita nei sotterranei di Londra. Qui strani personaggi esaltati svolgono riti complicati e sacrifici umani. I tre giovani capiscono molte cose: le vittime sono morte per volere del capo della setta, che aveva a che fare con l'affare fallito in Egitto. Una quarta persona, un altro professore del college, farebbe la stessa fine se i ragazzi non lo aiutassero a superare la crisi delle incredibili allucinazioni. I giovani perÃƒÂ² vengono scoperti, inseguiti e colpiti con i micidiali aghetti: hanno quindi anch'essi spaventose allucinazioni ma riescono a superare il momento drammatico. Il responsabile della macchinazione ÃƒÂ¨ &quot;l'amico&quot; di Holmes, il &quot;disponibile&quot; istruttore di scherma, Rathe, che si serve per i suoi misfatti della sorella, signora Dribb, governante del college. L'uomo vuole sopprimere Holmes, che ha scoperto tutto, e con lui i suoi due amici. Ma alla fine ÃƒÂ¨ Holmes ad avere la meglio e a mettere la polizia sulle tracce dei colpevoli. PerÃƒÂ² Elizabeth viene colpita da Rathe e muore tra le braccia di Holmes, il quale ha compreso ormai la sua vocazione di investigatore e l'autentica amicizia di Watson.\n","torrent":{"xt":"urn:btih:bbf7b0db6c58fb6982df7a746fdbcb699cfcc3a2","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DPiramide+di+paura%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf7b0db6c58fb6982df7a746fdbcb699cfcc3a2","infoHashBuffer":{"type":"Buffer","data":[187,247,176,219,108,88,251,105,130,223,122,116,111,219,203,105,156,252,195,162]},"announce":[],"urlList":[]}}