{"title":"Soda Stereo - Nada Personal (1985) WMA320","uid":6112372,"size":98519752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bc06994451bed03a67c8cfb8360efed40e4c48d8&amp;dn=Soda+Stereo+-+Nada+Personal+%281985%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1295408125,"description":"Su segundo ÃƒÂ¡lbum, Nada Personal, fue editado en octubre de 1985. Durante el verano el grupo realizÃƒÂ³ una gira de conciertos por los centros turÃƒÂ­sticos argentinos, tocando en Mar del Plata, Villa Gesell y Pinamar, sumando ademÃƒÂ¡s un concierto consagratorio en el Festival de La Falda, en CÃƒÂ³rdoba, en el que contaron con la participaciÃƒÂ³n de AndrÃƒÂ©s Calamaro y Charly GarcÃƒÂ­a como invitados en teclados en el tema Jet-set.\n\nEn abril decidieron presentar oficialmente el ÃƒÂ¡lbum con un concierto en el Estadio Obras Sanitarias de Buenos Aires. Realizaron cuatro histÃƒÂ³ricas funciones a lleno total sumando 20.000 espectadores, el 11, 12 y 13 de ese mes. Durante la primera de las tres funciones se filmÃƒÂ³ un vÃƒÂ­deo en vivo de larga duraciÃƒÂ³n editado pocos meses despuÃƒÂ©s. Bobby Flores, el conocido crÃƒÂ­tico musical y cofundador de la revolucionaria radio Rock &amp; Pop de Buenos Aires, terminaba de esta manera su crÃƒÂ³nica del recital:\n\nNos hallamos frente a la mÃƒÂ¡s poderosa agrupaciÃƒÂ³n del paÃƒÂ­s... El mejor parÃƒÂ¡metro para medir esta presentaciÃƒÂ³n es que se me hizo corto, parecÃƒÂ­a haber durado diez minutos; y la gente se quedÃƒÂ³ con ganas de mÃƒÂ¡s. La salida del estadio fue un murmullo general de las canciones de Soda Stereo. La lluvia, el trÃƒÂ¡fico cortado en la Avenida Libertador por los que salÃƒÂ­an y por los que entraban, el ÃƒÂºltimo pancho de la noche y una saludable sensaciÃƒÂ³n de bienestar, no dejan lugar para las dudas existenciales. VolvÃƒÂ­ a colocar mi mandÃƒÂ­bula en su lugar, y me fui cantando bajito Estoy Azulado, entre la lluvia por Libertador.\nA partir de esos conciertos las ventas del disco comenzaron a crecer aceleradamente, pasando del disco de oro, que habÃƒÂ­an conseguido durante el verano, hasta el platino, y llegando a doblar esa cifra en los meses siguientes. Sin abandonar los ritmos &quot;bailables&quot;, este segundo LP logrÃƒÂ³ mÃƒÂ¡s profundidad en las letras y madurez en las melodÃƒÂ­as. El disco significÃƒÂ³ la consagraciÃƒÂ³n definitiva de Soda Stereo ante el pÃƒÂºblico argentino.\n\nEn junio de 1986, luego de una gira nacional, el trÃƒÂ­o grabÃƒÂ³ su segundo video-clip con el tema &quot;Cuando pase el temblor&quot;, nuevamente bajo la direcciÃƒÂ³n de Alfredo Lois, en las ruinas del PucarÃƒÂ¡ de Tilcara, en la provincia de Jujuy. El video, que completÃƒÂ³ la filmaciÃƒÂ³n de la presentaciÃƒÂ³n en el Estadio Obras, fue nominado como finalista del 12Ã‚Â° World Festival of Video and TV en Acapulco unos aÃƒÂ±os despuÃƒÂ©s.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Nada Personal.wma                                           \n02 - Si No Fuera Por....wma                                      \n03 - Cuando Pase El Temblor.wma                                  \n04 - Danza Rota.wma                                              \n05 - El Cuerpo Del Delito.wma                                    \n06 - Juego De Seduccion.wma                                      \n07 - Estoy Azulado.wma                                           \n08 - Observandonos (Satelites).wma                               \n09 - Imagenes Retro.wma                                          \n10 - Ecos.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:bc06994451bed03a67c8cfb8360efed40e4c48d8","amp;dn":"Soda+Stereo+-+Nada+Personal+%281985%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc06994451bed03a67c8cfb8360efed40e4c48d8","infoHashBuffer":{"type":"Buffer","data":[188,6,153,68,81,190,208,58,103,200,207,184,54,14,254,212,14,76,72,216]},"announce":[],"urlList":[]}}