{"title":"Prison Architect Alpha 33","uid":11971724,"size":137044052,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd2bde3868991dcd708df01e80aeb4aea8a4740c&amp;dn=Prison+Architect+Alpha+33&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dauphong","files":1,"time":1432852923,"description":"About This Game\nBuild and Manage A Maximum Security Prison.\n\nPrison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block. You'll need to hire some guards, get some showers built and unless the kitchen is up and running with chefs working away you're going to end up with a riot on your hands. From there you take your prison in which-ever direction you like. A monsterous super-max or comfortable center for rehabilitation, the choice is up to you.\n\n\nPrison Architect is currently in Alpha which means that the game is playable, but still in development. Not all features are implemented yet and there are many bugs that may affect gameplay. We are currently releasing monthly updated builds which include new features and bug fixes. By buying the alpha you will automatically be gifted a free copy of the full game when it's finished","torrent":{"xt":"urn:btih:bd2bde3868991dcd708df01e80aeb4aea8a4740c","amp;dn":"Prison+Architect+Alpha+33","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2bde3868991dcd708df01e80aeb4aea8a4740c","infoHashBuffer":{"type":"Buffer","data":[189,43,222,56,104,153,29,205,112,141,240,30,128,174,180,174,168,164,116,12]},"announce":[],"urlList":[]}}