{"title":"No Man of Her Own (1932) DVD5 - Clark Gable, Carole Lombard [DDR","uid":9435024,"size":4490440704,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be87dd4fde395c90f152ab1421588f591ad662aa&amp;dn=No+Man+of+Her+Own+%281932%29+DVD5+-+Clark+Gable%2C+Carole+Lombard+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SaM","files":-1,"time":1388886166,"description":"No Man of Her Own (1932) DVD5 - Clark Gable, Carole Lombard [DDR]\n\nNo Man of Her Own is a 1932 romantic drama starring Clark Gable and Carole Lombard as a married couple in their only film together, several years before their own legendary marriage in real life. The movie was directed by Wesley Ruggles, and originated as an adaptation of No Bed of Her Own, a 1932 novel by Val Lewton, but ended up based more on a story by Benjamin Glazer and Edmund Goulding, although it retained the title it got from Lewton's novel. It is not related to the 1950 film of the same name.\n\n    CAST:-\n    Clark Gable as Jerry 'Babe' Stewart\n    Carole Lombard as Connie Randall\n    Dorothy Mackaill as Kay Everly\n    Grant Mitchell as Charlie Vane\n    George Barbier as Mr Randall\n    Elizabeth Patterson as Mrs Randall\n    J. Farrell MacDonald as 'Dickie' Collins\n    Tommy Conlon as Willie Randall\n    Walter Walker as Mr Morton\n    Paul Ellis as Vargas\n    Lillian Harmer as Mattie - The Librarian\n    Charley Grapewin as George - The Clerk\n\nDirected by Wesley Ruggles\nProduced by Albert Lewis\nWritten by Novel (uncredited):, Val Lewton\nMusic by W. Franke Harling (uncredited)\n\nMOVIE REVIEW:- No Man of Her Own (1932)\nGambler Babe Steward (Clark Gable) is in trouble with the law and decides to lie low in a small town. There he meets librarian Connie Randall (Carole Lombard) and attempts to seduce her. They flip a coin to decide whether or not to get married. The coin forces them to get married and Connie soon falls in love with Babe. Babe, meanwhile, continues his conning while telling Connie that he is working on Wall Street. Connie does not suspect anything until she finds Babe's marked cards in his desk. She shuffles the cards and when Babe plays a game of poker, he loses. Babe wants nothing more to do with Connie and leaves for Rio de Janeiro to win big money at cards. But, realizing that he loves Connie, he gives himself in to the police to serve his jail sentence. When Babe returns to a pregnant Connie, he does not suspect that she knows of his deception, but she does not say a word about it and in true Hollywood fashion, we are left to assume that the couple lives happily ever after.\n\nPRODUCTION NOTES:-\nMarion Davies is ultimately responsible for this film being made, as she encouraged MGM to make a trade of Gable for Bing Crosby, who was the only person she wanted for her next project, which became Going Hollywood (1933). Multi-millionaire William Randolph Hearst, Davies' love interest and her partner in a production company, convinced MGM's Louis B. Mayer to make the deal, so Gable was sent to Paramount to work on a project of his choice until Crosby was finished with his picture with Davies.[1] Gable looked over the available properties, and the only one that interested him was the script for No Man of Her Own, which had originally been slated for George Raft.\n\nThe original treatment of Val Lewton's novel 1932 novel No Bed of Her Own, which was the early working title for the film as well, was written by Austin Parker, who also wrote the first screenplay. Because of concerns expressed by the censors at the Hays Office, Paramount purchased in August 1932 another story, &quot;Here Is My Heart&quot; (not the same as the 1934 Bing Crosby film, also released by Paramount), to use to soften the piece. The film was originally to have been directed by James Flood.\n\nMiriam Hopkins was originally offered the lead, but balked at the idea of Gable receiving top billing, and demanded another project. Lombard, who was a rising star on the Paramount lot, but still relegated to roles in which she was second-billed to her male counterparts, was chosen to replace Hopkins.\n\nDuring filming, Gable and Lombard were entirely indifferent to one another, with Lombard in a foul mood due to her recent unpleasant loan-out to United Artists. She spoke of that experience with her usual colorful vocabulary, which Gable was not certain he approved of. No romantic relationship between the stars came about during the making of this picture, with Lombard still married to actor William Powell and still very much in love. While Gable was still married to socialite Rhea Langham, he could not say that he was in love, but he was certainly not interested in Lombard. He was not so distant from Lombard, however, that he did not give her a nickname, calling her &quot;Ma&quot;, as his character did in the film. Lombard retaliated by calling him &quot;Pa.&quot;\n\nOn the last day of filming, Gable presented Lombard with a pair of ballerina slippers with a card attached that said, &quot;To a true primadonna.&quot; Lombard got him back when she presented him with a large ham with his picture on it. Gable kissed her goodbye and they did not stay in touch, as Gable found Lombard to be bawdier than he was willing to handle, and Lombard found Gable to be overly conceited. It was not until four years later that their romance began to take off. Gable and Lombard never appeared together in another film, primarily because they became major stars at different studios, which didn't like to lend them out\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English, French\nRunTime 85 mins\nSubtitles: English, Francais\nRipped by: Trinidad [DDR]\nDuration: 85 mins","torrent":{"xt":"urn:btih:be87dd4fde395c90f152ab1421588f591ad662aa","amp;dn":"No+Man+of+Her+Own+%281932%29+DVD5+-+Clark+Gable%2C+Carole+Lombard+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be87dd4fde395c90f152ab1421588f591ad662aa","infoHashBuffer":{"type":"Buffer","data":[190,135,221,79,222,57,92,144,241,82,171,20,33,88,143,89,26,214,98,170]},"announce":[],"urlList":[]}}