{"title":"Metropolitan (1990) multisubs DivX (moviesbyrizzo)","uid":6598511,"size":906394061,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be8935444345743c4c80b16380e8d8c5aac2a949&amp;dn=Metropolitan+%281990%29+multisubs+DivX+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"moviesbyrizzo","files":-1,"time":1313117486,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0100142/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0100142/&lt;/a&gt;\n\n(Writer/Director Whit Stillman also brought us &quot;The Last days of Disco&quot;\nas you may recall) he was nominated for an Oscar as writer \nfor this movie here\n\nConverted from a Criterion collection ntsc dvd9 disc to DivX\n720 X 480 at 1000k video bitrate along with a 192k audio bitrate\n\nSubtitles included:\n\nEnglish template, English close captioned, Portuguese, Romanian, Russian,\nSerbian and Spanish - Please post for whatever other languages we need\nincluding Swedish, Dutch, Italian, German French etc - more work needs to\nbe done to stay well stocked on these on the net - equally too - merci\n\nAlso included is an approximately 15MB folder of soundtrack selections\nThis movie has some actually nice music along the way, to keep you tuned to it\n\nThis is a look at American personality types and American culture\nbroadly speaking. Great blondes!\n\nThe problem with the mindset most seen in this movie is that negativity is the\norder of the day along with extremist views that lack adequate foundation in \nhumanistic wisdom, a tendency to over-assert nonetheless, an inability to deal \nwith issues with intelligent articulation based fully on real feelings and \nthoughts that are of Euro-Humanist origin in what we consider the best quality\nof engagement etc. There is much mean spirited banter and little of real \nintelligence in what is said. Belittling others unfairly, calling down women\ninsanely (and men too) who arent made of the same stuff as the arrogant Bush\npersonality types shown for all to see in what is superficial levels of brain engagement with reality of how they come across. Somewhat like a &quot;My dinner \nwith andre&quot; New York style Part II. Lots of wicked like personality fixation\nin the genre of scripting.\n\nNonetheless, it has its moments and I do love the Christianly spirit of the \nblonde gals in the movie as none have achieved the reputation they have in \nCalifornia of being the best of such Irish spitited beauty outside of Australia -\nalthough Im quickly homesick to be back there or in Germany or France equally\nor Italy even especially too!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:be8935444345743c4c80b16380e8d8c5aac2a949","amp;dn":"Metropolitan+%281990%29+multisubs+DivX+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8935444345743c4c80b16380e8d8c5aac2a949","infoHashBuffer":{"type":"Buffer","data":[190,137,53,68,67,69,116,60,76,128,177,99,128,232,216,197,170,194,169,73]},"announce":[],"urlList":[]}}