{"title":"Selected JACK KIRBY Comics (1950-1986) (Marvel, DC, Eclipse)","uid":9589669,"size":2223507794,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:be9567956807c67457852e62b1177384d434ed73&amp;dn=Selected+JACK+KIRBY+Comics+%281950-1986%29+%28Marvel%2C+DC%2C+Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"STFmaryville","files":101,"time":1391885328,"description":"This week marked the 20th anniversary of the passing of Jack Kirby, co-creator of the Marvel Age of Comics and one of the most prolific, talented pencillers in the history of sequential art.\n\nA lot has been said, written, and debated about The King, so I'll keep this simple. I wanted to put together a torrent that combined a few of his most influential works (like The New Gods, and The Fantastic Four with Stan Lee) and some obscure offerings (Boys' Ranch with Joe Simon, Green Arrow with various writers, and Super Powers featuring the Justice League of America).\n\nI also included the first year's worth of Jack Kirby Collector magazine, a few high-definition scans of Kirby art, an article from Comics Scene in the 1980s, Stan Lee's fascinating testimony from a few years ago about who created what, and a portrait of The King near the end of his life.\n\nOverall, I think this compilation turned out as a pretty cool tribute.\n\nThere are some great digital rips here (thanks VikTSlick and shipjolly!) of FF and X-Men, and I think this torrent will be pleasing to longtime fans, young readers who may not have much exposure to his work, and might even have something to offer to those who dislike his art. Sorry there isn't a preview image, Bayimg doesn't like me today.\n\nPlease seed and share. And if you like something, consider buying it. Check your LCS for trades or the new issue of JKC.\n","torrent":{"xt":"urn:btih:be9567956807c67457852e62b1177384d434ed73","amp;dn":"Selected+JACK+KIRBY+Comics+%281950-1986%29+%28Marvel%2C+DC%2C+Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be9567956807c67457852e62b1177384d434ed73","infoHashBuffer":{"type":"Buffer","data":[190,149,103,149,104,7,198,116,87,133,46,98,177,23,115,132,212,52,237,115]},"announce":[],"urlList":[]}}