{"title":"Rise of the Ogre - Gorillaz Autobiography PDF","uid":8400434,"size":68560967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:beeba72d09c2addf5bd77dfe445ee9a57fdec974&amp;dn=Rise+of+the+Ogre+-+Gorillaz+Autobiography+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pyro3138","files":1,"time":1366680773,"description":"&quot;I tell you what, right, I can guarantee you're going to get some real juicy bits of Gorillaz info. I'll probably slag off loads of people, too. It'll be packed full of great shots from the sets of our videos, gigs, rehearsals, interviews...you name it. It's all in there. So place your order up front kids, this book going to be a scorcher!&quot; - Gorillaz bass-slayer Murdoc Nicalls. This stunning, full-colour hardback will be the most unique rock autobiography ever published. Gorillaz have always been as much about the visuals as they are about the music, and the autobiography will be a feast for the eyes. Featuring brand new art from and designed by Jamie Hewlett, this is the full story of Murdoc, 2D, Noodle and Russel Hobbs for the first time. Included will be their emailing with their motley crew of collaborators, from Ike Turner to Sean Ryder, and accounts of the gigs, the movie (for the first time), the videos and the website - including the low down on Kong Studios, their legendary HQ. It is an essential purchase for a legion of fans.","torrent":{"xt":"urn:btih:beeba72d09c2addf5bd77dfe445ee9a57fdec974","amp;dn":"Rise+of+the+Ogre+-+Gorillaz+Autobiography+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beeba72d09c2addf5bd77dfe445ee9a57fdec974","infoHashBuffer":{"type":"Buffer","data":[190,235,167,45,9,194,173,223,91,215,125,254,68,94,233,165,127,222,201,116]},"announce":[],"urlList":[]}}