{"title":"The Color Book of Felted Crochet","uid":11164952,"size":69086425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf0c1c8b490b5c4d2af0ca28d913a1b7431aedf4&amp;dn=The+Color+Book+of+Felted+Crochet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"KnitLady","files":-1,"time":1412617590,"description":"Noted author and needlework expert Amy O'Neill Houck teams up with crochet designer Stina Ramos to present a colorful and fashionable wardrobe of crocheted garments and accessories presented in over 300 full-color photographs. The collection of 25 beautiful pieces inspired by nature's palette uses color from across the visible spectrum, and features a special felting process that adds a soft, sturdy texture to the crocheted fabric and allows even beginners to crochet and felt with confidence. From a tunic with a shawl collar in pale blue, a sweater with sweeping dolman sleeves in raspberry, and a pencil skirt in cardinal red to leg warmers, handbags, hats, and scarves, all the designs have classic lines that never go out of style and are carefully crafted to flatter any figure. Comprehensive sections called &quot;Crochet Basics&quot; and &quot;Felting Basics&quot; detail the step-by-step processes needed to achieve felted crochet. A mini-course, &quot;Designing with Color,&quot; explains the principles of color theory and the exciting ways readers can add color to wardrobe pieces using yarn and fiber.25 original projects inspired by nature's palette that show the latest fashion trends Professional tips and secrets Clear, concise step-by-step directions for the projectsDiagrams and schematics that help readers attain professional results Over 300 photographs Extensive sources and resource guides &quot;Designing with Color&quot; section, which explains the principles of color theoryAn illustrated tutorial of &quot;How to Crochet&quot; and &quot;How to Felt Crocheted Fabric&quot; Complete glossary and index","torrent":{"xt":"urn:btih:bf0c1c8b490b5c4d2af0ca28d913a1b7431aedf4","amp;dn":"The+Color+Book+of+Felted+Crochet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf0c1c8b490b5c4d2af0ca28d913a1b7431aedf4","infoHashBuffer":{"type":"Buffer","data":[191,12,28,139,73,11,92,77,42,240,202,40,217,19,161,183,67,26,237,244]},"announce":[],"urlList":[]}}