{"title":"America: Imagine a World Without Her - Chapterized Audiobook MP3","uid":10533263,"size":214245577,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bf136f021cafd17b684ce36eb97b72fe27fdb4fd&amp;dn=America%3A+Imagine+a+World+Without+Her+-+Chapterized+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1405130074,"description":"** Same as previous version, but split into chapters. **\n\nMP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nAmerica: Imagine a World Without Her\n\nWritten by: Dinesh D'Souza\nNarrated by: Walter Dixon\nLength: 7 hrs and 24 mins\nFormat: Unabridged\nRelease Date:06-02-14\nProgram Type: Audiobook\n\nIs America a source of pride, as Americans have long held, or shame, as Progressives allege? Beneath an innocent exterior, are our lives complicit in a national project of theft, expropriation, oppression, and murder? Or is America still the hope of the world?\n\nNew York Times best-selling author Dinesh D'Souza says these questions are no mere academic exercise. It is the Progressive view that is taught in our schools, that is preached by Hollywood, and that shapes the policies of the Obama administration. If America is a force for inequality and injustice in the world, its power deserves to be diminished; if traditional America is based on oppression and theft, then traditional America must be reformed - and the federal government can do the reforming.\n\nIn America: Imagine a World Without Her D'Souza offers a passionate and sharply reasoned defense of America, knocking down every important accusation made by Progressives against our country.\n\nProvocative in its analysis, stunning in its conclusions, Dinesh D'Souza's America will be the most talked about audiobook of the year.\n\n** Same as previous version, but split into chapters. ** \t\t","torrent":{"xt":"urn:btih:bf136f021cafd17b684ce36eb97b72fe27fdb4fd","amp;dn":"America%3A+Imagine+a+World+Without+Her+-+Chapterized+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf136f021cafd17b684ce36eb97b72fe27fdb4fd","infoHashBuffer":{"type":"Buffer","data":[191,19,111,2,28,175,209,123,104,76,227,110,185,123,114,254,39,253,180,253]},"announce":[],"urlList":[]}}