{"title":"No Ordinary Time (Unabridged) - Doris Kearns Goodwin Audiobook","uid":11497855,"size":1131708656,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bfa8bc5596219e15c6a5cd22167a955a1ef95b51&amp;dn=No+Ordinary+Time+%28Unabridged%29+-+Doris+Kearns+Goodwin+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416269638,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nNo Ordinary Time: Franklin and Eleanor Roosevelt: The Home Front in World War II\n\nWritten by: Doris Kearns Goodwin\nNarrated by: Nelson Runger\nLength: 39 hrs and 18 mins\nUnabridged Audiobook | View Abridged\nRelease Date:05-04-11\n\nPulitzer Prize Winner, History, 1995\n\nNo Ordinary Time describes how the isolationist and divided United States of 1940 was unified under the extraordinary leadership of Franklin Roosevelt to become the preeminent economic and military power in the world.\n\nUsing diaries, interviews, and White House records of the president's and first lady's comings and goings, Goodwin paints an intimate portrait of the daily conduct of the presidency during wartime and the Roosevelts' extraordinary constellation of friends, advisers, and family.\n\nBringing to bear the tools of both history and biography, No Ordinary Time relates the unique story of how Franklin Roosevelt led the nation to victory against seemingly insurmountable odds and, with Eleanor's essential help, forever changed the fabric of American society","torrent":{"xt":"urn:btih:bfa8bc5596219e15c6a5cd22167a955a1ef95b51","amp;dn":"No+Ordinary+Time+%28Unabridged%29+-+Doris+Kearns+Goodwin+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa8bc5596219e15c6a5cd22167a955a1ef95b51","infoHashBuffer":{"type":"Buffer","data":[191,168,188,85,150,33,158,21,198,165,205,34,22,122,149,90,30,249,91,81]},"announce":[],"urlList":[]}}