{"title":"Ancient Rome, An Anthology of Sources [PDF] [StormRG]","uid":10753374,"size":3584355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c001c1afb1a5731f632596edccd5522c674c3671&amp;dn=Ancient+Rome%2C+An+Anthology+of+Sources+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"F1restorm","files":-1,"time":1407897958,"description":"Ancient Rome: An Anthology of Sources\nAuthor: Christopher Francese\nPublished: 2014\nPublisher: Hackett Publishing Co.\nISBN: 9781624660009\nFormat: Retail PDF\n_______________________________________________________________________________\n\nEdited and Translated, with an Introduction, by Christopher Francese and R. Scott Smith\n\nReviews\n&quot;Terrific . . . exactly the sort of collection we have long needed: one offering a wide range of texts, both literary and documentary, and that--with the inclusion of Sulpicia and Perpetua--allows students to hear the voices of actual women from the ancient world. The translations themselves are fluid; the inclusion of long extracts allows students to sink their teeth into material in ways not possible with traditional source books. The anonymous texts, inscriptions, and other non-literary material topically arranged in the 'Documentary' section will enable students to see how the documentary evidence supplements or undermines the views advanced in the literary texts. This is a book that should be of great use to anyone teaching a survey of the history of Ancient Rome or a Roman Civilization course. I look forward to teaching with this book which is, I think, the best source book I have seen for the way we teach these days.&quot; --David Potter, University of Michigan\n\n&quot;Eager to be immersed in the richness, diversity, and raw energy of how ancient Romans lived and thought? This most readable anthology is a revealing, seductive page-turner, hard to put down once opened.&quot; --Richard J. Talbert, The University of North Carolina at Chapel Hill\n\n&quot;An Impressive and well-chosen selection of key sources for the study of ancient Rome, rendered into lively and engaging English. Together they offer a panorama of republican and imperial life and letters. Highly recommended.&quot; --Nathan Rosenstein, The Ohio State University --Nathan Rosenstein, The Ohio State University\n","torrent":{"xt":"urn:btih:c001c1afb1a5731f632596edccd5522c674c3671","amp;dn":"Ancient+Rome%2C+An+Anthology+of+Sources+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c001c1afb1a5731f632596edccd5522c674c3671","infoHashBuffer":{"type":"Buffer","data":[192,1,193,175,177,165,115,31,99,37,150,237,204,213,82,44,103,76,54,113]},"announce":[],"urlList":[]}}