{"title":"The Manchurian President - Aaron Klein","uid":11707243,"size":2074883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c08b026f27c5ecb2c63ee4c41459b8285d498535&amp;dn=The+Manchurian+President+-+Aaron+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1424180365,"description":"The book uncovers a far-leftist, anti-American nexus that has been instrumental in not only helping build Obama's political career but in securing his presidency. Klein details with shocking precision how this nexus continues to influence Obama and the White House and is involved in drafting policy aimed at reshaping our country. Highlights of The Manchurian President: *Obama's mysterious college years unearthed *Shocking details of Obama's relationship with Bill Ayers and other Weathermen terrorists *Obama's ties to Islam and black liberation theology *Startling facts about Obama's eligibility to serve as president *Obama's membership in a socialist party probed *How Obama's &quot;hope,&quot; &quot;change&quot; slogans stem from communist activism *Radical socalists involved in drafting stimulus bill, ObamaCare *Communists, socialists and other radicals on team Obama, including an expose on Obama's top guns in the White House *Never-before-revealed depth of Obama's relationship with ACORN\n\n\nAbout the Author:\n Aaron Klein is an investigative journalist and Jerusalem bureau chief for WorldNetDaily.com. He is a regular on top American radio shows and appears frequently on Fox News Channel and Al Jazeera. He is the author of Schmoozing with Terrorists and The Late Great State of Israel, as well as the host of Aaron Klein Investigative Radio for New York's WABC, the largest radio talk station in the United States","torrent":{"xt":"urn:btih:c08b026f27c5ecb2c63ee4c41459b8285d498535","amp;dn":"The+Manchurian+President+-+Aaron+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08b026f27c5ecb2c63ee4c41459b8285d498535","infoHashBuffer":{"type":"Buffer","data":[192,139,2,111,39,197,236,178,198,62,228,196,20,89,184,40,93,73,133,53]},"announce":[],"urlList":[]}}