{"title":"Art of Islam (Panorama of the World Art Ebook).pdf","uid":11795359,"size":39016009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0a288298737bb7431d24c07ab17d8af6bb27b0a&amp;dn=Art+of+Islam+%28Panorama+of+the+World+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1428145407,"description":"Harry N. Abrams | 1970 | ISBN: 0810980142 | English | 272 pages | PDF | 37.2 MB\n\nAt its height, the Islamic world extended from the Iberian Peninsula to the Indian subcontinent and beyond, but despite this enormous geographical spread, the art forms born and nourished among the followers of the Prophet display an amazing unity of style and purpose. Indeed, it would be surprising if this were not so, but in order to understand this fact, we must first shed all our Western preconceptions concerning the function of art and the role of the artist in society. To quote the author's introduction: &quot;In Islam, art and faith are inseparably bound together; but within the framework of strict laws, sufficient liberty is left for artists to arrive at creative works which, while possibly they may not fascinate the Westerner at first glance, will ultimately end by enthralling him. Anyone with the patience to follow the artist in Allah's service through the labyrinth of geometric decorations will become captivated by the beauty of its artistic logic .... Islamic art . . . acquired an aspect of Its own which, weathered by sun and drought, strife and tradition, quickly matured and became easily recognizable among the countless other aspects of art in the world.&quot;","torrent":{"xt":"urn:btih:c0a288298737bb7431d24c07ab17d8af6bb27b0a","amp;dn":"Art+of+Islam+%28Panorama+of+the+World+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a288298737bb7431d24c07ab17d8af6bb27b0a","infoHashBuffer":{"type":"Buffer","data":[192,162,136,41,135,55,187,116,49,210,76,7,171,23,216,175,107,178,123,10]},"announce":[],"urlList":[]}}