{"title":"DishPointer AR Pro 2.1.4 iPa","uid":8229928,"size":296114,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:c0b2e1179640a975bb7c7ecf660c06e9b614aab2&amp;dn=DishPointer+AR+Pro+2.1.4+iPa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pist-off","files":-1,"time":1362702661,"description":"Description\n\nPoint your phone towards the sky and see on the live camera screen where the satellites are, any line of sight (LoS) issues by trees or buildings and the look angles. Couldn't be easier to install your dish with this augmented reality satellite finder. As a professional installer said: &quot;Invaluable, gets the job done in half the time&quot;\n\nWorks best on the iPhone 3GS and iPhone 4 since they have an internal compass. On the 3G and iPod Touch it works like an inclinometer - see the notes below.\n\n*****************\nSee video here:\nor search &quot;DishPointer Youtube&quot;\n*****************\n\nBusinessWeek: &quot;Best iPhone Augmented Reality Apps for Business - Tracking Satellites in Space - DishPointer AR Pro&quot;\n\nWall Street Journal: &quot;An enterprise app&quot;\n\nTele-Satellite: &quot;Award winning DishPointer App: It's never been this easy to check satellite reception&quot;\n\n&quot;As a broadcast professional, this app is unvaluable&quot; UplynxSteve, Broadcaster\n\n&quot;I have never had so much value out of a program. I dumped a BB Bold because I needed this app!&quot; 1955jmgs, Professional V-Sat Installer\n\n&quot;Revolutionary product, truly one if not the best app I have ever used for my line of work&quot;, Super Canadian, Professional Installer\n\n&quot;Worth every Penny!..It worked just as it says&quot;, tnterrapin, DIY-Installer\n\nFeatures\n========\n+ Augmented Reality, see the satellites on the display\n+ Works world wide at any location with any satellite\n+ Does not require cell signal or internet access\n+ Select the satellites to be displayed from a list\n+ Add or delete your own satellites to/from the list (PRO)\n+ Displays satellite settings (azimuth, elevation, skew) and current magnetic as well as true heading for the screen center\n+ Clarke Belt (satellite arc) is shown from east to west - all geostationary satellites are along this arc\n+ When moving the iPhone laterally or vertically, the arc and the satellites move in real time with the live image\n+ Ability to lock the compass, i.e. the arc won't move laterally anymore\n+For 3G users, ability to enter a lateral reference point, such as a manual compass reading or an existing satellite position\n+ Ability to enter location\n\nWhy get the Pro version?\n==============\n+ Add your own satellites to the list, update them whenever you want - complete independence when satellite positions change or new ones appear - no need to wait for an official update. For business critical missions a must.\n+Be on the safe side for future updates and new features. Pro version always take priority over the standard version.\n\nUsage instructions\n=========\n3GS/4 users:\n1. Switch it on and tap AR View button\n2. In camera mode, look at the bottom label and rotate iPhone until it heads towards south (true heading = 180Â°). (People located on the southern hemisphere should point the iPhone north).\n3. Lift the iPhone and watch the satellites appear\n4. Move the device laterally and see the satellites moving too\n5. Compass is sensitive to interferences but and works best when device is held flat. You can lock the compass in that position and lift the iPhone up but don't move it laterally then.\n\n3G/iPod Touch users:\n1. As above but set the lateral reference mode first. The app needs to know in which direction you are pointing the iPhone. So either enter a manual compass bearing compensated for magnetic declination or a satellite position if you have already a working satellite or used DishPointer Maps for a reference Point.\n2. Lift the iPhone up and see the arc but don't move the iPhone laterally, as it won't get shifted.\n\nNOTE: The app does not require Cell or internet, works on its own.","torrent":{"xt":"urn:btih:c0b2e1179640a975bb7c7ecf660c06e9b614aab2","amp;dn":"DishPointer+AR+Pro+2.1.4+iPa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b2e1179640a975bb7c7ecf660c06e9b614aab2","infoHashBuffer":{"type":"Buffer","data":[192,178,225,23,150,64,169,117,187,124,126,207,102,12,6,233,182,20,170,178]},"announce":[],"urlList":[]}}