{"title":"Kwitny-Crimes of Patriots-Dope,Dirty Money&amp;CIA(Iran-contra scand","uid":5399694,"size":7058134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0b27a70f1d65c57046badd106b34ada2e2177c6&amp;dn=Kwitny-Crimes+of+Patriots-Dope%2CDirty+Money%26CIA%28Iran-contra+scand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"red_gonzo","files":1,"time":1267376195,"description":"This is Jonathan Kwitny's shocking book The Crimes of Patriots - A True Tale of Dope, Dirty Money and the CIA (1987) which tells the story behind the story revealed in the Iran-contra investigation. A rifle blast blows off the head of an Australian banker in his Mercedes - and a tale of the whole Cold War begins to unravel. The death of Frank Nugan exposes the massive fraud at the heart of his empire, the Nugan Hand Bank; but it also exposes the real power of the bank - a network of U.S. generals, admirals and CIA men, including a former director of that organization. As the colorful story of the Nugan Hand Bank unfolds, we learn that there have been many similar operations. Patterns and eerie resonances emerge, and the names of those who later masterminded the Iran-contra fiasco lurk in the shadows cast by Nugan Hand: Clines, Shackley, Secord. We are slowly brought to a greater truth as Kwitny exposes at last the crimes committed against American citizens in pursuit of policy of &quot;anti-communism&quot;. He shows how some of the biggest names in American defense and intelligence were involved in an operation that promoted dope trade, tax evasion and gun running which swindled American citizens and citizens of allied countries out of millions of dollars. Kwitny lays out a mystery filled with questions whose answers - so far - have stayed locked in the U.S. government's vault of secrets. The Crimes of Patriots will reveal how an obscure Australian bank, Nugan Hand Ltd., came to occupy the central position in a vast network of drug transactions, fraud, secret arms deals, and covert intelligence operations. It is a chilling glimpse into the workings of the secret government that has operated ruthlessly in America and around the world for the last forty years, unchecked, answerable only to itself. It's a masterpiece of investigative journalism that reveals the sordid truths shrouded within the &quot;national security interest&quot;. 400 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:c0b27a70f1d65c57046badd106b34ada2e2177c6","amp;dn":"Kwitny-Crimes+of+Patriots-Dope%2CDirty+Money%26CIA%28Iran-contra+scand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b27a70f1d65c57046badd106b34ada2e2177c6","infoHashBuffer":{"type":"Buffer","data":[192,178,122,112,241,214,92,87,4,107,173,209,6,179,74,218,46,33,119,198]},"announce":[],"urlList":[]}}