{"title":"Doctor Who - Season 05 - (1967-68) - 40 Episodes","uid":9053205,"size":3215785783,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0d092e62519aebcda20515a5175157300b61eac&amp;dn=Doctor+Who+-+Season+05+-+%281967-68%29+-+40+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bnaron","files":40,"time":1381896604,"description":"The fifth season of British science fiction television series Doctor Who began on 2 September 1967 with the first story of season 5 The Tomb of the Cybermen and ended on 1 June 1968 with The Wheel in Space.\n\nPatrick Troughton, Frazer Hines and Deborah Watling appear as The Second Doctor, Jamie McCrimmon and Victoria Waterfield respectively.\n\nDeborah Watling departs in the penultimate story Fury from the Deep. Wendy Padbury makes her debut as Zoe Heriot in the season finale, The Wheel in Space.\n\nIn The Web of Fear, Nicholas Courtney appeared for the first time as Colonel Lethbridge-Stewart. He appeared next in the next season's The Invasion, and became a regular supporting character in season 7 - season 13. He made subsequent appearances in season 20 and season 26.\n\nEpisodes:\n\n1.  The Tomb of the Cybermen - Four Episodes\n\n    Synopsis: The TARDIS crew arrives on Telos where they find an expedition\n    excavating the Tomb of the Cybermen. Inside the tomb, they find frozen\n    Cybermen who are soon to awake. \n\n2.  The Abominable Snowmen - Six Episodes\n    Episodes 1, 3, 4, 5, and 6 are reconstructions.\n\n    Synopsis: The TARDIS crew arrive on a cold and windy hillside. After\n    exploring, the Doctor, wearing an extremely furry coat, is mistaken\n    for what they think could be ... a Yeti.\n\n3.  The Ice Warriors - Six Episodes\n    Episodes 2 and 3 are resonstructions.\n\n    Synopsis: In the distant future the crew at Brittanicus Base\n    struggle to control an ionizer, which they are using to slow the\n    progress of glaciers rolling over Britain. Creatures then awaken\n    from the glacier, identifying themselves as Ice Warriors from the\n    planet Mars.\n\n4.  The Enemy of the World - Six Episodes\n\n    Synopsis: The Doctor's evil double plans to rule the world with\n    volcanoes.\n\n5.  The Web of Fear - Six Episodes\n    Episode 3 is a reconstruction.\n\n    Synopsis: The Doctor, with the help of the military, tries to stop\n    yeti invading the London Underground. \n\n6.  Fury from the Deep - Six Episodes\n    All six episodes are reconstructions.\n\n    Synopsis: The TARDIS lands in the sea off the eastern coast of\n    England. The Second Doctor, Jamie, and Victoria investigate a\n    nearby beach where there's something nasty in the pipes. \n\n7.  The Wheel in Space - Six Episodes\n    Episodes 1, 2, 4, and 5 are resonstructions.\n\n    Synopsis: The Cybermen plan to attack a space station.\n\n","torrent":{"xt":"urn:btih:c0d092e62519aebcda20515a5175157300b61eac","amp;dn":"Doctor+Who+-+Season+05+-+%281967-68%29+-+40+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d092e62519aebcda20515a5175157300b61eac","infoHashBuffer":{"type":"Buffer","data":[192,208,146,230,37,25,174,188,218,32,81,90,81,117,21,115,0,182,30,172]},"announce":[],"urlList":[]}}