{"title":"Jim Crace (4 Novels)","uid":9728897,"size":8643828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0d71e8aded77e5b00c25bd5ac7ed02abcb0f886&amp;dn=Jim+Crace+%284+Novels%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nepalifiction","files":-1,"time":1394336272,"description":"                                    All That Follows\n\nJim Crace blazes into new territory with a near-future exploration of politics, courage and love. Leonard Lessing is a jazzman taking a break. He's almost fifty, addicted to the media, reliving old gigs, and finds his life is not so much in a rut as a well-oiled groove. He and his wife Francine are struggling to cope with the absence of Francine's daughter, who at twenty has upped and left and immaculately covered her tracks. Otherwise their life in a regulated surburb is unremarkable - until a few miles away hostages are seized and the ringleader of the kidnappers turns out to be a man from Leonard's past...Set in the south of England, 2024, and Austin, Texas, 1997, and populated by a quartet of strong and fiery women, this hypnotic novel wonders whether a life full of sound and fury signifies more than a life lived quietly, and asks what it really means to be courageous.                                    \n\n                                     Harvest\n\nHarvest is a novel by Jim Crace, published in 2013 by Picador. Crace has stated that Harvest will be his final novel. Harvest was shortlisted for the 2013 Man Booker Prize, and the inaugural Goldsmiths Prize.\n\n                                     Quarantine\n\nQuarantine is a novel by Jim Crace. It was the winner of the 1997 Whitbread Novel Award, and was shortlisted for the Booker Prize for Fiction the same year.\n\n                                     The Pesthouse\n\nOnce the safest, most prosperous place on earth, the United States has become sparsely populated and chaotically unstable. Across the country, families have traveled toward the one hope left: passage on a ship to Europe. As Franklin Lopez makes his way towards the ocean, he finds Margaret, a sick woman shunned to die in isolation. Tentatively, the two join forces, heading towards their future. With striking prose and a deep understanding of the American ethos, Jim Crace, one of our most consistently ambitious writers, creates in The Pesthouse a masterful tale of the human drive to endure.","torrent":{"xt":"urn:btih:c0d71e8aded77e5b00c25bd5ac7ed02abcb0f886","amp;dn":"Jim+Crace+%284+Novels%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d71e8aded77e5b00c25bd5ac7ed02abcb0f886","infoHashBuffer":{"type":"Buffer","data":[192,215,30,138,222,215,126,91,0,194,91,213,172,126,208,42,188,176,248,134]},"announce":[],"urlList":[]}}