{"title":"INFORMIT - Spring Framework","uid":10274649,"size":2812475232,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c0fd82306e127af04499314948b59e2648df328e&amp;dn=INFORMIT+-+Spring+Framework+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":52,"time":1401639341,"description":"Spring Developer Advocate Josh Long provides a walking tour of all the Spring projects, including: Spring, Spring MVC, Spring Data, Spring Batch, Spring Integration, Spring Security, Spring Social, and more. Josh introduces how to get started building modern-day Spring applications while introducing the concepts behind them. In the lessons, Josh guides viewers through a look at the Spring stack and the features designed to support relational data access, NoSQL and big-data access, batch processing, integration and messaging, REST services, mobile clients, OAuth-secured, connected web applications, service provider APIs, and more!\n\nCONTENT:\n\nLesson 1 \nIntroduction to Spring Examines the Open Source framework as well as Spring projects. Viewers will learn to build their own applications using the SpringSource Tool Suite. Lesson 1 covers various configuration styles and the ApplicationContext to give new users a feel for what Spring brings to the table.\n\nLesson 2 \nThe Life of A Bean Reviews How Spring helps manage the Lifecycle and scope of beans. Showcasing the functionality of beans using PostProcessors and AOP, the lesson concludes with instructions on how easily you can augment your beans.\n\nLesson 3 \nPower Tools in Core Spring Teaches some of the more advanced Features in the core Spring framework. It includes application configuration and how to use services such as Java scheduling, thread managing, and caching.\n\nLesson 4 \nRelational Data Access with Spring covers common Idiom Support and Management transaction. The lesson teaches Spring data access and looks at convenient relational databases like JDBC and JPA.\n\nLesson 5 \nNoSQL Data Access with Spring Examines the umbrella project to help address the next Generation of Data. The lesson then reviews Spring technologies like Spring Redis and MongoDB. The lesson ends by looking at the conveniences that Spring data can provide through the repository report.\n\nLesson 6 \nBatch Processing with Spring Gives instructions on Batch processing and the motivations Behind it. Viewers will learn how to describe and create batch jobs using Spring batch, Java, and XML configuration styles.\n\nLesson 7 \nIntegration and Messaging in Spring Takes A Look at the common messaging Idioms supported in Spring and Shows How to Connect to JMS and AMQP brokers. It reviews how messaging can provide a better connection and a reliability scale. The lesson concludes by teaching how the enterprise application integration in Spring can help build better event-driven architectures.\n\nLesson 8 \nBuilding Web Applications with Spring starts with the Basics on How to Build Web applications and then moves on to Servlet Support in Spring core. It also looks at MVC Spring and how that can be used to build web applications with REST. The lesson ends by describing how to secure your applications with Spring Security and OAuth.\n\nLesson 9 \nCloud Foundry Provides information on How to use Spring's Component model Easily to insulate your application from the Underlying platform. Viewers will also learn how to move their application to a cloud platform like Cloud Foundry.\n &lt;a href=&quot;\nhttp://www.informit.com/store/spring-framework-livelessons-video-training-downloadable-9780133463071&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.informit.com/store/spring-framework-livelessons-video-training-downloadable-9780133463071&lt;/a&gt;","torrent":{"xt":"urn:btih:c0fd82306e127af04499314948b59e2648df328e","amp;dn":"INFORMIT+-+Spring+Framework+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0fd82306e127af04499314948b59e2648df328e","infoHashBuffer":{"type":"Buffer","data":[192,253,130,48,110,18,122,240,68,153,49,73,72,181,158,38,72,223,50,142]},"announce":[],"urlList":[]}}