{"title":"christmas trio-mickeys magical christmas+once and twice upon a c","uid":5910600,"size":2195023943,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c104159ab4930ba89d01eaab76d4c529f83293b7&amp;dn=christmas+trio-mickeys+magical+christmas%2Bonce+and+twice+upon+a+c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"alanwatson","files":-1,"time":1288040837,"description":"Full-Length Holiday Movie.[mickeys magical christmas]\nsnowed in at the house of mouse\n\nJoin Mickey and all of your favorite Disney animated superstar - together for the first time ever - as they share a heartwarming holiday celebration and sing a special song, &quot;The Best Christmas Of All,&quot; that captures this wondrous occasion.\n\nWhen a huge snowstorm leaves everyone stranded, Mickey and all of his guests at the House Of Mouse, including Pooh, Piglet, Belle, Snow White, Ariel and many more of his old and new friends, break out the cookies and hot chocolate to help Donald mend his tattered Christmas spirit. The fun starts when Minnie pulls out their favorite holiday home movies and everyone starts to reminisce.\n\nAs everybody lifts their voices in joyful song, they realize that the &quot;Best Christmas Of All&quot; is the one you share with all of your friends!\n-------------------------------------------------------------------------------\n\nMickey's Once Upon A Christmas: Disney's biggest stars shine in a magical all-new movie - sure to become a holiday classic! Mickey, Minnie, and their famous friends Goofy, Donald, Daisy and Pluto gather together to reminisce about the love, magic and surprises in three wonder-filled stories of Christmas past.\n\nIn the fine tradition of Disney's superb storytelling, Minnie and Mickey recall the year they both gave up what was most important to them for the sake of the other, making for one unforgettable Christmas. Goofy and Max retell when they experienced a series of hilarious but season-shaking events... until a visit from the real Santa made it a most magical holiday. Thinking back to when they wished Christmas was every day, Donald's newphews, Huey, Dewey and Louie, remember their dream turning into a comical catastrophe, eventually learning what true holiday spirit is all about.\n\nFeaturing the entire cast in a finale of merry magical Christmas songs, all the excitement of Mickey's Once Upon A Christmas is ready to unwrap for holiday family fun!\n\n-------------------------------------------------------------------------------------\n\nMickey's Twice Upon A Christmas: This Christmas, find out who's been naughty and who's been nice in an all-new Disney holiday celebration. Mickey, Donald, Goofy and their pals star in five festive tales about the importance of opening your heart to the true meaning of Christmas.\n\nWatch the hilarious antics of stubborn old Donald as he tries in vain to resist the joy of the season, and laugh along with Mickey and Pluto as they learn a great lesson about the power of friendship.\n\nThe whole family will celebrate the wonder of the holidays with these magical Christmas stories featuring your favourite Disney characters! ","torrent":{"xt":"urn:btih:c104159ab4930ba89d01eaab76d4c529f83293b7","amp;dn":"christmas+trio-mickeys+magical+christmas%2Bonce+and+twice+upon+a+c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c104159ab4930ba89d01eaab76d4c529f83293b7","infoHashBuffer":{"type":"Buffer","data":[193,4,21,154,180,147,11,168,157,1,234,171,118,212,197,41,248,50,147,183]},"announce":[],"urlList":[]}}