{"title":"(2007) The Afghan Whigs - Unbreakable (A Retrospective 1990-2006","uid":10089068,"size":559763152,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c1136d542f569fd17b9651ae21a5665c4e7f30f5&amp;dn=%282007%29+The+Afghan+Whigs+-+Unbreakable+%28A+Retrospective+1990-2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"100.XY","files":-1,"time":1399161854,"description":"(2007)The Afghan Whigs - Unbreakable (A Retrospective 1990-2006)\n\n\n\nReview:\nThere's about eight years between the first and second tracks on Unbreakable (A Retrospective), immediately revealing how much the Afghan Whigs developed over a decade, what was gained in the process, and what was lost. Opener &quot;Retarded&quot;, from 1990's Up In It, a lo-fi maelstrom of raw, threatening guitars, introduces the band's defining elements: the knife-fight between guitar players Greg Dulli and Rick McCollum, soul and funk melodies ratcheted to aggressive tempos, and Dulli's in-character performance (&quot;Motherfucker lied to you,&quot; he snarls), which detractors would label &quot;posturing&quot; throughout the 1990s. Following &quot;Retarded&quot; is &quot;Crazy&quot;, from the band's 1998 swan song 1965; it's slicker and more controlled, dialing down its tempo and filling its empty spaces with &quot;Soul Finger&quot;-style party chatter, yet sacrificing not one iota of menace.\nUnbreakable, a best-of collection that democratically gathers tracks from every facet of the band's career, along with two newly recorded songs, is a sort of last laugh. Despite their stature today (there's a 33 1/3 book on Gentlemen in the works), the band-- and especially Dulli-- were largely neglected during the 1990s, relegated to second-tier status behind alt- bands such as Live, Alice in Chains, and Candlebox. Formed in Cincinnati in 1986 and defunct by 2001, the Afghan Whigs were one of the few alt- bands to flourish on a major label, where greater control and bigger budgets allowed them to indulge every sinister urge. While alternative rock radio still sported untucked flannel, the Whigs looked dapper in all black or tailored suits. When popular music was at its most studiously PC, the Whigs emphasized the sexual, and Dulli played power-struggle games that many read as misogynist.\nWhile their peers could barely see past the Who, the Whigs were digging through the Stax Records catalog and covering the Supremes (&quot;Come See About Me&quot; is included here). Even on their early tracks, the band found a way to integrate African-American sounds and influences into their white rock: &quot;Turn on the Water&quot;, from 1991's Congregation (whose album cover infamously features a nude black woman holding a white baby, no less) uses Isaac Hayes' wakka-chikka guitars as a punk accessory, and its jumpy guitar riffs instill these songs with a sense of motion that suggests amped-up r&amp;b. Black Love, the band's 1996 blaxploitation-rock epic, should have been the culmination of this trend, but in 1996 it sounded overdone and obvious. Unbreakable, however, reveals Black Love to be a closet singles album, fitting three still-visceral songs into the tracklist but making &quot;Blame Etc.&quot; and &quot;Honky's Ladder&quot; the most glaring omissions.\nWith more dry wit and intelligent frustration than was often recognized, Dulli's lyrics were also intensely personal in their intimate sadomasochism, to the extent that he invited Scrawl's Marcy Mays to sing &quot;My Curse&quot; on Gentlemen because he couldn't bring himself to do it (nor could the producers include it here). Taken at face value, though, Dulli's songs made him out to be an asshole, so that's what people assumed he was. And he likely played that up, too. But on Unbreakable, the hyperbolic tension of his lyrics plays as an amplification of his own angst, not as a one-to-one projection. He wasn't necessarily the people he sang about, but they were certainly part of him. The leering threats of &quot;Be Sweet&quot; and &quot;66&quot; might best be read as useful exaggerations. And yet, Dulli's voice wavers on the quieter, slower numbers. He misses notes on &quot;Faded&quot;, muddles his phrasing on the new track &quot;Magazine&quot;, but never self-censors. He lets the moment stand, powerful in its imperfection, the sound of someone trying to convey overwhelming inner conflict. At a time when many bands strained to project anguish, Dulli kept his performances as raw as the hurt he's singing about.\nThe two newly recorded tracks-- the band's first since their break-up in 2001-- are surprisingly strong, picking up pretty much where 1965 left off. It's nice to hear McCollum's guitar slicing at Dulli again and Curley's bass trying to break them up. After the military grunts that count off &quot;I'm a Soldier&quot;, the band launches into a massive gospel assault that prominently features Memphis vocalist Susan Marshall (who also appeared on 1965), as if they had the audacity to rewrite &quot;Gimme Shelter&quot; with a three-note chorus and cagier lyrics. Written shortly before the band split six years ago, &quot;Magazine&quot; begins as a slow ballad, but builds into something more angular, lacking a hook but still intriguing.\nRather than presenting these songs chronologically-- starting with their earliest Sub Pop singles and ending with their newly recorded tracks-- Unbreakable is sequenced more organically and intuitively, mixing together songs from each phase of their career so that they comment on one another. Ultimately, the tracklist comprises a larger, self-mythologizing narrative-- culminating in the sweeping drama of &quot;Crime Scene Part One&quot; and &quot;Faded&quot;, both from Black Love-- that fits well with the Whigs' album-as-song-cycle approach. Unbreakable is one of those rare career compilations that shows its subject in a new and immensely flattering light, with the potential to clear up past misperceptions and to reveal vast complexities that were previously overlooked.\nReview by Stephen M. Deusner\nRate 8.8/10\n\nimage\n\n\n\nTrack List:\n01. Retarded\n02. Crazy\n03. Turn On The Water\n04. Debonair\n05. I'm A Soldier\n06. 66\n07. Be Sweet\n08. Come See About Me\n09. Uptown Again\n10. What Jail Is Like\n11. Magazine\n12. I'm Her Slave\n13. Going To Town\n14. Gentleman\n15. Let Me Lie To You\n16. John The Baptist\n17. Crime Scene Part One\n18. Faded\n\n\nSummary:\nCountry: USA\nGenre: Alternative rock\n\n\nMedia Report:\nSource : CD\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM\nBit rate mode : Variable\nBit rate : ~878-1000 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nBit depth : 16 bits","torrent":{"xt":"urn:btih:c1136d542f569fd17b9651ae21a5665c4e7f30f5","amp;dn":"%282007%29+The+Afghan+Whigs+-+Unbreakable+%28A+Retrospective+1990-2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1136d542f569fd17b9651ae21a5665c4e7f30f5","infoHashBuffer":{"type":"Buffer","data":[193,19,109,84,47,86,159,209,123,150,81,174,33,165,102,92,78,127,48,245]},"announce":[],"urlList":[]}}