{"title":"The Mathematical Mechanic - Mark Levi","uid":11501697,"size":4060777,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1170ba3946305d07ab49f9ae1a0989018574677&amp;dn=The+Mathematical+Mechanic+-+Mark+Levi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SectorVector","files":-1,"time":1416331879,"description":"The Mathematical Mechanic: Using Physical Reasoning to Solve Problems\n\nby Mark Levi.\n\n#Pages     : 200\n#Publisher : Princeton University Press; 1 edition (2009)\n#ISBN-13: 978-0691140209\n\n\nEverybody knows that mathematics is indispensable to physics--imagine where we'd\n\nbe today if Einstein and Newton didn't have the math to back up their ideas. But\n\nhow many people realize that physics can be used to produce many astonishing and\n\nstrikingly elegant solutions in mathematics? Mark Levi shows how in this\n\ndelightful book, treating readers to a host of entertaining problems and\n\nmind-bending puzzlers that will amuse and inspire their inner physicist.\n\n\nLevi turns math and physics upside down, revealing how physics can simplify\n\nproofs and lead to quicker solutions and new theorems, and how physical\n\nsolutions can illustrate why results are true in ways lengthy mathematical\n\ncalculations never can. Did you know it's possible to derive the Pythagorean\n\ntheorem by spinning a fish tank filled with water? Or that soap film holds the\n\nkey to determining the cheapest container for a given volume? Or that the line\n\nof best fit for a data set can be found using a mechanical contraption made from\n\na rod and springs? Levi demonstrates how to use physical intuition to solve\n\nthese and other fascinating math problems. More than half the problems can be\n\ntackled by anyone with precalculus and basic geometry, while the more\n\nchallenging problems require some calculus. This one-of-a-kind book explains\n\nphysics and math concepts where needed, and includes an informative appendix of\n\nphysical principles.\n\n\n\nThe Mathematical Mechanic will appeal to anyone interested in the little-known\n\nconnections between mathematics and physics and how both endeavors relate to the\n\nworld around us","torrent":{"xt":"urn:btih:c1170ba3946305d07ab49f9ae1a0989018574677","amp;dn":"The+Mathematical+Mechanic+-+Mark+Levi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1170ba3946305d07ab49f9ae1a0989018574677","infoHashBuffer":{"type":"Buffer","data":[193,23,11,163,148,99,5,208,122,180,159,154,225,160,152,144,24,87,70,119]},"announce":[],"urlList":[]}}