{"title":"Antony Cyril Sutton - 1986 - The Best Enemy Money Can Buy (158p)","uid":11322376,"size":642438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1e29f1dd33de43044da37c12174ffe903ddd0f5&amp;dn=Antony+Cyril+Sutton+-+1986+-+The+Best+Enemy+Money+Can+Buy+%28158p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Inua1","files":1,"time":1414609460,"description":"Title: The Best Enemy Money Can Buy    \nAuthor: Antony Cyril Sutton\nISBN-10: 0937765015\nISBN-13: 978-0937765012\n\n\nThose who read Anthony Sutton's WALL AND THE BOLSHEVIK REVOLUTION should read THE BEST ENEMY MONEY CAN BUY in tandem. The latter book simply follows events during and especially after World War II and the Cold War. Sutton has amassed a collection ofand comments which, if so sad and deadly, would be funny.\n\nPart of THE BEST ENEMY MONEY CAN BUY deals with government officials either deflecting or ending investigations of U.S. business executives who did business and made lucrative deals with &quot;The Evil Empire.&quot; Many U.S. presidents preached about the purity of their anti-Communism while at the same time arranging for business leaders to make huge sums of money doing business with both the Soviets and Chinese Communists.\n\nSome of the projects that U.S. and Western European businessmen included innocent sounding projects such as the Kharkov Tractor Factory which was built in 1932. This became a military production factory. Another example of U.S. government and business executives occurred just before the Soviets Afghanistan in 1980. The Soviets purchased huge grain supplies knowing that window dressing would preclude further grain sales.\n\nSutton also cites the Kama Truck Factory which was computerised by Texas Instruments, powered by General Electric, and financed by U.S. bankers. All of this done via the U.S. taxpayers. One must raise the question of who pays for all of this.\n\nFor all of his tough talk about the wicked Communists, Pres. Reagan continued the late Pres. Nixon's policy of money and technology transfers to the Chinese Communists. One amusing aspect of the Cold War was the fact that U.S. authorities went after any and all dissenters who complained about the status-quo. The political response to any complaints or problems in the U.S. was due to &quot;The Gremlins in the Kremlin.&quot; Yet, the same businessmen, Congressmen, self appointed professional anti-Communists, etc. were the same ones who voted for or arranged so much finance and technology to both the Soviets and Chinese. The official anti-Communists did more to prolong Big Communism than any U.S. dissenter or U.S. self avowed Communist.\n\nWhat is interesting is the official political do gooders condemned U.S. labor leaders as being Communist. Yet, these same labor leaders were virtually the only ones who raised protest against the harsh working and living conditions of Soviet workers which Sutton makes clear on page 208. The hypocrisy is so apparent.\n\nThose who say the a picture is worth a thousand words would appreciate this book. The political cartoons reveal a lot about the lack of loyalty on part of &quot;conservative&quot; business leaders who have been in the vanguard of domestic anti-Communism.\n\nAnthony Sutton is clear that U.S. technology and financial transfers to Big Communism was responsible for the deaths of U.S. Servicemen in the Korean and Vietnam Wars. U.S. citizens should be outraged that their government and official leaders were responsible for all this.\n\nMr. Luce, the well known journalist, was asked about U.S. Communists. Mr. Luce responded that American blue collar workers were Democrats. The American middle classes were Republicans. The plutocratic wealthy were Communists. Sutton's book makes this assessment clear.\n- James E. Egolf","torrent":{"xt":"urn:btih:c1e29f1dd33de43044da37c12174ffe903ddd0f5","amp;dn":"Antony+Cyril+Sutton+-+1986+-+The+Best+Enemy+Money+Can+Buy+%28158p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e29f1dd33de43044da37c12174ffe903ddd0f5","infoHashBuffer":{"type":"Buffer","data":[193,226,159,29,211,61,228,48,68,218,55,193,33,116,255,233,3,221,208,245]},"announce":[],"urlList":[]}}