{"title":"American.Horror.Story.S04E07.HDTV.x264-KILLERS","uid":11519048,"size":322601294,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c1fbb7d1660c1ea348416334f0c4dd801ccac2b0&amp;dn=American.Horror.Story.S04E07.HDTV.x264-KILLERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":2,"time":1416474373,"description":"[b]American Horror Story\n\n[IMG]http://i.imgur.com/lxonf2t.jpg[/IMG]\n\nGenre: Drama, Horror, Thriller \nYear: 2011 - \nCountry: USA \nRuntime: 45 min \nProducer: Ryan Murphy, Brad Falchuk \nCast: Zachary Quinto, Sarah Paulson, Joseph Fiennes, Evan Peters, Lily Rabe, James Cromwell \n\n.: Plot :. \nAmerican Horror Story is A Dramatic television series created and Produced by Ryan Murphy and Brad Falchuk. Each Season, the series focuses on A Different Story and setting. In the First Season, A family moves to That A House Los Angeles, unaware That it is haunted. Father Ben Harmon (Dylan McDermott) is trying to deal with his wife's rejection after he has an affair with a student, and soon falls under the house's sway. Meanwhile, wife Vivien (Connie Britton) must not only try to forgive her husband but deal with the aftereffects of a miscarriage. Daughter Violet (Taissa Farmiga) is confronted with hostile girls at her new school and befriends her father's disturbed teenage patient, Tate Langdon (Evan Peters). And lurking NEARBY is neighbor Constance (Jessica Lange), A former actress WHO Both hates and is Oddly protective of her Special-Needs daughter Adelaide (Jamie Brewer), WHO Can sense the House's Evil. In the Second Season, strange Happenings occur at Briarcliff Manor, run by the Catholic church as a sanitarium. Sister Jude (Jessica Lange) administers the facility with a strict hand while concealing her lusts. Dr. Arthur Arden (James Cromwell) conducts strange experiments on the patients, including accused serial killer Kit Walker (Evan Peters), the infamous Bloody Face, who may or may not be innocent. [/b]","torrent":{"xt":"urn:btih:c1fbb7d1660c1ea348416334f0c4dd801ccac2b0","amp;dn":"American.Horror.Story.S04E07.HDTV.x264-KILLERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1fbb7d1660c1ea348416334f0c4dd801ccac2b0","infoHashBuffer":{"type":"Buffer","data":[193,251,183,209,102,12,30,163,72,65,99,52,240,196,221,128,28,202,194,176]},"announce":[],"urlList":[]}}