{"title":"Standup Comedy - Tim Wilson - Gettin' My Mind Right","uid":4319079,"size":79163092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c20b5a9a335a829edbd0438d79fdf8880de740fc&amp;dn=Standup+Comedy+-+Tim+Wilson+-+Gettin%5C%27+My+Mind+Right&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"rambam1776","files":35,"time":1217286053,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the Ops who put these out and about.\n\nRambam1776\n\n\n\nTIM WILSON ? GETTIN? MY MIND RIGHT\n\nBiography\tby Jason Ankeny\nGeorgia-born country comedian Tim Wilson was a born funnyman, delivering dead-on impressions of his teachers while still in elementary school; he later emceed his high school&amp;#039;s talent shows, but after taking up guitar as a teen he instead aspired to a career in music. While in college he accepted a job as a sportswriter, later convincing his editors to allow him to review local concerts as well; at an Atlanta Rhythm Section date, Wilson passed along his demo tape to the group&amp;#039;s drummer Roy Yaeger, who agreed to produce a session at his Georgia studio. The resulting demo went nowhere, however, and so Wilson instead turned to comedy; immediately he earned a devoted local following, and soon after won a Cinemax stand-up competition. A series of television spots followed, including an appearance on The Tonight Show with Jay Leno; in 1990, he also teamed with the duo of Pinkard &amp; Bowden to write the song &quot;Arab, Alabama,&quot; and its success convinced him to include music in his stand-up act. In addition to a series of LPs for the independent Southern Tracks label including Tough Crowd, Waking Up the Neighborhood, Low-Class Love Affair and Tuned Up, Wilson scored a hit single with his &quot;Garth Brooks Ruined My Life,&quot; also co-writing Jeff Foxworthy&amp;#039;s smash &quot;The Redneck Twelve Days of Christmas.&quot; Upon signing to Capitol, he released his major-label debut It&amp;#039;s a Sorry World in early 1999; Gettin&amp;#039; My Mind Right followed later that same year. In 2000 he issued Hillbilly Homeboy which was helped by the success of its first single, &quot;The Ballad of John Rocker&quot; and waited three years to follow it up with his first funk concept album, Super Bad Sounds of the &amp;#039;70s. \n\n\n\nReview\tby William Ruhlmann\nRacist, sexist, xenophobic, and reactionary, Tim Wilson is on the more offensive side of the current school of Southern comedy (which also includes Jeff Foxworthy, Roy D. Mercer, and Bill Engvall). Like Engvall, he also writes novelty country songs, which are interspersed with his standup routines here. Members of the Atlanta Rhythm Section and the Muscle Shoals Rhythm Section back him up on performances of self-explanatory titles like &quot;The Devil Was a Nerd in High School&quot; and &quot;Sumo Wrestler Santa Claus.&quot; Wilson is a history buff, joking about Abraham Lincoln and Thomas Edison, and his best bits come in a series of twisted historical reminiscences by a character known as Uncle B.S., who claims to have insinuated himself into everything from Pearl Harbor to the Nativity. Anyone on the left side of the political spectrum is liable to have trouble with some of Wilson&amp;#039;s observations, but his redneck audiences obviously have no trouble with tasteless jokes about gun control and the death penalty, among other things.  (Rambam1776 note ? This review is BS, this guy is funny, and the racism is a joke)\n\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hxfwxqtkldte&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:hxfwxqtkldte&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c20b5a9a335a829edbd0438d79fdf8880de740fc","amp;dn":"Standup+Comedy+-+Tim+Wilson+-+Gettin%5C%27+My+Mind+Right","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20b5a9a335a829edbd0438d79fdf8880de740fc","infoHashBuffer":{"type":"Buffer","data":[194,11,90,154,51,90,130,158,219,208,67,141,121,253,248,136,13,231,64,252]},"announce":[],"urlList":[]}}