{"title":"Oglaf Webcomic Collection [ADULT] (Manual Rip|Up To 2/20/14)","uid":9646659,"size":76308836,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c25f2315938b7f1bcd848aeeefb0fc0a059a409a&amp;dn=Oglaf+Webcomic+Collection+%5BADULT%5D+%28Manual+Rip%7CUp+To+2%2F20%2F14%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"VikTSlick","files":6,"time":1393011609,"description":"From the minds of illustrators Trudy Cooper and Doug Bayne comes Oglaf, and extremely filthy (and extremely funny) webcomic that tackles sex and fantasy with a satirical bent. There is all sorts of nudity and gay/straight/other? sex, and all of it is in service to the stories and the sticky situations (pun intended). The initial &quot;main&quot; storyline focuses on an apprentice to a sorceress who enjoys torturing him by denying him the right to masturbate, and then forcing him to hose down two hot lesbians as part of his &quot;chores&quot;. Yeah, it gets even weirder and more hilarious from there. There is the plight of the Snow Queen, who needs to be sexually satisfied in order for it to become spingtime - but she freezes everything solid (including her lovers' dicks). Then there is Kronar, Son of Man, a mighty and fearsome warrior who is also a homosexual, and an insatiable one at that. The story of his &quot;son&quot; is particularly hilarious. Or perhaps you will enjoy the tale of a man &quot;cursed&quot; with such amazing sexual prowess that he instantly makes anyone else cum when they come into contact with his penis - but he himself can not get off. Much more filthiness and perversion abound in this terrific gem of a comic, and unlike other sex/adult comics it is not meant to titillate, but rather get you to laugh at all the absurdity. And it works, oh trust me - HOW it works! If you are old enough to enjoy it, this is one of the funniest things you will ever read. Give it a whirl.\n\nI have manually ripped all the images into 6 cbrs, with the website warning as a cover image for each. Each CBR is around 50-70 pages and it reads quick, since it is all single-page panels. Everything is not precisely chronological to the website; the first 3 volumes or issues are organized to make the main plot flow a little better. The remaining three volumes are exactly chronological, though. As I mentioned earlier, there are overarching story arcs interspersed with one-offs or smaller stories, but if you read straight through I don't think it is all that confusing. Hope you dudes and dudettes enjoy this one, and make you sure you check out the main page:\n\nOglaf.com\n\n...and also a wiki, for some more info if you want it:\n &lt;a href=&quot;\nhttp://oglaf.wikia.com/wiki/Oglaf_Wiki&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://oglaf.wikia.com/wiki/Oglaf_Wiki&lt;/a&gt;\n\nPlease seed, enjoy! :-)\n\n***NOTE - Just a reminder that this is VERY NSFW. Do not read this at the office or you are liable to get fired! Or you can be smart like me and be your own boss, lol. ;-)","torrent":{"xt":"urn:btih:c25f2315938b7f1bcd848aeeefb0fc0a059a409a","amp;dn":"Oglaf+Webcomic+Collection+%5BADULT%5D+%28Manual+Rip%7CUp+To+2%2F20%2F14%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c25f2315938b7f1bcd848aeeefb0fc0a059a409a","infoHashBuffer":{"type":"Buffer","data":[194,95,35,21,147,139,127,27,205,132,138,238,239,176,252,10,5,154,64,154]},"announce":[],"urlList":[]}}