{"title":"The Best of Eric Clapton [FLAC+MP3]  Clapton Chronicles","uid":9511816,"size":642868432,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c264bccfbea370606eff6b0a992426bde55e1c0e&amp;dn=The+Best+of+Eric+Clapton+%5BFLAC%2BMP3%5D++Clapton+Chronicles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"Big-Papi","files":-1,"time":1390423100,"description":"The Best of Eric Clapton [FLAC+MP3] (Big Papi) Clapton Chronicles\n\nSource: CD\n\n\nBy Daniel J.\n\nAs the 1980's opened, Clapton seemed more tuned into the mainstream without sacrificing any of his vital bluesy guitar and his throaty vocals. The Clapton Chronicles pick up where Cream of Clapton leaves off.\n\nThe engaging radio-friendly &quot;Forever Man&quot; from the Phil Collins-produced Behind The Sun continued Clapton's run on the pop charts, with his signature wailing blues guitar in full form. However, it turned out to be his last Top 40 hit for a while. Also from that album was &quot;She's Waiting&quot; with its pounded out synths in the chorus. It ends interestingly with frenzied accompaniment by some female backing singers, snare drum and piccolo.\n\n&quot;It's In The Way that You Use It,&quot; from the Color of Money soundtrack and also on his August album, was the first solo song I heard from him thanks to MTV, still with the full sound of guitars, synths, saxes, and brass. Other tracks from August not on here that I enjoyed were &quot;Run,&quot; the ballad &quot;Holy Mother,&quot; and his duet with Tina Turner, &quot;Tearing Us Apart,&quot; so 1986 wasn't a bad year for him.\n\nNext he released Journeyman (1989), which critics showed as a return to form, and even his best album since Slowhand, as seen with Bo Diddley's righteous &quot;Before You Accuse Me,&quot; which is simply marvelous pure blues, and where he gets help from Robert Cray. This album was produced by Russ Titleman, who had revitalized Steve Winwood's career with Back In The High Life and Roll With It and indeed, &quot;Pretending&quot; could've fit on Roll With It. Chaka Khan helps with backing vocals here, ironic as she did the same for Winwood's &quot;Higher Love.&quot; &quot;Bad Love&quot; gets a boost from Phil Collins on drums and backing vocals. There's less of the synths and more traditional rock instrumentation, which explains Journeyman's reputation as Clapton's best 80's album.\n\nThen came 20 March 1991, when his four-year old son Conor was killed in a fall. Following an extended absence, he came out with the heart-wrenching &quot;Tears of Heaven,&quot; sung in a delicate falsetto, from the Rush soundtrack. With &quot;Would you know my name if I saw you in heaven&quot; and the resolve of &quot;I must be strong and carry on/'cause i know i don't belong here in heaven&quot; the reference is more than clear. This gave him the first of two Grammies for Best Record. The version here is the original studio version.\n\nFrom the Grammy-winning Unplugged, there is the considerably slowed down version of &quot;Layla.&quot; Its tempo is indeed a reminder of its blues roots. This peaked at #12, two positions below of its studio counterpart peak. The live version of &quot;Running On Faith&quot; originally from Journeyman, is also included.\n\nHis second Grammy came with the Babyface-produced &quot;Change The World&quot; from the Phenomenon soundtrack. This Top Five ballad had a notably more romantic and theme, albeit mellowed, and with a more with a nice pop-soul backing vocal troupe.\n\nA handful of the songs here denote how much Clapton was sobered by his tragedy, reminded perhaps of mortality in general. &quot;Blue Eyes Blue&quot; from the Runaway Bride soundtrack, shows a more subdued Clapton: &quot;it was you who put the clouds around me/It was you who made the tears fall down.&quot; &quot;River of Tears&quot; with its funereal airy synths by Simon Climie of Climie Fisher fame who co-produced the album Pilgrim, of a man trying to start over after a split-up, and the #16 single &quot;My Father's Eyes,&quot; also from that album attest to that. On hearing &quot;how could I lose him?&quot; and &quot;Through the distant clouds of tears/I'm like a bridge that was washed away&quot; there is a sign that Clapton was still mourning and pouring it into these songs.\n\nWhere the 80's showed him holding steady, the 90s showed him winning more music recognition and glory, but at such a heavy price. Small wonder he was drowning in a river of tears.","torrent":{"xt":"urn:btih:c264bccfbea370606eff6b0a992426bde55e1c0e","amp;dn":"The+Best+of+Eric+Clapton+%5BFLAC%2BMP3%5D++Clapton+Chronicles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c264bccfbea370606eff6b0a992426bde55e1c0e","infoHashBuffer":{"type":"Buffer","data":[194,100,188,207,190,163,112,96,110,255,107,10,153,36,38,189,229,94,28,14]},"announce":[],"urlList":[]}}