{"title":"The Namesake BY Jhumpa Lahiri(epub) [Qwerty80]","uid":7973014,"size":334041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2801d42d3d8df89033b5f64d70be1111b84e246&amp;dn=The+Namesake+BY+Jhumpa+Lahiri%28epub%29+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KatQwerty","files":3,"time":1356908233,"description":"[b][size=&quot;150&quot;]The Author is a pulitzer prize winner for her book &quot;The interpreter of the maladies. This book was a NYT bestseller as well as made into a movie[/size][/b]\n\n\n[b]Publication Date: September 1, 2004  | EPUB [/b]\n \n \n \n\nJhumpa Lahiri's Interpreter of Maladies established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction.\n \n \n Among the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the highest critical praise for its grace, acuity, and compassion in detailing lives transported from India to America. \n \n \n \n \nIn The Namesake, Lahiri enriches the themes that made her collection an international bestseller: the immigrant experience, the clash of cultures, the conflicts of assimilation, and, most poignantly, the tangled ties between generations. Here again Lahiri displays her deft touch for the perfect detail -- the fleeting moment, the turn of phrase -- that opens whole worlds of emotion. \n \n \n \nThe Namesake takes the Ganguli family from their tradition-bound life in Calcutta through their fraught transformation into Americans. On the heels of their arranged wedding, Ashoke and Ashima Ganguli settle together in Cambridge, Massachusetts. An engineer by training, Ashoke adapts far less warily than his wife, who resists all things American and pines for her family. When their son is born, the task of naming him betrays the vexed results of bringing old ways to the new world. \n \n \n \n Named for a Russian writer by his Indian parents in memory of a catastrophe years before, Gogol Ganguli knows only that he suffers the burden of his heritage as well as his odd, antic name. Lahiri brings great empathy to Gogol as he stumbles along the first-generation path, strewn with conflicting loyalties, comic detours, and wrenching love affairs. \n \n \n With penetrating insight, she reveals not only the defining power of the names and expectations bestowed upon us by our parents, but also the means by which we slowly, sometimes painfully, come to define ourselves. The New York Times has praised Lahiri as &quot;a writer of uncommon elegance and poise.&quot; The Namesake is a fine-tuned, intimate, and deeply felt novel of identity.\n\n","torrent":{"xt":"urn:btih:c2801d42d3d8df89033b5f64d70be1111b84e246","amp;dn":"The+Namesake+BY+Jhumpa+Lahiri%28epub%29+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2801d42d3d8df89033b5f64d70be1111b84e246","infoHashBuffer":{"type":"Buffer","data":[194,128,29,66,211,216,223,137,3,59,95,100,215,11,225,17,27,132,226,70]},"announce":[],"urlList":[]}}