{"title":"Clear.and.Present.Danger [1994][DVDrip][eng]","uid":6070799,"size":735049768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2c6eb26b846a9d4e3489bf6f3305bed1e7f194b&amp;dn=Clear.and.Present.Danger+%5B1994%5D%5BDVDrip%5D%5Beng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Camel-Toe","files":-1,"time":1293608992,"description":"Clear and Present Danger (1994) - By Smelly-Cat\n\n\nTruth needs a soldier.\nHarrison Ford returns as intrepid CIA agent Jack Ryan in this critically acclaimed box-office smash from the producers of Patriot Games. When his mentor Admiral James Greer (James Earl Jones) becomes gravely ill, Ryan is appointed acting CIA Deputy Director of Intelligence. His first assignment: investigate the murder of one of the President's friends, a prominent U.S. businessman with secret ties to Colombian drug cartels. Unbeknownst to Ryan, the CIA has already dispatched a deadly field operative (Willem Dafoe) to lead a paramilitary force against the Colombian drug lords. Caught in the crossfire, Ryan takes matters into his own hands, risking his career and life for the only cause he still believes in - the truth.\n---------------------------------------------------------------------------\n\nTom Clancy's bestseller has Jack Ryan acting as Head of the CIA when his mentor Admiral Greer falls prey to cancer. On his watch, the President of the United States orders a covert operation to attack some South American druglords responsible for a friend's death. Ryan, who swears before Congress not to engage in covert action, must choose between loyalty and integrity.\n---------------------------------------------------------------------------\n\nPatriotic American Jack Ryan's (Harrison Ford) just been promoted to Deputy Director of Intelligence for the CIA. But before he can adjust to the demands of his position as advisor to the President, Jack's got to investigate a massacre that took the lives of several dignitaries. Probing relentlessly, Jack uncovers the disturbing truth about criminal activities involving an international drug cartel and a close friend of the United States President. Based on Tom Clancy's bestselling novel.\n\n\nActors: Harrison Ford, Willem Dafoe, Anne Archer, James Earl Jones\nDirector: Phillip Noyce\nAudio: DTS &amp; Dolby Digital 5.1\nAspect Ratio: 1.78:1 16:9 Enhanced\nTransfer Format: Widescreen\nVideo Encoding: Xvid\nAudio Encoding: MP3 128kbps\nCategory: Drama, Thriller\nFormat: DVD\nYear: 1994\nRating: M15+\nLanguages: English\nSubtitles: None\nRunning Time: 2:15:26","torrent":{"xt":"urn:btih:c2c6eb26b846a9d4e3489bf6f3305bed1e7f194b","amp;dn":"Clear.and.Present.Danger+%5B1994%5D%5BDVDrip%5D%5Beng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c6eb26b846a9d4e3489bf6f3305bed1e7f194b","infoHashBuffer":{"type":"Buffer","data":[194,198,235,38,184,70,169,212,227,72,155,246,243,48,91,237,30,127,25,75]},"announce":[],"urlList":[]}}