{"title":"Professional Interior Photography, 3rd Ed - (Malestrom)","uid":4648355,"size":62120777,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3163d93c413da3187cbb298e845507823af92f8&amp;dn=Professional+Interior+Photography%2C+3rd+Ed+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1231960130,"description":" &lt;a href=&quot;http://www.image-upload.net/images/qrm0rs6fb461xrgnlz0b.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/qrm0rs6fb461xrgnlz0b.jpeg&lt;/a&gt;\n\nMichael Harris, &quot;Professional Interior Photography, 3 Ed&quot;\nFocal Press | 2003-01 | ISBN: 0240519027 | 188 pages | PDF \n\nThis highly visual, full colour text is a must have purchase for all student and professional interior photographers, from residential to industrial. Michael Harris provides a complete guide through the vast choice of equipment and materials available, sharing his professional knowledge to help you improve your images.\n\nNew coverage of digital photography is included in this third edition helping you decide on film versus digital for your capture medium. The pros and cons of both are evaluated through a close look at the practice of Ashley Morrison, an interior photographer working digitally. The theory of lighting and composition is combined with practical tips and suggestions for overcoming day-to-day problems, and advice is given on how best to present and store images so you can concentrate on taking the images.\nIf you are just beginning a career in interior photography this book offers a good, comprehensive resource for ideas and techniques whilst encouraging individual interpretation. Illustrated with stunning colour pictures throughout, the text is written in an easy digestible style, making theory clear and simple to understand.\n\n\nThe interviews with the masters of interior photography have been expanded and updated to include their views on digital, and now include senior English Heritage photographer Derek Kendall alongside Brian Harrison, Andreas von Einsiedel and Peter Aprahamian.\n\n\n*New information on the pros and cons of digital photography to keep you up to date\n*Practical advice on which equipment to use to achieve professional results\n*Inspirational colour photographs throughout, including images from top master photographers ","torrent":{"xt":"urn:btih:c3163d93c413da3187cbb298e845507823af92f8","amp;dn":"Professional+Interior+Photography%2C+3rd+Ed+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3163d93c413da3187cbb298e845507823af92f8","infoHashBuffer":{"type":"Buffer","data":[195,22,61,147,196,19,218,49,135,203,178,152,232,69,80,120,35,175,146,248]},"announce":[],"urlList":[]}}