{"title":"Kathy Smith Pregnancy Workout","uid":6162534,"size":654667714,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c3545b64c906d2ede09d2fa05efb054c9db7b931&amp;dn=Kathy+Smith+Pregnancy+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"krylyshli","files":1,"time":1297264794,"description":"Kathy Smith: Pregnancy Workout\n\nKathy Smith has been around a while in the world of fitness videos, and with good reason. Her calm, authoritative manner, flawless timing, emphasis on proper form, and responsible directions put her entire fitness series a cut above most celebrity workouts. Pregnancy Workout is no exception. Smith and five workout buddies (all of them appearing to be well past the fifth month of pregnancy) demonstrate a good 50-minute prenatal workout, with an ample warmup period, a cardio section that includes sufficient upper-body work, plenty of safe abdominal and pelvic-floor exercises, and an active relaxation period (which some avid aerobicizers may find a bit too long). Smith uses props such as chairs and pillows to allow effective exercise while maintaining an emphasis on safety and comfort.\n\nThere's also an excellent section on getting back up to working out postpartum, with a set of simple exercises that can be done within a day or two after delivery (and even a few stretches for the baby, which Smith demonstrates with her adorable infant daughter). Gynecological authorities appear in the video as well to give advice on prenatal exercise and to answer common postnatal questions on such topics as resuming exercise after a C-section and timing exercise around breastfeeding. The baby-block and teddy-bear graphics are a little too cutesy, and those used to working out to high-energy Top 40 hits may find the music extremely bland, but the exercise itself is always the focus, making this one of the best pregnancy workouts available","torrent":{"xt":"urn:btih:c3545b64c906d2ede09d2fa05efb054c9db7b931","amp;dn":"Kathy+Smith+Pregnancy+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3545b64c906d2ede09d2fa05efb054c9db7b931","infoHashBuffer":{"type":"Buffer","data":[195,84,91,100,201,6,210,237,224,157,47,160,94,251,5,76,157,183,185,49]},"announce":[],"urlList":[]}}