{"title":"Rudy Maxa World Exotic Places 01of13 India Delhi and Agra DVDRip","uid":9626195,"size":306351837,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c376da55ba3a947010e2da063c8e3d01182451a7&amp;dn=Rudy+Maxa+World+Exotic+Places+01of13+India+Delhi+and+Agra+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1392595980,"description":"Rudy Maxa,s World: Exotic Places\n\nTravel Documentary hosted by Rudy Maxa, published by Questar in 2009 - English narration\n\n\nInformation\n------------------------------\n\nRudy Maxa World: Exotic Places\nWelcome to Rudy Maxa's World, the ultimate travel experience with America's leading high-end travel expert. Join Rudy Maxa, public radio's original Savvy Traveller and contributing editor for National Geographic Traveller magazine, for an unforgettable tour of the fascinating cities and regions that have captivated world travellers for centuries.\n\n\n1)  India Delhi and Agra \nIndia is the world's &quot;it&quot; country. Tumultuous, colorful, and fragrant, northern India is a mosaic of urban and rural life. &quot;You can put a camera down almost anywhere in India and let it run for two hours,&quot; Rudy Maxa says, &quot;and when you return, you'll have a film to rival an 'Indiana Jones' movie.&quot; From the serene beauty of one man's love poem to a woman, the Taj Mahal, to the crowded alleys of downtown New Delhi, India is a feast for the senses. Maxa discovers temples straight out of Disneyland and consults a street astrologer who tells him he will live a long life but his hotel room number is not an auspicious one.\n\n2)  India Rajasthan \nJaipur, the &quot;Pink City,&quot; provided the Mughal Empire with its generals even as its civilians were building some of the world's great temples and palaces. Here travelers find the Hawa Mahal, the Hall of Winds, built with red and pink sandstone. One of Rajasthan's other great cities, Jodhpur, is less know to the world, even though it loaned its name to a style of riding breeches. This episode takes viewers into the royal rooms behind the sandstone walls of the Mehrangarh Fort, perched high above the city. And in the back streets of Jodhpur, cameras find the enormous furniture industry that collects and refurbishes heirloom furniture that make their way to stores around the world. In the dusty countryside outside of Jodhpur, villagers who have never have seen a Westerner invite Rudy Maxa into their modest homes, and the maharajah of Jodhpur explains why his palace is now a hotel.\n\n3)  Turkey Istanbul \nEverywhere in the Turkish capital is evidence of civilizations that tried to tame it. From the Romans to the Ottomans, this tumultuous city has seen it all, and its architecture, cuisine, and customs reflect that reality. Here, Christianity and Islam have their touchstones, and the cliche that &quot;East meets West&quot; at the Bosporus is a truism. Rudy tries to avoid buying a Turkish carpet-he admits he's powerless to visit Istanbul without returning home with a rug-but, as usual, he fails. Prowl some of the Grand Bazaar's 2,000 shops and spend some time with a professional shopper who teaches travelers the fine art of haggling. And can those Turkish carpets tell stories? Many do-stories of love and despair are woven in wool and color. Rudy gets steamed and scrubbed in a 16th century hammam, or public bath, and tours some of the world's great buildings-Topkapi Palace, the Aya Sofia, the Blue Mosque, and the downtown Spice Market. Be hypnotized by Whirling Dervishes, charmed by the Iznik art of ceramics, and learn how to buy a . . . carpet.\n\n4)  Turkey Turquoise Coast \nViewers will be forgiven for thinking the southern Turkish coast on the Mediterranean Sea more closely resembles the Italian countryside or Greek islands. That's because the best Greek and Roman ruins are found in Turkey. Great, ancient towns of Ephesus, Antalya, Myra and Dalyan dot the Turkish coast, tempting visitors to step back into time when lavish Roman homes and markets dotted the landscape. Boarding a gulet, the traditional wooden Turkish boat, for a Blue Cruise, Rudy departs from the popular seaside town of Bodrum for a watery visit along the coast with stops to tour dramatic, historic ruins.\n\n5)  Thailand Bangkok \nThe capital of Thailand appears the capital of pandemonium, its streets filled with tuk-tuks, motorcycle taxis, cars and 12 million people. But the Thais have mastered the art of creating tranquility behind closed doors, whether in homes, hotels or temples. Rudy takes you to back streets and the quiet, residential klongs, or canals, of Bangkok. Visits to Bangkok's legendary food carts and markets reveal the real city that captures the affection of visitors who take the time to seek out what makes Bangkok special. Marvel at the Emerald Buddha (made no less spectacular by the fact it's really jade), visit the city's flower and fish markets, join locals offering incense and flowers at colorful outdoor shrines, celebrate the king's 80th birthday with an all-day and all-night party, and take a wooden boat along the city's main artery, the wide Chao Phraya river. A side trip takes viewers to the world's only outdoor market whose vendors must fold back their displays 16 times a day as a train passes through the heart of commerce, missing vegetables, meats, and fish by inches.\n\n6)  Thailand Golden Triangle \nTea plantations have replaced the opium fields in northern Thailand, but dense jungle still covers much of the area where Thailand borders Burma and Laos. Visit an Akha hill tribe village trying to maintain its traditions in the face of tourism. Meet elephants rescued from life in Bangkok at an elephant orphanage. Join Rudy as he takes mahout lessons and gets soaked steering his elephant into the river that separates Thailand from Burma. Explore the small villages that mark this part of the country and meet a Buddhist monk who uses horses, martial arts, and religion to steer young men away from the temptations of drugs being produced across the border in Burma. The saffron robes of Buddhist monks, the vivid colors of local blossoms, and the brilliant emerald of rice fields make the Golden Triangle a magical corner of the world.\n\n7)  Thailand Andaman Coast \nSome of the world's most beautiful waters and beaches await visitors to southern Thailand, where the names of Andaman Coast towns such as Phuket are well known to backpackers and sun seekers. But there's more to this 16-million-year-old ecosystem than just golf and sunbathing. Dramatic limestone cliffs and rock formations jut from translucent waters of Phang-nga Bay; join Rudy as he paddles through hidden entrances of small islands to find mangroves few people ever see. Meet locals in a seaside village devastated by the recent tsunami as they struggle to rebuild by offering sustainable tourism and home stays to visitors.\n\n8)  Russia St Petersburg \nThe treasures of the Hermitage are revealed in High Definition for perhaps the first time for American television viewers. St. Petersburg--enjoying a renaissance since its favorite son, Vladimir Putin, ascended to office - is no longer the gloomy city it once was as billions of rubles pour in to restore the place to its former glory. From the splendors of Peterhof to the quiet grace of the city's many canals, this former capital built by a czar has reclaimed its position as one of the world's great destinations.\n\n9)  Estonia Tallin and the Islands \nThe old town in the capital city of Talinn is Europe's best-restored medieval town with streets and buildings that recall the days of the Hanseatic League but whose cafes, art galleries, hotels, and restaurants today appeal to both sophisticated as well as first-time travelers. Venture into the countryside of Estonia, to the large island of Saaremaa and the much smaller island of Muhu, where you'll find windmills, thatch-roofed farmhouses and quiet waters. Of special interest is a candid interview with Mart Laar, the prime minister who took over a country that was an economic and psychological basket case following the withdrawal of Soviet troops and-with the help of a flat tax-turned Estonia into one of Europe's most dynamic and forward-thinking little countries.\n\n10)  Argentina Buenos Aires \nThe style and verve of one of South America's most beautiful capitals is the focus of this episode that highlights Argentina's national dance, the tango, as well as the energy that its diverse population brings to the urban landscape. The HD lens brings to the fore the graceful and classic architecture of Buenos Aires, exemplified by the San Telmo neighborhood whose Sunday market is traditionally closed at sunset by an impromptu street band that marches through the streets, collecting dancers and revelers with its insistent drumbeats. At local tango parlors called milongas, Buenos Aires residents, known as portenos, lend an air of authenticity to the dance that grew up in the working class neighborhoods of the city. We wander the famous Recoleta cemetery in downtown Buenos Aires, where incredible monuments to the departed, including Eva Peron, feature winged angels and other fantastically decorated crypts. Meet a 70-year-old ice cream maker from Sicily who never misses a day's work. And explore the underground art scene that's finding a home in Buenos Aires.\n\n11)  Argentina Mendoza \nThe heart of Argentine wine country is nestled in a valley beneath the snow-capped Andes whose iconic summit, Aconcagua, is the highest in the Western hemisphere. Glacial runoff from the mountain range feeds the miles of vineyards that, along with fruit and vegetable farms, blanket the lowlands. Rudy drives into the thin air of the Andes, visiting the graveyard of those who died trying to summit Aconcagua. His choice for high-altitude adventure: getting soaked while whitewater rafting. Back at sea level, he meets winemakers whose well-priced and elegant Malbecs are shaking up the world's wine market. A lunch of grilled meats prepared by gauchos in the middle of a vineyard is a reminder that the cowboy life is very much alive in this stunning region.\n\n12)  Japan Tokyo \nAn urban marriage of high tech and age-old customs makes Tokyo a fascinating destination, from teenagers playing &quot;cos,&quot; or costume games, to adults taking dinner at tiny yakatori restaurants, where the kitchen is a small grill dedicated to cooking skewers of meat. Tour the city's massive wholesale fish market, Tsukiji Market, before dawn to watch the daily auction of massive torsos of tuna fish destined for sushi restaurants around the world. Check out space-age toilets at the showroom of Toto as proof that cutting edge technology permeates every aspect of Japanese life. Go shopping in a department store with more than 100 shops catering to young Japanese women to whom fashion is all important. From bathing in the neon lights of the Shibuya neighborhood at night, to marveling at the city's spring explosion of cherry blossoms, to learning your fortune by consulting a joss-stick at a Buddhist temple, Tokyo offers a rainbow of experiences guaranteed to fascinate.\n\n13)  Japan Kyoto \nThe spiritual heart of Japan, Kyoto offers a glimpse of Japanese life as it used to be, primarily because it was never bombed during World War II. Tiny streets with wooden homes, impressive temples, and a dedication to ancient Japanese traditions make Kyoto one of Japan's most visited cities. We check into a ryokan, or Japanese inn, and talk with one of Japan's best-known designers of kimonos to learn why his craft is still thriving. Rudy invites viewers to join him at a tea ceremony and learns that the Japanese attention to detail even extends to incense that locals use for a variety of purposes. Experience the tranquility of not only a rock garden but also a moss garden, retreats that help lend this city in a valley its Zen-like peacefulness.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/8809/xa13.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/8809/xa13.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img577.imageshack.us/img577/5527/14e6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img577.imageshack.us/img577/5527/14e6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img547.imageshack.us/img547/557/0cdi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img547.imageshack.us/img547/557/0cdi.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img594.imageshack.us/img594/715/azuf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img594.imageshack.us/img594/715/azuf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img534.imageshack.us/img534/5123/592f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img534.imageshack.us/img534/5123/592f.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img801.imageshack.us/img801/4777/7622.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img801.imageshack.us/img801/4777/7622.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img33.imageshack.us/img33/982/83iu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img33.imageshack.us/img33/982/83iu.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/1753/j2kk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/1753/j2kk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img849.imageshack.us/img849/2408/itgc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img849.imageshack.us/img849/2408/itgc.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img163.imageshack.us/img163/5764/9hri.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img163.imageshack.us/img163/5764/9hri.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img200.imageshack.us/img200/196/xrkv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img200.imageshack.us/img200/196/xrkv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/1187/5ock.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/1187/5ock.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5419353d3a1418677a64&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1673 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 25mins\n * Framerate: 29fps\n * Number of Parts: 13\n * Part Size: average 292 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.travelvideostore.com/travel-video-series/rudy-maxas-world-exotic-places/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.travelvideostore.com/travel-video-series/rudy-maxas-world-exotic-places/&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Best%20of%20Travel%3A%20South%20Africa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Best%20of%20Travel%3A%20South%20Africa&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Europe%20to%20the%20Max%3A%20Hidden%20Treasures&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Europe%20to%20the%20Max%3A%20Hidden%20Treasures&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:c376da55ba3a947010e2da063c8e3d01182451a7","amp;dn":"Rudy+Maxa+World+Exotic+Places+01of13+India+Delhi+and+Agra+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c376da55ba3a947010e2da063c8e3d01182451a7","infoHashBuffer":{"type":"Buffer","data":[195,118,218,85,186,58,148,112,16,226,218,6,60,142,61,1,24,36,81,167]},"announce":[],"urlList":[]}}