{"title":"Railworks TS2016 DTG North London Line Route + DB Class 59/2","uid":12629314,"size":1198274250,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3857298191ab4ada06d95dc64b9e2b9f0538972&amp;dn=Railworks+TS2016+DTG+North+London+Line+Route+%2B+DB+Class+59%2F2+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TS2015","files":1,"time":1445815748,"description":"One of the busiest commuter routes through the UK’s capital city is stunningly recreated for Train Simulator in this new route add-on. \r\n\r\nThe North London Line spans approximately 17 miles between Richmond and Stratford, and is today part of the London Overground network. The line is a heavy commuter route with trains every 15 minutes, and also a key corridor for freight traffic, connecting the inner suburbs north of London. Despite the line’s short length, the route is almost entirely dense inter-urban railway, with trains taking more than one hour to traverse the route when calling at all 23 stations. \r\n\r\nBuilt over a total of 25 years in five connecting sections, the first portion of the line was opened as the Eastern Counties and Thames Junction Railway in 1846 between Stratford and North Woolwich, with the last portion opening in 1869 between South Acton and Richmond by the London &amp; South Western Railway. \r\n\r\nThe 1980s started to see closures across the line, the most notable being the closure of Broad Street station, a once major terminus for the City of London that became a dwindling station with very few passengers. Other notable closures on the line included the Tottenham Hale to Stratford link, and more recently the section between Stratford and North Woolwich in 2006. Where that track once stood is now used by the Docklands Light Railway and will also become part of the Crossrail branch to Abbey Wood in 2018. \r\n\r\nThe line is electrified mostly with 25kV AC overhead catenary between Stratford and Acton Central, made so that dual voltage Class 313s could use the line and also open it up to electric freight locomotives. The section between Acton Central and Richmond sees third rail power, and between Gunnersbury and Richmond there is also a fourth rail as the London Overground and District Line shares this stretch of the network. \r\n\r\nToday the line is populated by Class 378/2 ‘Capitalstars’ forming the London Overground services, D78 Tube Stock for District Line services between Richmond and Gunnersbury, and Class 66s, 70s, 90s and 92s hauling freight. \r\n\r\nThe North London Line for Train Simulator recreates the 17 mile route as it operates today between Richmond in the South West of London and Stratford in the North East, with the track curving in a rough semicircle shape to avoid the centre of London. The route includes standard British LED signalling throughout and the modern TfL Class 378 ‘Capitalstar’.\r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:c3857298191ab4ada06d95dc64b9e2b9f0538972","amp;dn":"Railworks+TS2016+DTG+North+London+Line+Route+%2B+DB+Class+59%2F2+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3857298191ab4ada06d95dc64b9e2b9f0538972","infoHashBuffer":{"type":"Buffer","data":[195,133,114,152,25,26,180,173,160,109,149,220,100,185,226,185,240,83,137,114]},"announce":[],"urlList":[]}}