{"title":"My Father - My Lord (Israel) DivX (moviesfromrizzo)","uid":6140295,"size":667117615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c3aa60e709827e5344525735862f8ef8fd90ee63&amp;dn=My+Father+-+My+Lord+%28Israel%29+DivX+%28moviesfromrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1296434143,"description":"btw If you are on the Upstairs Downstairs torrent, please note that many have come\nthrough with a fast enough completion in that they were willing to share their seed. Some seemed to leave with 40% completions even! That's a sad waste.\nOh well we hope this will work out yet - having made the point here today. \n\nMany others have simply quit, as there isn't enough sharing that is occurring and\nso they leave frustrated. We cannot pump in seed if the torrent wont take any more\nwhen not enough sharing has occurred. That's how the software works that we all use.\n\nSo whether its Rumpole or any other major torrent, please join in to share -\neven after you get your download - if you are willing to promote culture at\nits best!\n\nThis movie today is from Israel and looks at religious dogma in what are the \nimplications of the teachings of sacrifice as related in the story of Abraham\nwhich all are asked to celebrate and appreciate for what it is supposed to mean\neven today.\n\nThe effect on all concerned in this sad movie about a great kid who\nalthough has kindness shown to him - as that is Jewish culture - caring\nfor children is all they are really in fact taught in modern days equally -\nthe effect has to be seen as clearly dissonant as it isn't easy enough to \nrationalize in order to truly make sense of it all - I suspect.\n\nMichael Rizzo Chessman\n\n\nDivX 720 X 480 - 128k audio","torrent":{"xt":"urn:btih:c3aa60e709827e5344525735862f8ef8fd90ee63","amp;dn":"My+Father+-+My+Lord+%28Israel%29+DivX+%28moviesfromrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3aa60e709827e5344525735862f8ef8fd90ee63","infoHashBuffer":{"type":"Buffer","data":[195,170,96,231,9,130,126,83,68,82,87,53,134,47,142,248,253,144,238,99]},"announce":[],"urlList":[]}}