{"title":"Prison Architect Alpha 10 (Windows)","uid":8523019,"size":115130196,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3e2a8bdde960fec5aa829832ddbc5406ab8b89c&amp;dn=Prison+Architect+Alpha+10+%28Windows%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Dwarth","files":1,"time":1369958377,"description":"LINUX BUILD NOW AVAILABLE! Steam customers can now publish or subscribe to the to the best prisons from the Architect community. A new danger model improves the realty of riots occurring, and when they do you can brutally oppress the inmates using riot cops with massive batons!\n\n\n= Steam Workshop\nYou can now share your prisons online via the Steam Workshop, accessible from the main menu (Steam version only)\nYou can publish your current prison by giving it a name and clicking on Publish\nAlternatively you can browse the Prison Architect workshop and subscribe to other people's prisons\nSubscribed prisons will show up in the workshop window and can be played at any time by clicking Play\nUse the Steam Workshop itself to set descriptions, metadata, and to manage your published prisons\n\n= Linux\nPrison Architect is now available for Linux, via Steam and as a standalone download\nWe have targeted Ubuntu 12.04 and later (32 or 64 bit) for now, with wider compatibility coming in future alphas\nThe game should work fine on other distros, but please let us know if you have problems\nNote: Prison Architect is not currently compatible with Debian (Stable), because we require glibc 2.15 or greater\n\n= New anger model\nThe system for determining when prisoners become angry and misbehave has been totally overhauled\nThere is now a Thermometer which represents the &quot;danger level&quot; of your prison. A high &quot;temperature&quot; will lead to fights.\nAll prisoners have a &quot;boiling point&quot;, which represents the temperature at which they will kick off\nMax sec prisoners will tend to have a lower boiling point, meaning they will kick off earlier\nThis thermometer is visually represented in the top toolbar, showing the current temperature and rate of change.\nFactors affecting the danger level of your prison:\n- (increase) prisoners angry that their needs are not being met\n- (increase) prisoners locked up for no reason\n- (increase) riot police on site\n- (increase) fight / riot occurring nearby\n- (increase) recent death\n- (decrease) prisoners who feel they are well treated (all needs met)\n- (decrease) guards stationed in the area \n- (decrease) recent punishments (deterrent)\n\n= Rioting\nIf the &quot;temperature&quot; of your prison rises too high, prisoners will begin to riot. \nThis raises the temperature further, resulting in a feedback loop which can push the entire prison into riot\nPrisoners who are rioting will capture their cell block, and will defend it against your guards and riot police\nRioting prisoners will smash down internal doors, freeing their cellmates and spreading the riot to neighbouring cell blocks\nYour guards and staff will not willingly enter a captured sector - too dangerous\n\n= New Emergency services: Riot police, Paramedics\nTo deal with riots, you can now call in Riot Police. These guys are heavily armoured and will retake the captured sectors\nYou can control them using the Emergency Callouts unit list on the right of the screen, or by drag-selecting\nParamedics will heal anyone injured nearby\nYou can dismiss emergency callout units by clicking on the red X next to their unit icon\n\n= Incident markers\nWhen guards spot an incident, they will now &quot;radio in&quot; to alert you of this trouble\nMarkers will popup around the edge of the screen, directing you to the incident\nClick on the Marker to quickly move to the incident\n\n= Laundry continued:\n- Prisoner uniforms now come out of the laundry machines crumpled, and must be ironed before use (requires Ironing Board) \n- Prisoners will now change into their clean uniforms whenever their Clothing need is high\n- When showering, Prisoners will now get undressed only when close to the shower\n- Fixed: Multiple laundry baskets were being sent to a single sector at the same time\n- Fixed: Not enough prisoner uniforms are delivered to the prison\n- Fixed: Laundry baskets would sometimes render a vertical stripe of random sprites above their position\n\n= New audio work\nA ton of new audio elements have been added to the game, especially for angry crowds\nYou will now get lots of audio warning before trouble breaks out. The prison now sounds a lot more dangerous\nA brand new dynamic music score will play during and after a Riot\nAll objects are now made of a certain material (Wood/Metal etc) and have appropriate damage sounds\n\n\n- There have been significant improvements to direct unit control, ie drag selection, movement commands etc\n\n- You can no longer build on the very edges of the map, or anywhere on the road\n\n- Guards and staff can no longer see through walls (ie do not reveal fog of war)\n\n- The Regime report now shows the current time as a horizontal line\n\n- Prisoners will now sleep when in their cells at any time between 10pm and 8am, if they need to\n\n- All consumables are now delivered in batches, once per hour (ingredients/foodtrays/uniforms/metal/bleach)\n\n- Workmen can now unload anything from delivery trucks. This fixes bugs where items were left blocking the road\n\n- Prisoners can now receive up to 3 visitors in a single group\n\n- Fixed: Laundry/Workshop/Kitchen objects could not be dismantled because the job was wrongly assigned to prisoners\n\n- Fixed: New construction jobs are often wrongly tagged as &quot;Failed: No materials&quot; for a few seconds\n\n- Fixed: Visitation does not end during a bangup\n\n- Fixed: Graphical bug that resulted in the bottom of some sprites being clipped\n\n- Fixed: Prisoners assigned to work in the Kitchen would sometimes try to bring ingredients in from outside,\nresulting in an immediate escape attempt as soon as they were out the front door\n\n- Fixed: The navigation system would fail when trying to plot routes to the very edges of the map \n(Note: Although entities can navigate to the very edge, they aren't allowed to build on it)","torrent":{"xt":"urn:btih:c3e2a8bdde960fec5aa829832ddbc5406ab8b89c","amp;dn":"Prison+Architect+Alpha+10+%28Windows%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e2a8bdde960fec5aa829832ddbc5406ab8b89c","infoHashBuffer":{"type":"Buffer","data":[195,226,168,189,222,150,15,236,90,168,41,131,45,219,197,64,106,184,184,156]},"announce":[],"urlList":[]}}