{"title":"My Morning Jacket - 2003 - It Still Moves  [EAC - FLAC]","uid":4675678,"size":472974474,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4225e5aa6fdb4b493a29a644a46668085964244&amp;dn=My+Morning+Jacket+-+2003+-+It+Still+Moves++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bludStain","files":-1,"time":1232893775,"description":"My Morning Jacket - 2003 - It Still Moves  [EAC - FLAC]\n\nReview    by Thom Jurek\n\nIt's a beautiful thing to know that Brian Wilson is still alive and well in the kingdom of indie rock. My Morning Jacket's third full-length effort, and first for the ATO/RCA venture label, is a step beyond the band's work for Darla. While the gorgeous amalgam of the Band's vision of country/Americana and Neil Young's blend of folk and rock are everywhere present, there is a new textural awareness evident on It Still Moves. Jim James' songwriting is tighter in structure, but his production sensibility is early-'70s Laurel Canyon, with some of the Grateful Dead's American Beauty tropes as well. Sounds like a mess, doesn't it? Well, it's not. Wearing your influences on your sleeve doesn't mean unoriginality. James is an original songwriter; he has worked hard to develop the gifts inherent in his lyric concerns and his ability to paint emotional landscapes with his melodies, and the payoff has never been greater. &quot;Mahgeetah,&quot; with its Pet Sounds ambience and country-rock melody -- complete with fuzzed-out guitar solo -- is far more imaginative than anything Wilco ever pulled off by trying the same thing (which they do over and over ad nauseam). &quot;Dancefloors,&quot; with its biting Telecaster lead line that echoes &quot;Baby Don't Do It&quot; and the Stray Gators' country majesty, is full of warmth, depth, and Levon Helm's soul. And &quot;Golden,&quot; which is the third track in this opening triad, brings James' love of Tim Buckley and Fred Neil into the light. But all of these elements of construction are read through James' Kentucky and his unique melodic gift, where fragments becomes entire lines become songs with stunning bridges, achingly poetic lyrics, and a country boy's sense of whacked-out humor and tenderness (check out &quot;One Big Holiday&quot;). The horn arrangements on &quot;Easy Morning Rebel&quot; make the country shuffle into a near R&amp;B tune with an old-timey stroll through a shambolic rhythm track. In all, My Morning Jacket may be a journey through the past, but it's also a solid step into something rock &amp; roll has been missing for an awfully long time in the mainstream arena: melody, extremely catchy and well-written songs that aren't afraid of the mainstream, and a love of the great pop continuum that translates into something new.\n\n    \n01  Mahgeetah     James     5:56\n02  Dancefloors     James     5:38\n03  Golden     James     4:39\n04  Master Plan     James     5:05\n05  One Big Holiday     James     5:21\n06  I Will Sing You Songs     James     9:18\n07  Easy Morning Rebel     James     5:09\n08  Run Thru     James     5:45\n09  Rollin' Back     James     7:50\n10  Just One Thing     James     3:13\n11  Steam Engine     James     7:26\n12  One in the Same     James     6:23 ","torrent":{"xt":"urn:btih:c4225e5aa6fdb4b493a29a644a46668085964244","amp;dn":"My+Morning+Jacket+-+2003+-+It+Still+Moves++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4225e5aa6fdb4b493a29a644a46668085964244","infoHashBuffer":{"type":"Buffer","data":[196,34,94,90,166,253,180,180,147,162,154,100,74,70,102,128,133,150,66,68]},"announce":[],"urlList":[]}}