{"title":"Voices From the Vietnam War: Stories From American, Asian, and R","uid":11740539,"size":4783967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4254abf10fe708c27d389f18346f4f0e77590e9&amp;dn=Voices+From+the+Vietnam+War%3A+Stories+From+American%2C+Asian%2C+and+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425786327,"description":"For more than thirty years, Vietnam was ravaged by war, resulting in nearly 1.5 million military casualties and more than 4 million civilian casualties. From the French Indochina War (1946-1954) to the Communist victory in 1975, the land and people were the victims of constant battle and were irrevocably altered by the effects of devastating violence. Voices from the Vietnam War; Stories from American, Asian, and Russian Veterans assembles the accounts of soldiers, spies, and medical workers who experienced firsthand the years of conflict in Vietnam.Few oral histories of the Vietnam War allow civilians or Communist supporters to tell their stories, and the resulting scholarship is often one-sided. Xiaobing Li, a native of China and a former soldier in the People's Liberation Army, spent seven years gathering hundreds of accounts from survivors of the war, filling gaps in the narrative, and providing new insights into the events of the war. Voices from the Vietnam War offers the personal accounts of twenty-two individuals, spanning three continents and representing multiple political beliefs and perspectives---American, Chinese, Russian, North and South Korean, Vietnamese, and Viet Cong.Many of the narratives bear the lingering spirit and influence of the ideology imposed on the veterans by their respective governments. Some of the veterans still follow official accounts, glorifying the Communist victory in Vietnam or praising Western political involvement in the war. Among the stories are several Communist accounts that humanize and contextualize the war's events while shedding light on aspects of the war previously unknown to Western scholars. An interview with a former KGB agent reveals that Russia's support of North Vietnam was far greater than Western historians previously have speculated. Another account, by a captain in the Chinese army, details the experience of the Chinese troops who fought alongside the North Vietnamese.While much of the scholarship on the Vietnam War focuses on battles, political maneuvering, and combat strategies, Xiaobing Li presents a collection of stories from people who witnessed the war firsthand. Voices from the Vietnam War focuses on personal combat experiences, offering a deeper understanding of America's longest war","torrent":{"xt":"urn:btih:c4254abf10fe708c27d389f18346f4f0e77590e9","amp;dn":"Voices+From+the+Vietnam+War%3A+Stories+From+American%2C+Asian%2C+and+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4254abf10fe708c27d389f18346f4f0e77590e9","infoHashBuffer":{"type":"Buffer","data":[196,37,74,191,16,254,112,140,39,211,137,241,131,70,244,240,231,117,144,233]},"announce":[],"urlList":[]}}