{"title":"[WatchingMyMomGoBlack DogFart] Daughter watches Her Mom Go Black","uid":13347231,"size":1134102173,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c42633e48e8445d0a38aca912f744eb79a32f6ed&amp;dn=%5BWatchingMyMomGoBlack+DogFart%5D+Daughter+watches+Her+Mom+Go+Black&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1454057666,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/FYw\r\n \nhttp://imgsnaps.com/image/FYr\r\n\r\nDescription:\r\n\r\nMaia Davis has the best of intentions by having her mother, Ava Delane, meet up with a personal trainer. And daughter are Mother in the park and awaiting Rico Strong's arrival so they can really begin to feel the burn. However, the miserable weather forces all three inside in order for the regime to being workout. Once inside, Rico uses his experience to show both ladies some exercises. Light flirting leads Some to an all out frenzy of black ladies on Rico's big black cock. 's Massive black Rico cock is shared between mother and daughter while the head of the household has no idea that his two ladies are going black. Ava's dilemma as to whether or not this constitutes cheating does not matter. What matters is that her daughter is sucking down a Kong-sized black cock in front of her and the workout plan has gone out the window. Davis- Maia without any shame- rides Rico's big black cock while her mom masturbates with anticipation. White pussy's Maia gets slammed like a hurricane and it's Ava's time to feel the wrath of interracial sex. Takes his huge Rico black cock from Maia's pussy and inserts it directly into Ava's once- tight asshole. If debate on The anal sex is really cheating does not seem to faze Rico: He's balls deep in that ass milf's and Maia Davis is cheer- ing them on. The only thing left to workout is some black nutmeg. Davis takes a Maia thick load of Rico's jizz right down her mouth as mom watches. We have a feeling that tonight's dinner table will not look right: Ava Delane will not be able to sit properly and Maia will have already eaten","torrent":{"xt":"urn:btih:c42633e48e8445d0a38aca912f744eb79a32f6ed","amp;dn":"%5BWatchingMyMomGoBlack+DogFart%5D+Daughter+watches+Her+Mom+Go+Black","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c42633e48e8445d0a38aca912f744eb79a32f6ed","infoHashBuffer":{"type":"Buffer","data":[196,38,51,228,142,132,69,208,163,138,202,145,47,116,78,183,154,50,246,237]},"announce":[],"urlList":[]}}