{"title":"Duck Tales Remastered-ALiAS","uid":8809902,"size":328899807,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c4615084d9a524cb356a0b5f883ca0b7f2ff70c4&amp;dn=+Duck+Tales+Remastered-ALiAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":35,"time":1376432617,"description":"\nDuckTales Remastered follows the adventures of Scrooge McDuck as he explores differently themed worlds to collect their treasures and become the worlds richest duck.\nDuckTales Remastered takes the classic Disney platforming adventure to a whole new level. All of the visuals from the 8-bit game have been beautifully re-created as hand-drawn and animated sprites, across a backdrop of luscious, re-envisioned level backgrounds. Furthermore, original Disney Character Voices talent, including some from the cartoon TV series, bring in-game characters to life with charm and wit, while the classic melodies of the original soundtrack are given a modern twist. The game also features an all new tutorial level where players can get familiar with the iconic pogo jump and cane swing, while Scrooge McDucks Museum allows players to track all their stats and compare their progress with others via global leaderboards.\n\nFeatures:\n\nRelive the classic TV series from the 1980s  Follow the adventures of Scrooge McDuck and his three nephews as they fend off enemies including the Beagle Boys and Magica DeSpell, on their quest to obtain the five most impressive treasures from across the world.\nRedefined hand-drawn visuals  Developer WayForward have taken all the original visuals from the 8-bit game and significantly enhanced and recreated them as hand-drawn sprites, across a backdrop of beautifully re-envisioned level backgrounds.\nAuthentic Disney experience  Some of your favorite Disney characters are brought to life by many of the original voice-over talent from the classic DuckTales TV series and stage backgrounds take their inspiration from the classic TV episodes.\nLearn to pogo  In an all new tutorial level, learn the basic playing skills, including Scrooge McDucks icon pogo jump and cane swing.\nVisit the museum  Track your achievements, progress and status on the leader boards in Scrooge McDucks new Museum.\nCash in your coins at Scrooge McDucks Money Bin  A new playable area, Scrooges Money Bin allows players to track the amount of wealth accumulated and even take a swim through his latest spoils.\nDigitally enhanced soundtrack  Built from the original versions, the soundtrack for DuckTales Remastered created more modern amplified iterations of the classic melodies.\n\nGenre: Platformer\nPublisher: Capcom\nDeveloper: WayForward Technologies\n\n1. Unzip &amp; Unrar\n2. Run Setup.exe for install\n3. Have Fun!!!!\n\nRipped: Music, Speech\n\nNOTES\n\nLanguages: English, French, Italian, German, Spanish\nPortuguese-Brazil (change it into Option Menu)\n\n1. Don't forget to add an exception to your antivirus (if required)\n2. Block all game executables in your firewall\n\nSupport the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:c4615084d9a524cb356a0b5f883ca0b7f2ff70c4","amp;dn":"+Duck+Tales+Remastered-ALiAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4615084d9a524cb356a0b5f883ca0b7f2ff70c4","infoHashBuffer":{"type":"Buffer","data":[196,97,80,132,217,165,36,203,53,106,11,95,136,60,160,183,242,255,112,196]},"announce":[],"urlList":[]}}