{"title":"Dana C. Jack - Silencing the Self Across Cultures. Depression an","uid":10347358,"size":5628585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4b2941005ee7c4b1a7d3d4534f5a1076b2c76ec&amp;dn=Dana+C.+Jack+-+Silencing+the+Self+Across+Cultures.+Depression+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1402624955,"description":"Description\nProduct Details\nBook Title: Silencing the Self Across Cultures: Depression and Gender in the Social World\t\nBook Author: Dana C. Jack, Alisha Ali\nHardcover: 568 pages\nPublisher: Oxford University Press; 1 edition (April 28, 2010)\nLanguage: English\nISBN-10: 0195398092\nISBN-13: 978-0195398090\n\n===================================================================================\nBook Description\nPublication Date: April 28, 2010 | ISBN-10: 0195398092 | ISBN-13: 978-0195398090 | Edition: 1\nWinner of the 2011 Ursula Gielen Global Psychology Book Award\nThis international volume offers new perspectives on social and psychological aspects of the complex dynamic of depression. The twenty-one contributors from thirteen countries - Australia, Canada, Finland, Germany, Haiti, India, Israel, Nepal, Poland, Portugal, Puerto Rico, Scotland, and the United States - represent contexts with very different histories, political and economic structures, and gender role disparities.\nAuthors rely on Silencing the Self theory, which details the negative psychological effects when individuals silence themselves in close relationships and the importance of the social context in precipitating depression. Specific patterns of thought about how to achieve closeness in relationships (self-silencing schema) are known to predict depression. This book breaks new ground by demonstrating that the linkage of depressive symptoms with self-silencing occurs across a range of cultures. We offer a new view of gender differences in depression situated in the formation and consequences of self-silencing, including differing motivational aims, norms of masculinity and femininity, and the broader social context of gender inequality.\nThe book offers evidence regarding why women's depression is more wide-spread than men's and why the treatment of depression lies in understanding that a person's individual psychology is inextricably related to the social world and close relationships. Authors examine not only gender differences in depression but also related aspects of mental and physical illness, including treatments specific to women. Several chapters describe the transformative possibilities of community-driven movements for disadvantaged women that support healing through a recovery of voice, and describe the need for systemic and structural changes to counter violations of human rights as a means of reducing women's risk of depression. Bringing the work of these researchers together in one collection furthers international dialogue about critical social factors that affect the rising rates of depression around the globe.\n\n===================================================================================\nReviews\n&quot;I could not put down this highly interesting volume of essays that provides some of the most powerful and stunning insights into a reframing of women's depression! I strongly recommend this impressive book for all providers of health services as well as for educators and policy makers.&quot;--Melba J. T. Vasquez, PhD, President, American Psychological Association\n\n&quot;This volume is perhaps the most powerful and poignant account of the silencing of women's voices across time and culture that has been published. It is a book that informs. It is a book that enlightens. It is a book to be treasured, and to be remembered long after it has been read and placed on the shelf.&quot;--Anthony J. Marsella, PhD, Professor Emeritus, Department of Psychology, University of Hawaii\n\n&quot;The authors in this volume listen to women with a methodological tuning fork, precise and sensitive to women and context, and they read women's depression like a smoke alarm on cultural abuses of power. In the caring and delicate hands of Jack and Ali, women's narrations of depression signal a global call for justice and gendered human rights.&quot;--Michelle Fine, PhD, Distinguished Professor of Social Psychology, Women's Studies and Urban Education, Graduate Center, City University of New York\n\n&quot;This book demonstrates the importance of self-silencing in the lives of women (and men) in many societies. The relationship to depression is useful for clinicians and researchers, and shows a means of getting at clinically relevant cultural information in a disciplined and practical way.&quot;--Arthur Kleinman, MD, Esther and Sidney Rabb Professor of Anthropology, Harvard University, and Professor of Medical Anthropology and Psychiatry, Harvard Medical School\n\n&quot;A vivid and scholarly portrayal of how gender and cultural influence interact to shape the expression of mood disorder.&quot;--Zindel V. Segal, PhD, Cameron Wilson Chair in Depression Studies and Professor of Psychiatry, University of Toronto\n\n&quot;What a stunning achievement! In the face of a medical establishment that views and treats depression as primarily a problem of faulty neurochemistry, this compelling book argues persuasively (and with solid evidence) for the powerful role of oppression in shaping women's mental health. This volume is required reading for mental health providers, scholars, and activists interested in understanding and improving women's lives.&quot;--Lisa A. Goodman, PhD, Professor, Department of Counseling and Developmental Psychology, Boston College\n\n&quot;Overall, Jack and Ali's book is fertile with opportunities for psychotherapists. Each chapter offers numerous implications for prevention, intervention and treatment. I echo the book's jacket quote by Lisa Goodman, PhD, that &quot;this book should be required reading for mental health providers, scholars and activists interested in understanding and improving women's lives&quot;...The gift of this book is its benefit to everyone.&quot; --Penelope L Norton, PhD, Voices: The Art of Science of Psychotherapy\n\n&quot;Silencing the Self Across Cultures: Depression and Gender in the Social World is a valuable contribution to our profession. It is an academic work that builds upon previous research.&quot; --PsycCRITIQUES\n\n&quot;A final commentary summarizes the research limitations of the constructs of self-silencing, depression, and gender, and calls for continued research on conditions that promote depression. An excellent review of current research springing from second-wave feminism. Summing Up: Highly recommended. &quot; --Choice\n\n&quot;This thorough and impressive book is partly all about connection between people, and what happens when it's missing or faulty...There is a lot to digest in this volume, but generally it is written in an approachable style, notwithstanding the statistical analyses in some chapters. The inclusion of narratives from women is welcome, giving voice to the research findings and providing a human, grounding touch. It is not written for the lay person, but more for practitioners, academics and researchers in the field.&quot; --Metapsychology\n\n&quot;Although the length and density of this volume may be daunting, it reminds readers of the complexity of women's experience and serves as excellent resource forteaching, planning research, and organizing effective interventions with diverse groups of women and men.&quot; -- Carolyn Zerbe Enns, PhD, Psychology of Women Quarterly\n\n===================================================================================\nAbout the Author\nDana C. Jack, EdD, is Professor at Fairhaven College of Interdisciplinary Studies/Western Washington University. Her research examines women's depression and anger in the U. S. and internationally, and qualitative research methods. She was a Fulbright Scholar to Nepal in 2001, and is author of three books, including Silencing the Self: Women and Depression.\nAlisha Ali, PhD, is an Associate Professor in the Department of Applied Psychology at New York University. Her research examines social influences on women's depression, including the effects of emotional abuse, racism, and harassment. She is currently principal investigator on a series of studies examing economic empowerment for survivors of domestic violence.\n===================================================================================","torrent":{"xt":"urn:btih:c4b2941005ee7c4b1a7d3d4534f5a1076b2c76ec","amp;dn":"Dana+C.+Jack+-+Silencing+the+Self+Across+Cultures.+Depression+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b2941005ee7c4b1a7d3d4534f5a1076b2c76ec","infoHashBuffer":{"type":"Buffer","data":[196,178,148,16,5,238,124,75,26,125,61,69,52,245,161,7,107,44,118,236]},"announce":[],"urlList":[]}}