{"title":"Veterinary Ophthalmology  - 5th Edn - 2 Volume Set","uid":10404370,"size":223030277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4bb4406a6fba90984f8312b9be46ba2edd71970&amp;dn=Veterinary+Ophthalmology++-+5th+Edn+-+2+Volume+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"leah1289","files":1,"time":1403435440,"description":"\nPublication Date: June 4, 2013 | ISBN-10: 047096040X | ISBN-13: 978-0470960400 | Edition: 5 | 2 Volumes in 1 |\n| 35 Chapters | 2186 Pages | Fully Bookmarked and Indexed |\n\n\n\n\nBook Description\n\nVeterinary Ophthalmology, Fifth Edition is a fully updated version of the gold-standard reference for diseases and treatment of the animal eye in veterinary medicine. With an internationally renowned list of contributing authors, the book has been revised and expanded to incorporate the most up-to-date research and information. New chapters cover ophthalmic genetics and DNA tests, microsurgery, photography, camelid ophthalmology, and rabbit ophthalmology, and existing chapters feature expanded coverage of noninvasive imaging techniques, feline ophthalmology, equine ophthalmology, and marine mammals and penguins.\n\nThe book retains its classic structure, with sections on basic vision sciences, the foundations of clinical ophthalmology, canine ophthalmology, and special ophthalmology, which encompasses specific coverage of most commonly treated species and chapters on neuro-ophthalmology and systemic diseases.  A companion website offers the images from the book available for download in PowerPoint and the references linked to CrossRef.  Veterinary Ophthalmology remains the most comprehensive resource for authoritative information on veterinary ophthalmology worldwide and is a key reference for anyone interested in veterinary or comparative ophthalmology.\t\t\t","torrent":{"xt":"urn:btih:c4bb4406a6fba90984f8312b9be46ba2edd71970","amp;dn":"Veterinary+Ophthalmology++-+5th+Edn+-+2+Volume+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4bb4406a6fba90984f8312b9be46ba2edd71970","infoHashBuffer":{"type":"Buffer","data":[196,187,68,6,166,251,169,9,132,248,49,43,155,228,107,162,237,215,25,112]},"announce":[],"urlList":[]}}