{"title":"Comprehensive Nanoscience and Technology","uid":15578392,"size":183033794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4cb81ee2ba55407a2ed866d713a965a6c71b296&amp;dn=Comprehensive+Nanoscience+and+Technology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"clouderone","files":1,"time":1471370819,"description":"Comprehensive Nanoscience and Technology - David L. Andrews et al. (Elsevier, 2011).pdf\r\n\r\nFrom the Introduction: Nanotechnology and its underpinning sciences are progressing with unprecedented rapidity. With technical advances in a variety of nanoscale fabrication and manipulation technologies, the whole topical area is maturing into a vibrant field that is generating new scientific research and a burgeoning range of commercial applications, with an annual market already at the trillion dollar threshold. The means of fabricating and controlling matter on the nanoscale afford striking and unprecedented opportunities to exploit a variety of exotic phenomena such as quantum, nanophotonic and nanoelectromechanical effects. Moreover, researchers are elucidating new perspectives on the electronic and optical properties of matter because of the way that nanoscale materials bridge the disparate theories describing molecules and bulk matter. Surface phenomena also gain a greatly increased significance; even the well-known link between chemical reactivity and surface-to-volume ratio becomes a major determinant of physical properties, when it operates over nanoscale dimensions.\r\n\r\nAgainst this background, this comprehensive work is designed to address the need for a dynamic, authoritative and readily accessible source of information, capturing the full breadth of the subject. Its six volumes, covering a broad spectrum of disciplines including material sciences, chemistry, physics and life sciences, have been written and edited by an outstanding team of international experts. Addressing an extensive, cross-disciplinary audience, each chapter aims to cover key developments in a scholarly, readable and critical style, providing an indispensible first point of entry to the literature for scientists and technologists from interdisciplinary fields. The work focuses on the major classes of nanomaterials in terms of their synthesis, structure and applications, reviewing nanomaterials and their respective technologies in well-structured and comprehensive articles with extensive cross-references.\r\n\r\nIt has been a constant surprise and delight to have found, amongst the rapidly escalating number who work in nanoscience and technology, so many highly esteemed authors willing to contribute. Sharing our anticipation of a major addition to the literature, they have also captured the excitement of the field itself in each carefully crafted chapter. Along with our painstaking and meticulous volume editors, full credit for the success of this enterprise must go to these individuals, together with our thanks for (largely) adhering to the given deadlines. Lastly, we record our sincere thanks and appreciation for the skills and professionalism of the numerous Elsevier staff who have been involved in this project, notably Fiona Geraghty, Megan Palmer and Greg Harris, and especially Donna De Weerd-Wilson who has steered it through from its inception. We have greatly enjoyed working with them all, as we have with each other.\r\n\r\n\r\n\r\nThis comprehensive work is designed to address the need for a dynamic, authoritative and readily accessible source of information, capturing the full breadth of the subject.\r\nIts five volumes, covering a broad spectrum of disciplines including material sciences, chemistry, physics and life sciences, have been written and edited by an outstanding team of international experts, including Nobel Prize Winner, John Charles Polanyi.\r\nAddressing an extensive, cross-disciplinary audience, each chapter aims to cover key developments in a scholarly, readable and critical style, providing an indispensible first point of entry to the literature for scientists and technologists from interdisciplinary fields.\r\nThe work focuses on the major classes of nanomaterials in terms of their synthesis, structure and applications, reviewing nanomaterials and their respective technologies in well-structured and comprehensive articles with extensive cross-references","torrent":{"xt":"urn:btih:c4cb81ee2ba55407a2ed866d713a965a6c71b296","amp;dn":"Comprehensive+Nanoscience+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4cb81ee2ba55407a2ed866d713a965a6c71b296","infoHashBuffer":{"type":"Buffer","data":[196,203,129,238,43,165,84,7,162,237,134,109,113,58,150,90,108,113,178,150]},"announce":[],"urlList":[]}}