{"title":"MFSL, DCC, Sony MasterSound, Avenue, FIM, Analogue Prod etc","uid":15573045,"size":10463851405,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c4d0f6c3d823ecbb8f31da77c083e4f5b56668c4&amp;dn=MFSL%2C+DCC%2C+Sony+MasterSound%2C+Avenue%2C+FIM%2C+Analogue+Prod+etc&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"rontoolsie","files":517,"time":1471285621,"description":"Here is a collection of audiophile remasterd gold disks from DCC, Analogue Productions, RCA Gold Collectors Edition, Classic Compact Disks, FIM, Sony MasterSound, Atlantic Gold Standard and Avenue Gold. \r\nAll of these are significantly better than the original main-label releases. And it is for this reason that I have elected not to (at this point) include some of the many MFSL disks that I have, since many of them are either not better than the original release (DSoTM, Meddle etc), or current remasters have rendered them of historical value only (Crime of the Century). At some point I may revisit what I consider some of the best MFSL and made a folder of just those. Cat Stevens, Gilberto/Getz, Nirvana come to mind. \r\nAll discs are ripped with EAC and include log file. All cover art/liner note scans are also included. All of these are original and are from my own CD collection. \r\nMost of these I have had uploaded as individual torrents. But since my maximum number of long term seeds has been exceeded in BitComet, I am now lumping these all into one big torrent. The huge disadvantage is that it is now virtually impossible to search for the individual titles, which is why I made them individual uploads initially. But it was either consolidate or start deleting, and I chose to consolidate. \r\n\r\nOn DCC are\r\n\tJim Croce-24 Karat Gold In a Bottle\r\n\tMiles Davis-The Musings of Miles\r\n\tJefferson Starship-Red Octopus\r\n\tElvis-Elvis is Back!\r\n\tElvis-24 Karat Hits\r\n\tAl Green-Greatest Hits\r\nOn Analogue Productions\r\n\tChet Baker-Chet Note this contains only the original 10 tracks found on the original LP release, and not the bonus 11th track found on most other CD verisons. \r\nOn Classic Compact Disk (the CD offshoot of Classic Records)\r\n\tDean Peer-Ucross (virtuoso solo electric bass guitar)\r\n\tJennifer Warnes-Famous Blue Raincoat\r\n\tSara McLachlan-Fumbling Towards Ecstacy/The Freedom Sessions\r\n\tThe Cowboy Junkies-The Trinity Sessions\r\nYou would have thought that the Trinity Sessions being straight to DAT could not really have much room for improvement, but for some reason this version sounds quite a bit better than the already fine-sounding RCA release. \r\n\r\nRCA 24 Karat Gold Collectors Edition\r\n\tJefferson Airplane-Surrealistic Pillow (both stereo and mono versions)\r\n\r\nSony Mastersound SBM\r\n\tThe Indigo Girls-The Indigo Girls\r\n\tRoy Orbison-Lonely and Blue\r\n\r\nAvenue Gold Collectors Edition\r\n\tWar-All Day Music\r\n\tWar-Deliver the Word\r\nThese remasters of two of War’s classic albums have amazing sonic qualities, and are light years ahead of the main-label releases. The only let down is the quality of the artwork that appears to have been generated from poor scans of the originals. \r\nFIM HDCD\r\n\tPatricia Barber-Café Blue (the HDCD treatment takes a superb-sounding album on the Premonition label, and turns it into a flesh and blood recording full of warmth, nuance and soul). \r\n\r\n\r\nAtlantic Gold Standards\r\n\tPhil Collins-Face Value\r\nAlthough this is also available as a very good Audio Fidelity remastering, this version has the edge in that the all-important drums have more ‘thwack’ and bite to them. The AF version slightly softens the impact and has extra warmth. Those who have heard the differences tend to favor this Atlantic version over the AF one","torrent":{"xt":"urn:btih:c4d0f6c3d823ecbb8f31da77c083e4f5b56668c4","amp;dn":"MFSL%2C+DCC%2C+Sony+MasterSound%2C+Avenue%2C+FIM%2C+Analogue+Prod+etc","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d0f6c3d823ecbb8f31da77c083e4f5b56668c4","infoHashBuffer":{"type":"Buffer","data":[196,208,246,195,216,35,236,187,143,49,218,119,192,131,228,245,181,102,104,196]},"announce":[],"urlList":[]}}