{"title":"Green For Danger (1946 Alastair Sim)","uid":5488711,"size":732823552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c509e03a5e4b9ee21698b43f27e017ccebfb4e1f&amp;dn=Green+For+Danger+%281946+Alastair+Sim%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"renman","files":-1,"time":1270867555,"description":"Adapted from a novel by Christianna Brand, one of six humorous whodunits \n\nfeaturing Inspector Cockrill of the Kent County Police, Green For Danger (d. \n\nSidney Gilliat, 1947) considerably alters Brand's story and its protagonist.\n\nOriginally set in a military hospital during the Blitz in 1941, the film \n\nrelocates the action to a civilian emergency hospital during the doodlebug \n\ncampaign of 1944. The major changes in Gilliat and Claude Guerney's \n\nscreenplay, however, were reserved for the main character. Although Launder \n\nand Gilliat made a number of thrillers over the years, Gilliat disliked \n\nwhodunits, and hoped to largely remove that element from the plot, but Brand's \n\noriginal story was too carefully constructed to survive without it. Their \n\nsolution, as Gilliat later recalled, was to &quot;make capital of the very clichÃƒÂ©s \n\nof the detective novel&quot;.\n\nTo this end they structured the screenplay so that the first third set up the \n\nmystery in a traditional fashion, though undercutting it somewhat with a wry \n\nvoice-over. When Inspector Cockrill arrives, most of the viewer's assumptions, \n\nabout the characters and the mystery genre, start to unravel.\n\nThey turned Cockrill into the narrator and cast the comic actor Alastair Sim \n\nin the role. The film subtly guys the whole genre, with the Inspector \n\nfrequently proved wrong and even partly responsible for the last death. In one \n\npriceless scene, he smugly turns to the last page of a mystery novel to find \n\nthat he has incorrectly guessed the identity of the murderer.\n\nGreen For Danger is a remarkable mixture of sly comedy and genuine thrills, \n\nwith the sardonic and sarcastic humour of the protagonist providing a good \n\ncounterpoint to the darkly atmospheric surroundings of the hospital - shot \n\nwith considerable panache by Launder and Gilliat's regular cameraman Wilkie \n\nCooper. This is seen at its best in the night-time sequence in which the \n\nvarious characters roam around the hospital grounds before one of them meets \n\nher end at the hands of a spectral murderer dressed in a surgical gown. Except \n\nfor two establishing shots at the beginning of the story, the film was shot \n\nentirely inside Pinewood studios, including all the 'exteriors'. The result is \n\nprobably Gilliat's most visually accomplished and controlled film as director.\n\n\nSEEDING FROM 10/4/10\n\n\nPlease help to seed this thank you","torrent":{"xt":"urn:btih:c509e03a5e4b9ee21698b43f27e017ccebfb4e1f","amp;dn":"Green+For+Danger+%281946+Alastair+Sim%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c509e03a5e4b9ee21698b43f27e017ccebfb4e1f","infoHashBuffer":{"type":"Buffer","data":[197,9,224,58,94,75,158,226,22,152,180,63,39,224,23,204,235,251,78,31]},"announce":[],"urlList":[]}}