{"title":"Fire Protection Engineering in Building Design","uid":8303514,"size":6015892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c510a8c80e365594b13ea06a7035b83bb61a45bd&amp;dn=Fire+Protection+Engineering+in+Building+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364318859,"description":"Jane Lataille, &quot;Fire Protection Engineering in Building Design&quot;\nEnglish | 2002-10-10 | ISBN: 0750674970 | 151 pages | PDF | 5.7 mb\n\nA clear and concise reference guide on integrating fire protection design, Fire Protection Engineering in Building Design encompasses not only the basic information on the functions, design, and applications of fire protection systems; but also reveals how this information can and should be integrated with every other major engineering discipline.\n\nProtecting people, buildings and the environment from the impact of fire requires a comprehensive, systematic approach that includes the analysis of fire hazards as well as the design, installation and maintenance of fire detection, suppression and communications systems. Jane Lataille takes the reader beyond these basic issues and includes information on mitigating potential fire damage through proper design and construction of buildings, industrial processes and utility systems.\n\nThrough specific examples, the reader sees how fire protection engineering can be integrated with mechanical, electrical, structural, and chemical engineering. The book also includes a section on writing fire protection specifications as well as a comprehensive reference list.\n\n- Assure effective fire protection design through engineering\n- Avoid costly fire protection redesign\n- Effectively integrate fire protection features into project specifications","torrent":{"xt":"urn:btih:c510a8c80e365594b13ea06a7035b83bb61a45bd","amp;dn":"Fire+Protection+Engineering+in+Building+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c510a8c80e365594b13ea06a7035b83bb61a45bd","infoHashBuffer":{"type":"Buffer","data":[197,16,168,200,14,54,85,148,177,62,160,106,112,53,184,59,182,26,69,189]},"announce":[],"urlList":[]}}