{"title":"Ken Wilber - Integral Psychology","uid":6100521,"size":7367942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5198b88c5a87dd00ff45884fdfff7e37d0bd759&amp;dn=Ken+Wilber+-+Integral+Psychology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"asperge","files":3,"time":1294947714,"description":"In this dense text, philosopher Wilber (The Eye of the Spirit) aims to reconstruct a place for spiritual consciousness in Western developmental psychology. Describing prevailing psychological theories as inhabiting a &quot;flatland&quot; where only &quot;the world of matter and energy, empirically investigated by human senses and their tools is real,&quot; Wilber surveys their history. He looks both at the early modern era, when scientific materialists banished the philosophical investigation of an individual's interior life from science, and at the work of 200 ancient, medieval and modern philosophers, for whom spiritual concerns were paramount. They all helped shape the history of modern developmental psychology, he argues. Wilber aims to produce a two-volume textbook from his research; this effort is a condensed outline of the ideas he plans to detail. But even this shorter text contains 20 pages of charts, 68 pages of endnotes and a lengthy explanation of his four-quadrant model (designed to integrate consciousness, spirit and therapy with the psychological development of the individual in relationship to the material world)--all of which makes for some hefty reading. Additionally, because he's writing for a scholarly audience, Wilber employs terminology that may be challenging for the lay reader, although he does manage, occasionally, to clarify complex themes with simple analogies. Mixing scientific inquiry with spiritual concerns, this book should speak most clearly to those looking for a basis in Western science to validate their spiritual quest.\n &lt;a href=&quot;\nhttp://www.amazon.com/dp/1570625549&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/dp/1570625549&lt;/a&gt;\n\n----------------------------------------------\n\nThe document is a djvu file. To read djvu files : http://windjview.sourceforge.net/","torrent":{"xt":"urn:btih:c5198b88c5a87dd00ff45884fdfff7e37d0bd759","amp;dn":"Ken+Wilber+-+Integral+Psychology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5198b88c5a87dd00ff45884fdfff7e37d0bd759","infoHashBuffer":{"type":"Buffer","data":[197,25,139,136,197,168,125,208,15,244,88,132,253,255,247,227,125,11,215,89]},"announce":[],"urlList":[]}}