{"title":"ExxxtraSmall - Dolly Little (Im Stuck! Plz Help) NEW 09 June 201","uid":14854718,"size":608259914,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c5787080d7fca921542759066d5fbf43e40a4b2c&amp;dn=ExxxtraSmall+-+Dolly+Little+%28Im+Stuck%21+Plz+Help%29+NEW+09+June+201&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1465465015,"description":"The oh so itsy-bitsy Dolly Little is super excited to hang out with her friend Anna today! She skips all the way over to her house and you can see how happy she is the second she rings the doorbell. She expects Anna to answer, but its her father instead. He is super nice, so he invites Dolly in to wait until Anna arrives. Mr. Largo is sitting on the couch reading, while dolly fools around with her pigtails and starts thinking about all the super fun things that her and her friend will do! But then, something happens. Dolly gets a jolt in her stomach and has to use the bathroom immediately. Mr. Largo points her to it and as soon as she hops on, she can already tell her tiny little booty is stuck! she has no idea what to do, so she calls Mr. Largo right over. He sees the situation, and is willing to help, but only if she can help him too. His fat cock hasnt been sucked in a while, and he thinks it might be a good trade. Dolly thinks it will be super weird since hes her best friends dad , but shes desperate to be freed. She gags on Mr. Largos long schlong just enough for him to feel ready to pull her free. Once she pops right off the seat, he suggests moving it to the bedroom, and at this point Dolly is totally game. Once they get there Mr. Largo ravages her micro pussy with no shame and uses her teeny pigtails for more leverage. Her pussy was almost as red as her hair when he was done with her. Mr. Largo came all over Dollys face turning her into one of the finest iced mini strawberry shortcakes you have probably ever seen.\r\n \nhttp://imgdone.com/viewer.php?file=15563103446498004371.jpg\r\n \nhttp://imgdone.com/viewer.php?file=84864575720768760636.jpg","torrent":{"xt":"urn:btih:c5787080d7fca921542759066d5fbf43e40a4b2c","amp;dn":"ExxxtraSmall+-+Dolly+Little+%28Im+Stuck%21+Plz+Help%29+NEW+09+June+201","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5787080d7fca921542759066d5fbf43e40a4b2c","infoHashBuffer":{"type":"Buffer","data":[197,120,112,128,215,252,169,33,84,39,89,6,109,95,191,67,228,10,75,44]},"announce":[],"urlList":[]}}