{"title":"Ministry Monday #6","uid":10801241,"size":1142876460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5b11c31f8c50bdcdd76537b06baade73b669e1c&amp;dn=Ministry+Monday+%236&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"1fnD3f","files":5,"time":1408350713,"description":"Week #6...Ministry Monday. This is a special one. This song was the last thing Mikey Scaccia recorded before he passed away in Dec. 2012.  Sammy (Ministry engineer) shared in the mini-documentary about what it was like to work with Mikey and how this song was the exact opus that was his playing style and prowess on that instrument. We all miss you. Lotsa love Mikey. \n\nEnjoy, share and make all your posts on our Facebook, Twitter and website (www.alfuckingjourgensen.com). Some of you are just leeching...do you job too. Get the word out on these FREE downloads. We did our job of slaving over these remixxxes, so you help get the word out to your cult. Fair enough?\n\nThe Youtube video has the songs together but in this download you have to download them separately AND before I'm asked...yes... both in 320.  \n\nSo, remember: 1. like my Alien Jourgensen and Ministry fan pages on Facebook AND hit up my Twitter @alfknjourgensen. 2. Send a link back to us from you website, social media or online magazines.\n\nHow easy was that...two new track gets released THIS Monday (along with some extras on the Pirate Bay... yes...THAT Pirate Bay) and will be released in the same order as on the album. If that weren't enough...we're gonna do the same with the Relapse remixxxes after From Beer to Eternity's are all done... so download away..\n\n-Uncle Al\nwww.alfuckingjourgensen.com\n\nMikey's Middle Finger (I Feel Like Shit RemiXXX)\nDeFriBrilatour Webisode #5\nDeFriBrilatour Webisode #6\nDeFriBrilatour Webisode #7","torrent":{"xt":"urn:btih:c5b11c31f8c50bdcdd76537b06baade73b669e1c","amp;dn":"Ministry+Monday+%236","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b11c31f8c50bdcdd76537b06baade73b669e1c","infoHashBuffer":{"type":"Buffer","data":[197,177,28,49,248,197,11,220,221,118,83,123,6,186,173,231,59,102,158,28]},"announce":[],"urlList":[]}}