{"title":"Dungeonland-FLT","uid":8082222,"size":1196102178,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c65cbe2100c8512256150796830d2196696eadfb&amp;dn=Dungeonland-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1359524390,"description":"\n            In Their 26th Year Of Glory, FairLight Released #1067\n\n                    Dungeonland (c) Paradox Interactive\n\n:  Supplied by: FAIRLIGHT            : : Release Date: 30-01-2013          :\n    Cracked by:  FAIRLIGHT                Game Type:    Action, Casual\n    Packaged by: FAIRLIGHT                Image Format: ISO\n              -----\n    DISCS: 1 DVD                          Protection: Steam\n\n    System Requirements : One of those computer thingies\n\n\nGame information:\n=================\n\nDungeonland is a co-operative hack and slash game that takes players on  a\ndeadly tour through a medieval theme  park.  Playing  as  The  Rogue,  The\nWarrior or The Mage, the heroes will need to work together as  a  team  to\nget past the evil overseer of this &quot;Tragic Kingdom&quot; - The Dungeon Maestro.\n\nThe truly diabolical can even take on the  role  of  the  Dungeon  Maestro\nhimself and wreak havoc on friends. Unleash the killer rabbits, drop  some\nexploding frogs in their path, or whip up a giant fan and  blow  them  all\naway.\n\n\nFeatures:\n=========\n* Strategic Co-op Gameplay: Utilize each character's unique skills and\n  weapons, combine their special powers to form all new attacks, or just\n  plain hack and slash your way through this treacherous theme park\n* Competitive Multiplayer: Play as the Dungeon Maestro himself and unleash\n  evil on your friends. Summon your minion to thwart the heroes, conjure\n  spells or take control of a boss monster and get in the action yourself.\n  Then push the Evil Laugh button and let your sinister cackle reverberate\n  throughout the land\n* Replayability: The DM AI randomizes monsters, treasures, and dangers\n  each session to create a unique experience; player choice in equipping\n  items creates endless combinations for more variety\n* Colorful Game World: Three different theme park environments to explore,\n  each with their own unique attractions. Don't forget to visit the gift\n  shop on the way out. The prices are to die for...\n* Prepare to DIE: Dungeonland is a dangerous place - making your way past\n  its deadliest attractions will be an extreme challenge. Only the\n  hardiest of heroes need apply\n\n\nInstallation Information:\n=========================\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall.\nTHIS time game even works online! But we cant know (depends on\nparadox) how long so release is considered offline as always.\n\n                                                            /TEAM FAiRLIGHT\n\n\n                    +-+  QUALITY, TRADITION  AND PRIDE +-+\n","torrent":{"xt":"urn:btih:c65cbe2100c8512256150796830d2196696eadfb","amp;dn":"Dungeonland-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c65cbe2100c8512256150796830d2196696eadfb","infoHashBuffer":{"type":"Buffer","data":[198,92,190,33,0,200,81,34,86,21,7,150,131,13,33,150,105,110,173,251]},"announce":[],"urlList":[]}}