{"title":"Superman vs. Aliens, Predator and Terminator","uid":5346360,"size":244138758,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c67032465f162018ef4871772afc3680a21f4f9e&amp;dn=Superman+vs.+Aliens%2C+Predator+and+Terminator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"brodahisou","files":-1,"time":1265652886,"description":"Collection of mini-series where Superman battles the Alien and Predator creatures, as well as the Terminators.\n\n\nSuperman/Aliens\nOn the investigation of an incoming probe as part of Lexcorp's attempts to improve its public image, Clark is shocked to discover that the pod's transmissions are a Kryptonian distress call.  Making contact with the pod, Superman receives a telepathic transmission of a city that survived the destruction of its planet, and is now running out of resources. Taking a ship to investigate the city Superman finds more than just survivors.\nStory and layout art by Dan Jurgens, with finished art by Kevin Nowlan.\n\n\nSuperman/Aliens II: God War\nDarkseid acquires several Alien eggs, subsequently sending them to New Genesis within several Parademons and unleashing them on his foes.  Orion accompanies Superman on a mission to Apokolips to destroy the Alien Queen.\nWritten by Chuck Dixon, with art by Jon Bogdanove and Kevin Nowlan. \n\n\nSuperman vs. Predator\nSuperman goes to investigate a mysterious alien ship in the Central American jungles, where he is afflicted by a virus that significantly drains his powers. The Predator nonetheless senses he is a worthy opponent and begins stalking him with the intention of making him its next trophy.\n\n\nSuperman and Batman vs. Aliens and Predator \nWhen a group of explorers goes missing near a dormant volcano in the Andes mountains, Clark Kent and Lois Lane are sent to investigate. Meanwhile, the Batman is following leads of his own, following unprecedented worldwide sightings of Predators. But in the volcano's heart, both Superman and Batman discover something they'd never expected - and unless they can stop it, the Earth is doomed! \nWritten by Mark Schultz and illustrated by Ariel Olivetti.\n\n\nSuperman vs. The Terminator: Death to the Future\nIn the present day of 1999, Sarah Connor and John Connor, who have been fleeing from time-traveling Terminators for decades.  While walking in a Metropolis shopping mall, Sarah and John are attacked by a T-800 Terminator and then Superman comes to their aid.\nWritten by Alan Grant, with pencils by Steve Pugh and inks by Mike Perkins.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:c67032465f162018ef4871772afc3680a21f4f9e","amp;dn":"Superman+vs.+Aliens%2C+Predator+and+Terminator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c67032465f162018ef4871772afc3680a21f4f9e","infoHashBuffer":{"type":"Buffer","data":[198,112,50,70,95,22,32,24,239,72,113,119,42,252,54,128,162,31,79,158]},"announce":[],"urlList":[]}}