{"title":"EXPLOITED COLLEGE GIRLS - Candice - Her First Hard Fuck 720p","uid":11736896,"size":2293512941,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c6d191012dff28728ad927afbad8c62bcba551db&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Candice+-+Her+First+Hard+Fuck+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"beta2008x","files":1,"time":1425598160,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=w4s6r_cdc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=w4s6r_cdc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=czj16_ecg_15_03_05_candice.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=czj16_ecg_15_03_05_candice.jpg&lt;/a&gt;\n\nIt's hard to say which is bigger, Candice's phat white girl booty or her outrageous personality. Fortunately this week you get both in the same update and as an added bonus we've included the best dialogue ever recorded in the history of Ex Co Gi courtesy of 21 year old Candi and her &quot;hood rat&quot; upbringing.\n\nWe're not going to lie to you and claim that this is the best video we've ever posted to Ex Co Gi, it's good, but not the very best one ever. However, we can guarantee that every top ten list we will ever compile is going to have 21 year old Candice listed someplace. As soon as Jay fires up the camera for the interview, you will be captivated by Candice's sassy attitude and say-anything personality. We aren't sure where she's from as the only thing her accent brings to mind is &quot;Hustle and Flow&quot;, but it's probably more southern than northern. Combine that with her love of er...let's say African American culture, and you have a very interesting girl.\n\nAs the action gets going, Jay uses his fingers and a vibrator on Candice and to his and her pleasant surprise in no time at all she's wiggling and panting as her first orgasm overtakes her completely by surprise. Jay is ready for more and might have teased another O out of her - but she had to run to the bathroom for a nice relaxing post coital whiz.\n\nAs a thank you, Candice gets to her knees to try to finish the noisy, sloppy blowjob she started in the Behind The Scenes segment but Jay is a Zen master and no matter how well she applies her amazing blowjob skills she can't get him to cum. We can only surmise that the entire time Jay was just waiting for a chance to pound Candice's big, round ass from behind. We don't cater to fans of big asses as well as we could, but it's just not that easy to find a girl with an ass as great as Candice's. Now, granted it's got a terrible paintjob, but if you ignore that and just watch those cupcakes bounce you will be in booty heaven.\n\nAfter getting Candice off a second time and getting his fill of her magnificent ass, Jay has her get down on the floor where he finally unleashes a massive load on her face. She's been trying to work it out of him since the cameras rolled and she seems genuinely happy to catch every drop as he finally unloads","torrent":{"xt":"urn:btih:c6d191012dff28728ad927afbad8c62bcba551db","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Candice+-+Her+First+Hard+Fuck+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d191012dff28728ad927afbad8c62bcba551db","infoHashBuffer":{"type":"Buffer","data":[198,209,145,1,45,255,40,114,138,217,39,175,186,216,198,43,203,165,81,219]},"announce":[],"urlList":[]}}