{"title":"The Sarah Jane Adventures - Season 01 (2007) - 10 Episodes - 1 S","uid":10815600,"size":2791765663,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c6ff376c626bb99767592bfa98dd245db10d44ca&amp;dn=The+Sarah+Jane+Adventures+-+Season+01+%282007%29+-+10+Episodes+-+1+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"bnaron","files":-1,"time":1408459931,"description":"The Sarah Jane Adventures - Season 01 (2007) - 10 Episodes - 1 Special (Prequel)\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&lt;/a&gt;\n\n\nThe Sarah Jane Adventures is a British science fiction television program, produced by BBC Cymru Wales for CBBC, created by Russell T Davies and starred Elisabeth Sladen. The program is a spin-off of the long-running BBC science fiction program Doctor Who and focuses on the adventures of Sarah Jane Smith, a middle-aged investigative journalist who, in her youth, had numerous adventures across time and space. The series debuted on BBC One with a 60-minute special, &quot;Invasion of the Bane&quot;, on 1 January 2007, and broadcast through to 2011. It was nominated for a British Academy Children's Award in 2008 in the Drama category, and for a BAFTA Cymru in 2009 in the Children's Drama category. The program won a Royal Television Society 2010 award for Best Children's Drama.\n\n\nSeason 01 (2007)\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2007-09-24 - Revenge of the Slitheen (1) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nIt's Maria (Yasmine Paige), Luke (Tommy Knight) and Clyde's (David Anthony) first day at their new school, and something's not quite right. The food keeps going off, there's a funny smell in the air and the new technology block is hiding some dark secrets. The friends soon make a shocking discovery: evil alien race the Slitheen have disguised themselves as teachers as part of a deadly plan that threatens the future of the entire Earth.\n\n\n2007-09-24 - Revenge of the Slitheen (2) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nUnder attack from the monstrous Slitheen child, Maria (Yasmine Paige), Luke (Tommy Knight) and Clyde (David Anthony) escape, thanks to some deodorant and Sarah Jane's (Elisabeth Sladen) sonic lipstick. Back in her attic, Sarah Jane's super computer Mr Smith (Alexander Armstrong), reveals the aliens' evil plan to drain Earth of its energy. But as a power blackout spreads across the globe, Mr Smith goes out of action. The gang must rely on their wits alone to stop the Slitheen from extinguishing the sun for ever.\n\n\n2007-10-01 - Eye of the Gorgon (1) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nSarah Jane (Elisabeth Sladen) and her young friends investigate reports of a ghostly nun which is haunting the local old folks' residential home. And when one of the elderly residents entrusts Luke (Tommy Knight) with a mysterious alien talisman, it becomes clear there is even more to the story than meets the eye. The gang delves deeper, and discovers that the nun is part of a secret order sworn to protect a terrifying alien creature who can turn her victims to stone with a single look.\n\n\n2007-10-01 - Eye of the Gorgon (2) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nMaria's dad Alan (Joseph Millson) has been turned to stone. The alien talisman is now in the possession of the Gorgon and her evil nuns, and they are preparing to open the portal to their world. Can Sarah Jane (Elisabeth Sladen) and her young friends free Alan from his stony state, prevent the nuns from unleashing more deadly aliens on the Earth, and avoid the Gorgon's petrifying gaze?\n\n\n2007-10-15 - Warriors of Kudlak (1) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nSarah Jane (Elisabeth Sladen) and Maria (Yasmine Paige) investigate the mysterious disappearance of local boy Lance Metcalf, and soon discover that a number of children have gone missing across the country. Remarkably, the disappearances all occurred during freak storms and in cities that are home to a laser tag game called Combat 3000. As Sarah Jane and Maria delve deeper into the mystery, Luke (Tommy Knight) and Clyde (David Anthony) are off enjoying a game of Combat 30.\n\n\n2007-10-15 - Warriors of Kudlak (2) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nA Carcaroth has arrived on Earth, seeking soldiers to help fight his endless intergalactic war back home. Using Combat 3000 to sift out the best, most aggressive and instinctive fighters, he then transports them to his spaceship, awaiting transfer to the war. Clyde (David Anthony) and Luke (Tommy Knight) find themselves amongst the 'warriors', while Sarah Jane (Elisabeth Sladen) and Maria (Yasmine Paige) must infiltrate the alien's headquarters to bring down the Carcaroth from the inside.\n\n\n2007-10-29 - Whatever Happened to Sarah Jane (1) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nSarah Jane (Elisabeth Sladen) mysteriously disappears, just as a huge meteor threatens to crash straight into Earth. When Maria (Yasmine Paige) wakes up one morning, it's as though Sarah Jane, and Luke (Tommy Knight), never existed. Living across the road in Sarah Jane's house is a woman called Andrea (Jane Asher). And with the attic empty and Mr Smith (Alexander Armstrong) nowhere to be seen, every other trace of Sarah Jane has vanished, and Maria is the only one able to remember her. With the mysterious, hooded figure of the Trickster haunting Bannerman Road and the alien Graske meddling in time, Maria sets out to discover whatever happened to Sarah Jane. But as her journey takes her back to 1964, will she be able to find Sarah Jane in time to stop the meteor from destroying the world?\n\n\n2007-10-29 - Whatever Happened to Sarah Jane (2) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nMaria (Yasmine Paige) finds herself taken back in time by the alien Graske to a pier in 1964. There, she meets a young girl her own age called Sarah Jane Smith (Elisabeth Sladen) who, with her friend Andrea (Jane Asher), is about to embark on a fateful adventure. Taken by the Graske again, Maria is then reunited with the present-day Sarah Jane. But with them both trapped in limbo as part of the meddlesome Trickster's plan to wreak chaos, they are helpless to stop the huge meteor which is about to crash into the Earth. Maria's dad Alan is the only one able to remember Sarah Jane and Maria and faces a struggle to bring them back in time to save the world.\n\n\n2007-11-12 - The Lost Boy (1) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nA news report on a couple looking for their missing son, Ashley, brings a surprise for Sarah Jane (Elisabeth Sladen) when she discovers that the missing boy looks exactly like Luke (Tommy Knight). And when Mr Smith (Alexander Armstrong) confirms that Luke is a genetic match with Ashley, Sarah Jane sends him back to live with his 'parents'. With no knowledge of his former life, Luke finds it hard to fit in and, when he tries to escape, he makes a startling discovery about who his parents really are. Sarah Jane, meanwhile, makes some investigations into the Pharos Para-Science Institute, a research unit that has been conducting experiments using alien technology. Floella Benjamin guest stars as Professor Rivers.\n\n\n2007-11-19 - The Lost Boy (2) (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nMaria (Yasmine Paige) and her dad, Alan (Joseph Millson), dig deeper into the mystery of Luke's (Tommy Knight) new parents and discover that Luke has actually been kidnapped by the Slitheen. There are more shocks when Sarah Jane (Elisabeth Sladen) and Maria find out that Mr Smith (Alexander Armstrong), Sarah Jane's super computer, is one of the bad guys. With Clyde (David Anthony) nowhere to be seen, Luke in the clutches of aliens and no Mr Smith to help, things are not looking good for Sarah Jane and Maria. But just what do the Slitheen want with Luke? And who, or what, exactly, is the Xylok?\n\n\n2007 Specials\n\n\n2007-01-01 - Invasion of the Bane (Video:H.264, 640x368, 986kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\n(Prequel to the Season Premier) - Having just moved, Maria and her father meet their eccentric neighbour Sarah Jane Smith. When Maria sees Sarah late one night helping an alien return home, she cannot believe her eyes. Before she has time to think about what she has seen, she becomes tangled in the conspiracy behind the new soft-drink, Bubble Shock. Only Sarah Jane can help...\n\n\n","torrent":{"xt":"urn:btih:c6ff376c626bb99767592bfa98dd245db10d44ca","amp;dn":"The+Sarah+Jane+Adventures+-+Season+01+%282007%29+-+10+Episodes+-+1+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ff376c626bb99767592bfa98dd245db10d44ca","infoHashBuffer":{"type":"Buffer","data":[198,255,55,108,98,107,185,151,103,89,43,250,152,221,36,93,177,13,68,202]},"announce":[],"urlList":[]}}