{"title":"Iggy Pop - Nude &amp; Rude (1996) WMA320","uid":6161062,"size":186936121,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c8338e211e9db0f7dc9192c9627d444e440f998c&amp;dn=Iggy+Pop+-+Nude+%26+Rude+%281996%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297213736,"description":"Iggy Pop remains one of the most influential performers in rock from the past 30 years. Iggy, taking inspiration from the likes of Jim Morrison, was one of the great innovators of shock theatrics in rock music (he did this using bloody displays of gusto such as slashing his chest with glass or simply rolling over many shards on the stage floor). &quot;Nude And Rude&quot; is, to be honest, just a taste of Iggy's best work. But a good showcasing it is and anyone interested in getting a start on the man who along with his original band, The Stooges, set the stage for the Punk movement should check it out. The opening, &quot;I Wanna Be Your Dog&quot; is gritty, dirty rock with some deliciously suggestive lyrics and guitar work that seems like a precursor to Metallica or Nirvana. The next track, &quot;No Fun&quot; (later covered by the Sex Pistols), is a perfect pre-Punk expression of boredom and simply having no one around. &quot;Search and Destroy&quot; is an exhilarating anthem of chaos and street poetics. &quot;Gimme Danger&quot; is haunting in a Punk-poetry sense, it actually has some depth and imagery that stick. &quot;I'm Sick Of You&quot; sounds like psychedelic sadness. There isn't much to &quot;Nightclubbing,&quot; it does sound like interesting cabaret though. Surprise, surprise, &quot;China Girl,&quot; for those of you unaquainted with your popular music history, was NOT a David Bowie original, he made it into a hit but Iggy Pop was indeed the first to record it (under Bowie's production). &quot;Lust For Life&quot; remains a popular Iggy tune (you'll hear it in commercials here and there), it has a cool swing feel that gives a fun energy. &quot;The Passenger&quot; is one of Iggy Pop's all-time great recordings. This is a hypnotic, stylish and lyrically enrapturing song with a Doors-like feel in it's dreamy tone (the late Michael Hutchence also recorded a great version). Iggy here invites us on a ride through &quot;the city's ripped-back sides.&quot; From here the album takes a more late 70's-like feel as in the almost bluesy &quot;Kill City&quot; with it's images almost out of Burroughs. To be honest, &quot;Real Wild Child&quot; isn't that great, it doesn't have the energetic insanity or poetic grittyness of Iggy's best work, in fact, it feels simply like a silly moment. &quot;Cold Metal&quot; is a driving tune with Iggy delivering a rough vocal. The closing, &quot;Wild America&quot; is a cool, modern Iggy track where he presents a portrait of America that's sinister but kinda fun. Any Iggy devotee will tell you there are some great songs missing here, such as the insane &quot;T.V. Eye&quot; and &quot;1969,&quot; but the point of most of these collections is to get you to look for the entire body of work. As a taste of Iggy Pop, this a good CD to get, but once you've heard it, you'll want to really get into the good stuff. \n\nby Mr. Fellini\n\nTRACKLIST:\n\n01 - I Wanna Be Your Dog.wma                                \n02 - No Fun.wma                                             \n03 - Search &amp; Destroy.wma                                   \n04 - Gimme Danger.wma                                       \n05 - I'm Sick Of You.wma                                    \n06 - Funtime.wma                                            \n07 - Nightclubbing.wma                                      \n08 - China Girl.wma                                         \n09 - Lust For Life.wma                                      \n10 - The Passenger.wma                                      \n11 - Kill City.wma                                          \n12 - Real Wild Child.wma                                    \n13 - Cry For Love.wma                                       \n14 - Cold Metal.wma                                         \n15 - Candy.wma                                              \n16 - Home.wma                                               \n17 - Wild America.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:c8338e211e9db0f7dc9192c9627d444e440f998c","amp;dn":"Iggy+Pop+-+Nude+%26+Rude+%281996%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8338e211e9db0f7dc9192c9627d444e440f998c","infoHashBuffer":{"type":"Buffer","data":[200,51,142,33,30,157,176,247,220,145,146,201,98,125,68,78,68,15,153,140]},"announce":[],"urlList":[]}}