{"title":"GiliSoft USB Stick Encryption v5.0 with Key [TorDigger]","uid":8517789,"size":2315138,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c84bf683b4c20fe295ee169573fb73e7cf0b862a&amp;dn=GiliSoft+USB+Stick+Encryption+v5.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"TorDigger","files":11,"time":1369807739,"description":"GiliSoft USB Stick Encryption\n\nGiliSoft USB Stick Encryption is especially designed to create password protected USB memory sticks. It creates protected areas on the disk that is needed to enter password to see contents. Data on the protected areas are encypted by 256-bit AES on-the-fly encryption. Protected USB stick is fully autonomous and does not need any special software installed on computer.\n\nFeatures and Benefits:\n\n- GiliSoft USB Stick Encryption is a powerful tool that password protects all your external portable media. No matter what type of external storage device you use, USB stick encryption password protects it within seconds.\n- GiliSoft USB Stick Encryption works on all flavors of Windows. USB stick encryption works perfectly well on all external portable media like USB flash drives, Thumb Drives, Memory Sticks, Memory Cards, Pen Drives and Jump Drives.\n- Whatever information, files, folders and documents you put in your USB drive, USB stick encryption keeps them completely secured.\n- Gili USB Stick Encryption protects data using several layers of patent pending protection methods. This makes its protection, PC and hardware independent.\n- Total peace of mind from security leaks and privacy breaches. Never again fear of what's happening to your device while it is lost.\n- GiliSoft USB Stick Encryption is easy to install, run and use. It doesn't complicate it's users with technical jargon common in other encryption programs.\n- A very easy to use program with user-friendly interface.\n\nSystem Requirements:\n\nSupport Intel Pentium D Dual-Core Processor and AMD Athlonâ„¢ 64X2 Dual-CoreProcessor;\nWindows 2000/2003/XP/Vista/Windows 7/8 (32&amp;64)\n\nHomepage: http://www.gilisoft.com/product-usb-stick-encryption.htm\n\nInstallation Instructions:\n\n- Install program.\n- Run &quot; Regme&quot; and merge it to system registry.\n\n~~~OR~~~\n\n- Temporarily disconnect internet.\n- Register application with any email given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:c84bf683b4c20fe295ee169573fb73e7cf0b862a","amp;dn":"GiliSoft+USB+Stick+Encryption+v5.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84bf683b4c20fe295ee169573fb73e7cf0b862a","infoHashBuffer":{"type":"Buffer","data":[200,75,246,131,180,194,15,226,149,238,22,149,115,251,115,231,207,11,134,42]},"announce":[],"urlList":[]}}