{"title":"Gitarowe wyzwania - Szkoła gry na gitarze nie tylko akustycznej","uid":14602788,"size":8321401222,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c8732196b0317c998638aeee898e5048d0a5d272&amp;dn=Gitarowe+wyzwania+-+Szko%C5%82a+gry+na+gitarze+nie+tylko+akustycznej&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Joe669","files":121,"time":1463060307,"description":"Wydawnictwo Absonic. Autor Krzysztof Błaś. Multimedialna szkoła na 2 płytach DVD. W ponad 4 godzinnym materiale zawarta jest ogromna ilość informacji niezbędnych dla każdego gitarzysty. Od gitarowych początków, dla osób rozpoczynających swoją przygodę z instrumentem, poprzez techniki pracy prawej i lewej ręki, aż do zaawansowanych zagadnień związanych ze skalami oraz harmonią - tak obszernej szkoły gitarowej jeszcze nie było! To jednak nie wszystko.\r\nW osobnym rozdziale dowiesz się jak wybrać właściwy instrument, jak dokonać samodzielnie podstawowych regulacji, a także zobaczysz to, co do tej pory dla zwykłych śmiertelników pozostawało niewidoczne! Ujęcia z wielu kamer zapewnią niespotykany komfort nauki. W wielu najistotniejszych momentach samemu będziesz mógł dokonać wyboru kamery, której obraz chcesz oglądać. Wszystkie zagadnienia omówione są w zrozumiały i przejrzysty sposób, a szereg ćwiczeń i demonstracji pozwoli z łatwością opanować cały materiał.\r\nPomimo tego, że szkoła przeznaczona jest dla gitarzystów akustycznych, uniwersalność materiału sprawia, że w równym stopniu skorzystają z niej fani gitar elektrycznych. Po obejrzeniu tego kompendium wiedzy, gitara nie będzie już miała dla Ciebie żadnych tajemnic!","torrent":{"xt":"urn:btih:c8732196b0317c998638aeee898e5048d0a5d272","amp;dn":"Gitarowe+wyzwania+-+Szko%C5%82a+gry+na+gitarze+nie+tylko+akustycznej","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8732196b0317c998638aeee898e5048d0a5d272","infoHashBuffer":{"type":"Buffer","data":[200,115,33,150,176,49,124,153,134,56,174,238,137,142,80,72,208,165,210,114]},"announce":[],"urlList":[]}}