{"title":"Kanye West 24 Bit Vinyl Pack","uid":8603996,"size":6710644848,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c89214a4bef5f48a218c09aefb31b036b5ecede8&amp;dn=Kanye+West+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1371953396,"description":"\n  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n  \n  Kanye West 24 Bit Vinyl Pack\n\n  * Genres: Rap, Jazz, Pop/Rock\n  * Styles: Midwest Rap, Hardcore Rap, Pop-Rap, Pop\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums\n\n  * 2004 The College Dropout\n  * 2005 Late Registration\n  * 2008 808s &amp; Heartbreak\n  * 2010 My Beautiful Dark Twisted Fantasy\n  * 2011 Watch the Throne (with Jay-Z)\n\n  * In the span of three short years, Kanye West went from hip-hop beatmaker to worldwide hitmaker, as his stellar production work for Jay-Z led to a major-label recording contract and, ultimately, a wildly successful solo career. West paired his beats with tongue-twisting raps and a self-assured, flamboyant personality. His dapper fashion sense set him apart from many of his rap peers, and his confidence often came across as boastful or even egotistical, albeit amusingly so. This flamboyance, of course, made for good press, something that West enjoyed in spades during his sudden rise to celebrity status. He was a media darling, appearing and performing at countless awards shows (and winning at them, too), delivering theatrical videos to MTV, and mouthing off about whatever happened to cross his mind. \n\n  * He frequently spoke out against the rampant homophobia evident in much rap music, posed for the cover of Rolling Stone as Jesus Christ, and even claimed during a televised Hurricane Katrina fundraiser that &quot;George Bush doesn't care about black people.&quot; West courted controversy, no question about it, but his steady presence in the celebrity limelight couldn't eclipse his musical talent. His production abilities seemed boundless during his initial surge of activity, as he not only racked up impressive hits for himself (including &quot;Jesus Walks&quot; and &quot;Gold Digger&quot;), but also collaborated on smash hits with the likes of Jay-Z and Ludacris. As his career progressed throughout the early 21st century, West shattered certain stereotypes about rappers, becoming a superstar on his own terms without adapting his appearance, his rhetoric, or his music to fit any one musical mold.\n\n  * Coming out of left field (i.e., Chicago, a city rarely praised for its hip-hop exports), West was an unlikely sensation and more than once defied adversity. Like so many others who were initially inspired by Run-D.M.C., he began as just another aspiring rapper with a boundless passion for hip-hop, albeit a rapper with a Midas touch when it came to beatmaking. Indeed, it was his beatmaking prowess that got his foot in the industry door. Though he did quite a bit of noteworthy production work during the late '90s (Jermaine Dupri, Foxy Brown, Mase, Goodie Mob), it was West's work for Roc-a-Fella at the dawn of the new millennium that took his career to the next level. Alongside fellow fresh talent Just Blaze, West became one of the Roc's go-to producers, consistently delivering hot tracks to album after album. His star turn came on Jay-Z's classic Blueprint (2001) with album standouts &quot;Takeover&quot; and &quot;Izzo (H.O.V.A.).&quot; Both songs showcased West's signature beatmaking style of the time, which was largely sample-based; in these cases, the former track appropriated snippets of the Doors' &quot;Five to One,&quot; while the latter sampled the Jackson 5's &quot;I Want You Back.&quot;\n\n  * More high-profile productions followed, and before long word spread that West was going to release an album of his own, on which he planned to rap as well as produce. Unfortunately, that album was a long time coming, pushed back and then pushed back again. It didn't help that West was in a tragic car accident in October 2002 that almost cost him his life. He capitalized on the traumatic experience by using it as the inspiration for &quot;Through the Wire&quot; (and its corresponding video), which would later become the lead single for his debut album, 2004's The College Dropout. As the album was continually delayed, West continued to churn out big hits for the likes of Talib Kweli (&quot;Get By&quot;), Ludacris (&quot;Stand Up&quot;), Jay-Z (&quot;'03 Bonnie &amp; Clyde&quot;), and Alicia Keys (&quot;You Don't Know My Name&quot;). Then, just as &quot;Through the Wire&quot; was breaking big-time at the tail end of 2003, another West song caught fire, a collaboration with Twista and comedian/actor Jamie Foxx called &quot;Slow Jamz,&quot; which gave the rapper/producer two simultaneously ubiquitous singles and a much-anticipated debut album. As with so many of West's songs, the singles were driven by somewhat recognizable sample-based hooks: Chaka Khan's &quot;Through the Fire&quot; in the case of &quot;Through the Wire,&quot; and Luther Vandross' &quot;A House Is Not a Home&quot; in the case of &quot;Slow Jamz.&quot;","torrent":{"xt":"urn:btih:c89214a4bef5f48a218c09aefb31b036b5ecede8","amp;dn":"Kanye+West+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89214a4bef5f48a218c09aefb31b036b5ecede8","infoHashBuffer":{"type":"Buffer","data":[200,146,20,164,190,245,244,138,33,140,9,174,251,49,176,54,181,236,237,232]},"announce":[],"urlList":[]}}