{"title":"The Kautokeino Rebellion - 2008 - DivX - velvetfog","uid":4644473,"size":734438715,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8b872c7fc454f2981bb7a8da2110c42632e9674&amp;dn=The+Kautokeino+Rebellion+-+2008+-+DivX+-+velvetfog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"velvetfog","files":-1,"time":1231832790,"description":"Ever since Nils Gaup directed Veiviseren (Norwegian title. It is called &quot;Ofelas&quot; in samish, &quot;Pathfinder&quot; in English) one have awaited more of the ice cold and heart warming stuff from the filmmaker with samish (a Lappland people in Northern Scandinavia) relations.\n\nWell, here he's back again many years after having his film Oscar-nominated. This is a different film. A true story of the Norwegian authorities suppressing the Samish minority in the most Northern part of Norway.\n\nThe film is beautifully and realistically filmed, and the acting is flawless. And Gaup has not fallen into any trap of making the story any other than it is.\n\nIt's got some of the very same feeling as &quot;Ofelas&quot;, though set in another time. The Swedish and Danish stars playing the priests and bishops are just as you would expect them to be. Not at all understanding of the Samish peoples daily life in the hash and cold winter of Finnmark.\n\nNils Gaup has told that he has had plans on making this film for 20 years. Well, here it is. It'll be a price winning movie, surely. Finally another masterpiece from his hand. Enjoy the ever so sad true story! Another great Norwegian movie. There's been quite a movie revolution in Norway the latter years. What a dream come true!\n\n\nNorwegian with hard coded English subtitles.\n640x272 - DivX - 92 minutes","torrent":{"xt":"urn:btih:c8b872c7fc454f2981bb7a8da2110c42632e9674","amp;dn":"The+Kautokeino+Rebellion+-+2008+-+DivX+-+velvetfog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b872c7fc454f2981bb7a8da2110c42632e9674","infoHashBuffer":{"type":"Buffer","data":[200,184,114,199,252,69,79,41,129,187,122,141,162,17,12,66,99,46,150,116]},"announce":[],"urlList":[]}}