{"title":"The Acadian Diaspora - An Eighteenth-Century History [EPUB]","uid":9879857,"size":4066154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9a9d2f2f13da0d8bda415bb467d196340ecb065&amp;dn=The+Acadian+Diaspora+-+An+Eighteenth-Century+History+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AtomTPB","files":1,"time":1396530106,"description":"Pages: 272 pages\nPublisher: Oxford University Press, USA (June 8, 2012)\nLanguage: English\nISBN-10: 0199739773\nISBN-13: 978-0199739776\n\n\n\nLate in 1755, an army of British regulars and Massachusetts volunteers completed one of the cruelest, most successful military campaigns in North American history, capturing and deporting seven thousand French-speaking Catholic Acadians from the province of Nova Scotia, and chasing an equal number into the wilderness of eastern Canada. Thousands of Acadians endured three decades of forced migrations and failed settlements that shuttled them to the coasts of South America, the plantations of the Caribbean, the frigid islands of the South Atlantic, the swamps of Louisiana, and the countryside of central France. \n\nThe Acadian Diaspora tells their extraordinary story in full for the first time, illuminating a long-forgotten world of imperial desperation, experimental colonies, and naked brutality. Using documents culled from archives in France, Great Britain, Canada, and the United States, Christopher Hodson reconstructs the lives of Acadian exiles as they traversed oceans and continents, pushed along by empires eager to populate new frontiers with inexpensive, pliable white farmers. Hodson's compelling narrative situates the Acadian diaspora within the dramatic geopolitical changes triggered by the Seven Years' War. Faced with redrawn boundaries and staggering national debts, imperial architects across Europe used the Acadians to realize radical plans: tropical settlements without slaves, expeditions to the unknown southern continent, and, perhaps strangest of all, agricultural colonies within old regime France itself. In response, Acadians embraced their status as human commodities, using intimidation and even violence to tailor their communities to the superheated Atlantic market for cheap, mobile labor. \n\nThrough vivid, intimate stories of Acadian exiles and the diverse, transnational cast of characters that surrounded them, The Acadian Diaspora presents the eighteenth-century Atlantic world from a new angle, challenging old assumptions about uprooted peoples and the very nature of early modern empire.","torrent":{"xt":"urn:btih:c9a9d2f2f13da0d8bda415bb467d196340ecb065","amp;dn":"The+Acadian+Diaspora+-+An+Eighteenth-Century+History+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9a9d2f2f13da0d8bda415bb467d196340ecb065","infoHashBuffer":{"type":"Buffer","data":[201,169,210,242,241,61,160,216,189,164,21,187,70,125,25,99,64,236,176,101]},"announce":[],"urlList":[]}}