{"title":"Count Five - Psychotic Revelation The Ultimate Count Five (1966-","uid":4848023,"size":149697248,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca6e4854c84c33b6b9614f419afe4bdcc7643457&amp;dn=Count+Five+-+Psychotic+Revelation+The+Ultimate+Count+Five+%281966-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Iron_Horse","files":29,"time":1239760635,"description":"Count Five - Psychotic Revelation: The Ultimate Count Five (1966-1969) [Garage Rock]\nCD (2003) To Mp3 320 mbit/s\nIncluded: CD Covers and this Info\n\nCount Five - Psychotic Revelation: The Ultimate Count Five\nThough Collectables' Psychotic Reaction: The Complete Psychotic Reaction did include every one of the band's 18 officially released tracks, Big Beat's Psychotic Revelation: The Ultimate Count Five does indeed replace it as the ultimate Count Five compilation. It's not just because it includes every one of those 18 tracks and then some, with half a dozen unreleased outtakes, demos, and unedited versions. It's also because there's a great 24-page booklet on the history of the band by Alec Palao that clears up much of the mystery surrounding the Count Five, with quotes from most of the members. While the additional material is neither that revelatory or voluminous, it does include some nice bonuses. Prominent among them is the original unedited version of &quot;Psychotic Reaction,&quot; with a previously unheard tag and key change at the end, though Double Shot Records was wise to release the reassembled version that became the big hit. Also on hand is an unedited version of &quot;They're Gonna Get You&quot; from the Count Five's sole LP, as well as a demo of the group's non-LP single &quot;Contrast&quot; and some fair unreleased originals by John &quot;Sean&quot; Byrne. The excellent packaging doesn't disguise the failure of any of the band's other material to come close to matching the garage-psychedelic classic &quot;Psychotic Reaction,&quot; or how derivative much of it was of British Invasion bands (particularly the Yardbirds). Still, they did conjure some above-average tracks like &quot;Double Decker Bus,&quot; the psychedelic-tinged &quot;Peace of Mind,&quot; and the poppier psychedelia of &quot;Merry-Go-Round,&quot; making this ultimately worthwhile for the committed '60s garage fan. ~ Richie Unterberger, All Music Guide\n\nThe Count Five Biography\nStrictly speaking, based on their raw talent, the Count Five wouldn't rate too much attention from music historians. The definitive one-hit wonders, they failed to make much of a lasting impression on the listening public or on music -- but just play that one hit, &quot;Psychotic Reaction,&quot; even 40 years after the fact, and almost any audience will brighten up and want to hear more. Their one fault was that they could never generate more -- they tried but never issued another record half as good.\n\nThe Count Five started life in San Jose, CA, in the early '60s with a pair of high school students named John &quot;Mouse&quot; Michalski and Roy Chaney, who had played guitar and bass, respectively, in a succession of local bands such as Johnny &amp; the GTOs and the Renegades, specializing in surf instrumental music. Still in their mid-teens, they changed their name to the Squires, added a singer (Kenn Ellner), and tried picking up on the British Invasion sound; this wouldn't be the last time the group attempted to adapt to the musical sounds around them. Sean Byrne, an Irish-born guitarist, singer, and songwriter attending San Jose City College, came aboard in late 1964, and the Squires made a local name for themselves over the ensuing year. Then, organist Phil Evans quit for personal reasons and drummer Skip Cordell joined another group; with the arrival of his replacement, Butch Atkinson, the group changed their name to the Count Five. It was just about then that Byrne put the finishing touches on a song he'd been outlining in his head, ultimately called &quot;Psychotic Reaction.&quot;\n\nThat song, heard by a local DJ named Brian Lord, became the group's key to stardom, at least momentarily. It became a showcase for the band's abilities, especially guitarists Michalski and Byrne, and they began working it up into the crescendo of their stage act. At first it didn't seem to do much good, as the group was turned down by Capitol Records, Fantasy Records, and a handful of other California-based companies, but after working out a new arrangement of &quot;Psychotic Reaction&quot; with the band, Lord got the song and the group placed with Double Shot Records, a Los Angeles-based label. The record -- a chugging, fuzz tone-laden piece of punk defiance with more than a few signature licks and phrasings borrowed from Bo Diddley and the Yardbirds, among others, and a punk attitude that was worthy of the Standells -- eventually made number five nationally and number one in Los Angeles.\n\nUnfortunately, the band was never able to follow up the hit with anything even remotely as successful. An album was rushed out, containing some ill-conceived originals, but nothing that the group did after &quot;Psychotic Reaction&quot; seemed to work. They tried reusing the same formula, working in a slightly more folk-rock vein, and attempting some fresh guitar pyrotechnics (on &quot;The World&quot; and &quot;Pretty Big Mouth&quot; and, in a psychedelic vein, on &quot;Peace of Mind&quot;), plus a pair of pretty fair Who covers (&quot;My Generation&quot; and &quot;Out in the Street&quot;), but by 1967, it was clear that the group's days were numbered. The strain of maintaining music careers while attending college -- which was essential to the members keeping their draft deferments -- took its toll, as did the dwindling bookings, as memory of &quot;Psychotic Reaction&quot; faded. In the end, after an attempt by Double Shot to keep Byrne as the only active member, the Count Five ceased to exist.\n\nTheir story might have ended there, as dimly remembered one-shot hitmakers, but for the 1972 release of Nuggets, Lenny Kaye's original '60s garage/psychedelic punk compilation. &quot;Psychotic Reaction&quot; may not have been the most original track on the album, but it was one of the more accessible, and still potent and enjoyable on its own terms six years after the fact; suddenly a new generation of enthusiasts discovered the Count Five. Yardbirds fans, in particular, tended to despise the group for having ripped off many of lead guitarist Jeff Beck's pyrotechnical tricks in a more commercially successful manner, but generally the song proved a popular oldie selection among more knowing '60s listeners, and there was demand for their album, which resulted in several rounds of reissues on vinyl and CD. In the decades since, the group has rated at least a mention in most histories of garage rock and psychedelic punk, and &quot;Psychotic Reaction&quot; is as much a standard of the genre as the Standells' &quot;Try It&quot; or the Thirteenth Floor Elevators' &quot;You're Gonna Miss Me.&quot; ~ Bruce Eder, All Music Guide\n\nTracklist:\n01. Psychotic Reaction - 2003 (Previously Unissued)\n02. Double Decker Bus - 1966\n03. Pretty Big Mouth - 1966\n04. World - 1966\n05. My Generation - 1966\n06. She's Fine - 1966\n07. Peace Of Mind - 1966\n08. They're Gonna Get You - 2003 (Previously Unissued)\n09. Morning After, The - 1966\n10. Can't Get Your Lovin' - 1966\n11. Out In The Street - 1966\n12. Move It Up - 2003 (Previously Unissued)\n13. So Much - 2003 (Previously Unissued)\n14. You Must Believe Me - 1967\n15. Teeny Bopper Teeeny Bopper - 1967\n16. Contrast - 1967\n17. Merry-Go-Round - 1967\n18. Revelation In Slow Motion - 1968\n19. Declaration Of Independence - 1968\n20. Enchanted Flowers - 2003 (Previously Unissued)\n21. Mailman - 1969\n22. Contrast - 2003 (Previously Unissued)\n23. People Hear What I Say - 2003 (Previously Unissued)\n24. Psychotic Reaction - 1966\n\nLineup:\nJohn &quot;sean&quot;Byrne - Lead Vocals, Rhythm Guitar\nKenn Ellner - Lead Vocals (Tracks 5,8,11,12,16,22,23), Harp, Percussion\nJohn &quot;Mouse&quot; Michalski - Lead Guitar\nRoy Chaney - Bass\nCraig &quot;Butch&quot; Atktinson - Drums","torrent":{"xt":"urn:btih:ca6e4854c84c33b6b9614f419afe4bdcc7643457","amp;dn":"Count+Five+-+Psychotic+Revelation+The+Ultimate+Count+Five+%281966-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6e4854c84c33b6b9614f419afe4bdcc7643457","infoHashBuffer":{"type":"Buffer","data":[202,110,72,84,200,76,51,182,185,97,79,65,154,254,75,220,199,100,52,87]},"announce":[],"urlList":[]}}