{"title":"How To Survive In a World Without Antibiotics","uid":10744199,"size":1988945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca9924019e7f5a11b74bd4cc07d88395d647cdd2&amp;dn=How+To+Survive+In+a+World+Without+Antibiotics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eboneezer","files":1,"time":1407798337,"description":"\nISBN : 0983878420\n\nAuthor: Keith Scott-Mumby\nThe &quot;Golden Age&quot; Of Antibiotics Is Over! Deadly new organisms, resistant to all known antibiotics, are emerging all over the planet and gaining ground FAST... It's over! The truth is, the comfortable world as we have known it for the last 60 years is coming rapidly to an end. Bacteria are deadly and the short period of time where we were able to control them is vanishing fast. Because of their fantastic power of multiplication (doubling every 20 minutes or so), that new strain could be all over the Earth within months, or even weeks. You've heard of MRSA, everyone has heard of MRSA. But did you know that in 2009 an even more virulent new strain of MRSA emerged, that is FIVE TIMES more deadly and kills 50% of its victims? But it's not just MRSA. Now we have VRE (vancomycin-resistant enterococcus), which is far more deadly than MRSA (100% fatal septicemia). Also we now have PRSP (penicillin-resistant Streptococcus pneumoniae). It is reported that out of 100,000 hospitalizations for pneumonia, 40% are now due to this organism! And don't forget, resistant syphilis is back on the loose. Syphilis (Lues) was one of the most feared of all diseases for centuries and kept young men and women in terror of the act of sexual union. Our old enemy TB is on the prowl too, with a new strain which is classed MDR (multiple-drug resistant). In Germany in the summer of 2011 A deadly new strain of E. Coli emerged, that is highly resistant to antibiotics and killed hundreds in Europe on it's unstoppable rampage. If you are not worried about this deteriorating position, you should be. False reliance on drugs and pharma medicine has proven to be a weak strategy: the game is LOST! The Truth Is: You can't hold back bacteria. They are too overwhelmingly numerous and powerful. But there is GOOD news... In the days before antibiotics not everyone died of their infections. There were scores of great, workable non-drug solutions to infections. These remedies still work! You need to get to know them, get re-acquainted with our folklore and natural heritage again and fast. You never know when the next outbreak will sweep your neighborhood. It's important to strengthen your immune defenses, of course. But you also need to go on a short education course of learning what your antibiotic-alternative options are. To make it easy for you, Dr. Keith has compiled a comprehensive report of all the suitable alternatives, with scientific studies to support them. Youï¿½ll be amazed just how many humble home remedies and plant-based solutions have been studied scientifically and demonstrated to work effectively. PLUS, he has given you lots of very modern possibilities that were not even dreamed of in the era before antibiotics. This is the AUTHORITY report you have been waiting for. Dr. Keith is well known for demanding minimum scientific standards, not just myth, &quot;wise woman stories&quot; and ignorant conjecture.","torrent":{"xt":"urn:btih:ca9924019e7f5a11b74bd4cc07d88395d647cdd2","amp;dn":"How+To+Survive+In+a+World+Without+Antibiotics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9924019e7f5a11b74bd4cc07d88395d647cdd2","infoHashBuffer":{"type":"Buffer","data":[202,153,36,1,158,127,90,17,183,75,212,204,7,216,131,149,214,71,205,210]},"announce":[],"urlList":[]}}