{"title":"Nina Simone 24 Bit Vinyl Pack","uid":9597016,"size":5484787985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb4da837102ddeab220609adc8c81f6a9cb08057&amp;dn=Nina+Simone+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"politux","files":-1,"time":1392042641,"description":"  Nina Simone 24 Bit Vinyl Pack\n\n  Genre: Jazz\n  Styles: Vocal Jazz, Standards\n  Codec: FLAC\n  Bitrate: ~ 1,500 - 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 kHz\n \n  1958 Little Girl in Blue\n  1964 In Concert (Mono)\n  1965 I Put a Spell on You\n  1965 Pastel Blues \n  1967 Sings the Blues\n  1974 It Is Finished (Original US)\n  1978  Baltimore (1st UK)\n \n  Nina Simone was one of the most gifted vocalists of her generation, and also one of the most eclectic. Simone was a singer, pianist, and songwriter who bent genres to her will rather than allowing herself to be confined by their boundaries; her work swung back and forth between jazz, blues, soul, classical, R&amp;B, pop, gospel, and world music, with passion, emotional honesty, and a strong grasp of technique as the constants of her musical career.\n\n  Nina Simone was born Eunice Kathleen Waymon in Tryon, North Carolina on February 21, 1933. Her mother, Mary Kate Waymon, was a Methodist minister, and her father, John Divine Waymon, was a handyman who moonlighted as a preacher. Eunice displayed a precocious musical talent at the age of three when she started picking out tunes on the family's piano, and a few years later she was playing piano at her mother's Sunday church services. Mary Kate worked part time as a housemaid, and when her employers heard Eunice play, they arranged for her to study with pianist Muriel Mazzanovich, who tutored Eunice in the classics, focusing on Bach, Beethoven, Brahms, Chopin, and Schubert. After graduating at the top of her high school class, Eunice received a grant to study at the Juilliard School of Music in New York City, and applied for enrollment at the Curtis Institute of Music in Philadelphia. However, Eunice was denied admission at the Curtis Institute under mysterious circumstances, despite what was said to be a stellar audition performance; Eunice would insist that her race was the key reason she was rejected.\n\n  Determined to support herself as a musician, in 1954 Eunice applied for a job playing piano at the Midtown Bar &amp; Grill in Atlantic City, New Jersey. Eunice was told she would have to sing as well as play jazz standards and hits of the day. While she had no experience as a vocalist, Eunice faked it well enough to get the job, and she adopted a stage name, Nina Simone -- Nina from a pet name her boyfriend used, and Simone from the French film star Simone Signoret. The newly christened Nina Simone was a quick study as a singer, and her unique mixture of jazz, blues, and the classics soon earned her a loyal audience. Within a few years, Simone was a headliner at nightclubs all along the East Coast, and in 1957 she came to the attention of Syd Nathan, the mercurial owner of the influential blues and country label King Records. Nathan offered Simone a contract with his jazz subsidiary, Bethlehem Records, and the two were soon butting heads as the strong-willed Simone insisted on choosing her own material. Simone won out, and in 1958, she enjoyed a major hit with her interpretation of &quot;I Loves You Porgy&quot; from Porgy and Bess. The single rose to the Top 20 of the pop charts, but like many of Nathan's signings, Simone did not see eye to eye with him about business details (particularly after she discovered she'd signed away her right to royalties upon receiving her advance), and by 1959 she had signed a new deal with Colpix Records.\n\n  Simone's reputation as a powerful live performer had only grown by this time, and her second album for Colpix was the first of many live recordings she would release, Nina Simone at Town Hall. Simone's live performances gave her more room to show off her classical piano influences, and her albums for Colpix reflected an intelligent taste in standards, pop songs, and supper club blues, and while she didn't enjoy another American hit on the level of &quot;I Loves You Porgy,&quot; her recordings of &quot;Trouble in Mind&quot; and &quot;Nobody Knows You When You're Down and Out&quot; both entered the pop charts as singles.\n\n  In 1964, Simone left Colpix to sign a new deal with Philips, and the move coincided with a shift in the themes of her music. While always conscious of the ongoing struggle for civil rights, Simone often avoided explicit political messages in her material; as she later wrote, &quot;How can you take the memory of a man like Medgar Evers and reduce all that he was to three and a half minutes and a simple tune?&quot; But as the fight for racial equality became a more pressing issue in America, Simone began addressing issues of social justice in her music, penning songs such as &quot;Mississippi Goddam,&quot; &quot;Four Women,&quot; and &quot;Young, Gifted and Black,&quot; the latter inspired by the work of her friend and mentor Lorraine Hansberry. Simone also enjoyed a British hit single in 1964 with &quot;Don't Let Me Be Misunderstood,&quot; and while the record didn't fare as well in the United States, a year later the Animals would take the song to the pop charts on both sides of the Atlantic. Simone would next hit the British charts with her cover of Screamin' Jay Hawkins' &quot;I Put a Spell on You,&quot; which also rose to the Top 30 in the States.\n\n  In 1967, after recording seven albums for Philips, Simone struck a new deal with RCA Records, and while her first album for her new label, Nina Simone Sings the Blues, was a straightforward collection of blues standards, her subsequent work for RCA found Simone focusing on contemporary pop, rock, and soul material, much of which dealt with topical themes and progressive philosophies (1969's To Love Somebody featured no fewer than three Bob Dylan tunes). Simone's 1968 cover of &quot;Ain't Got No/I Got Life&quot; (from the musical Hair) was a major chart hit in the U.K., and Simone would focus her energies on her European career when she left the United States in 1970, initially settling in Barbados and divorcing her husband and manager. Simone's exile was prompted by her increasing disillusionment with American politics, as well as her refusal to pay income taxes as a protest against the U.S. involvement in Vietnam, though recording sessions and concert dates would occasionally bring her back to the United States. In 1974, Simone released her last album for RCA, It Is Finished, and spent the next several years traveling the world and playing occasional concerts; she would not return to the recording studio until 1978, when she recorded the album Baltimore at a studio in Belgium for Creed Taylor's CTI label. (That same year, Simone was arrested and charged for her non-payment of taxes from 1971 to 1973.) It would be another four years until Simone would record again, cutting Fodder on My Wings for a Swiss label in 1982.\n\n  After several more years of travel, Simone released a live album through the American VPI label, 1985's Live &amp; Kickin, and another concert set, Let It Be Me, was issued by Verve in 1987, a year that saw Simone enjoying a major career resurgence in Europe; her 1959 recording of &quot;My Baby Just Cares for Me&quot; was used in a British television commercial for Chanel No. 5 perfume, and the song subsequently became a hit, rising to the Top Ten of the U.K. pop charts. In 1989, Simone was invited by Pete Townshend to sing the song &quot;Fast Food&quot; on his concept album The Iron Man, which also featured John Lee Hooker. Simone's autobiography I Put a Spell on You was published in 1990, and after a well-received United States concert tour, she was signed by Elektra Records, which released the album A Single Woman in 1993.\n\n  In 1995, Simone found herself in the news after she fired a gun at one of her neighbors during an argument; she was diagnosed with bipolar disorder, which was said to be the cause of several episodes of erratic behavior in her later years. Simone continued to perform live in Europe and the United States up until the summer of 2002, when it was discovered she had breast cancer. Simone's battle with the disease came to a close on April 21, 2003 in Carry-le-Rouet, France. Only a few days earlier, Simone had received an honorary degree from the Curtis Institute in Philadelphia, the same school that had rejected her in 1953.","torrent":{"xt":"urn:btih:cb4da837102ddeab220609adc8c81f6a9cb08057","amp;dn":"Nina+Simone+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb4da837102ddeab220609adc8c81f6a9cb08057","infoHashBuffer":{"type":"Buffer","data":[203,77,168,55,16,45,222,171,34,6,9,173,200,200,31,106,156,176,128,87]},"announce":[],"urlList":[]}}