{"title":"Avira  AntiVir  Personal - Free Antivirus 12.0.0.872","uid":7034268,"size":87264656,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb52f2c557788fbe7cfa72e7c528f2e291ddcf3f&amp;dn=Avira++AntiVir++Personal+-+Free+Antivirus+12.0.0.872&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Dirty.R.L","files":1,"time":1329325307,"description":"\n\nDescription:\n\nAvira AntiVir Personal FREE Antivirus was developed to be a reliable free antivirus solution, that constantly and rapidly scans your computer for malicious programs such as viruses, Trojans, backdoor programs, hoaxes, worms, dialers etc. Monitors every action executed by the user or the operating system and reacts promptly when a malicious program is detected.\n\nAvira AntiVir Personal is a comprehensive, easy to use antivirus program, designed to offer reliable free of charge virus protection to home-users, for personal use only, and is not for business or commercial use.\n\nAvira AntiVir Personal gives you the following functions:\n\n* Control Center for monitoring, administering and controlling the entire program\n\n* Central configuration with user-friendly standard and advanced options and context-sensitive help\n\n* Scanner (On-Demand Scan) with profile-controlled and configurable search for all known types of virus and malware\n\n* Integration into the Windows Vista User Account Control allows you to carry out tasks requiring administrator rights\n\n* Guard (On-Access Scan) for continuous monitoring of all file access attempts\n\n* Integrated quarantine management to isolate and process suspicious files\n\n* Rootkit protection for detecting hidden malware installed in your computer system (rootkits) (Only for 32-bit systems)\n\n* Direct access to detailed information on the detected viruses and malware via the Internet\n\n* Simple and quick updates to the program, virus definitions, and search engine \nthrough Single File Update and incremental VDF updates via a webserver on the Internet\n\n* Integrated Scheduler to plan one-off or recurring tasks, such as updates or test runs\n\n* Very high rates of virus and malware detection using innovative search technologies (search engines) and heuristic search processes\n\n* Detection of all common archive types, including detection of nested archives and smart extensions\n\n* High-performance multithreading function (simultaneous high-speed scanning of multiple files)\n\n\nNOTE:\n\nAvira AntiVir Personal is free for personal use only. A license key can be downloaded from here.\n\n\nRequirements:\n\n* At least 100 MB of free hard disk memory space (more if using Quarantine for temporary storage)\n* At least 192 MB RAM under Windows 2000/XP\n* At least 512 MB RAM under Windows Vista\n* For the installation of Avira AntiVir Personal: Administrator rights\n* For all installations: Windows Internet Explorer 6.0 or higher\n\n","torrent":{"xt":"urn:btih:cb52f2c557788fbe7cfa72e7c528f2e291ddcf3f","amp;dn":"Avira++AntiVir++Personal+-+Free+Antivirus+12.0.0.872","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb52f2c557788fbe7cfa72e7c528f2e291ddcf3f","infoHashBuffer":{"type":"Buffer","data":[203,82,242,197,87,120,143,190,124,250,114,231,197,40,242,226,145,221,207,63]},"announce":[],"urlList":[]}}