{"title":"Trilogy.Of.Terror.1975.DVRrip-GPB2008","uid":5321307,"size":734298112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb841998f23cdd57a83a87227eddcb722dacc6d4&amp;dn=Trilogy.Of.Terror.1975.DVRrip-GPB2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GPB2008","files":-1,"time":1264870055,"description":"Three stories interwoven together. The first, about a high school student infatuated with his teacher. The second, a paranoid tale of two sisters - one good, the other evil, and the third about an African tribal doll that comes to life and terrorizes a woman in her apartment.  Written by Humberto Amador\n\nThree horror anthology stories of tormented women. In the first story, Julie Eldridge is a sexually repressed high school teacher who is blackmailed by one of her students for a past indiscretions which she played an unwilling part. But the student is unaware that Julie plots to turn the tables on him the first chance she gets. In the second story, Millicent Larimore is a plain-looking, almost reclusive woman who lives with her amoral twin sister Therese whom delights in tormenting her. However, only their doctor who visits from time to time knows the real thing behind the scene. In the final story, Amelia in a solo horror story monologue is a mother-dominated woman who buys an African Zuni fetish doll for her latest boyfriend in which the doll comes to life and terrorizes her in her own apartment.\n\nPlease Seed..Comment..And ENJOY!!!","torrent":{"xt":"urn:btih:cb841998f23cdd57a83a87227eddcb722dacc6d4","amp;dn":"Trilogy.Of.Terror.1975.DVRrip-GPB2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb841998f23cdd57a83a87227eddcb722dacc6d4","infoHashBuffer":{"type":"Buffer","data":[203,132,25,152,242,60,221,87,168,58,135,34,126,221,203,114,45,172,198,212]},"announce":[],"urlList":[]}}