{"title":"RedGate SmartAssembly Professional v6.7.1.61 with Key [iahq76]","uid":7804753,"size":5010584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb8f73edf81cd9eec93f09e2b5792ced54fdf38d&amp;dn=RedGate+SmartAssembly+Professional+v6.7.1.61+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"TorDigger","files":4,"time":1352370892,"description":"SmartAssembly\n\nRed Gate's .NET obfuscator\nProtect your .NET code and Intellectual Property\n\nProtect your .NET code and IP with SmartAssembly\n\n.NET applications are easy to disassemble if they haven't been obfuscated. SmartAssembly is an obfuscator that helps protect your application against reverse-engineering, cracking, and modification.\n\nIf you don't want your C# or VB.NET code exposed internationally, or if your entire business rests on the IP embodied in your software, then obfuscating your code becomes a necessity, not a luxury.\n\n.NET applications are easy to disassemble if they haven't been obfuscated, which is obviously a problem if you've invested time, effort, and money in your code. Obfuscating your code is easy to do, and helps protect it against reverse-engineering, cracking, and modification.\n\nMaybe you just don't want your code exposed, or maybe your entire business rests on the IP embodied in your software; SmartAssembly makes sure that your code is well-protected. You can learn more about SmartAssembly Obfuscation in our case studies and webinar recordings.\n\nMultiple forms of Obfuscation and Optimization\n\nCode Obfuscation makes your application hard to reverse-engineer, removes non-useful code, and compresses dependencies, protecting and compacting your application with a minimum of fuss.\n\nKey features:\n\nName mangling\nChanges the names of methods and fields to make it hard to understand their purpose.Control flow obfuscation\nConverts the code inside methods to 'spaghetti code' to make it difficult to see how the application works.\nReferences dynamic proxy\nCreates a proxy for calls to methods outside of your assembly to make it hard to find external calls.\n\nStrings encoding\nEncodes the strings used in your software to hide such information as passwords and SQL queries.\n\nResources compression and encryption\nCompresses and encrypts managed resources to make them hard to understand, and to reduce the size of the assembly.\n\nPruning\nRemoves non-useful metadata to make the code harder to reverse-engineer, reduce the size of the assembly, and improve loading time.\n\nDependencies merging\nTakes all the DLLs and merges dependencies into the main assembly, so you don't have to load lots of DLL files, and so that they can also be obfuscated.\n\nDependencies compression and embedding\nCompresses and embeds your dependencies into your main assembly, simplifying the deployment of your software and reducing the size of your program.\n\nMethod parent obfuscation\nMoves methods in your code by changing the class they are in, making it harder to understand how methods and classes relate to each other.\n\nStrong name signing with tamper protection\nSigns your assembly and helps to protect it against modification (the additional tamper protection is not available in the Standard edition).\n\nDeclarative obfuscation\nExcludes a member from obfuscation using custom attributes directly in your code.\n\nDebugging\n\nSmartAssembly decodes obfuscated stack traces and generates .pdb files containing debugging information. This enables you to debug your assembly into your IDE, and get the full stack trace when an exception occurs. To top it off, SmartAssembly even helps to ensure that you're automatically releasing unneeded memory.\n\nIntegration and Support\n\nObfuscation can be integrated into build processes using MS Build or command-line, and supports .NET 2.0 to 4.5, Compact Framework 2.0 to 3.5, Silverlight 2.0 to 5.0, XNA (xbox, PC applications), and Windows Phone 7, with some exceptions \n\nTechnologies supported\n\nSmartAssembly can protect your Winforms, Silverlight, Windows Phone 7, ASP.NET applications and more. It can also be integrated into build processes using MS Build or the command-line.\n\nHomepage: http://www.red-gate.com/products/dotnet-development/smartassembly/\n\nInstallation Instructions: \n\n1. Install program.\n2. Copy license file from key folder and paste to mentioned directory.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:cb8f73edf81cd9eec93f09e2b5792ced54fdf38d","amp;dn":"RedGate+SmartAssembly+Professional+v6.7.1.61+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb8f73edf81cd9eec93f09e2b5792ced54fdf38d","infoHashBuffer":{"type":"Buffer","data":[203,143,115,237,248,28,217,238,201,63,9,226,181,121,44,237,84,253,243,141]},"announce":[],"urlList":[]}}