{"title":"BBC = Meat Loaf In and out of Hell [MP4-AAC](oan)","uid":14682785,"size":696709530,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cc1ab3435e72fb8db0d3abda39b249ef7051279b&amp;dn=BBC+%3D+Meat+Loaf+In+and+out+of+Hell+%5BMP4-AAC%5D%28oan%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"oneanight","files":5,"time":1464103018,"description":"\n\r\n\r\n\r\nBBC = Meat Loaf In and out of Hell [MP4-AAC](oan)\r\n \nhttp://imgchicken.com/images/57378449280730285217.png\r\n\r\n\r\nSince the release of the Bat Out of Hell album, Meat Loaf has possessed the kind\r\nof international status that few artists obtain. His larger-than-life persona and\r\nperformances are fuelled by a passion for theatre and storytelling. This candid\r\nprofile reveals the man and his music through his own testimony and from the\r\naccounts of those closest to him.\r\n\r\nMeat Loaf's life story is one of epic proportions - he survived a childhood of\r\ndomestic violence only to face years of record company rejection before eventually\r\nfinding global fame. Along the way he experienced bankruptcy, health scares, bust-ups\r\nand one of the greatest comebacks of all time. All this and more is explored in the\r\nfilm, which features behind-the-scenes footage of his recent Las Vegas residency\r\nplus plans for a new album featuring songs by Jim Steinman.\r\n\r\nThe film also revisits the Dallas of Meat Loaf's early years and includes insights\r\nfrom his high school friends, who reveal how Meat really got his famous moniker.\r\n\r\nAfter his mother died, Meat Loaf fled Texas for the bright lights of LA. He sang in\r\nitinerant rock bands, but no-one would give him a recording contract. By 1969 he was\r\nbroke and disillusioned. His break would take the form of a musical. He was offered\r\na part in Hair, having been invited to audition whilst working as a parking attendant\r\noutside the theatre. Shortly afterwards he met Jim Steinman and the road to success\r\nreally began. Yet the Hair gig was the beginning of an enduring love affair with\r\ntheatre that is reflected in his singing persona today.\r\n\r\nHis first album, the now legendary Bat Out of Hell, was initially rejected by scores\r\nof record companies, yet went on to spend a staggering 485 weeks in the UK charts. The\r\nwhole album is a masterwork of storytelling that Meat Loaf and Steinman worked on for\r\nfour years and then battled to get heard. Meat Loaf and those who worked on the album\r\nfrom Todd Rundgren to Ellen Foley - reflect on the songs, and celebrate the alchemy\r\nthat resulted in such a blistering back catalogue.\r\n\r\nWhen Bat Out Of Hell II was finally released 15 years after the first album, it defied\r\nindustry expectations, with I'd Do Anything for Love reaching number one in 28 countries.\r\nIt is considered one of the greatest comebacks in music history. More albums and hits\r\nwere to follow across the '90s and '00s, alongside a varied and successful acting career.\r\nMark Kermode examines some of the roles Meat Loaf made his own, in films as diverse as\r\nThe Rocky Horror Picture Show and Fight Club.\r\n\r\nHaving traversed the peaks and troughs of a career spanning the best part of 50 years,\r\nthis consummate performer finally reveals what spurs him on, in this, the inside story\r\nof a bat out of hell who continues to blaze a trail into the hearts and minds of millions.\r\n\r\n\r\n\r\nSCREENS\r\n \nhttp://imgchicken.com/images/56383871124492085735.png\r\n \nhttp://imgchicken.com/images/69456757643746537583.png\r\n \nhttp://imgchicken.com/images/12111340756849961061.png\r\n\r\nFORMAT:.......................: MP4\r\nFULLSIZE:.....................: 664 MiB\r\nRESOLUTION:...................: 720*404=16:9\r\nFRAME RATE:...................: 25.000 fps\r\nAUDIO AAC:....................: 256 Kbps [stereo]\r\nCHANNELS:.....................: 2 Front: L/R\r\nLANGUAGE:.....................: English\r\nVIDEO BITRATE:................: 1300 Kbps\r\nSUBTITLES:....................: NONE\r\nRUNTIME:......................: 59mn 26s\r\n\r\nPLEASE SEED - PLEASE SHARE - PLEASE UPLOAD","torrent":{"xt":"urn:btih:cc1ab3435e72fb8db0d3abda39b249ef7051279b","amp;dn":"BBC+%3D+Meat+Loaf+In+and+out+of+Hell+%5BMP4-AAC%5D%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc1ab3435e72fb8db0d3abda39b249ef7051279b","infoHashBuffer":{"type":"Buffer","data":[204,26,179,67,94,114,251,141,176,211,171,218,57,178,73,239,112,81,39,155]},"announce":[],"urlList":[]}}