{"title":"Rockafire Explosion Movie","uid":5300873,"size":930231307,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc7a38af5c793befa771590f989adea3b517be0d&amp;dn=Rockafire+Explosion+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SpicyBob","files":-1,"time":1264217001,"description":"In the early eighties, kids all over the US flocked to Showbiz Pizza for the rides, games, and animatronic rock band, The Rock-afire Explosion. Created by 23-year-old prodigy Aaron Fechter, The Rock-afire Explosion amazed children and adults alike before being mysteriously pulled from showrooms and replaced by the now popular Chuck-E-Cheese in the early nineties.\n\nNearly twenty years later, still profoundly affected by his experience at Showbiz Pizza, small-town disc-jockey Chris Thrash sought out Fechter and purchased a Rock-afire band of his own. Some clever programming on Chris' part, and the band was once again performing for millions, this time on\n\nThe Rock-afire Explosion reveals how Chris came to revive this fallen 80's gem, explores his and a number of other fan's obsessions with the animatronic band, and chronicles the rise and fall of Showbiz Pizza and what was once a 20 million dollar per-year venture for inventor Aaron Fechter. More than this, the film is a look at the importance of nostalgia, ever-changing media culture, and the eternal quest to stay young.\n\nFind out more at: http://www.rockafiremovie.com/\nalso wikipedia: http://en.wikipedia.org/wiki/The_Rock-afire_Explosion\nMovie available for purchase on Amazon. Contains over 40 minutes of additional video.\n\nIf you are having trouble playing the movie, try vlc. It plays everything.\nhttp://www.videolan.org/vlc/\n\nEnjoy","torrent":{"xt":"urn:btih:cc7a38af5c793befa771590f989adea3b517be0d","amp;dn":"Rockafire+Explosion+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc7a38af5c793befa771590f989adea3b517be0d","infoHashBuffer":{"type":"Buffer","data":[204,122,56,175,92,121,59,239,167,113,89,15,152,154,222,163,181,23,190,13]},"announce":[],"urlList":[]}}