{"title":"Operator Mono","uid":13538902,"size":273922,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cc8a43a6fa8d934f9777f9a53f20b5dfd98f5ea5&amp;dn=Operator+Mono&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1455466732,"description":"Typesetting is formal, handwriting is informal, and halfway in between is typewriting. Though typewriters haven’t been a fixture of our lives for decades, the look of typewritten letters is still instantly recognizable, making them an indispensable tool for designers. People always choose typewriter faces when they want readers to look past the anonymity of writing, and focus instead on the voice behind the words: the letter from the editor, the solemn report, and the charitable appeal are forever the province of the typewriter font. And because they strike a useful balance between earnestness and down-home charm, they’re perfect for text that risks taking itself too seriously, from corporate communications to cocktail menus.\r\n\r\nBut actual typewriter faces are notoriously difficult to work with. They never have the broad range of weights that designers need (let alone features like small caps), and their italics are rarely either distinctive or interesting. Their fixed-width construction — the requirement that each letter have the same horizontal dimension — gives them their interesting and recognizable artifacts (an I with long serifs, a squeezed M, and so on), but also disrupts the rhythm of text. What a designer ideally needs is a fully-fledged family of typefaces with the voice of typewriting, but none of its limitations, which is why we designed Operator.\r\n\r\nOperator builds on the aesthetic of typewriting, but sheds these mechanical constraints. Instead of fixed widths, it has natural widths, allowing letters to expand and contract to their traditional proportions. For situations that truly demand a fixed-width design, we created a companion family called Operator Mono. Operator Mono pushes the bounds of the style, offering a solid range of weights and colorful italics, both features that recommend the design for programming environments. In this short film, you’ll see how the needs of developers and designers came together in the Operator family","torrent":{"xt":"urn:btih:cc8a43a6fa8d934f9777f9a53f20b5dfd98f5ea5","amp;dn":"Operator+Mono","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8a43a6fa8d934f9777f9a53f20b5dfd98f5ea5","infoHashBuffer":{"type":"Buffer","data":[204,138,67,166,250,141,147,79,151,119,249,165,63,32,181,223,217,143,94,165]},"announce":[],"urlList":[]}}