{"title":"2014 - Legends - Season 1 - 10 (1280x720) Episodes","uid":12889231,"size":6588132060,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ccbe821ca2f9e0a803968bd97c70b2d220142eda&amp;dn=2014+-+Legends+-+Season+1+-+10+%281280x720%29+Episodes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"bnaron","files":12,"time":1449089423,"description":"2014 - Legends - Season 1 - 10 (1280x720) Episodes\r\n\r\nDescription Courtesy of: IMDb (http://www.imdb.com/title/tt2402137)\r\n\r\nFollows a deep-cover operative named Martin Odum, who has an uncanny ability to transform himself into a different person for each job. But his own identity comes into question when a mysterious stranger suggests that Martin isn't who he thinks he is.\r\n\r\nAll Episodes are: (Video codec: H.264, 1280x720p, 2000kbps, 23fps)\r\n\r\n\r\n2014-04-14 - 01 - Pilot (Audio codec: AAC, 48kHz, 192kbps, 2-Channel)\r\n\r\nMartin Odum has the uncanny ability to transform himself into a completely different person for each job. But he begins to question his own identity when a mysterious stranger suggests that Martin isn't the man he believes himself to be.\r\n\r\n\r\n2014-08-20 - 02 - Chemistry (Audio codec: AAC, 48kHz, 244kbps, 6-Channel)\r\n\r\nWhen a high school chemistry teacher and his family are kidnapped, DCO takes the case because the teacher is a former chemical weapons engineer for the Russian Army, hidden by the CIA in the Witness Protection Program. Martin, Crystal and Troy Buchannan go undercover to infiltrate the Chechen mob, rescue the family and stop the production of the deadly gas.\r\n\r\n\r\n2014-08-27 - 03 - Lords of War (Audio codec: AAC, 48kHz, 229kbps, 6-Channel)\r\n\r\nMartin assumes the legend of Dante Auerbach, an international arms dealer known as the 'Lord of War', in order to track the sale of VX gas, and rescue kidnapped chemist, Richard Hubbard. He makes contact with beautiful arms dealer Ana Paulanos, the right hand of a mysterious Chechen mobster, 'The Colonel'.\r\n\r\n\r\n2014-09-03 - 04 - Betrayal (Audio codec: AAC, 48kHz, 232kbps, 6-Channel)\r\n\r\nThe Colonel and Ana Paulanos are captured by DCO when they sell Martin a briefcase of VX that turns out to be bogus. In response, one of The Colonel's followers releases real VX on a crowded bus, threatening more attacks if The Colonel and Ana aren't released.\r\n\r\n\r\n2014-09-10 - 05 - Rogue (Audio codec: AAC, 48kHz, 235kbps, 6-Channel)\r\n\r\nMartin is put on leave after the confrontation with The Colonel. He begins looking into his own past and The Stranger's assertion that 'Martin Odum' is a legend. This off-book investigation leads him to a mysterious smuggler in Houston who may have the answers he needs. Martin assumes the legend of a Southern outlaw in order to infiltrate the smuggling operation and get close to Dobson.\r\n\r\n\r\n2014-09-17 - 06 - Gauntlet (Audio codec: AAC, 48kHz, 242kbps, 6-Channel)\r\n\r\nMartin takes Kyle Dobson into custody in the aftermath of a shoot-out with the smuggling crew. But when Dobson is wounded, Martin is forced to get him medical attention at a Houston Hospital. Dobson's mysterious employer, The Verax Corporation, sends a team of professional hitmen to retrieve Dobson, forcing Martin to take his prisoner on the run in a frantic escape back to Los Angeles.\r\n\r\n\r\n2014-09-24 - 07 - Quicksand (Audio codec: AAC, 48kHz, 239kbps, 6-Channel)\r\n\r\nMartin returns to DCO after the events in Houston and is presented with the case of a threat to assassinate a visiting Saudi Prince. The investigation leads Martin and Rice to a beautiful and charismatic female rights activist.\r\n\r\n\r\n2014-10-01 - 08 - Iconoclast (Audio codec: AAC, 48kHz, 236kbps, 6-Channel)\r\n\r\nMartin stays in legend as journalist Sebastian Egan to exonerate Hani Jabril and find the real assassins of Prince Abdullah. DCO is forced to pursue the investigation 'off book', ultimately leading Martin into his most dangerous stand off yet.\r\n\r\n\r\n2014-10-08 - 09 - Wilderness of Mirrors (Audio codec: AAC, 48kHz, 241kbps, 6-Channel)\r\n\r\nMartin manages to escape from an interrogation and finds out that Sonya and Aiden have been abducted. As he looks for them, he learns more information about his past.\r\n\r\n\r\n2014-10-08 - 10 - Identity (Audio codec: AAC, 48kHz, 241kbps, 6-Channel)\r\n\r\nMartin finds out that Verax could be plotting an assassination. He is also kidnapped and makes a stunning discovery about his own identity","torrent":{"xt":"urn:btih:ccbe821ca2f9e0a803968bd97c70b2d220142eda","amp;dn":"2014+-+Legends+-+Season+1+-+10+%281280x720%29+Episodes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccbe821ca2f9e0a803968bd97c70b2d220142eda","infoHashBuffer":{"type":"Buffer","data":[204,190,130,28,162,249,224,168,3,150,139,217,124,112,178,210,32,20,46,218]},"announce":[],"urlList":[]}}