{"title":"Antony Cyril Sutton - 1976 - Wall Street And FDR (177p) [Inua].p","uid":11322179,"size":467609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccde11f7cd31ed206e8208e834e1ce0ae0dd6f1b&amp;dn=Antony+Cyril+Sutton+-+1976+-+Wall+Street+And+FDR+%28177p%29+%5BInua%5D.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Inua1","files":1,"time":1414609005,"description":"Title: Wall Street and FDR   \nAuthor: Antony Cyril Sutton\nISBN-10: 1905570716\nISBN-13: 978-1905570713\n\nFranklin D. Roosevelt is frequently described as one of the greatest presidents in American history, remembered for his leadership during the Great Depression and Second World War. Antony Sutton challenges this received wisdom, presenting a controversial but convincing analysis. Based on an extensive study of original documents, he concludes that: \n* FDR was an elitist who influenced public policy in order to benefit special interests, including his own. \n* FDR and his Wall Street colleagues were 'corporate socialists', who believed in making society work for their own benefit. \n* FDR believed in business but not free market economics. \n\nSutton describes the genesis of 'corporate socialism' - acquiring monopolies by means of political influence - which he characterizes as 'making society work for the few'. He traces the historical links of the Delano and Roosevelt families to Wall Street, as well as FDR's own political networks developed during his early career as a financial speculator and bond dealer. \n\nThe New Deal almost destroyed free enterprise in America, but didn't adversely affect FDR's circle of old friends ensconced in select financial institutions and federal regulatory agencies. Together with their corporate allies, this elite group profited from the decrees and programs generated by their old pal in the White House, whilst thousands of small businesses suffered and millions were unemployed. \n\nWall Street and FDR is much more than a fascinating historical and political study. Many contemporary parallels can be drawn to Sutton's powerful presentation given the recent banking crises and worldwide governments' bolstering of private institutions via the public purse. This classic study - first published in 1975 as the conclusion of a key trilogy - is reproduced here in its original form. (The other volumes in the series are Wall Street and the Rise of Hitler and Wall Street and the Bolshevik Revolution.)","torrent":{"xt":"urn:btih:ccde11f7cd31ed206e8208e834e1ce0ae0dd6f1b","amp;dn":"Antony+Cyril+Sutton+-+1976+-+Wall+Street+And+FDR+%28177p%29+%5BInua%5D.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccde11f7cd31ed206e8208e834e1ce0ae0dd6f1b","infoHashBuffer":{"type":"Buffer","data":[204,222,17,247,205,49,237,32,110,130,8,232,52,225,206,10,224,221,111,27]},"announce":[],"urlList":[]}}