{"title":"Simon Schama - History of Britain 1776-2003 (Unabridged)","uid":4597931,"size":595642093,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cd3973448c5ebba15284356b3854524b95346210&amp;dn=Simon+Schama+-+History+of+Britain+1776-2003+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eddie1969","files":414,"time":1230078606,"description":"Audio Books : Misc. Educational : MP3/64Kbps : English\n\nA History of Britain by Simon Schama\n1776 - 2003 The Fate of an Empire\n\nRead by Stephen Thorne\n\nUnabridged recording on 18 CD's @ 64Kbs \n\n  \n\nReview\nThe Fate of Empire brings Simon Schama's stylish and absorbing History of Britain to a stirring close. Of the volumes in the trilogy, The Fate of Empire is the most subjective, as Schama offers his own account of how the British shaped much of the modern world, and in turn were reshaped as a nation and a people by the experience of revolution, empire and war.\n\nUnlike the previous volumes, Schama only pays lip-service to the familiar narrative of British history. The great, the good and the unsung are all there - the Lake poets, Queen Victoria, Benjamin Disraeli, Mary Seacole, Winston Churchill and George Orwell - but Schama uses them as voices through which a different history of Britain can be heard. Ireland, India, the urban poor, suffragettes and striking miners are all restored to the national story. The emphasis on empire (along with India and Ireland the largest subject-entry in the index) is particularly welcome, although the finest hour of empire - the First World War - is dealt with all too briefly.\n\nAlong the way Schama reveals himself once more as one of the world's finest cultural historians, with brilliant vignettes on Rousseau in England, the 1851 exhibition, Orwell's complex patriotism and much else, together with original insights on photography, the effect of empire on English vocabulary, and the post-war &quot;colouring&quot; of Britain. For beginners this is an excellent 21st century perspective on modern British history. For connoisseurs it is a refreshing reminder of how little British history the English really know\n\n","torrent":{"xt":"urn:btih:cd3973448c5ebba15284356b3854524b95346210","amp;dn":"Simon+Schama+-+History+of+Britain+1776-2003+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3973448c5ebba15284356b3854524b95346210","infoHashBuffer":{"type":"Buffer","data":[205,57,115,68,140,94,187,161,82,132,53,107,56,84,82,75,149,52,98,16]},"announce":[],"urlList":[]}}