{"title":"head first programming, a learner's guide to programming, using","uid":6148515,"size":17646876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd8ad2cc253f033ad9fef79dd4c209c5b82f75c8&amp;dn=head+first+programming%2C+a+learner%5C%27s+guide+to+programming%2C+using&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"DLAddict","files":1,"time":1296782561,"description":"head first programming, a learner's guide to programming, using the python language - ora 2009 &lt;a href=&quot;\nhttp://amzn.to/f9CwTT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/f9CwTT&lt;/a&gt;\n\n# Paperback: 448 pages\n# Publisher: O'Reilly Media; 1 edition (November 24, 2009)\n# Language: English\n# ISBN-10: 0596802374\n# ISBN-13: 978-0596802370\n\nLooking for a reliable way to learn how to program on your own, without being overwhelmed by confusing concepts? Head First Programming introduces the core concepts of writing computer programs -- variables, decisions, loops, functions, and objects -- which apply regardless of the programming language. This book offers concrete examples and exercises in the dynamic and versatile Python language to demonstrate and reinforce these concepts.\n\nLearn the basic tools to start writing the programs that interest you, and get a better understanding of what software can (and cannot) do. When you're finished, you'll have the necessary foundation to learn any programming language or tackle any software project you choose.\n\nWith a focus on programming concepts, this book teaches you how to:\n\n* Understand the core features of all programming languages, including: variables, statements, decisions, loops, expressions, and operators\n* Reuse code with functions\n* Use library code to save time and effort\n* Select the best data structure to manage complex data\n* Write programs that talk to the Web\n* Share your data with other programs\n* Write programs that test themselves and help you avoid embarrassing coding errors \n\nWe think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First Programming uses a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep.","torrent":{"xt":"urn:btih:cd8ad2cc253f033ad9fef79dd4c209c5b82f75c8","amp;dn":"head+first+programming%2C+a+learner%5C%27s+guide+to+programming%2C+using","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd8ad2cc253f033ad9fef79dd4c209c5b82f75c8","infoHashBuffer":{"type":"Buffer","data":[205,138,210,204,37,63,3,58,217,254,247,157,212,194,9,197,184,47,117,200]},"announce":[],"urlList":[]}}