{"title":"Micro XP Pro 1.11b","uid":8004418,"size":328209080,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cdb549143c430a66da955fd8d3e19da66df07bca&amp;dn=Micro+XP+Pro+1.11b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"DarkReverser","files":1,"time":1357853763,"description":"[i]From the creator of Micro XP Pro,\nDarkReverser Presents: [/i]\n\n[b]Micro XP Pro 1.11b[/b]\n\nDescription: The slimmest most functional, fastest, most secure copy of XP you can find on the planet. \n\n[b]-Fastest install, 10 minutes on modern systems including:[/b]\nWMP 11, IE 8, DirectX 9.0C + Managed Code, .Net 2.0, Visual C++ 2005, 2008, 2010 Runtimes, General Runtimes (To support all applications and games)\nINTEL (11.2.0.1006), AMD and ASMEDIA sata drivers (So you can install XP on modern hardware)\nUSB 3.0 drivers \n6 Themes (+Luna)\nOver 150 neatly organised utilities \nNtBackup,System Restore, Windows Firewall, Recovery Console\nNo Activation, No serial Needed, 100% Genuine, 100% Software compatibility \n\n[b]-Smaller ISO: 336MB ISO [/b]\n\n\n[b]What's New / Notes[/b]\n\n1.11b\n-Removed Language Files (Kept keyboard layouts) Wasn't working, I will therefore direct people to use a language pack that does work\n-Added Terminal Services  \n-Added Option to Install Recovery Console ( run i.e., d:i386winnt32.exe /cmdcons ) You must be connected to the internet.\n-Added SysTracer 2.6 \n\n1.11\n- Complete rebuild to support all languages, eliminate many bugs and past issues, and achieve a cleaner more polished extra stable build\n- Updated scripts/drivers/security updates\n\n[b]Instructions[/b]\n\nExtract with Winrar 4.20.\n\nLet's customize the ISO to you.\nAre you going to be sharing files or printers in a network, if so choose the workgroup tweak or no tweaks.\nDo you require everything to work &quot;out of the box&quot;, or are you a beginner, if so choose no tweaks.\nIs this purely a gaming system, you desire upmost performance and security and know what services are in XP, if so choose the regular tweaks.\nNow that you've made your choice, go ahead and open the Iso with MagicISO or UltraISO.\nGo into i386, now go back to your download folder and select the tweak file you picked, now drag it over, it will for overwrite now say yes.  Click Save.\n\nTime to burn\nBurn with imgburn or you're favorite burning software with the verification option checked.\n\nConfigure your BIOS\nRestart your computer, keep pressing repeadedly the del button, this will get you into bios.\nFind the boot options, and pick whatever optical drive Micro XP Pro is in.\n\nChoose your partition and the rest of the setup is automatic.\nNote you do not need to activate Micro XP Pro; no I did not crack it, I removed the activation component.\nNote, despite this Microsoft will recognise Micro XP Pro as genuine, and it will work all Microsoft software such as Microsoft Office, Security Essentials etc.\n\n[b]Languages[/b]\nPlease use the following language pack:\nPlease download this language pack for additional languages:\nCreate a system restore point before use, oherwise you may not be able to go back to your original language.\nIt's a clean, but stuborn language pack; the language you choose will stick :)\n\n[b]Warranty[/b]\nMicro XP Pro will install with &quot;easy install&quot; from VMware, but much of what makes this release great will not be installed.  Google &quot;easy install vmware&quot; for more information.\nNo warranty is offered to those who modify this ISO.  \nMicro XP Pro works great in virtual machines, but drivers in this environment are often not stable; virtual machines are imperfect emulators.\nIn Virtual Machines, software like Alcohol 120% and Daemon Tools which install drivers will not function properly.\nMake sure you pick the tweak file that is for you, see &quot;Let's customize the ISO to you&quot;\nIt is recommend to use Windows Update via Internet Explorer 8\n","torrent":{"xt":"urn:btih:cdb549143c430a66da955fd8d3e19da66df07bca","amp;dn":"Micro+XP+Pro+1.11b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdb549143c430a66da955fd8d3e19da66df07bca","infoHashBuffer":{"type":"Buffer","data":[205,181,73,20,60,67,10,102,218,149,95,216,211,225,157,166,109,240,123,202]},"announce":[],"urlList":[]}}