{"title":"CLASSIC XXX - ROXANNA (1970)","uid":4097349,"size":733231932,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cdc02364b46174157270caf98d5a801175e30f98&amp;dn=CLASSIC+XXX+-+ROXANNA+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bytor10464","files":1,"time":1206389048,"description":"Director: Nick Phillips \n \nLabel: Alternative Cinema \n \n \nGenre: Exploitation \nCountry: USA \nYear: 1970 \n \n  \n \n\nUncut! Never-before-released erotic sexploitation film from Nick Philips. Transferred from a recently discovered 35mm negative!\n\nSeeing its first-ever release on home video is the 1970 film Roxanna directed by sexploitation auteur Nick Phillips and starring legendary Swedish sex-siren Uschi Digart. An amazing exploitation film from the grindhouse glory days. This Uncut Theatrical Version is partnered with the ultra-sexy Retro Seduction Cinema Remake starring Misty Mundae (Play-Mate of the Apes), Darian Caine (Mistress Frankenstein) and Katie Jordon (Erotic Witch Project 2).\n\nRoxanna (Misty Mundae) knows who she wants, what she craves, and how to get it, and nothing or no one is going to stop her. She spends her nights and days experimenting with her sweet young body - satisfying a hot erotic appetite with an endless parade of female lovers. But Roxanna's obsession with exquisite and limitless pleasures of the flesh begins to take over her life, and soon lesbian desires surge beyond her control. Naughty fantasies become mouth-watering reality, and Roxanna loses herself completely to this world of delectable sin. With the final realization that she has taken things too far - farther than her mind and body can handle - Roxanna must come to terms with her insatiable libido, or face the devastating consequences \n \n\n\n\nIf you download, please be kind enough to seed, rate and comment. \n\nALL KILLER / NO FILLER! - - NEVER EXTRA JUNK FILES!","torrent":{"xt":"urn:btih:cdc02364b46174157270caf98d5a801175e30f98","amp;dn":"CLASSIC+XXX+-+ROXANNA+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdc02364b46174157270caf98d5a801175e30f98","infoHashBuffer":{"type":"Buffer","data":[205,192,35,100,180,97,116,21,114,112,202,249,141,90,128,17,117,227,15,152]},"announce":[],"urlList":[]}}