{"title":"Gay- [Randy Blue] Romeo Alfonso, Austin Wolf, Sean Zevran","uid":15551813,"size":432396843,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cdc31b194687ac74fe40207ea402a5644a797a2e&amp;dn=Gay-+%5BRandy+Blue%5D+Romeo+Alfonso%2C+Austin+Wolf%2C+Sean+Zevran&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"toepica","files":1,"time":1471032177,"description":"Silverlake. It is full of artists, hipsters and bears, oh my. Austin is just sipping on his coffee and celebrating the fact that Justin Owen is the newest movie star he discovered. He decided to continue his celebration into the evening at the Los Angeles Daddy Bar, The Faultline. There is a party going on called, Raunch, and Austin is ready to get down and dirty. He enters the dark bar. Everyone is drinking and having fun. He grabs a beer and starts watching the gay porn on the screen. But he is then distracted by the two gogo dancers at the front. Romeo Alfonso his shaking his money maker in a speedo while Sean Zevran dances in a jock strap. Austin has to buy them. He starts tipping them dollar after dollar. And these two see this muscled beef cake in front of them and decide right then and there to take the rest of the night off. They pull him in a back room and start to make out. Clothes start to come off and slowly the last patrons leave the bar. This leaves the place open for these three to play. Out by the pool table, Sean gets on his knees and starts to suck them both off. Next Romeo gets on his knees and starts slurping down Austin and Sean as well. Austin wants to get something in his mouth. He pulls Romeo up and eats his ass while sucking on Sean and his big fat cock. Sean then turns around so that Austin can get to his ass. Next Romeo sits back and lets Austin suck him off while Sean rims him. But they are ready to take this to the next level. It is time to fuck. Austin slides into Sean while they both suck off Romeo on the bar. Next, Romeo sits back and lets Sean ride his long hard cock, while Austin sucks on Sean and tries to take him all the way down to the base. Sean screams out as he is sandwiched between a cock and a mouth. Finally Romeo lays Sean down on the pool table and fucks him on his back. Austin feeds him his cock. They fuck until hey all get close. They all cum one after another all over Sean. Sean takes both loads in his mouth. Then the three start to make out passionately. Just another night in Silverlake. Where the action never ends until the sun comes up. Welcome to L.A","torrent":{"xt":"urn:btih:cdc31b194687ac74fe40207ea402a5644a797a2e","amp;dn":"Gay-+%5BRandy+Blue%5D+Romeo+Alfonso%2C+Austin+Wolf%2C+Sean+Zevran","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdc31b194687ac74fe40207ea402a5644a797a2e","infoHashBuffer":{"type":"Buffer","data":[205,195,27,25,70,135,172,116,254,64,32,126,164,2,165,100,74,121,122,46]},"announce":[],"urlList":[]}}