{"title":"The Time Traveller's Guide to Medieval England  (epub/mobi)","uid":8649346,"size":4484717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce625f1451c6793050a0bd60c12f36a51abb4a21&amp;dn=The+Time+Traveller%27s+Guide+to+Medieval+England++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Robin1966","files":7,"time":1373063544,"description":"The Time Traveller's Guide to Medieval England\nWritten by Ian Mortimer\nRetail epub and mobi\nUnabridged\n\nThe past is a foreign country.\n\nThis is your guidebook.\n\nA time machine has just transported you back to the fourteenth century. What do you see? How do you dress? How do you earn a living and how much are you paid? What sort of food will you be offered by a peasant or a monk or a lord? And more important, where will you stay?\n\nThe Time Traveler's Guide to Medieval England is not your typical look at a historical period. This radical new approach shows us that the past is not just something to be studied; it is also something to be lived. All facets of everyday life in this fascinating period are revealed, from the horrors of the plague and war to the ridiculous excesses of roasted larks and medieval haute couture.\n\nThrough the use of daily chronicles, letters, household accounts, and poems of the day, Morti-mer transports you back in time, providing answers to questions typically ignored by traditional historians. You will learn how to greet people on the street, what to use as toilet paper, why a physician might want to taste your blood, and how to know whether you are coming down with leprosy.\n\nFrom the first step on the road to the medieval city of Exeter, through meals of roast beaver and puffin, Mortimer re-creates this strange and complex period of history. Here, the lives of serf, merchant, and aristocrat are illuminated with re-markable detail in this engaging literary journey. The result is the most astonishing social history book you're ever likely to read: revolutionary in its concept, informative and entertaining in its detail, and startling for its portrayal of humanity in an age of violence, exuberance, and fear.\n\n\nEnjoy and Seed!!\t\t","torrent":{"xt":"urn:btih:ce625f1451c6793050a0bd60c12f36a51abb4a21","amp;dn":"The+Time+Traveller%27s+Guide+to+Medieval+England++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce625f1451c6793050a0bd60c12f36a51abb4a21","infoHashBuffer":{"type":"Buffer","data":[206,98,95,20,81,198,121,48,80,160,189,96,193,47,54,165,26,187,74,33]},"announce":[],"urlList":[]}}