{"title":"Martin Gardner Complete Mathematical Games from Scientific Ameri","uid":4133446,"size":374334246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cee35345ca92ad177b557f419bad9255706606c7&amp;dn=Martin+Gardner+Complete+Mathematical+Games+from+Scientific+Ameri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"cobalt59","files":20,"time":1208145257,"description":"The entire collection of Martin Gardner\\\\\\&amp;#039;s Scientific American columns on one searchable CD! The Mathematical Games column ran in Scientific American from 1956 to 1986. In these columns Gardner introduced hundreds of thousands of readers to the delights of mathematics and of puzzles and problem solving. His column broke such stories as Rivest, Shamir and Adelman on public-key cryptography, Mandelbrot on fractals, Conway on Life, and Penrose on tilings. He enlivened classic geometry and number theory and introduced readers to new areas such as combinatorics and graph theory. The CD contains the following books: 1. Hexaflexagons and Other Mathematical Diversions 2. The Second Scientific American Book of Mathematical Puzzles and Diversions 3. New Mathematical Diversions 4. The Unexpected Hanging and Other Mathematical Diversions 5. Martin Gardners 6th Book of Mathematical Diversions from Scientific American 6. Mathematical Carnival 7. Mathematical Magic Show 8. Mathematical Circus 9. The Magic Numbers of Dr. Matrix 10. Wheels, Life, and Other Mathematical Amusements 11. Knotted Doughnuts and Other Mathematical Entertainers 12. Time Travel and Other Mathematical Bewilderments 13. Penrose Tiles to Trapdoor Ciphers 14. Fractal Music, Hypercards, and more Mathematical Recreations from Scientific American 15. The Last Recreations: Hydras, Eggs, and Other Mathematical Mystifications. A profile and interview with Martin Gardner is included in this collection","torrent":{"xt":"urn:btih:cee35345ca92ad177b557f419bad9255706606c7","amp;dn":"Martin+Gardner+Complete+Mathematical+Games+from+Scientific+Ameri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cee35345ca92ad177b557f419bad9255706606c7","infoHashBuffer":{"type":"Buffer","data":[206,227,83,69,202,146,173,23,123,85,127,65,155,173,146,85,112,102,6,199]},"announce":[],"urlList":[]}}