{"title":"Self-Assessment in Head and Neck Surgery and Oncology [StormRG]","uid":11850031,"size":28259157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cef1338f08d9a4d5bcbc5924f16d0c69c2e0f851&amp;dn=Self-Assessment+in+Head+and+Neck+Surgery+and+Oncology+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"0xmovva","files":2,"time":1430065399,"description":"TITLE/EDITION Self-Assessment in Head and Neck Surgery and Oncology, 1e\nBy: James Paul O'Neill MD MB FRCSI MBA MMSc ORL-HNS (Author), Jatin P. Shah MD MS (Surg) PhD (Hon) FACS Hon. FRCS (Edin) Hon. FRACS Hon. FDSRCS (Lond) (Author)\nSeries: Expert Consult Title: Online + Print\nPaperback: 280 pages\nPublisher: Saunders; 1 Pap/Psc edition (June 26, 2014)\nLanguage: English\nISBN-10: 0323260039\nISBN-13: 978-0323260039\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nSelf-Assessment in Head and Neck Surgery and Oncology is a one-of-a-kind, comprehensive medical reference book that showcases international, expert knowledge and judgment in the practice of head and neck surgery and oncology. It offers a variety of true/false statements and multiple-choice questions, as well as patient and case histories, coverage of the newest technologies, and much more. This brand-new resource is perfectly suited for otolaryngology residents, oncologists, and surgeons who wish to measure their understanding of how to effectively manage the day-to-day problems and issues arising in patients with neoplasms of the head and neck.\n\nTest your expertise. Various forms of self-assessment include true/false statements and multiple-choice questions throughout.\nTake advantage of patient and case histories accompanied by real-life photographs and scans.\nReference the correct answer to every question, which is followed by a bulleted list of the minimum core knowledge required for that particular area.\nAccess the most current information on new technologies, outcomes data, results of clinical trials, and future directions.\nFurther your research with a list of suggested readings included in each chapter","torrent":{"xt":"urn:btih:cef1338f08d9a4d5bcbc5924f16d0c69c2e0f851","amp;dn":"Self-Assessment+in+Head+and+Neck+Surgery+and+Oncology+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef1338f08d9a4d5bcbc5924f16d0c69c2e0f851","infoHashBuffer":{"type":"Buffer","data":[206,241,51,143,8,217,164,213,188,188,89,36,241,109,12,105,194,224,248,81]},"announce":[],"urlList":[]}}