{"title":"Selected Letters 1960-1970 volume 1 Charles Bukowski - Screams F","uid":11602199,"size":649015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf209e56bbdc576e736592aabd3310ba13183641&amp;dn=Selected+Letters+1960-1970+volume+1+Charles+Bukowski+-+Screams+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Inua1","files":1,"time":1417367472,"description":"Title: Screams from the Balcony: Selected Letters 1960-1970, Vol. 1\t\nAuthor: Charles Bukowski\nPaperback: 384 pages\nPublisher: Black Sparrow Press; Re-issue edition (May 30, 2002)\nLanguage: English\nISBN-10: 0876859147\nISBN-13: 978-0876859148\n\nSummary: Screams from the Balcony is a collection of letters chronicling Charles Bukowski's life as he tries to get published and work at a postal office, all while drinking and gambling.\n\n\nDescription: \nThis wonderful collection of letters chronicles Bukowski's life from his first days as a poet having meager success through his resignation from his postal job to pursue writing as his sole source of income. In between, the letters reveal in raw and uncensored fashion how a hard-drinking, hard-living man followed his own vision of poetic truth and artistic integrity. Earlier letters are written to the few editors, poets and admirers who had become aware of Bukowski's wild poetry. In them, we see the 40-year-old author struggling to make ends meet through an alcoholic stupor of which he is neither ashamed nor apologetic. We read of his thrill as his first book appears-- directly in the aftermath of the assassination of JFK. Even as his fame grows and his friends are convinced that he has made it, Bukowski remains in ill health and financial insecurity. The honesty, humour and lack of pretension in these letters make them a must for Bukowski fans and an engaging read for anyone interested in literary lives. Reproductions of letters and an afterword by Cooney round out the volume nicely. \n\nHere we witness the angry, boozing, brooding, bitter poet, still unable to quit his day job, hustling his work. But he also appears inspired and hard-edged, drawing strength from his raw self-expression, his uncompromising stance as the ultimate outsider, his relentless rage, and his ability to survive in spite of himself. These letters from 1960 through 1970 reveal Bukowski in his glory--toothaches, hangovers, haemorrhoids, and all--as a manic-depressive for all seasons. His persona, so closely linked to his pathology, is as apparent in his correspondence as in his poetry and fiction, making these selected letters ideal for Bukowskiphiles. One wonders, however, just how many others will delve into this stuff. Bukowski is perversely intriguing, attracting the kind of attention one usually reserves for grisly train wrecks. Stay tuned--this is only the first volume. Benjamin Segedin --This text refers to an out of print or unavailable edition of this title.\n\n\nBiography\nCharles Bukowski is one of America's best-known contemporary writers of poetry and prose, and, many would claim, its most influential and imitated poet. He was born in Andernach, Germany, and raised in Los Angeles, where he lived for fifty years. He published his first story in 1944, when he was twenty-four, and began writing poetry at the age of thirty-five. He died in San Pedro, California, on March 9, 1994, at the age of seventy-three, shortly after completing his last novel, Pulp (1994)","torrent":{"xt":"urn:btih:cf209e56bbdc576e736592aabd3310ba13183641","amp;dn":"Selected+Letters+1960-1970+volume+1+Charles+Bukowski+-+Screams+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf209e56bbdc576e736592aabd3310ba13183641","infoHashBuffer":{"type":"Buffer","data":[207,32,158,86,187,220,87,110,115,101,146,170,189,51,16,186,19,24,54,65]},"announce":[],"urlList":[]}}