{"title":"Rosemary Clooney Greatest Hits remastrs 320k (musicfromrizzo)","uid":6732813,"size":490432227,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf320597b4cff0086cd66098d4195a86ab564096&amp;dn=Rosemary+Clooney+Greatest+Hits+remastrs+320k+%28musicfromrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"musicfromrizzo","files":-1,"time":1318222211,"description":"Ms. Rosemary Clooney Greatest Hits and more 320k\nplus remastered tracks included where indicated (musicfromrizzo)\n\n\nI love this gal and am completely thrilled each time I hear her sing\nCorazon De Melon (Watermelon Heart) or Mambo Italiano among other\nof her great songs including Sway and Come On-A My House\n\nThis was the Irish gal with an Italian understanding which comes\nfrom human strength and goodness of spirit that knows no limit!\n\nIn the end she was a gal from Germany who knew how\nto reach out to all that are kin - what a thrill that is!\n\nenjoy all her great hits here along with added bonus songs\nand remastered tracks where available - including mambo Italiano\n- you found it here first!\n\n\nMichael Rizzo Chessman\nmusicfromrizzo\n\n\nRosemary Clooney - A Nightingale Sang In Berkeley Square (Remastered)\nRosemary Clooney - A You're Adorable (The Alphabet Song)\nRosemary Clooney - Be My Life's Companion\nRosemary Clooney - Beautiful Brown Eyes\nRosemary Clooney - Bewitched, Bothered And Bewildered (Remastered)\nRosemary Clooney - Blues In The Night\nRosemary Clooney - Botch-A-Me (Ba-Ba Baciami Piccina)\nRosemary Clooney - Buffalo Gals (With Bing Crosby) (Remastered)\nRosemary Clooney - Come In From The Rain (Remastered)\nRosemary Clooney - Come On-A My House\nRosemary Clooney - Corazon De Melon (Watermelon Heart) (Remastered)\nRosemary Clooney - Count Your Blessings (Instead Of Sheep)\nRosemary Clooney - Get Me To The Church On Time (Remastered)\nRosemary Clooney - Grieving For You\nRosemary Clooney - Half As Much (Remastered)\nRosemary Clooney - Here's That Rainy Day (Remastered)\nRosemary Clooney - Hey There\nRosemary Clooney - I Wish I Wuz (Hi Ho Fiddle Dee Dee)\nRosemary Clooney - I'm So Lonesome I Could Cry (Remastered)\nRosemary Clooney - I'm Waiting Just For You\nRosemary Clooney - If I Had A Penny\nRosemary Clooney - If Teardrops Were Pennies\nRosemary Clooney - It Never Entered My Mind (Remastered)\nRosemary Clooney - It's Like Taking Candy From A Baby\nRosemary Clooney - It's Only A Papermoon (Remastered)\nRosemary Clooney - Just The Way You Are (Remastered)\nRosemary Clooney - Lonely Am I (Remastered)\nRosemary Clooney - Long Ago And Far Away (Remastered)\nRosemary Clooney - Love Is Here To Stay (Remastered)\nRosemary Clooney - Love Won't Let You Get Away (With Bing Crosby) (Remastered)\nRosemary Clooney - Mambo Italiano (Remastered)\nRosemary Clooney - Meditation (Remastered)\nRosemary Clooney - Medley - These Foolish Things (Remastered)\nRosemary Clooney - Mixed Emotions\nRosemary Clooney - Nice Work If You Can Get It (Remastered)\nRosemary Clooney - Sentimental Journey (Remastered)\nRosemary Clooney - Shine -wear a smile! (Remastered)\nRosemary Clooney - Shine On Harvest Moon (Remastered)\nRosemary Clooney - Sisters\nRosemary Clooney - South Rampart Street Parade (Remastered)\nRosemary Clooney - Spring Is Here (Remastered)\nRosemary Clooney - Sway (Remastered)\nRosemary Clooney - Sweet Besty From Pike (Remastered)\nRosemary Clooney - Tenderly (Remastered)\nRosemary Clooney - Thanks For The Memory (Remastered)\nRosemary Clooney - That Old Black Magic (Remastered)\nRosemary Clooney - The Days Of Wine And Roses (Remastered)\nRosemary Clooney - The Shadow Of Your Smile (Remastered)\nRosemary Clooney - They Can't Take That Away From Me (Remastered)\nRosemary Clooney - This Can't Be Love (Remastered)\nRosemary Clooney - This Ole House\nRosemary Clooney - Tomorrow I'll Dream And Remember (Remastered)\nRosemary Clooney - Too Old To Cut The Mustard\nRosemary Clooney - Who Kissed Me Last Night (Remastered)\nRosemary Clooney - Why Shouldn't I (Remastered)\nRosemary Clooney - Will You Still Be Mine (Remastered)\nRosemary Clooney - Ya Got Class (Remastered)\nRosemary Clooney - You Belong To Me (Remastered)\nRosemary Clooney - You Make Me Feel So Young (Remastered)\nRosemary Clooney - You Started Something\nRosemary Clooney - You'll Never Know (Remastered)\nRosemary Clooney - You're In Kentucky Sure As You're Born (Remastered)\nRosemary Clooney - You're Just In Love\n","torrent":{"xt":"urn:btih:cf320597b4cff0086cd66098d4195a86ab564096","amp;dn":"Rosemary+Clooney+Greatest+Hits+remastrs+320k+%28musicfromrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf320597b4cff0086cd66098d4195a86ab564096","infoHashBuffer":{"type":"Buffer","data":[207,50,5,151,180,207,240,8,108,214,96,152,212,25,90,134,171,86,64,150]},"announce":[],"urlList":[]}}