{"title":"Woven Hand - Consider the Birds (2004) [192]","uid":3648629,"size":57059992,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf3e916a0706c9c422a676cd41e44103992b0fd3&amp;dn=Woven+Hand+-+Consider+the+Birds+%282004%29+%5B192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"epeb","files":10,"time":1175001230,"description":"As one third of Denver, CO, progressive country-tinged outfit 16 Horsepower, David Eugene Edwards established himself as a songwriter with a knack for injecting his dense, cryptic, and dark moods into his music, and with his second outing under his solo, side project guise, Wovenhand, Edwards continues down a similar path. For the majority of Consider the Birds, Edwards truly embraces the &quot;solo&quot; tag by performing every instrument, but on select tracks, such as the tensional dirge that opens the record, &quot;Sparrow,&quot; Eugene employs a tasteful yet powerful band as a counterweight to his more blatant experimentations. It is a testament to Edwards&amp;#039; vision that over the course of its 40 minutes, Consider the Birds never feels schizophrenic, since the album constantly flirts with an unfocused recklessness. Drones and tom-heavy percussion abound on songs such as &quot;Oil on Panel,&quot; and Edwards often saddles them up with fractured samples, melodies that tease dissonances, and his strong yet quavering voice. The whole concoction then circles around itself like a rickety, wooden roller coaster filled with coincidental assemblages of complementing sounds. One can&amp;#039;t help but wonder how overwrought Edwards must be when he&amp;#039;s practicing his music, but Consider the Birds once again affirms, no matter how emotional and extended he might be, Edwards never seems to be toting an empty heart. \n","torrent":{"xt":"urn:btih:cf3e916a0706c9c422a676cd41e44103992b0fd3","amp;dn":"Woven+Hand+-+Consider+the+Birds+%282004%29+%5B192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3e916a0706c9c422a676cd41e44103992b0fd3","infoHashBuffer":{"type":"Buffer","data":[207,62,145,106,7,6,201,196,34,166,118,205,65,228,65,3,153,43,15,211]},"announce":[],"urlList":[]}}