{"title":"Cannabis Collection - Strain Hunters","uid":7403689,"size":2687834112,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cf46753e3866a4989c578342f6506f5eec38bcfa&amp;dn=Cannabis+Collection+-+Strain+Hunters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GRNS3","files":-1,"time":1341175765,"description":"\n\n\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nStrain Hunters - Expedition to Malawi\n\nStrain Hunters is a series of documentaries aimed at informing the general public about the quest for the preservation of the cannabis plant in the form of particularly vulnerable landraces originating in the poorest areas of the planet.\n\nThe sole intent of Strain Hunters is to identify, locate and retrieve cannabis landraces that have not yet been studied, in order to give scientists and doctors the possibility to further enhance knowledge of the cannabis plant in the medicinal field. Many previously unknown cannabinoid profiles are contained in cannabis landraces originating from areas where there is no possibility of scientific research.\n\nOne day these plants could be helpful in developing better medications for the sick and the suffering. We feel it is our duty to preserve as many cannabis landraces in our genetic database, and by breeding them into other well-studied medicinal strains for the sole purpose of scientific research.\n\nDuring the making of the Strain Hunters documentaries no harm was done to any person, animal, plant, or the environment. All carbon emissions generated by this project have been offset by planting thousands of seeds.\n\nThe Strain Hunters documentaries have the defined and limited purpose of information to the general public. Strain Hunters do not endorse or promote illegal activities of any kind.\n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n","torrent":{"xt":"urn:btih:cf46753e3866a4989c578342f6506f5eec38bcfa","amp;dn":"Cannabis+Collection+-+Strain+Hunters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf46753e3866a4989c578342f6506f5eec38bcfa","infoHashBuffer":{"type":"Buffer","data":[207,70,117,62,56,102,164,152,156,87,131,66,246,80,111,94,236,56,188,250]},"announce":[],"urlList":[]}}