{"title":"Ricky Gervais - Life's Too Short + Derek - TVrip - Xvid - Slimoo","uid":8322089,"size":7578828800,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cfe9599451069a03054be94095457c7ef0eb5847&amp;dn=Ricky+Gervais+-+Life%27s+Too+Short+%2B+Derek+-+TVrip+-+Xvid+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"_Slimoo_","files":20,"time":1364704239,"description":"Life's Too Short - Series 01 - TVrip - Xvid\n\n\n\n\nMockumentary written by Ricky Gervais and Stephen Merchant in which Britain's pre-eminent dwarf actor Warwick Davis plays a spoof version of himself.\n\n With his career on the slide, a massive tax bill caused by his useless accountant, and a wife who's divorcing him, the showbiz actor has no choice but to open his doors to a film crew 24/7. Maybe living his life like an open wound will get him back on top? The film crew charts Warwick's every move as he tries to maintain his pride and self-respect in some very unusual situations.\n\n Warwick plays a fictional version of himself where he is desperate, conniving, fame-hungry and self-centred, but always gets his comeuppance.\n\n He runs a talent agency, Dwarves For Hire, for small people but is always taking the best jobs for himself.\n\n Being a &quot;showbiz dwarf&quot; creates many an unusual situation for Warwick and he is constantly trying to use this to his advantage - it's just a shame that nobody recognises him without his costumes...\n\n Gervais said at the Banff World Television Festival earlier this year: &quot;It's the funniest thing we've ever done.&quot; He added this comedy is &quot;pure funny&quot; without the pathos of The Office or the drama of Extras. &quot;Warwick, in real life, is an actor and runs a company so we are taking that and skewing it. We are giving him small man complex, making him jealous, manipulative and self-obsessed.&quot;\n\n\n\n\n\n\n\n\nLife's Too Short - S01 - E01 - Liam Neeson\nLife's Too Short - S01 - E02 - Johnny Depp\nLife's Too Short - S01 - E03 - Helena Bonham Carter\nLife's Too Short - S01 - E04 - Steve Carell\nLife's Too Short - S01 - E05 - Les Dennis, Keith Chegwin, Shaun Williamson\nLife's Too Short - S01 - E06 - Cat Deeley  \nLife's Too Short - S01 - E07 - Sting, Sophie Ellis-Bextor\nLife's Too Short - S01 - E08 - Val Kilmer, Les Dennis, Keith Chegwin, Shaun Williamson  \nLife's Too Short - S01 - E09 - The Making Of Life's Too Short\n\n\n\n\n\nFormat                                   : AVI\nFormat/Info                              : Audio Video Interleave\nFile size                                : 348 MiB\nDuration                                 : 28mn 57s\nOverall bit rate                         : 1 678 Kbps\n\nCodec ID                                 : XVID\nCodec ID/Hint                            : XviD\nDuration                                 : 28mn 57s\nBit rate                                 : 1 561 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 416 pixels\nDisplay aspect ratio                     : 16:9\n\n\nPlus\n\nDerek - Series 01 (All 8 Episodes)\n\nComic Relief 2013 - David Brent\n\nRicky Gervais - Golden Years\n\nWarwick Davis And The Seven Dwarfs Of Auschwitz\n\n\n\n\n.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:cfe9599451069a03054be94095457c7ef0eb5847","amp;dn":"Ricky+Gervais+-+Life%27s+Too+Short+%2B+Derek+-+TVrip+-+Xvid+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe9599451069a03054be94095457c7ef0eb5847","infoHashBuffer":{"type":"Buffer","data":[207,233,89,148,81,6,154,3,5,75,233,64,149,69,124,126,240,235,88,71]},"announce":[],"urlList":[]}}