{"title":"The Duellists [DivX - Ita Eng Mp3 - Sub Ita Eng Fra Ger]","uid":5300119,"size":1242718895,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d13369aea7a8a2d0730adf8dc9b8ccf83cc533a7&amp;dn=The+Duellists+%5BDivX+-+Ita+Eng+Mp3+-+Sub+Ita+Eng+Fra+Ger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"RDaneel20","files":3,"time":1264191557,"description":"The Duellists [DivX - Ita Eng Mp3 - Sub Ita Eng Fra Ger][Tntvillage.Scambioetico]\n\n\n\n\nI duellanti\nThe Duellists (1977)\n\n\nCast: \n\n   * Keith Carradine - D'Hubert\n    * Harvey Keitel - Feraud\n    * Albert Finney - Fouche\n    * Edward Fox - Colonel\n    * Cristina Raines - Adele\n    * Robert Stephens - Gen. Treillard\n    * Tom Conti - Dr. Jacquin\n    * John McEnery - Chevalier\n    * Diana Quick - Laura\n    * Alun Armstrong - Lacourbe\n    * Maurice Colbourne - Second\n    * Gay Hamilton - Maid\n    * Meg Wynn Owen - Leonie\n    * Jenny Runacre - Mme. de Lionne\n\n\n\n\nThe Duellists is a 1977 film, which was Ridley Scott's first feature film as a director. It won the Best Debut Film award at the 1977 Cannes Film Festival.[1] The basis of the screen play is the Joseph Conrad short story The Duel (U.S. title: Point of Honor) published in A Set of Six.\nThe film has been compared to Stanley Kubrick's Barry Lyndon. In both films, duels play an essential role. In his commentary for the DVD release of his film Scott comments that he was trying to emulate the lush cinematography of Kubrick's film, which approached the naturalistic paintings of the era depicted.\n\nThe film is lauded for its historically authentic portrayal of Napoleonic uniforms and military conduct, as well as its generally accurate early-nineteenth-century fencing techniques as recreated by fight choreographer William Hobbs.\n\nThe main locations used for shooting the movie were in and around Sarlat-la-CanÃƒÂ©da in the Dordogne region of France.\n\n\nPlot:\nSet during the Napoleonic Wars, it features two French Hussar officers, Armand d'Hubert (Keith Carradine) and Gabriel FÃƒÂ©raud (Harvey Keitel). A misunderstanding between them over an initially minor incident becomes a quarrel that turns into a bitter, long-drawn out feud over the following fifteen years, interwoven with the larger conflict that provides its backdrop. At the beginning, FÃƒÂ©raud is the one who jealously guards his honor and repeatedly demands satisfaction anew when a duelling encounter ends inconclusively; he aggressively pursues every opportunity to locate and duel with his foe.\n\nAs the story progresses, d'Hubert also finds himself caught up in the contest. He is unable to refuse FÃƒÂ©raud's repeated challenges to duel or to walk away because of the rigid code of honour. The feud persists through the different campaigns of the Napoleonic war, and on into the period of the Bourbon restoration which follows. When the story begins, both men are lieutenants, and over time both rise through the ranks to reach the rank of General.\n\nAt times Feraud and d'Hubert meet but are of different rank in the army, which due to army regulations prevents them from duelling, but whenever both are of the same rank and in the same place, Feraud immediately issues a challenge. Each comes close to fatally wounding the other, d'Hubert being critically wounded in a duel with small swords, FÃƒÂ©raud later being slashed in a joust on horseback with cavalry sabres and both of them nearly killing each other in an inconclusive combat with heavy sabres inside a barn. During the retreat from Moscow, another duel (this time with pistols) almost takes place, but the two must act together to survive when they are attacked by Cossacks.\n\nAfter the fall of Napoleon, d'Hubert marries and becomes a respected member of the restored aristocracy and a General of Brigade in the new French Army, while FÃƒÂ©raud is an embittered member of the anti-monarchist party. Poor and despised, he rejoins Napoleon after the Emperor escapes from Elba (while d'Hubert refuses to take part in Napoleon's return), but his hopes are dashed after the Battle of Waterloo and Napoleon's final exile to St. Helena. Forced to live under supervised conditions in a country village (unknown to Feraud, d'Hubert, by interceding with Minister Joseph Fouche, was responsible for Feraud's not being executed for being &quot;a rabid Bonapartist&quot;), Feraud still tracks d'Hubert down and challenges him, although he no longer truly remembers, or has conveniently altered, the reason for the perceived injury to his honor........\n\n\n:::-&gt;Scheda tecnica del DivX","torrent":{"xt":"urn:btih:d13369aea7a8a2d0730adf8dc9b8ccf83cc533a7","amp;dn":"The+Duellists+%5BDivX+-+Ita+Eng+Mp3+-+Sub+Ita+Eng+Fra+Ger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13369aea7a8a2d0730adf8dc9b8ccf83cc533a7","infoHashBuffer":{"type":"Buffer","data":[209,51,105,174,167,168,162,208,115,10,223,141,201,184,204,248,60,197,51,167]},"announce":[],"urlList":[]}}