{"title":"Ismail Kadare - Novels &amp; Short Stories (13 books)","uid":11177012,"size":12522173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d158198d412e850864cd112b7675478429b3dee0&amp;dn=Ismail+Kadare+-+Novels+%26amp%3B+Short+Stories+%2813+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"workerbee","files":-1,"time":1412801033,"description":"\nISMAIL KADARE (b. 1936) is a best-selling Albanian writer and a leading literary figure in his country since the 1960s.  His works have been translated into more than thirty languages.  The Independent (London) newspaper wrote: &quot;He has been compared to Gogol, Kafka and Orwell.  But Kadare's is an original voice, universal yet deeply rooted in his own soil.&quot;\n\nHis novels draw on legends surrounding the historical experience of the Balkan peoples, the representation of classical myths in modern contexts, and the totalitarian regime experiment in Albania.  They are obliquely ironic as a result of trying to withstand political scrutiny.\n\nIn 2005 Kadare was awarded the inaugural Man Booker International Prize for &quot;a body of work written by an author who has had a truly global impact.&quot;  In 2009 he received the Principe de Asturias de las Letras in Spain.  He has been mentioned as a possible recipient for the Nobel Prize in Literature several times.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n* THE ACCIDENT (Text Publishing, 2010).  Translated from the Albanian by John Hodgson.\n\n* AGAMEMNON'S DAUGHTER: A Novella &amp; Stories (Arcade, 2011).  Translated from the French of Tedi Papavrami and Jusuf Vrioni by David Bellos.\n\n* BROKEN APRIL (Ivan R. Dee, 1989).  Translated from the Albanian.\n\n* CHRONICLE IN STONE (Text Publishing, 2008).  Translated from the Albanian by Arshi Pipa; edited and introduced by David Bellos.\n\n* ELEGY FOR KOSOVO (Arcade, 2011).  Translated from the Albanian by Peter Constantine.\n\n* THE FILE ON H. (Arcade, 1998).  Translated from the French of Jusuf Vrioni by David Bellos. -- PDF + ePUB\n\n* THE GENERAL OF THE DEAD ARMY (Arcade, 2011).  Translated from the French of Jusuf Vrioni by Derek Coltman.\n\n* THE GHOST RIDER (Canongate, 2010).  Translated from the French of Jusuf Vrioni by Jon Rothschild; updated with new sections by Ismail Kadare and David Bellos.\n\n* THE PALACE OF DREAMS (Arcade, 2011).  Translated from the French of Jusuf Vrioni by Barbara Bray.\n\n* THE PYRAMID (Arcade, 2013).  Translated from the French of Jusuf Vrioni by David Bellos, in consultation with the author.\n\n* THE SIEGE (Anchor, 2009).  Translated from the French of Jusuf Vrioni by David Bellos.\n\n* THE SUCCESSOR (Arcade, 2011).  Translated from the French of Tedi Papavrami by David Bellos.\n\n* TWILIGHT OF THE EASTERN GODS (Canongate, 2014).  Translated from the French of Jusuf Vrioni by David Bellos.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                         &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:d158198d412e850864cd112b7675478429b3dee0","amp;dn":"Ismail+Kadare+-+Novels+%26amp%3B+Short+Stories+%2813+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d158198d412e850864cd112b7675478429b3dee0","infoHashBuffer":{"type":"Buffer","data":[209,88,25,141,65,46,133,8,100,205,17,43,118,117,71,132,41,179,222,224]},"announce":[],"urlList":[]}}