{"title":"Kinky Friedman(6 Books) ","uid":9130049,"size":2430949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d19e5013e634212bea5d7e61fdce3d2946198068&amp;dn=+Kinky+Friedman%286+Books%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1383293639,"description":"Richard Samet &quot;Kinky&quot; Friedman is an American Texas Country singer, songwriter, novelist, humorist, politician and former columnist for Texas Monthly who styles himself in the mold of popular American satirists Will Rogers and Mark Twain.\n\nKill Two Birds and Get Stoned\nFriedman sends a slumping, unfulfilled novelist off on a wild criminal adventure with a couple of con artists in his latest, an engaging but erratic caper novel that begins when mid-career fiction writer Walter Snow meets the woman of his dreams, Clyde Potts, at a bank in Manhattan. Potts already has a companion, an oddball named Fox Harris who accompanies Clyde on her various criminal ventures, and the pair quickly take advantage of Snow's lust for Potts to convince him to play a role in a smalltime con at a New York bar. Their next escapade takes them to a mental hospital, where they liberate an African-American acquaintance who believes himself to be the king of an African country. The criminal stakes go up when Potts manages to steal Donald Trump's credit card number, and the trio throws a lavish party for the homeless at a New York shelter, but the plotting turns downright bizarre when Potts and Harris sabotage a major coffee cafe after the company that owns the chain evicts the owner of a dive bar called the Unicorn. Friedman's usual off-kilter charm prevails throughout, particularly in the characterization of Snow, a sincere but befuddled writer who uses his lust for Potts to overcome a continuing case of writer's block. Potts and Harris have their endearing moments, but the criminal subplots range from the solidly effective to the over-the-top wacky, particularly the coffee caper, which is designated &quot;Operation Diarrhea&quot; and involves the trio adding a mix of diabolical chemicals to the local brew. Friedman fans will enjoy the antics, but this falls short of top-shelf Kinky.\nCopyright 2003 Reed Business Information, Inc.\n\nFrom Library Journal\n\nFriedman abandons his eponymous hero for this standalone story about a down-and-out writer whose new buddies introduce him to a life of crime. \nCopyright 2002 Reed Business Information, Inc.\n\n\nThe Love Song of J. Edgar Hoover (Kinky Friedman Mystery #9)\n\nA beautiful woman, a missing husband, and a private eye with eyes for his comely client. It's the classic hardboiled-mystery setup. But in the grip of Kinky Friedman, expect one of the wildest, wackiest, and weirdest rides of your life!\n\n&quot;A novel to be read for the sheer joy of it.&quot;\n\n\nRoadkill (Kinky Friedman Mystery #10)\n\nWho would slap an Indian curse on a good ol' boy like country singer Willie Nelson? Probably the same person who's been firing shots into Willie's hotel room and sending nasty notes promising the cowboy crooner a one-way ticket to the big rodeo in the sky. Could it have something to do with the medicine man who got run over by Willie's tour bus one dark night? If anyone can find out, it's ace troubleshooter and well-known troublemaker Kinky Friedman--on the road again in his tenth wickedly funny, off-the-wall mystery caper.\n\nWith nothing to do and no one to bother, ne'er-do-well private dick and man-about-town Kinky Friedman ponders life and discusses world affairs with his equally bored cat. His reverie is short-lived, however, when he gets the news that stalwart Village Irregular Mike McGovern has disappeared while visiting Hawaii. Knowing McGovern's penchant for inebriated side trips, Kinky isn't too concerned -- until a few days turn into several weeks. Worried about their pal, Kinky and his motley crew of comrades head to Hawaii to look into McGovern's disappearance -- and find themselves caught in a big kahuna of a mystery chock-full of ancient myths, sacrificial cults, totems, taboos, native drinking practices?and, if they're lucky, the occasional lei.\n\n\nThe Mile High Club (Kinky Friedman Mystery #13)\n\nIt all starts with a casual flirtation, two people on a flight from Dallas to New York. She's gorgeous and mysterious; he's a private detective. When the plane lands, the detective -- our hero, Kinky -- finds he's been left holding the bag, literally. The woman, having asked the Kinkster to watch her luggage while she visits the can, has taken a powder and somehow vanished. Mystery Woman does turn up again, but not before Kinky has claimed the interest of an array of suits from the State Department, been party to a thwarted kidnap attempt by Arab terrorists, and found a dead Israeli agent parked on the toilet of his downtown Manhattan loft. \nEmploying the able-bodied assistance of his usual sidekicks, the Village Irregulars, Kinky eventually gets to the bottom of all the comings and goings of the many visitors to his loft, including two late-night visits by the mysterious and suddenly affectionate woman from the plane and one not-so-late-night visit by her angry brother. \nRaunchy, offbeat, and hilarious, The Mile High Club, complete with a surprise ending, is Kinky at his considerable best.\n\n\nThe Prisoner of Vandam Street: A Novel (Kinky Friedman Mystery #17)\n\nAlfred Hitchcock's classic film Rear Window gets an affectionate kick in the butt in this homage from master crime writer, philosopher, and equal-opportunity offender Kinky Friedman. \n\nIt's a case of malaria versus murder when private dick extraordinaire Kinky Friedman comes down with a tropical disease, in the jungle known as New York City, and is confined to his loft on Vandam Street in lower Manhattan, a prisoner in his own home with only his cat and black puppet head as company (neither of whom are great conversationalists). \nWith little to do but stare out the window in between bedridden bouts of fever and hallucinations, Kinky calls on assistance from the stalwart Village Irregulars, who proceed to dish out their own uniquely skewed brand of tea and sympathy, turning the loft into a virtual Mardi Gras of confusion and drunken debauchery. \nSuffering almost as much from company overload as from his fever, Kinky welcomes a rare moment of calm as he finds himself once again alone in his loft. Resuming his position at the kitchen window, he spots a pretty young woman in an apartment across the street. What he hopes might be titillating turns terrifying, however, as a man joins the woman and proceeds to attack her. Sure that he's witnessed a crime, Kinky calls in the cops, but, upon investigating his claim, they can find neither a victim nor an apartment across the street. In addition, no one else saw or heard anything that would ndicate a crime had taken place. Was it foul play or merely a fevered dream? \nConvinced that their friend is about to slip off into the land of eternal slumber, the Village Irregulars increase their vigilance and in the process raise the Kinkster's irritability level to an all-time high. Not to be deterred, however, Kinky sticks to his story and is rewarded when a few days later he sees the man in the apartment again, but this time with a gun. \nOutrageous, audacious, and ingeniously crafted, The Prisoner of Vandam Street is vintage Kinky: irreverent, clever, and full of the hardened philosophy and mordant wit that has earned him a vast and devoted readership. But what more would you expect from the writer The New York Times has called &quot;The world's funniest, bawdiest, and most politically incorrect country music singer turned mystery writer&quot;?\n\n","torrent":{"xt":"urn:btih:d19e5013e634212bea5d7e61fdce3d2946198068","amp;dn":"+Kinky+Friedman%286+Books%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d19e5013e634212bea5d7e61fdce3d2946198068","infoHashBuffer":{"type":"Buffer","data":[209,158,80,19,230,52,33,43,234,93,126,97,253,206,61,41,70,25,128,104]},"announce":[],"urlList":[]}}