{"title":"Steroids: From Physiology to Clinical Medicine","uid":7850671,"size":8663449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1d0fdebe7da9d0b46d7d3768b473f3ca84d8c96&amp;dn=Steroids%3A+From+Physiology+to+Clinical+Medicine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353598095,"description":"&quot;Steroids: From Physiology to Clinical Medicine&quot; ed. by Sergej M. Ostojic\nInTeOp | 2012 | ISBN: 9535108573 9789535108573 | 220 pages | PDF | 8 MB\n\nThis book covers contemporary basic science on steroids research, along with steroids practical application in clinical medicine. In response to the need to address novel and valuable information on steroids science and medicine, this book will enable readers to comprehend this fast-growing and exciting scientific discipline.\n\nThe book starts by describing physiological and pathophysiological roles of steroids, with reference to production and action of gonadal steroids, role of steroid sulfonation, sex specific and steroids-dependent mechanism of hippocampal function, and the hydroxysteroid dehydrogenases for the modulation of tissue glucocorticoid availability.\nThen authors covered different aspects of steroids application in clinical environment, such as endocrine function after ovarian transplantation, diagnostic significance of salivary assessment of androgens, drawbacks of steroids use in sport, analysis of serum steroid hormone profiles in patients with adrenocortical tumors, and correlation between salivary and serum cortisol responses after alcohol intake.\n","torrent":{"xt":"urn:btih:d1d0fdebe7da9d0b46d7d3768b473f3ca84d8c96","amp;dn":"Steroids%3A+From+Physiology+to+Clinical+Medicine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d0fdebe7da9d0b46d7d3768b473f3ca84d8c96","infoHashBuffer":{"type":"Buffer","data":[209,208,253,235,231,218,157,11,70,215,211,118,139,71,63,60,168,77,140,150]},"announce":[],"urlList":[]}}