{"title":"Breakpoint by Richard A Clarke  (retail) {dwg}","uid":10867884,"size":3834843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d23a63ee0826a0e4f637a25954fbd23f1ef14748&amp;dn=Breakpoint+by+Richard+A+Clarke++%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408937170,"description":"Against All Enemies warned about how we were conducting the war against terror. The Scorpion's Gate demonstrated what could happen. And now America's preeminent counterterrorism expert and #1 bestselling author shows us all . . .hat might come next. \n\nThe global village-an intricately intertwined network of technology that binds together the world's economies, governments, and communication systems. So large, so vital-and so fragile. Now a sophisticated group is seeking to &quot;disconnect the globe&quot;-destroying computer grids, communications satellites, Internet cable centers, biotech firms. Hard to do? If only that were so. \n\nQuickly, a dedicated team of men and women assembles to try to track the group down, searching through right-wing militias and Russian organized crime, Jihadist terrorists and enemy nation-states. But the attacks are coming more swiftly now, and growing in destructiveness. Soon, they will reach the breakpoint- and then there may be nothing anybody can do. \n\nReviewers everywhere praised the suspense and pace of The Scorpion's Gate, the vivid depictions of war, espionage, and bureaucracy, but most of all they hailed its authenticity. &quot;Unlike most novelists, the man has been there and done that,&quot; said The New York Times Book Review. &quot;Some of us,&quot; added The Washington Post, &quot;have learned to listen when Richard A. Clarke has something to say.&quot; And we'd better hope they're listening now.","torrent":{"xt":"urn:btih:d23a63ee0826a0e4f637a25954fbd23f1ef14748","amp;dn":"Breakpoint+by+Richard+A+Clarke++%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d23a63ee0826a0e4f637a25954fbd23f1ef14748","infoHashBuffer":{"type":"Buffer","data":[210,58,99,238,8,38,160,228,246,55,162,89,84,251,210,63,30,241,71,72]},"announce":[],"urlList":[]}}