{"title":"Assassins.Creed.PC.Edition","uid":4263066,"size":6893521822,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d252eaad2ca790266000d93b2d388ad721a5fc63&amp;dn=Assassins.Creed.PC.Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"monomaxout","files":2,"time":1214565515,"description":"\n                     Assassins Creed PC Edition\n                    ---------------------------- \n   \n    Assassin&amp;#039;s Creed is a third-person stealth game in which the player assumes the role of Altar ibn La-Ahad &quot;The Flying One, Son of None&quot;, a member of the Hashshashin (The Assassin Brotherhood) which is not allied to either the Templars or Saracens during the third crusade. Altar&amp;#039;s objective in the game is to assassinate nine historical figures propagating the Crusades in the year 1191. (According to Ubisoft developers, all of the main character&amp;#039;s targets are historical figures who died or disappeared in 1191, although not necessarily by assassination.)\n\nThe primary goal of the game is to carry out the assassinations ordered by the head of the Brotherhood, Al Mualim. To achieve this goal, the player must use stealth and a variety of intelligence gathering tactics to collect information on their target. These tactics include eavesdropping, forceful interrogation, pickpocketing, and completing tasks for Informers (other assassins who will give you information in exchange for assassinating targets or collecting flags[citation needed]). Additionally, the player may take part in any number of side objectives, including climbing tall towers to map out the city and saving citizens that are being threatened or harassed by the city guards. There are also various side quests unrelated to the story such as hunting down and killing Templars and flag collecting.\n\nThe game takes place primarily in the Holy Land. It consists of four main cities: Jerusalem, Acre, Damascus and Masyaf, the assassins stronghold; all but Masyaf contain three sections that are unlocked over the course of the game. An approximation of the land lying between these areas is present in the game as &quot;The Kingdom.&quot; The game&amp;#039;s developers claim the environments are all historically accurate. Each city features a highly detailed environment populated by many people of different types, and as the player interacts with his/her environment, the people around Altar respond in logical and predictable ways. For example, when Altar climbs buildings without the use of a ladder, the local citizens pause, gather round the building he is climbing and comment on his unusual behavior, or how they won&amp;#039;t help him if he hurts himself. Certain actions, such as harming an innocent can attract the unwanted attention of nearby guards, who may then choose to attack him. Neither Richard the Lionheart&amp;#039;s forces, nor Saladin&amp;#039;s forces are particularly friendly towards Altar - If he comes into contact with any guards outside the main cities, he will be chased off, no matter which side.\n\nThe player is made aware of how noticeable Altar is to enemy guards as well as the current state of alert in the local area. To perform many of the assassinations and other tasks, the player must consider the use of both &quot;low profile&quot; and &quot;high profile&quot; commands.&quot;Low profile&quot; commands allow Altar to blend into nearby crowds, gently pass by other citizens, or other non-threatening tasks that can be used to hide and reduce the alertness level.&quot;High profile&quot; commands are more noticeable, and include running, scaling the sides of buildings to climb to higher vantage points, and attacking foes; performing these actions at certain times may raise the local area&amp;#039;s awareness level. Once the area is at high alert, the player must use both low profile commands as well as aiming to climb away from ground level or using hiding spaces to reduce the alertness level. The player, as they complete the assigned assassinations, will gain either new weapons or new combat skills including counter-attacks and attack dodges. Besides his fists, Altar&amp;#039;s weapons include an assassin&amp;#039;s sword for standard combat, a short blade, and throwing knives which are used in conjunction with the short blade. Altar also starts the main storyline with the use of a hidden retractable blade on his left arm that can be used for killing targets at very close quarters without creating any immediate alerts (although, if others come across the body, the alertness level may be raised). This is the most noticeable difference between low and high profile. A low profile assassination can be performed within as little as a few feet of other guards or soldiers without attracting attention, whereas a high profile assassination attack will be noticed by everyone within eyesight. This becomes more difficult as the game progresses, as guards become more attentive for Altar&amp;#039;s presence due to his repeated killings.\n\nThe player&amp;#039;s health is described as the level of synchronization between Desmond and Altar&amp;#039;s memories; should Altar take damage, some amount of synchronization is lost, and if all synchronization is lost, the current memory that Desmond is experiencing will be restarted at the last checkpoint. When the synchronization bar is full, the player has the additional option to use &quot;eagle vision&quot; which allows the computer-rendered memory to highlight all visible characters in colors corresponding to whether they are friend or foe or even the target of their assassination. Due to Altar&amp;#039;s memories being rendered by the computer of the Animus project, the player may experience &quot;glitches&quot; in the rendering of the historical world, which may help the player to identify targets, or can be used to alter the viewpoint during in-game scripted scenes should the player react fast enough when they appear.\n\n\n\nPC version\n\nA pirated version of the game has been in existence since late February 2008 - more than a month before its expected release, though players are only able to complete the game using extra content available on the net in its current state; despite this, it was one of the most popular titles for piracy during the first week of March 2008.\n\nIt was made public on 1 April that Assassin&amp;#039;s Creed would be sold electronically and available for pre-order through Valve&amp;#039;s software distribution program, Steam, and though advertised to the entire Steam customer base it was for unknown reasons locked out for any Steam-customers not residing in North America (along with the entire Ubisoft catalog). The PC version of Assassin&amp;#039;s Creed was released on 8 April 2008 in North America. Four bonus mission types, not seen in the console version, are included. These 4 new missions are archer assassination, rooftop race challenge, merchant stand destruction challenge and escort challenge.\n","torrent":{"xt":"urn:btih:d252eaad2ca790266000d93b2d388ad721a5fc63","amp;dn":"Assassins.Creed.PC.Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d252eaad2ca790266000d93b2d388ad721a5fc63","infoHashBuffer":{"type":"Buffer","data":[210,82,234,173,44,167,144,38,96,0,217,59,45,56,138,215,33,165,252,99]},"announce":[],"urlList":[]}}