{"title":"Bill Willingham: Ironwood (Eros Comix) (1991) (Pudgy-CCA)","uid":9269822,"size":94918836,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d27a3bfab72af9f5acfc9d99631f7425fc3cb77f&amp;dn=Bill+Willingham%3A+Ironwood+%28Eros+Comix%29+%281991%29+%28Pudgy-CCA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gesserit","files":-1,"time":1385753775,"description":"\n &quot; Full-Blooded Fantasy and Fine Fornicatin' from Bill Willingham! &quot; \n\n    - Tagline, issue two\n\n &quot; D: One other note before we begin. You will no doubt notice I stop narrating \n   the story about half-way through this issue. My deep sense of justice and \n   artistic integrity has forced me to walk off the job. Since Willingham \n   continues to falsely claim to be the author of this freakshow, he can damn-well \n   write his own narration. I've read some of his other work, and I give him two \n   issues tops, before plummeting sales has him begging me to come back.\n\n   BW: Dragavon, you little fuck-weasel of the tundra. You didn't walk out, I \n   threw you out. Your pathetic, whimpering tantrums at the beginning of each \n   issue were already causing sales to fall off. Entire zip-codes were dropping \n   the book. It was getting so bad, I couldn't even sell wholesale copies to \n   religious groups for book burnings. I had to get rid of you in order to salvage \n   the rest of the series.\n\n       By the way, dip-shit, I was able to replace you with a real star. As of \n   now, Fantasia Faust is the new narrator. She didn't come out of the black and \n   white fuck-magazine ghetto like you. She's appeared in real four-color comics, \n   with super heroes and everything. And even as I write this, I'm in negotiation \n   with some high powered movers and shakers in this industry who are going to get \n   me some mutants for this book. Yeah, you heard me right; MUTANTS! Now, do you \n   still think anyone will miss you?&quot;\n   \n    - Introductory meta-dialogue between the protagonist and his author, issue four\n\n---\n\nI'm not quite sure what to call this. The book has an entirely worthwhile plot (as opposed to one that merely serves to bridge the gaps between the fornicatory bits) and the writing, artwork, and humour are all top-notch, so calling it &quot;fantasy porn&quot; hardly does it justice.\n\nOn the other hand, &quot;an epic fantasy with lots of gratuitous nudity and sex&quot; doesn't really do it justice, either, as this is a lot more pornographic than, say, HBO's &quot;Game of Thrones&quot; adaptation, which is what that phrase brings to mind.\n\nI'll settle for simply calling it &quot;outstanding&quot;, therefore. Shame this Willingham fellow doesn't seem to have published anything of note since... :P\n\n---\n\nCompiled from Pudgy's scans of a 2-volume re-release plus a separate cover gallery.\n","torrent":{"xt":"urn:btih:d27a3bfab72af9f5acfc9d99631f7425fc3cb77f","amp;dn":"Bill+Willingham%3A+Ironwood+%28Eros+Comix%29+%281991%29+%28Pudgy-CCA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27a3bfab72af9f5acfc9d99631f7425fc3cb77f","infoHashBuffer":{"type":"Buffer","data":[210,122,59,250,183,42,249,245,172,252,157,153,99,31,116,37,252,60,183,127]},"announce":[],"urlList":[]}}