{"title":"BBC.Documentaries.2016.07.24.Fixing.Dad.EN.SUB.MPEG4.x264.MPup","uid":15402126,"size":1053787232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d27c1ff250d0c52ddb9a8b3059000e9a46f2eede&amp;dn=BBC.Documentaries.2016.07.24.Fixing.Dad.EN.SUB.MPEG4.x264.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1469470593,"description":"BBC.Documentaries.2016.07.24.Fixing.Dad.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nGeoff was an overweight, over-worked night security guard, close to having his foot amputated and resigned to a premature death due to a catalogue of dangerous conditions linked to type 2 diabetes.\r\n\r\nHis sons decided it was time to step in.\r\n\r\nDocumentary film-makers Anthony and Ian Whitington turned their cameras on their dad in a last-ditch attempt to save his life.\r\n\r\nThere are no quick fixes as they battle to overhaul every aspect of Geoff's destructive lifestyle, from poor diet to bad habits, ingrained negativity and superhuman stubbornness - and set him the challenge of cycling 100 miles.\r\n\r\nBut the brothers won't give up. With their humour, support and determination, they show that those we love make us strong and that a life we love is worth fighting for.\r\n\r\n\t---------------------------------------------\r\n\r\nWhen their dad Geoff was getting his affairs in order and the threat of diabetic foot amputation loomed, film-makers Anthony and Ian Whitington decided to step in. With their cameras holding him accountable for every aspect of his destructive lifestyle, they turn his stubborn resistance into iron resolve. As Geoff fought to regain his health amidst mounting complications, his sons battled against his years of poor diet, bad habits and ingrained negativity, with little more than hope and gritty determination to get them through.\r\n\r\nThere are no quick fixes as the brothers attempt to transform their dad from a barely mobile night security guard to a fighting fit endurance cyclist and global speaker on defeating type 2 diabetes. With more than a third of adults in the UK pre-diabetic - and millions living with type 2 already - they show that if Geoff can do it, anyone can. Through humour, support and determination, the family reminds us that those we love make us strong and that a life we love is worth fighting for","torrent":{"xt":"urn:btih:d27c1ff250d0c52ddb9a8b3059000e9a46f2eede","amp;dn":"BBC.Documentaries.2016.07.24.Fixing.Dad.EN.SUB.MPEG4.x264.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27c1ff250d0c52ddb9a8b3059000e9a46f2eede","infoHashBuffer":{"type":"Buffer","data":[210,124,31,242,80,208,197,45,219,154,139,48,89,0,14,154,70,242,238,222]},"announce":[],"urlList":[]}}