{"title":"Vittorio De SICA - Miraclo a Milano (Miracle in Milan, 1951)","uid":4143009,"size":734244582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d27e55bde5b0854f919a7a6ccfb3f388cdde29a5&amp;dn=Vittorio+De+SICA+-+Miraclo+a+Milano+%28Miracle+in+Milan%2C+1951%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"zeinabqureshi","files":6,"time":1208588224,"description":"Miracolo a Milano (1951)\nVittorio De Sica\nCo-written by Zesare Zavattini\nGrand Prix at the Cannes Film Festival, 1951\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nInfo ..................:\nFile Size (in bytes) ..: 733,124,608 \nRuntime (# of frames) .: 1:33:10 (139,734 frames)\n\nVideo Codec ...........: xvid\nFrame Size ............: 448x336\nFPS ...................: 25.000\nVideo Bitrate .........: 951 kb/s\nBits per Pixel ........: 0.253 bpp\nB-VOP, N-VOP, QPel, GMC: B-VOP\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 85 kb/s tot , Joint Stereo LAME3.97  VBR\nInterleave ............: 1 vid frame (40 ms), preload=504\nNo. of audio streams ..: 1\n\nSubtitles in SRT ......: English, Italiano\nSubtitles in EN and IT included in SUB/IDX form in the RAR file\nInflate and use if required; the SRT is good enough, IMO.\n\nRip and subtitles by -=:ZEiNAB:=-\n\n(:- To Raphael, who supplied the DVD for ripping -:)\n\nSeed and enjoy, this is the only rip available on BitTorrent.\nThere is a DVD5 on piratebay, but it does not have English subs.\nSo this is the only english-texted version :-;\n\nSynopsis .............:\n(from the Wikpedia article)\nThis fantasy tale tells of TotÃƒÂ², who is found in a cabbage patch and adopted by an old women named Lolotta. He later moves to an orphanage because Lolotta passes away.\n\nThe film moves forward to when he's eighteen years of age and TotÃƒÂ² (Francesco Golisano) leaves the orphanage and begins to live in a shantytown in Milan.\n\nTotÃƒÂ²'s organizational skills, learned at the orphanage and from Lolotta, brings structure to the colony and brings a sense of small happiness and well being among the depressed folk.\n\nWhen TotÃƒÂ² is given a magic dove by the ghost of his adoptive mother, he uses its powers to grant wishes to those who ask. The dove, however, is taken back by two angels who object to a mortal having possession of it.\n\nThe land where TotÃƒÂ²'s and his friends live is taken over by capitalists after oil is found there and they're all taken away to prison in horse-drawn paddy wagons. On the way to prison, however, a dove is returned to TotÃƒÂ² and his wish for the freedom of his friends is granted. In a historical cinematic scene they escape into the sky, arguably to heaven, on brooms pinched from street sweepers in a town square.\n\nAwards ................:\n    * Cannes Film Festival: Grand Prize of the Festival, Vittorio De Sica; 1951.\n    * New York Film Critics Circle Awards: NYFCC Award; Best Foreign Language Film, Italy; 1951.\n    * National Board of Review: National Board of Review Awards 1951, Best Foreign Films; 1951.\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:d27e55bde5b0854f919a7a6ccfb3f388cdde29a5","amp;dn":"Vittorio+De+SICA+-+Miraclo+a+Milano+%28Miracle+in+Milan%2C+1951%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27e55bde5b0854f919a7a6ccfb3f388cdde29a5","infoHashBuffer":{"type":"Buffer","data":[210,126,85,189,229,176,133,79,145,154,122,108,207,179,243,136,205,222,41,165]},"announce":[],"urlList":[]}}