{"title":"An Appetite for Wonder - Richard Dawkins  (2013 - Unabridged)","uid":8967283,"size":228353907,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d284fc46b9c116b49e4fde73f74dea67d962e10f&amp;dn=An+Appetite+for+Wonder+-+Richard+Dawkins++%282013+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Robin1966","files":18,"time":1380244311,"description":"Audio Books : Biography : MP3/Variable : English\nAn Appetite For Wonder: The Making of a Scientist (Audiobook) By Richard Dawkins, read by the author\nUnabridged edition 2013 | 7 hours and 55 mins | ISBN: 184657384X | MP3 64 kbps | 229 MB\n\n\n\nBorn to parents who were enthusiastic naturalists, and linked through his wider family to a clutch of accomplished scientists, Richard Dawkins was bound to have biology in his genes. But what were the influences that shaped his life and intellectual development? And who inspired him to become the pioneering scientist and public thinker now famous (and infamous to some) around the world?\n\nIn An Appetite for Wonder we join him on a personal journey back to an enchanting childhood in colonial Africa. There the exotic natural world was his constant companion. Boarding school in England at the age of eight, and, later, public school at Oundle introduce Dawkins, and the reader, to strange rules and eccentric schoolmasters, vividly described with both humorous affection and some reservation. An initial fervent attachment to Church of England religion soon gives way to disaffection and, later, teenage rebellion. Early signs of a preference for music, poetry and reading over practical matters become apparent as he recalls the opportunities that entered his small world.\n\nOxford, however, is the catalyst to his life. Vigorous debate in the dynamic Zoology Department unleashes his innate intellectual curiosity, and inspirational mentors together with his own creative thinking ignite the spark that results in his radical new vision of Darwinism, The Selfish Gene.\n\nFrom innocent child to charismatic world-famous scientist, Richard Dawkins paints a colourful, richly textured canvas of his early life. Honest self-reflection and witty anecdotes are interspersed with touching reminiscences of his family and friends, literature, poetry and songs. We are finally able to understand the private influences that shaped the public man who, more than anyone else in his generation, explained our own origins.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d284fc46b9c116b49e4fde73f74dea67d962e10f","amp;dn":"An+Appetite+for+Wonder+-+Richard+Dawkins++%282013+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d284fc46b9c116b49e4fde73f74dea67d962e10f","infoHashBuffer":{"type":"Buffer","data":[210,132,252,70,185,193,22,180,158,79,222,115,247,77,234,103,217,98,225,15]},"announce":[],"urlList":[]}}