{"title":"Los 4 fantasticos.[spanish-dvdrip].","uid":5174885,"size":1014006010,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2aa6a3223d0117f27b0a0027969484155d4698d&amp;dn=Los+4+fantasticos.%5Bspanish-dvdrip%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zurera","files":1,"time":1258911203,"description":"Los cuatro fantÃƒÂ¡sticos (Fantastic Four)\nReparto: Chris Evans, Jessica Alba, Julian McMahon, Michael Chiklis, Ioan Gruffudd, Maria Menounos, Laurie Holden, Kerry Washington\nDirector: Tim Story\nDuraciÃƒÂ³n: 02:03:00\n\nSinopsis:\nEl sueÃƒÂ±o largamente acariciado del inventor, astronauta y cientÃƒÂ­fico Dr. Reed Richards (Ioan Gruffudd) estÃƒÂ¡ muy prÃƒÂ³ximo a hacerse realidad. EstÃƒÂ¡ al frente de un viaje al espacio exterior, al centro de una tormenta cÃƒÂ³smica. AllÃƒÂ­, espera conseguir desvelar los secretos de los cÃƒÂ³digos genÃƒÂ©ticos de los seres humanos en beneficio de la humanidad. La tripulaciÃƒÂ³n de Reed para la misiÃƒÂ³n estÃƒÂ¡ formada por su mejor amigo, el astronauta Ben Grimm (Michael Chiklis); por Sue Storm (Jessica Alba), directora de investigaciÃƒÂ³n genÃƒÂ©tica y antigua novia de Reed; y por el impulsivo hermano menor de Sue, el piloto Johnny Storm (Chris Evans). En compaÃƒÂ±ÃƒÂ­a del benefactor del proyecto, Von Doom, los cuatro parten para la exploraciÃƒÂ³n de sus vidas. La misiÃƒÂ³n discurre sin incidentes hasta que Reed descubre que hay un error de cÃƒÂ¡lculo en la velocidad con la que se acerca la tormenta. En unos minutos, el umbral de este fenÃƒÂ³meno atmosfÃƒÂ©rico estÃƒÂ¡ sobre ellos. La estaciÃƒÂ³n espacial se ve engullida por turbulentas nubes de radiaciÃƒÂ³n cÃƒÂ³smica que cambian el genoma de la tripulaciÃƒÂ³n. Su ADN se ve irrevocablemente alterado.... y ÃƒÂ©se va a ser su futuro. De regreso a la Tierra, los efectos de la exposiciÃƒÂ³n muestran rÃƒÂ¡pidamente sus primeros sÃƒÂ­ntomas brindando a cada uno de ellos poderes sobrenaturales, convirtiÃƒÂ©ndose en Los Cuatro FantÃƒÂ¡sticos.\n","torrent":{"xt":"urn:btih:d2aa6a3223d0117f27b0a0027969484155d4698d","amp;dn":"Los+4+fantasticos.%5Bspanish-dvdrip%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2aa6a3223d0117f27b0a0027969484155d4698d","infoHashBuffer":{"type":"Buffer","data":[210,170,106,50,35,208,17,127,39,176,160,2,121,105,72,65,85,212,105,141]},"announce":[],"urlList":[]}}