{"title":"Play On: Now, Then and Fleetwood Mac - Mick Fleetwood Audiobook","uid":11321947,"size":297470574,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d2c93ad25912050254087b5188e6b6958beca8e5&amp;dn=Play+On%3A+Now%2C+Then+and+Fleetwood+Mac+-+Mick+Fleetwood+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1414606906,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nPlay On: Now, Then and Fleetwood Mac\n\nWritten by: Mick Fleetwood\nNarrated by: Martin Dew\nLength: 10 hrs and 15 mins\nUnabridged Audiobook\nRelease Date:10-30-14\n\n'After forty-six years of being on the road, now is the right time to look back in a way I've never done before: now and then. I'm looking forward to sharing it with you.'\n\nMick Fleetwood has been part of one of the world's most successful and adored bands for over four decades. Here he tells the full and candid story of that life, and what it is to be part of the ever evolving Fleetwood Mac.\n\nHis all-access autobiography spans the career of one of classic rock's greatest drummers and band leaders, the co-founder of the deeply loved super group that bears his name.\n\nIn this intimate portrait of a life lived in music, Fleetwood vividly recalls his upbringing in Cornwall, Egypt, and Norway, tapping along to whatever song was playing on the radio; his experiences as a musician in Sixties London; the early days of the band featuring Peter Green, and his close friendship with George Harrison and seemingly all of music royalty.\n\nPlay On sheds new light on Fleetwood Mac's raucous history, describing the highs and lows of being part of a band that he often single-handedly kept together. His love affair with Stevie Nicks, the creation of landmark albums like Rumours and Tusk, and the many incredible and outrageous moments of recording, touring, fighting, and loving with Fleetwood Mac: all are here. He describes his life's moments with the honesty and immediacy that his fans expect, taking us to the very heart of this multi-layered life.\n\nIt's been a tumultuous journey with the excesses of the band's huge success at times threatening to destroy what they strived so hard to create. But through it all, it's been the drive to play on that has won out. Now, then, and always, it's Fleetwood Mac","torrent":{"xt":"urn:btih:d2c93ad25912050254087b5188e6b6958beca8e5","amp;dn":"Play+On%3A+Now%2C+Then+and+Fleetwood+Mac+-+Mick+Fleetwood+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2c93ad25912050254087b5188e6b6958beca8e5","infoHashBuffer":{"type":"Buffer","data":[210,201,58,210,89,18,5,2,84,8,123,81,136,230,182,149,139,236,168,229]},"announce":[],"urlList":[]}}