{"title":"Numerical Methods for Ordinary Differential Equations 3rd ed","uid":15532058,"size":5892917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2ee261beb97ff5e1157fc4801d24ae7c4cae425&amp;dn=Numerical+Methods+for+Ordinary+Differential+Equations+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1470842240,"description":"Numerical Methods for Ordinary Differential Equations 3rd ed - J.C. Butcher (Wiley, 2016).pdf\r\n\r\nA new edition of this classic work, comprehensively revised to present exciting new developments in this important subject\r\n\r\nThe study of numerical methods for solving ordinary differential equations is constantly developing and regenerating, and this third edition of a popular classic volume, written by one of the world’s leading experts in the field, presents an account of the subject which reflects both its historical and well-established place in computational science and its vital role as a cornerstone of modern applied mathematics.\r\n\r\nIn addition to serving as a broad and comprehensive study of numerical methods for initial value problems, this book contains a special emphasis on Runge-Kutta methods by the mathematician who transformed the subject into its modern form dating from his classic 1963 and 1972 papers.  A second feature is general linear methods which have now matured and grown from being a framework for a unified theory of a wide range of diverse numerical schemes to a source of new and practical algorithms in their own right.  As the founder of general linear method research, John Butcher has been a leading contributor to its development; his special role is reflected in the text.  The book is written in the lucid style characteristic of the author, and combines enlightening explanations with rigorous and precise analysis. In addition to these anticipated features, the book breaks new ground by including the latest results on the highly efficient G-symplectic methods which compete strongly with the well-known symplectic Runge-Kutta methods for long-term integration of conservative mechanical systems.\r\n\r\nKey features:                                                     \r\n\r\n??  Presents a comprehensive and detailed study of the subject\r\n\r\n??  Covers both practical and theoretical aspects\r\n\r\n??  Includes widely accessible topics along with sophisticated and advanced details\r\n\r\n??  Offers a balance between traditional aspects and modern developments\r\n\r\n \r\n\r\nThis third edition of Numerical Methods for Ordinary Differential Equations will serve as a key text for senior undergraduate and graduate courses in numerical analysis, and is an essential resource for research workers in applied mathematics, physics and engineering","torrent":{"xt":"urn:btih:d2ee261beb97ff5e1157fc4801d24ae7c4cae425","amp;dn":"Numerical+Methods+for+Ordinary+Differential+Equations+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2ee261beb97ff5e1157fc4801d24ae7c4cae425","infoHashBuffer":{"type":"Buffer","data":[210,238,38,27,235,151,255,94,17,87,252,72,1,210,74,231,196,202,228,37]},"announce":[],"urlList":[]}}