{"title":"Handjob----Harsh Handjobs Siterip 43gb","uid":8153185,"size":46134703114,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d30a738f117a185ecba6afc7b89191ab6e86a68b&amp;dn=Handjob----Harsh+Handjobs+Siterip+43gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":13,"uploader":"merzedes","files":-1,"time":1361059224,"description":"Harsh Handjobs Siterip \n\n43 gb, 117 videos all in HD 720p\n\nDescription for the 3 videos on frontpage the day of this upload. All 3 in torrent ofcourse :)\n\nTorrent image is for Anna Joy video. \n\nMegan Paige Paige Turnah \n\nMy girlfriend and I have a little secret. She likes to tie me up and boss me about. Of course this is not the sort of thing I want everyone knowing about, especially not the boys down at the pub. Imagine how fucked off I was when he went out and left me tied up the other day and then came back with one of her mates. My girlfriend said that she had offered to give her friend a few lessons in controlling her boyfriend and that I was to be a good boy and lie still while she slapped, pinched and flicked at my cock. I wasn't very happy about this, but then both girls started to strip off - I thought things had taken a turn for the better, but they now seemed to be about to get a whole lot worse.\n\n\nAnna Joy \n\nI spotted my girlfriend the other night and she was dressed up in the sexiest black dress, black stockings, high heels and her best lingerie. I was quite flattered she had taken so much trouble to make herself look so sexy just for me, until she told me that her fantastic outfit was not for me and she was going out to fuck one of her office colleagues. I was a bit perturbed by this and she told me it was because I have a tiny little cock that is not big enough to satisfy her - just to prove it she yanked off my trousers and underpants and started slapping my poor insulted cock around. If things weren't bad enough, I started to get hard with her rough treatment and hearing about what she was going to do with her new stud that night.\n\nTilly Hardy \n\nSome people think that my job as a glamour photographer would give me access to lots of really hot babes and even more fun after shoots. Proves how much they know! Glamour models can be just as difficult as any other woman. I had a nice looking girl in the other day, good face, good figure, great big tits. Trouble was I could not understand a word she was saying. I asked her to speak English and she took exception to it. She got stripped off for action and started work on my poor cock, she slapped it, flicked it and tugged at my balls until I thought they were going to come off. But then, something started to stir in the trouser department...\n\n\nNo screens on this one, but website gives a good indication of what you get.\n\nWebsite &lt;a href=&quot;\nhttp://harshhandjobs.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://harshhandjobs.com&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d30a738f117a185ecba6afc7b89191ab6e86a68b","amp;dn":"Handjob----Harsh+Handjobs+Siterip+43gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d30a738f117a185ecba6afc7b89191ab6e86a68b","infoHashBuffer":{"type":"Buffer","data":[211,10,115,143,17,122,24,94,203,166,175,199,184,145,145,171,110,134,166,139]},"announce":[],"urlList":[]}}