{"title":"Andrei Platonov - The Foundation Pit and other works (6 books)","uid":15184469,"size":6172789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4563f32a9fad273d1f472991d1bcfce70b5fd19&amp;dn=Andrei+Platonov+-+The+Foundation+Pit+and+other+works+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":12,"time":1467483181,"description":"\nANDREI PLATONOV (1899-1951), the pen name of Andrei Platonovich Klimentov, was a Soviet Russian writer, playwright, and poet.  Although Platonov was a Communist, much of his work was suppressed or censored during his lifetime for its skeptical attitude toward collectivization and other Stalinist policies, as well as for its experimental, avant-garde form.  For Nadezhda Mandelstam and Joseph Brodsky, Platonov was the writer who most profoundly registered the spiritual shock of revolution.\r\n\r\nTHE FOUNDATION PIT (1930), his most famous work, is a gloomy symbolic and semi-satirical novel that critiques the brutalities of Stalin's collectivization of Russian agriculture.  A team of workers is given the job of digging the foundation of an immense edifice, a palatial home for the perfect future that, they are convinced, is at hand.  But the harder the team works, the deeper they dig, the more things go wrong, and it becomes clear that what is being dug is not a foundation but an immense grave.  Seeking to evoke unspeakable realities, Platonov deforms and transforms language in pages that echo both with the alienating doublespeak of power and the stark simplicity of prayer. \r\n\r\nAlso included here are several collections of Platonov's short fiction from the whole of his career.  Among them are &quot;The Return,&quot; about an officer's difficult homecoming at the end of World War II, described by Penelope Fitzgerald as one of &quot;three great works of Russian literature of the millennium&quot;; &quot;The River Potudan,&quot; a moving account of a troubled marriage; and &quot;Soul,&quot; a harrowing novella about a young man returns to his Asian birthplace to find his people deprived not only of food and dwelling, but of memory and speech.\r\n\r\nDepicting a devastated world that is both terrifying and sublime, Platonov is a universal writer who is as solitary and haunting as Kafka.\r\n\r\n\r\nThe following books are in ePUB format:\r\n\r\n* Fierce and Beautiful World, The (Hodder &amp; Stoughton, 1971).  Translated by Joseph Barnes, with an Introduction by Yevgeny Yevtushenko.\r\n\r\n* Foundation Pit, The (Vintage, 2010).  Translated by Robert and Elizabeth Chandler, and Olga Meerson.\r\n\r\n* Happy Moscow (Harvill, 2001).  Translated by Robert and Elizabeth Chandler, and Angela Livingstone.\r\n\r\n* Return &amp; Other Stories, The (Harvill, 1999).  Translated by Robert and Elizabeth Chandler, and Angela Livingstone.\r\n\r\n* Russian Magic Tales from Pushkin to Platonov (Penguin Classics, 2012).  Edited by Robert Chandler.\r\n\r\n* Soul &amp; Other Stories (Vintage, 2013).  Translated by Robert and Elizabeth Chandler.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                                  \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:d4563f32a9fad273d1f472991d1bcfce70b5fd19","amp;dn":"Andrei+Platonov+-+The+Foundation+Pit+and+other+works+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4563f32a9fad273d1f472991d1bcfce70b5fd19","infoHashBuffer":{"type":"Buffer","data":[212,86,63,50,169,250,210,115,209,244,114,153,29,27,207,206,112,181,253,25]},"announce":[],"urlList":[]}}