{"title":"National Geographic War Heroes Of The Skies 5of6 Vietnam Dogfigh","uid":8942211,"size":722887909,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d483a6af42134b0645c56cbe0f0a92fd6d06a5c4&amp;dn=National+Geographic+War+Heroes+Of+The+Skies+5of6+Vietnam+Dogfigh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"MVGroup","files":-1,"time":1379690277,"description":"War Heroes Of The Skies\n\nWar Documentary hosted by Peter Harlowe, published by National Geographic in 2013 - English narration also known as\n* Heroes of the Skies\n\n\nInformation\n------------------------------\n\nWar Heroes Of The Skies.\nThrough the eyes of the heroes, experience realistic mid-air combat and see revealing interviews with the last surviving WWII veterans in War Heroes Of The Skies. From the WWII aircrew officer who doused a fire on the wing of his aircraft while 20,000 ft in the sky, to the phantom fighter pilot who took out four MiGs over Vietnam in the most celebrated dog fight of the modern era. Presented by Lord Ashcroft, these are all stories of superhuman endurance, selfless courage and heroism beyond the call of duty. Using vintage aircraft such as Spitfires fighters and Lancaster bombers, aerial stunt teams and state-of-the-art camera technology, the series brings to life the exploits of the world's greatest military air heroes. The series features realistic mid-air combat sequences, revealing interviews with the last surviving veterans, rare archive footage and cutting-edge CGI to transport viewers back in time to experience the reality of air combat.\naka Heroes Of The Skies\n\n\n1)  Battle of Britain \nIn July 1940, Squadron Leader Douglas Bader and his ragtag squadron of Canadian fighter pilots go into battle against Hitler's mighty Luftwaffe. The outcome of the Battle of Britain will determine the future of the free world. But Bader is also fighting his own personal battle. Just eight years earlier, a catastrophic flying accident cost him both of his legs. Never one to accept defeat, Bader - equipped with prosthetic legs - beats all the odds to become Britain's most celebrated air ace. Bader, who was immortalised in the film Reach For The Sky, used bold but controversial tactics. He and his men helped to turn the tide in the crucial Battle of Britain. This is his remarkable story.\n\n2)  Spitfire Victory \nEven though Canadian George Beurling broke every rule in the book, he still managed to become one of the greatest fighter pilots of World War II. But his was a turbulent road to glory. The Canadian Air Force deemed him too young for service and even when the British RAF accepted him, Beurling was branded a loner who lacked discipline and regularly defied orders. Only when he was transferred to Malta, one of the most dangerous war zones of World War II, was he able to prove himself. From 1940 to 1942, the strategically vital Mediterranean island was on the verge of surrender to the fascist powers. During the bitterly fought Battle of Malta, no Allied pilot shot down more enemy planes. Against staggering odds, Beurling's eagle-eyed marksmanship and extraordinary command of his Spitfire helped to win a crucial victory that changed the course of the war.\n\n3)  Total War \nLike all the Allied bombers of World War II, the crew of the Lancaster ME669 had an extremely dangerous job: avoiding deadly enemy fire while dropping high-powered explosives over Nazi Germany. Without them, Hitler may have emerged victorious. But the tactic called 'total war', a controversial strategy that turned cities into legitimate targets, overshadowed their legacy. Yet for the more than 100,000 volunteers, half of whom would not return, there was no other option. The rookie crew of Lancaster ME669 began their careers with a near-death crash landing. But the band of brothers bounced back with vigour, determined to defy the grim statistics of their profession. Ordered to fly 30 missions, no one expected them to make it past 14. Somehow luck was on their side and despite another crash landing and blood curdling missions over Berlin, Germany's most defended city, their heroic feats piled up. That is until their final mission, when they were forced to go deep into the heart of industrial Germany. This time, the men would not be so lucky. In April 1944, in one of the most heroic acts of the World War II, as the Lancaster tore through the night at 200 miles an hour, Sergeant Norman Jackson climbed onto the wing to try to fight a fire in a fuel tank while under attack from a German fighter at 22,000 feet.\n\n4)  Nazi Hunter \nIn World War II, American pilots raced to shoot down the most German planes and be crowned the country's top flying ace. US Air Force pilot Francis 'Gabby' Gabreski made it his personal mission to be the best there ever was.. The child of Polish immigrants, Gabreski made his mission personal, seeking to avenge his family's devastating losses during the war. But despite his passion, the young wannabe was accident-prone and incompetent behind the controls. Gabreski squeaked by on his flying test. He then made a brave request to join one of the famed Polish figher units in England's Royal Air Force. In the heart of the war and mentored by the best, the rookie cut his teeth. But he struggled to shoot down a single Nazi plane. Everything changed when he was transferred back to the US Air Corps 61st Squadron. While escorting bombers over occupied France, Gabreski scored his first victory. When the top brass radically shifted tactics to protect allied ground troops storming Normandy, the fighters were ordered to find the enemy and shoot them down. Gabreski and his ace competitors all saw this as a golden opportunity to make history as the best that ever flew.\n\n5)  Vietnam Dogfight \nLord Ashcroft KCMG looks back at the events of July 1966. With North Vietnam's squadron of MiG-21s hammering the US Air Force, the embattled men of the 8th Tactical Fighter Wing needed a hero to whip them into shape. Enter Colonel Robin Olds, a WWII veteran airman, who charged in and commanded respect with his unbreakable courage. But devising a tactic to beat North Vietnam in the air would not come easily. Olds and his men eventually came up with an audacious plan: set a 20th Century Trojan Horse trap high up in the air. To do this they would need to masquerade their F4 Phantom fighter jets as THUD bombers to lure the North Vietnamese MiGs into open skies, then take them down in a ferocious dogfight. Dubbed Operation BOLO, the top-secret scheme was hugely complex - one false move could have proven deadly for them all. Olds won the confidence of top brass and got the green light. On January 2nd, 1967, the 8th Tactical, led by Olds, provoked a ferocious airborne battle and attempted to change the course of the Vietnam War.\n\n6)  Red Tails \nThey were young, gifted and black but the US Army refused them key positions. That is until intense pressure from activist groups pushed President Franklin D. Roosevelt to initiate an African-American fighter pilot training program in Tuskegee, Alabama. Top secret and fiercely opposed by top military brass, the African-American pilots, dubbed the Red Tails, were forced to fly second-rate planes far from the action. But in June 1944, they leapt to the front lines of World War II. Suddenly they were given Mustang P-51 fighter planes and charged to protect Allied bombers on a mission to destroy Nazi Germany. Now fighting two wars - one in the skies against the Nazis and the other against racism back at home in the US - the Red Tails were determined to prove to the world that they had the right stuff. Ordered to adopt life-threatening tactics to knock out German radar stations and go head-to-head with the enemies' technologically advanced fighter jets, the Red Tails never caved in. This programme documents how their success helped secure the Nazi's defeat and changed the course of American history.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/5830/5z7f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/5830/5z7f.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img689.imageshack.us/img689/9483/a6h6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img689.imageshack.us/img689/9483/a6h6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img163.imageshack.us/img163/8500/ngq9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img163.imageshack.us/img163/8500/ngq9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img194.imageshack.us/img194/7466/hzsu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img194.imageshack.us/img194/7466/hzsu.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/1695/wvoz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/1695/wvoz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img29.imageshack.us/img29/2451/8yrz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img29.imageshack.us/img29/2451/8yrz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img62.imageshack.us/img62/7223/5n1o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img62.imageshack.us/img62/7223/5n1o.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img24.imageshack.us/img24/2814/bqq9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img24.imageshack.us/img24/2814/bqq9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img849.imageshack.us/img849/1034/16k1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img849.imageshack.us/img849/1034/16k1.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0c44656b644c403f223c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2139 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 45mins\n * Framerate: 25fps\n * Number of Parts: 6\n * Part Size: average 687 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.channel5.com/shows/heroes-of-the-skies/articles/about-the-show&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel5.com/shows/heroes-of-the-skies/articles/about-the-show&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d483a6af42134b0645c56cbe0f0a92fd6d06a5c4","amp;dn":"National+Geographic+War+Heroes+Of+The+Skies+5of6+Vietnam+Dogfigh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d483a6af42134b0645c56cbe0f0a92fd6d06a5c4","infoHashBuffer":{"type":"Buffer","data":[212,131,166,175,66,19,75,6,69,197,108,190,15,10,146,253,109,6,165,196]},"announce":[],"urlList":[]}}