{"title":"Mary Russell and Sherlock Holmes Series by Laurie R. King 1-12","uid":7678839,"size":25667499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d491a03e3ca29ed423cb2c37495b5ebcb9aaf1ad&amp;dn=Mary+Russell+and+Sherlock+Holmes+Series+by+Laurie+R.+King+1-12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"azizex666","files":-1,"time":1348768124,"description":"Mary Russell is a fictional character in a mystery series by American author Laurie R. King.\n\nWritten over a period of nearly two decades, King's novels are portrayals of a succession of memoirs written and compiled apparently by an aged Mary Russell. A note from the editor (signed by Laurie R. King) tells readers of a mysterious occurrence wherein a collection of written accounts was anonymously delivered to the unsuspecting novelist; the note ends with a plea for information from anyone with information on the identity of Mary Russell.\n\nThe stories are set between 1915 and the late 1920s, mainly in England but extending to Scotland, Wales, Palestine, northern India and California. They begin with fifteen year-old Mary Russell (she was born on 2 January 1900), who runs into a middle-aged individual she realizes is, in fact, Sherlock Holmes - the former consulting detective of Baker Street, now retired to Sussex, where he keeps bees. However, in the form of Mary Russell's memoirs, Sherlock Holmes stays in the stories mostly through the influence he has in Russell's life. Laurie R. King strives to clarify this, and is quoted on her website, &quot;I did not write Sherlock Holmes stories, I wrote Mary Russell stories&quot;.[1] Holmes plays a considerable role at first as Russell's closest friend, her calculating and idiosyncratic mentor, and as time and circumstance conspire, the Great Detective takes up the role of companion detective. During that time, Russell and Holmes come to have a great respect for one another. Seven years from their first meeting, the two negotiate a marriage agreement, and are married in 1921.\n\nMost of the novels are first-person, with Locked Rooms, The Language of Bees and God of the Hive being exceptions, since several long passages are third-person. This technique also serves to underscore and solidify themes in the first two of these novels. The third of this trio, God of the Hive published 2010, is probably primarily first-person as well, however Mary's narrative collaborates with the various third-person narratives of several characters, and in this way, God of the Hive manages to cover much wider ground than its companion novels.\n\n Book 01 - The Beekeeper's Apprentice \n Book 02 - A Monstrous Regiment of Women\n Book 03 - A Letter of Mary\n Book 04 - The Moor\n Book 05 - O Jerusalem\n Book 06 - Justice Hall\n Book 07 - The Game\n Book 08 - Locked Rooms\n Book 09 - The Language of Bees\n Book 10 - The God of the Hive\n Book 11 - Pirate King\n Book 12 - Garment of Shadows\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n \n\n            **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                   &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:d491a03e3ca29ed423cb2c37495b5ebcb9aaf1ad","amp;dn":"Mary+Russell+and+Sherlock+Holmes+Series+by+Laurie+R.+King+1-12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d491a03e3ca29ed423cb2c37495b5ebcb9aaf1ad","infoHashBuffer":{"type":"Buffer","data":[212,145,160,62,60,162,158,212,35,203,44,55,73,91,94,188,185,170,241,173]},"announce":[],"urlList":[]}}