{"title":"Meg Baird...Seasons on Earth(2011)[FLAC]","uid":6750592,"size":272486755,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d497a7c29e11846f9ded11dc1b10aaf8fb2e7f60&amp;dn=Meg+Baird...Seasons+on+Earth%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":13,"time":1318859101,"description":"[img]http://ecx.images-amazon.com/images/I/51mBeB2VaNL._SL500_AA300_.jpg[/img]\n[color=Green]Seasons on Earth [2011]Drag City / DC470 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  Babyon  2:37 \n  2  Stars Climb Up the Vine  7:25 \n  3  Share  6:19 \n  4  Even Rain  3:04 \n  5  Friends  5:57 \n  6  Beatles and the Stones  3:17 \n  7  The Finder  4:42 \n  8  The Land Turned Over  4:37 \n  9  Stream  6:40 \n  10  Song for Next Summer  6:20 \n\nI remember the liner notes to the Jayhawk's album Tomorrow the Green Grass included a sort of disclaimer about the album something along the lines of: Even though the songs sound simple, they are complex. It's a fallacy to think of a folk record as something simple and wrought only out of guitar strums and a ragged voice. Nowhere is there a more clear example of how complex a folk record can be than on Meg Baird's minimalist Seasons on Earth. With often just an acoustic guitar, Baird weaves delicate textures throughout the record, crafting songs with layers of the most intimate sounds: a voice and guitar.\n\n\nThough Seasons On Earth is only her second record, Baird comes from a long line of folksingers. She was the lead vocalist of freak-folk outfit Espers, has collaborated with Sharon Van Etten, Bonnie 'Prince' Billy, and she is the great-great niece of I.G. Greer (who helped the young Meg play guitar). It's little wonder, then, that Baird feels so in control of this album even though it's her first of mostly original material (2007's Dear Companion featured mostly covers and takes on traditional tracks). \n\n\nOf course, folk music has changed a lot since I.G. Greer. Baird's gentle fingerpicking accentuates a fluid, languorous voice making the album seem meditative and lyrical. We aren't struck with songs of social unrest and ballads of common and uncommon men and women. As Baird illustrates on this album, folk music has changed into something quiet different. A place-marker for a type of sound and, really, a sort of relationship between the listener and the artist. Folk music isn't just quiet music, it's intimate music, it's connective music that needs to be heard to live. So, it's not surprising, the spare elegance of the way the slide guitar lilts on &quot;The Finder&quot; or the harmonies on &quot;Even Rain.&quot; And it's not surprising as well that it's probably more difficult to listen to this album than the clang and clash of many others. The tranquil, meditative state that it provokes makes you have to listen even closer for the juxtaposition. In its entirety, the songs seem to slide into one another until the clatter of the penultimate track &quot;Stream,&quot; which, accordingly turns from a feedback driven ambush into an acoustic old-timey sounding vocal and guitar section before ratcheting back up with strums and swings into the music. \n\n\nFor Baird, an album seems to be a time more than a place and in Seasons on Earth she succeeds in halting the movement of the world for a very fine folk record. In many ways, it makes me feel a bit of regret in the slow dwindling of the freak-folk movement, which seemed to want to change the way that we heard and interacted with one of the great American art forms, the folk song. However, it's lovely that Baird is still here, challenging us to listen closely and changing the way that we do.\n\nripped by someone else using X Lossless Decoder\n\nplease seed\n\n[url]http://dickthespic.org/2010/11/20/meg-baird/[/url]\n[url]http://dickthespic.org/2010/11/21/espers/[/url]\n\n","torrent":{"xt":"urn:btih:d497a7c29e11846f9ded11dc1b10aaf8fb2e7f60","amp;dn":"Meg+Baird...Seasons+on+Earth%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d497a7c29e11846f9ded11dc1b10aaf8fb2e7f60","infoHashBuffer":{"type":"Buffer","data":[212,151,167,194,158,17,132,111,157,237,17,220,27,16,170,248,251,46,127,96]},"announce":[],"urlList":[]}}