{"title":"Sexual Abuse in Christian Homes and Churches - Collection 4","uid":5263190,"size":79831908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d568df384327e83dcb9516f0bfa83e58bccbb04f&amp;dn=Sexual+Abuse+in+Christian+Homes+and+Churches+-+Collection+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moman73","files":14,"time":1262802299,"description":"Sexual Abuse in Christian Homes and Churches - Collection 4:\n\nThe title of this upload is borrowed from the title of a book written by Carolyn Heggen (included in the UL). The UL is labeled Collection 4 because there are three previous uploads that discuss the same topic though with different emphasis:\n\n- Sexual Abuse of Nuns in Convents and Nunneries\n- Sexual Abuse of Minors and Pedophilia by Priests and Clergymen\n- Sex Solicitation in Auricular Confession - A Collection\n\nThis UL contains the following 14 titles:\n\n1- Heggen - Sexual Abuse in Christian Homes and Churches (1993)\n\n2- Nauheimer - I Accuse\n\n3- Heaven Preserve Us from Catholic Church\n\n4- Rubino - Suffer the Parents_Clergy Sexual Abuse of Children (1996)\n\n5- We Have Failed Our Children\n\n6- Ferro - Sexual Misconduct and the Clergy (2005)\n\n7- Sipe - Celibacy in Crisis (2003)\n\n8- The Discoveries of Barbara Anderson (2009)\n\n9- Jessop &amp; Brown - Church of Lies (2009)\n\n10- DeCamp - The Franklin Cover-up (1996)\n\n11- McCall - When the Piano Stops (2009)\n\n12- Richardson - The Ubreakable Child (2007)\n\n13- Kennedy - Lucifer's Lodge - Satanic Ritual Abuse in the Catholic Church (2004)\n\n14- Gage - Woman, Church and State (1893)\n\n\nThe last title in the group (#14) tells us that the roots of sexual abuse of women run deep in the teachings and practices of the Church and in the feudal system of the middle ages. Here are short excerpts from that book (Pages 152-154):\n\n    The minds of people having been corrupted through centuries by the doctrines of the Church in regard to woman, it became an easy step for the State to aid in her degradation. The system of feudalism arising from the theory that warfare was the normal condition of man, still oppressed woman by bringing into power a class of men accustomed to deeds of violence, who found their chief pleasure in the sufferings of others. To be a woman appealed to no instinct of tenderness in this class. To be a woman was not to be protected unless such woman held power in her own right, or acted in place of some feudal lord. The whole body of villeins and serfs were under absolute\ndominion of the feudal lords. They were regarded as possessing no rights of their own; the priests had control of their souls, the lord, of their bodies. . .\n\n. . . Women were taught by church and state alike that the feudal lord or seigneur had a right to them not only as against themselves, but as against any claim of husband or father. The custom known by a variety of names, but more modernly as 'marchetta,&quot; or &quot;marquette,&quot; compelled newly married women to a most dishonorable servitude. They were regarded as the rightful prey of the feudal lord for from one to three days after their marriage, and\nfrom this custom, the oldest son of the serf was held as the son of the lord, &quot;as perchance it was he who begot him.&quot; . . .\n\n. . . Although feudalism is generally considered the parent of this most infamous custom, some writers attribute its origin to an evangelical council, or to precepts directly inculcated by the church, whose very highest dignitaries did not hesitate to avail themselves of the usage. In 1471, quite the latter part of the fifteenth century, Pope Sixtus IV sought admission to the very illustrious Piedmont family, Delia Rovere, which possessed the right of cuissage, allowing the lord absolute control of his vassals newly wedded bride for three days and nights; a cardinal of the family having secured the patent by which this outrageous and abominable right was granted them. \n\n\n","torrent":{"xt":"urn:btih:d568df384327e83dcb9516f0bfa83e58bccbb04f","amp;dn":"Sexual+Abuse+in+Christian+Homes+and+Churches+-+Collection+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d568df384327e83dcb9516f0bfa83e58bccbb04f","infoHashBuffer":{"type":"Buffer","data":[213,104,223,56,67,39,232,61,203,149,22,240,191,168,62,88,188,203,176,79]},"announce":[],"urlList":[]}}