{"title":"Revision &amp; self-editing : techniques for transforming your f","uid":9164629,"size":1539145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d618147cff3157bc3344a77c43cbf4a18f246eed&amp;dn=Revision+%26amp%3B+self-editing+%3A+techniques+for+transforming+your+f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1383947004,"description":"Revision &amp; self-editing : techniques for transforming your first draft into a finished novel\nBy James Scott Bell\n\nDon't let the revision process intimidate you any longer. Discover how to successfully transform your first draft into a polished final draft readers won't be able to forget.\n\nIn Write Great Fiction: Revision &amp; Self-Editing, James Scott Bell draws on his experience as a novelist and instructor to provide specific revision tips geared toward the first read-through, as well as targeted self-editing instruction focusing on the individual elements of a novel like plot, structure, characters, theme, voice, style, setting, and endings. You'll learn how to:\n\nWrite a cleaner first draft right out of the gate using Bell's plotting principles\nGet the most out of revision and self-editing techniques by honing your skills with detailed exercises\nSystematically revise a completed draft using the ultimate revision checklist that talks you through the core story elements\nWhether you're in the process of writing a novel, have a finished draft you don't know what to do with, or have a rejected manuscript you don't know how to fix, Revision &amp; Self-Editing gives you the guidance you need to write and revise like a pro.\n\nAbout the Author\n\nJames Scott Bell is the author of the Write Great Fiction: Plot &amp; Structure and a contributing editor to Writer?s Digest magazine. He is also the author of more than fifteen novels currently teaches fiction writing courses at Pepperdine University and is a regular speaker at writers conferences.\n\nwww.jamesscottbell.com","torrent":{"xt":"urn:btih:d618147cff3157bc3344a77c43cbf4a18f246eed","amp;dn":"Revision+%26amp%3B+self-editing+%3A+techniques+for+transforming+your+f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d618147cff3157bc3344a77c43cbf4a18f246eed","infoHashBuffer":{"type":"Buffer","data":[214,24,20,124,255,49,87,188,51,68,167,124,67,203,244,161,143,36,110,237]},"announce":[],"urlList":[]}}