{"title":"Corps Strength: A Marine Master Gunnery Sergeant's Program","uid":8767523,"size":3061667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d62959a6084c056d86b53cd05968a305cb48a49d&amp;dn=Corps+Strength%3A+A+Marine+Master+Gunnery+Sergeant%27s+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1375368575,"description":" Paul J. Roarke, &quot;Corps Strength: A Marine Master Gunnery Sergeant's Program for Elite Fitness&quot;\nEnglish | ISBN: 1459602048 | 2010 | EPUB | 272 pages | 2,9 MB\n\nRenowned for its rigorous fitness training, the Marine Corps requires every member to be physically fit, regardless of age, grade, or duty assignment. Corps Strength applies the same techniques used to develop and maintain each Marine 's combat readiness to a day-to-day program for top-level fitness. Every aspect of training is incorporated into the program - including warm-ups, stretching, upper body, core strength, lower body, cardio, running, goal-setting, and motivation. The author has trained thousands of people and witnessed time and again the amazing results achieved by these proven techniques. Regardless of current fitness levels, this personalized training methodology will enable readers to begin today and immediately progress in absolute strength, muscular endurance, aerobic capacity, and joint flexibility. The workouts in this book are packed with grueling mind- and body-draining tasks that test the mettle of any athlete while bringing him or her to top physical form.","torrent":{"xt":"urn:btih:d62959a6084c056d86b53cd05968a305cb48a49d","amp;dn":"Corps+Strength%3A+A+Marine+Master+Gunnery+Sergeant%27s+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d62959a6084c056d86b53cd05968a305cb48a49d","infoHashBuffer":{"type":"Buffer","data":[214,41,89,166,8,76,5,109,134,181,60,208,89,104,163,5,203,72,164,157]},"announce":[],"urlList":[]}}