{"title":"White Knight Chronicles II [EUR][Multi][Spanish][PS3][www.consol","uid":6476558,"size":18804271673,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d66404fbd3d1d0b0923d749fc98a498fa0553350&amp;dn=White+Knight+Chronicles+II+%5BEUR%5D%5BMulti%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":10,"uploader":"consolasatope","files":82,"time":1308328834,"description":"White Knight Chronicles II continÃƒÂºa la historia ÃƒÂ©pica de Leonard con una marca nueva campaÃƒÂ±a ÃƒÂºnica de 30 horas jugador. Con una totalmente rediseÃƒÂ±ado, el sistema dinÃƒÂ¡mico de combate nuevo, puede crear y personalizar sus propias estrategias de ataque emocionante y combos. Con el juego online para hasta seis jugadores, se puede elegir para hacer frente a las misiones cooperativas o de libre vagar por el mundo del juego en equipo, ademÃƒÂ¡s de la funciÃƒÂ³n devuelve Georama lo que le permite construir su propia ciudad en lÃƒÂ­nea personalizables. White Knight II CrÃƒÂ³nicas tambiÃƒÂ©n apoya fÃƒÂ¡cil de jugar chat (a travÃƒÂ©s de teclado) y chat.Features voz: \nInmersiÃƒÂ³n Individual y Multijugador? Batalla fuerzas del mal al tomar personajes de su campaÃƒÂ±a para un jugador en una experiencia de juego multijugador expansiva con un mÃƒÂ¡ximo de otros seis jugadores en lÃƒÂ­nea. \nKnight Remastered Blanco CrÃƒÂ³nicas Edition Internacional incluido? Escuchar el storyline heroica del secuela y tienen la opciÃƒÂ³n viaje por el bono remasterizada original totales superiores 100 horas de jugabilidad. \nFan-PidiÃƒÂ³ CaracterÃƒÂ­sticas Nueva? Mejora mecÃƒÂ¡nica jugabilidad que ventiladores exigiÃƒÂ³ incluyendo, por primera vez, la capacidad de crear y personalizar su Incorruptus propio (un caballero ÃƒÂºnicas) y un sistema batalla mejorada que hace batallas rÃƒÂ¡pido ritmo y dinÃƒÂ¡mico. \nAmplia Variedad de Opciones PersonalizaciÃƒÂ³n Arma y Armadura? Jugadores pueden crear sus propio estilo combate ÃƒÂºnico con mÃƒÂ¡s de 400 nueva armadura y opciones arma. \nNueva Habilidades y Hechizos? Habilidades para seleccionar habilidades y hechizos como ataques cargo, ataques rociada y dual armas blandiendo, proporcionar adicionales tipos carÃƒÂ¡cter distinto. \nExpansivo Modo Online Nueva? Un modo online masiva extiende la jugabilidad allÃƒÂ¡ la historia del juego con hasta seis jugadores en nuevas misiones y desafÃƒÂ­os. \n","torrent":{"xt":"urn:btih:d66404fbd3d1d0b0923d749fc98a498fa0553350","amp;dn":"White+Knight+Chronicles+II+%5BEUR%5D%5BMulti%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66404fbd3d1d0b0923d749fc98a498fa0553350","infoHashBuffer":{"type":"Buffer","data":[214,100,4,251,211,209,208,176,146,61,116,159,201,138,73,143,160,85,51,80]},"announce":[],"urlList":[]}}