{"title":"Matt Monro  3 Albums","uid":4183049,"size":170571447,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7a66a792c81e9b3c0bc61b67488d17badee9c5b&amp;dn=Matt+Monro++3+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"mingy2","files":37,"time":1210515909,"description":"\n\nMatt was born Terry Parsons in north London in 1930, to Alice and Frederick. He had three brothers, Arthur, Reg and Harry and a sister, Alice. It was a tough childhood, his father died when he was three and after his mother became ill, he was fostered out for two years. Leaving school at 14, he tried a succession of jobs without sticking at any of them for very long, before National Service beckoned at age 18 and Matt became a tank driving instructor in the army and was posted to Hong Kong. He had sung in public from an early age, notably at the local Tufnell Park Palais, and in Hong Kong he took to entering local talent contests, winning several. In fact, he became so successful he was eventually barred from competing. Instead they gave him his own radio show, Terry Parsons Sings. After de-mob, he returned to London, to try and make a career out of singing. Initially he had little success and was obliged to take on a driving job to supplement his meagre income from the occasional singing engagement. He also hung around the music publishers offices in Denmark Street and occasionally made demos of new songs for their ever-optimistic song-pluggers to hawk around. \n \n \n Before too long, however, pianist Winifred Atwell heard his voice and recommended him to her own recording company, Decca, who signed him. She also helped choose his new name, Matt Monro. Matt coming from Matt White, a journalist friend, and Monro was Atwell?s father?s first name. Although the recording session went well, sales were only moderate. He got some radio exposure on Radio Luxembourg and also on the BBC with Cyril Stapleton&amp;#039;s &amp;#039;BBC Showband&amp;#039; show and a TV spot on The Winifred Atwell Show. But his lucky break came when EMI producer George Martin asked him to make a demo disc for Peter Sellers to use as a guide to copying the voice and style of Frank Sinatra for his forthcoming album, &quot;Songs for Swinging Sellers&quot;. It was such a good guide that Sellers realised he couldn?t improve on it himself and the recording was included on the LP under the name of Fred Flange. When word got out who the singer really was and what a fine voice he had, George Martin knew he was onto a winner and signed him for the Parlophone label. Almost immediately the combination of Monro, Martin and arranger/conductor Johnnie Spence had UK hit parade success with Portrait of My Love. This was swiftly followed by further hits of the calibre of My Kind Of Girl, Gonna Build a Mountain, Softly As I Leave You, From Russia with Love and Walk Away. The latter became the first hit for his manager and friend, Don Black, whom he had met during his Denmark Street days when Don was working for Toff Music. He also made the American charts at a time when this was still quite a rare occurrence, with My Kind of Girl &amp; Walk Away. Another success came when he became the first artist to cover &quot;Yesterday&quot;, taking it into the top ten in England. \n \n \n     He continued touring, working at the very best nightclubs like &amp;#039;The Talk Of The Town&amp;#039;, and was a regular on TV. Unfortunately there was a side to Matt Monro that was more-or-less unknown to the public. He had a drink problem. He simply loved drinking (he was also a heavy smoker) and the best entreaties of manager Black could not contain it. His performances appeared completely unaffected by the effects of alcohol, but eventually and almost inevitably, his health suffered. He was diagnosed with cancer of the liver but continued working. Doctors suggested a liver transplant as a last resort to save him, but during the operation at Addenbrookes Hospital in Cambridge surgeons discovered the cancer had spread widely and a transplant would have been pointless. Matt discharged himself and went back to singing, knowing he had little time left. His last performance was at London&amp;#039;s recently opened Barbican Centre and he died shortly afterwards at the Cromwell hospital in London, 7th February 1985, at the age of only 54.\n \n \nMatt Monro - All These Years\n\n\n\n01 - There&amp;#039;s A Kind Of Hush (Reed / Stephens)\n02 - Release Me (Miller / Williams / Yount / Harris)\n03 - Don&amp;#039;t Sleep In The Subway (Trent / Hatch)\n04 - What To Do? (Stillman / Ortolani)\n05 - The Happening (Holland / Dozier / Holland / Devol)\n06 - These Years (Hamilton / Fascinato)\n07 - You Don&amp;#039;t Have To Say You Love Me (Donaggio / Wickham / Napler-Bell)\n08 - Music To Watch Girls By (Ramin / Velona)\n09 - Here, There And Everywhere (Lennon / McCartney)\n10 - Spanish Eyes (Kaempfert / Singleton)\n11 - Nobody Cares For Me (Comer)\n\n\n\n\nMatt Monro - This Is The Life (1966)\n\n\n\n01 - I&amp;#039;m Glad There Is You\n02 - This Is The Life\n03 - You&amp;#039;re Gonna Hear From Me\n04 - I&amp;#039;ll Take Romance\n05 - Strangers In The Night\n06 - On A Clear Day (You Can See Forever)\n07 - Sweet Lorraine\n08 - My Best Girl\n09 - On A Wonderful Day Like Today\n10 - Merci Cherie\n11 - Honey On The Vine\n\n\n\n\n\n\nMatt Monro - Love Is The Same AnyWhere (1961)\n\n\n\n01 - Love Is The Same Anywhere\n02 - Jeannie\n03 - Let&amp;#039;s Face The Music And Dance\n04 - Such Is My Love\n05 - The Thing About Love\n06 - Come Sta\n07 - Cheek To Cheek\n08 - I&amp;#039;ll Dream Of You\n09 - April Fool\n10 - Mirage\n11 - There Are No Words For Love\n12 - No One Will Ever Know","torrent":{"xt":"urn:btih:d7a66a792c81e9b3c0bc61b67488d17badee9c5b","amp;dn":"Matt+Monro++3+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a66a792c81e9b3c0bc61b67488d17badee9c5b","infoHashBuffer":{"type":"Buffer","data":[215,166,106,121,44,129,233,179,192,188,97,182,116,136,209,123,173,238,156,91]},"announce":[],"urlList":[]}}