{"title":"Lions of Kandahar_ War in Afghanistan","uid":15528790,"size":213221889,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d7a7474cf671b71f15251f74636a1fc1aca46f93&amp;dn=Lions+of+Kandahar_+War+in+Afghanistan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"usparc56","files":3,"time":1470806811,"description":"Lions of Kandahar: The Story of a Fight Against All Odds\r\nWritten by: Rusty Bradley, Kevin Maurer\r\nNarrated by: Eric G. Dove\r\nLength: 8 hrs and 37 mins \r\nUnabridged Audiobook\r\nRelease Date:05-11-12\r\nPublisher: Brilliance Audio\r\n\r\nPublisher's Summary\r\n\r\nOne of the most critical battles of the Afghan War is now revealed as never before. Lions of Kandahar is an inside account from the unique perspective of an active-duty U.S. Army Special Forces commander, an unparalled warrior with multiple deployments to the theater who has only recently returned from combat.\r\n\r\nSouthern Afghanistan was slipping away. That was clear to then-Captain Rusty Bradley as he began his third tour of duty there in 2006. The Taliban and their allies were infiltrating everywhere, poised to reclaim Kandahar Province, their strategically vital onetime capital. To stop them, the NATO coalition launched Operation Medusa, the largest offensive in its history. The battlefield was the Panjwayi Valley, a densely packed warren of walled compounds that doubled neatly as enemy bunkers, lush orchards, and towering marijuana stands, laced through with treacherous irrigation ditches. A mass exodus of civilians heralded the carnage to come.\r\n\r\nDispatched as a diversionary force in support of the main coalition attack, Bradley’s Special Forces A-team and two others, along with their longtime Afghan Army allies, watched from across the valley as the NATO force was quickly engulfed in a vicious counterattack. Key to relieving it and calling in effective air strikes was possession of a modest patch of high ground called Sperwan Ghar. Bradley’s small detachment assaulted the hill and, in the midst of a savage and unforgettable firefight, soon learned they were facing nearly a thousand seasoned fighters - from whom they seized an impossible victory","torrent":{"xt":"urn:btih:d7a7474cf671b71f15251f74636a1fc1aca46f93","amp;dn":"Lions+of+Kandahar_+War+in+Afghanistan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a7474cf671b71f15251f74636a1fc1aca46f93","infoHashBuffer":{"type":"Buffer","data":[215,167,71,76,246,113,183,31,21,37,31,116,99,106,31,193,172,164,111,147]},"announce":[],"urlList":[]}}