{"title":"Knitting New Mittens and Gloves","uid":9206441,"size":127081410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7f43948d91b065adea9f4f6b0aa156cffb0617b&amp;dn=Knitting+New+Mittens+and+Gloves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384706593,"description":"Growing up in Cape Breton, on Canada?s Atlantic coast, knitwear designer Robin Melanson learned early on the importance of gloves and mittens in a harsh winter climate. Now this self-described ?mitten and glove aficionado? shares her enthusiasm for these ordinary items by presenting 28 extraordinary ways to make them for year-round style. Featuring gloves, mittens, arm warmers, mitts, and fingerless gloves, this is the second book in a new SCT Craft series that introduces innovative approaches to creating popular knitted items. Knitting New Mittens and Gloves combines traditional and untraditional techniques?as well as influences as far-flung as Gothic architecture, Estonian lace, and Wagnerian opera?in a winning collection of patterns for adults and children. From wool mittens filled with unspun fleece and arm warmers with leather laces, to cotton-mesh fingerless gloves and silk-beaded mitts to be worn as adornments, each design has an unexpected twist. Because they are small, quick to make, and don?t require a lot of yarn, mittens and gloves are perfect projects for knitting throughout the year, and they also offer an ideal opportunity for beginning and more seasoned knitters to experiment with new techniques, yarns, and styles. With its fresh, original sensibility, Knitting New Mittens and Gloves will captivate knitters of every level.","torrent":{"xt":"urn:btih:d7f43948d91b065adea9f4f6b0aa156cffb0617b","amp;dn":"Knitting+New+Mittens+and+Gloves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f43948d91b065adea9f4f6b0aa156cffb0617b","infoHashBuffer":{"type":"Buffer","data":[215,244,57,72,217,27,6,90,222,169,244,246,176,170,21,108,255,176,97,123]},"announce":[],"urlList":[]}}