{"title":"Alan Lomax - Blues Songbook (1934-78) [FLAC]","uid":6221700,"size":729618834,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d835775ba30d41f09ba47c4e99b33d2f324e35c8&amp;dn=Alan+Lomax+-+Blues+Songbook+%281934-78%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"roylenny","files":91,"time":1299351665,"description":"eac secure cues logs scans\n\nAlan Lomax Blues Songbook\n\n\nDisc: 1\n\n1. Going Down to the River - Mississippi Fred McDowell, Miles Pratcher \n2. Rolled and Tumbled \n3. Cherry Ball Blues - Jack Owens, \n4. Dust My Broom - Howlin' Wolf, , Hubert Sumlin \n5. Boogie Children - Boy Blue, Joe Lee, \n6. Stagolee - Lucious Curtis, Willie Ford \n7. Stop All the Buses - Cecil Augusta \n8. Worried Life Blues - David Honeyboy Edwards \n9. Pony Blues - Son House \n10. Tangle Eye Blues \n11. Trouble So Hard - Vera Hall-Ward, Dock Reed \n12. Worried Blues - Sonny Terry \n13. Beggin' the Blues - Bessie Jones \n14. John Henry - Gabriel Brown \n15. Country Blues - Dock Boggs \n16. Cherry Ball Blues - Skip James \n17. I Hate a Man Like You - Jelly Roll Morton \n18. Roll 'Em Pete - Pete Johnson \n19. Kokomo - Memphis Jug Band \n20. Life Is Like That - Big Bill Broonzy, Memphis Slim, Sonny Boy Williamson \n\n\nDisc: 2\t\n\n1. I Could Hear My Name A-Ringin' - Big Bill Broonzy, Memphis Slim, Sonny Boy Williamson \n2. Dimples in Your Jaws - Boy Blue, Joe Lee, \n3. Catfish Blues - Jack Owens, \n4. Kill-It-Kid Bag - Blind Willie McTell \n5. You're Gonna Need My Help - Elinor Boyer \n6. Army Blues - David Honeyboy Edwards \n7. Blues de la Prison - Alphonse &quot;Bois Sec&quot; Ardoin, Canray Fontenot \n8. I Been Drinking - Vera Hall-Ward \n9. I Been a Bad, Bad Girl (Prisoner Blues) - Ozella Jones \n10. I Be's Troubled - Muddy Waters \n11. Boogie Instrumental - R.L. Burnside \n12. Blind Lemon Blues - Leadbelly \n13. Sweet Patootie Blues - Albert Ammons \n14. Last Time - Sam Chatmon \n15. Shorty George - Smith Casey \n16. Desert Blues - Hattie Ellis, \n17. Joe Turner - Hobart Smith, Ed Young \n18. Joe Turner - Bob Pratcher, Miles Pratcher \n19. Joe Turner \n20. See That My Grave Is Kept Clean - Hobart Smith \n21. How Long Blues - Leadbelly, Brownie McGhee, Sonny Terry \n\n\nAllmusic.com review\nSteve Leggett wrote:\n\nFrom 1933-1985, Alan Lomax (along with his father, John A. Lomax) gathered field-recorded examples of African-American song forms, most of which ended up in the expansive Library of Congress American folk music collection. This two-disc collection selects some of the best of these into a single package and the result is a wonderful and indispensable journey through the blues, beginning with the sparkling opening track, &quot;Going Down the River,&quot; a variant of a Sleepy John Estes song done by slide guitarist Mississippi Fred McDowell, with Fannie Davis on comb kazoo and Miles Pratcher on second guitar. There are several amazingly intimate performances here, including Skip James singing &quot;Cherry Ball Blues&quot; at the 1966 Newport Folk Festival just days after his re-discovery, and his high, eerie voice and delicate guitar playing combine to create a stunning moment in which a legend is literally reborn out of the haze of 1930s blues 78s. That feat is nearly duplicated by Dock Boggs, whose ragged voice and banjo on &quot;Country Blues,&quot; a variant of the banjo tune &quot;Darling Corey,&quot; brings another lost bluesman back from the land of old 78s. There are also three very different versions of &quot;Joe Turner&quot; here and they afford a valuable lesson in the mutability of folk material. Joe Turner was really Joe Turney, who, in the early 1890s, was the so-called &quot;long chain man&quot; in Mississippi, the transfer man whose job it was to march groups of prisoners from court to the penal institutions and work camps where the convict lease system operated. Needless to say, he was much feared and hated. The first version here features Ed Young on cane fife and Hobart Smith on banjo, while the second has Miles Pratcher on guitar and Bob Pratcher on fiddle, and features the lines &quot;I laid down happy/And I woke up crying.&quot; By the time Big Bill Broonzy's version was recorded in the early '60s, Joe Turner had become a savior who sets prisoners free, an interpretation of events hardly supported by the facts, and a fascinating study in the reversal of fortune of a blues lyric.","torrent":{"xt":"urn:btih:d835775ba30d41f09ba47c4e99b33d2f324e35c8","amp;dn":"Alan+Lomax+-+Blues+Songbook+%281934-78%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d835775ba30d41f09ba47c4e99b33d2f324e35c8","infoHashBuffer":{"type":"Buffer","data":[216,53,119,91,163,13,65,240,155,164,124,78,153,179,61,47,50,78,53,200]},"announce":[],"urlList":[]}}