{"title":"Andy.McNabs.Tour.Of.Duty.Series.1.1of6.Under.Siege.480p.DVDRip.x","uid":11024473,"size":703250969,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8af11b6b50067d76be3e91bb64e2e4418709f14&amp;dn=Andy.McNabs.Tour.Of.Duty.Series.1.1of6.Under.Siege.480p.DVDRip.x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1410653125,"description":"Andy McNabs Tour of Duty: Series 1\n\nWar Documentary hosted by Andy McNab, published by ITV in 2009 - English narration\n\n\n\nInformation\n------------------------------\n\nAndy McNab's Tour Of Duty: Series 1\nSix-part series presented by former SAS soldier Andy McNab. From weapons and tactics to medical treatment and the chain of command, Andy provides the viewer with extraordinary insights into the deadly threats that British soldiers in Basra and Helmand face on a daily basis.\n\n\n1)  Under Siege \nFormer SAS soldier Andy McNab fronts this hard-hitting series, uncovering the real truth and stories behind British and American soldiers fighting in Iraq and Afghanistan. In this episode, the amazing story of the Princess of Wales Royal Regiment who spent four months under constant barrage of mortars, machine guns and small arms in Al Amarah, south of Baghdad. The soldiers themselves tell how they lived under the strain. Plus the US marine sniper who came under siege, not only from the enemy forces but also from his fellow marines while perched on top of an oil tank in Iraq.\n\n2)  Face to Face \nIn the streets of Iraq, battles are raging where soldiers have to fight the enemy at very close range, sometimes only a few metres. Soldiers from 1 Royal Horse Artillery tell how nine men, heavily outnumbered, were left trapped inside a house shooting insurgents who were beating at the doors. Plus the story of David Bellavia, an American infantryman who killed insurgents with his bare hands in Fallujah.\n\n3)  Ambush \nIn this episode, what it's like to come under surprise attack, and how troops combat such tactics. The men of 3 Para tell how they had to fight their way out of a massive Taliban ambush. And in Iraq, a medal-winning United States Marine tells how he ran straight into insurgent machine gun fire to save his men.\n\n4)  Man Down \nIt is a fact of war that soldiers get injured and killed, but their comrades display amazing courage and take immense risks to save lives on the field. Men like Lieutenant Simon Cupples of the Mercian Regiment, who put himself at risk no fewer than five times to save his injured mates. Plus the US Marines who faced incoming fire on the rooftop in Fallujah trying to save their dying friend.\n\n5)  Hidden Enemy \nHome made bombs - called improvised explosive devices or IEDs by the military - are a constant threat, liable to maim anybody unfortunate enough to come across them. Pete Norton tells how, knowing full well the risks he was taking, took the long walk to an IED in Baghdad which then exploded injuring him badly. Plus amazing footage of a US marine being blown up by an IED.\n\n6)  Courage under Fire \nEngineers are the unsung heroes of the battlefield, often finding themselves fighting in tractors rather than tanks, and having to blow-up their way through what others go round. Engineer Donald Campbell tells how he drove his digger into the middle of a raging fire-fight, allowing troops to move on and out thanks to the bridge he had constructed.\n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c984a8a0a78985fae7f8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1782 Kbps\n * Video: Resolution: 856 x 480\n * Video: Aspect Ratio: 1.783 (~16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 50mins\n * Framerate: 25fps\n * Number of Parts: 6\n * Part Size: average 670 MB\n * Container: Mp4\n * Source: DVDRip\n * Encoded by: Harry65\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d8af11b6b50067d76be3e91bb64e2e4418709f14","amp;dn":"Andy.McNabs.Tour.Of.Duty.Series.1.1of6.Under.Siege.480p.DVDRip.x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8af11b6b50067d76be3e91bb64e2e4418709f14","infoHashBuffer":{"type":"Buffer","data":[216,175,17,182,181,0,103,215,107,227,233,27,182,78,46,68,24,112,159,20]},"announce":[],"urlList":[]}}