{"title":"Cartoon - Alvin and the Chipmunks - Part 1","uid":4511512,"size":2772215855,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8d24d8923652d46585a1b302b9f3cb3cf0dc0de&amp;dn=Cartoon+-+Alvin+and+the+Chipmunks+-+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"cowboy23","files":12,"time":1226793261,"description":"Here is the first part of my upload of classic Alvin and the Chipmunks TV episodes.\nENJOY!!! :)\n\nEpisodes\n\n1. 21A. &quot;Alvin on Ice&quot;\nAlvin plans to get a famous figure skater, Heather Williams, to appear at the school Pageant.\n\n* Song: &quot;You Might Think&quot; originally performed by The Cars\n* Aired 10/27/84\n\n21B. &quot;Operation: Theodore&quot;\nThe Chipettes are volunteering at the local hospital, and Theodore stops by to bring Eleanor her homework and Theodore ends up missing.\n\n* Song: &quot;The Longest Time&quot; originally performed by Billy Joel\n* Mishap for Jeanette: having her shoes on the wrong feet.\n* Aired 10/27/84\n\n2. 19A. &quot;Royally Received&quot;\nThe Chipmunks get to see Buckingham Palace, and Alvin, in an attempt to impress a girl whose a big fan, tells her he is there to play for the Queen. Now, all he has to do is find the queen and convince her to let them play.\n\n* Aired 10/13/84\n\n* Key song: &quot;Rock This Town&quot; by the Stray Cats.\n* The Chipmunks wear the same suits they wore in the Valentine's special at their concert.\n\n19B. &quot;Gone FishinÃƒÂ¯Ã‚Â¿Ã‚Â½&quot;\nAlvin and the Chipmunks get a job working in an aquarium.\n\n* Song: &quot;The Boys are Back in Town&quot; originally performed by Thin Lizzy\n* Aired 10/13/84\n\n3. 20A. &quot;Setting the Record Straight&quot;\nAlvin and Simon turn Theodore into a record mascot in order to win a radio contest.\n\n* Key song: &quot;On the Road Again&quot; originally performed by Willie Nelson.\n* Aired 10/20/84\n\n20B. &quot;Father's Day Muffins&quot;\nThe Chipmunks sell Theodore's famous muffins so they may buy Dave a new tape recorder, but a mix up in making the batter causes the muffins to become hard.\n\n* Aired 10/20/84\n* Key song: &quot;Whip It&quot; by Devo.\n\n4. 4. &quot;The Chipmunk Story&quot;\nThe origin of the Chipmunks is revealed, including how Dave ended up with the them in the first place, as well as how their musical career got started.\n\n* Key songs: &quot;Never Eat a Chipmunk Diet&quot;, &quot;Witch Doctor&quot; by David Seville and the Chipmunks\n* Aired 10/8/83\n* Was released on VHS along with &quot;A Chipmunk Reunion&quot; in The Chipmunk Family Tree.\n\n5. 5A. &quot;Mr. Fabulous&quot;\nAlvin and Simon have Theodore enter a wrestling exhibition under the name &quot;Mr. Fabulous&quot; and he goes up against a monstrous Russian wrestler called Ivan the Terrible.\n\n* Song: &quot;Pump it Up&quot; by Danzel\n* Aired 10/15/83\n\n5B. &quot;Grandma and Grandpa Seville&quot;\nThe Chipmunks meet their grandparents for the first time. Then, when they discover that someone is trying to take over their grandparents' farm, they decide to raise the money needed to save the farm.\n\n* Aired 10/15/83\n* The Chipmunks' Grandparents lived at South Spoon ranch (parody of South Fork in Dallas, Texas).\n* First appearance of Dave's parents, who are also the Chipmunks' adoptive grandparents.\n\n6. 7A. &quot;The Chip Punk&quot;\nAlvin decides to change the Chipmunks' clean cut image to a punkier, more rebellious one in order to gain more publicity, but the trio ends up running from the police when they attempt to perform in an underground club.\n\n* Song: &quot;We Don't Care&quot;\n* Aired 10/29/83\n\n7B. &quot;From Here to Fraternity&quot;\nThe Chipmunks make up a singing telegraph service to help buy some golf clubs for Dave's Birthday. But when Theodore loses the addresses, the boys are sent on a birthday mission, for a $100 bonus. Except, that when Theodore wrote the number he wrote it upside down, so the Chipmunks end up going to the wrong house and are tricked into doing some different pranks for some college students who are bored.\n\n* Aired 10/29/83\n* Title is a spoof to the 1953 film, From Here to Eternity.\n\n7. 2A. &quot;Uncle Harry&quot;\nA charlatan chipmunk named Harry claims to be Alvin, Simon and Theodore's long lost uncle and says he will have them see their mother as soon as they make enough money. The Chipmunks later not only find out that Harry is not their uncle but also the money he has them making is for a strongman whom he has owed for a long time.\n\n* Key song: &quot;Workin' Day and Night&quot; by Michael Jackson\n* Aired 9/24/83\n* First appearance of &quot;Uncle&quot; Harry.\n\n2B. &quot;Rock 'n' Robot&quot;\nThe Chipmunks create a robot out of Alvin's video game, so that it can carry all of their equipment to their concerts. But, the robot goes berserk when it begins to capture every hat it sees, like the video game it was created from, and it is up to Alvin, Simon and Theodore to stop the robot.\n\n* Aired 9/24/83\n* Title is a pun to the saying &quot;Rock 'n' Roll&quot;.\n\n8. 44A. &quot;Chipmunk Vice&quot;\nIn a spoof of Miami Vice, Alvin is a slick detective in pastel shirts looking for his missing prized baseball card.\n\n* Aired 11/1/86\n* Key song: &quot;Sidewalk Talk&quot; by Madonna.\n\n44B. &quot;Hooping it Up&quot;\nThe Chipettes, the Chipmunks, and a tough group of older students participate in a 1950s-themed scavenger hunt at school.\n\n* Song: &quot;My Boyfriend's Back&quot; originally performed by The Angels.\n* Aired 11/1/86\n\n9. 42A. &quot;Experiment in Error&quot;\nAlvin refuses to take Brittany to the Black and White Ball, the biggest social event of the season. So after Alvin causes Brittany to get into an accident in SimonÃƒÂ¯Ã‚Â¿Ã‚Â½s laboratory, she convinces him into believing that she has turned into a zombie so he will take her to the ball.\n\n* Aired 10/18/86\n* Key song: &quot;Here She Comes&quot; originally performed by Bonnie Tyler.\n\n42B. &quot;How You Gonna Keep 'Em Down on the Farm?\nTheodore goes on the lam to help save Clarence, Grandpa SevilleÃƒÂ¯Ã‚Â¿Ã‚Â½s prizewinning calf, from becoming veal.\n\n* Key song: &quot;On the Road Again&quot; (for the second time in the series) originally performed by Willie Nelson.\n* Aired 10/18/86\n* The title references the famous post-World War I phrase, &quot;How're you going to keep them down on the farm once they've seen Gay Paree?&quot;\n\n10. 43A. &quot;Middle Aged Davey&quot;\nDave starts feeling old after his birthday, so the Chipmunks set him up on a date with Marcy Apple, his old college sweetheart. But she has gotten married, so he goes out with Bambi, her younger sisterÃƒÂ¯Ã‚Â¿Ã‚Â½who's young enough to be his daughterÃƒÂ¯Ã‚Â¿Ã‚Â½and they soon begin seeing each other regularly, to the ChipmunksÃƒÂ¯Ã‚Â¿Ã‚Â½ chagrin.\n\n* Song: &quot;Addicted to Love&quot; originally performed by Robert Palmer.\n* Aired 10/25/86\n\n43B. &quot;I Love L.A.&quot;\nAlvin is obsessed with getting a star on the Hollywood Walk of Fame before Dan the Dog gets his, and cooks up a number of schemes to try and get one.\n\n* Song: &quot;I Love L.A.&quot; originally performed by Randy Newman.\n* Aired 10/25/86\n\n11. &quot;Special: I Love the Chipmunks Valentine&quot; (1984)\nThe Chipettes are looking forward to be spending Valentine's Day with the Chipmunks. Simon and Theodore are also looking forward in spending the day with them, except Alvin. He is afraid of being crushed again due to the fact that a girl he once had a crush on broke his heart on Valentines. In order to rebuild his confidence, Simon makes a tape for Alvin to listen to while he sleeps. Without realizing, the tape hypnotizes Alvin into believing he is a casanova named Captain Chipmunk while sleepwalking and is finally able to gather up the courage to ask Brittany... although once he awakens, he can't remember. So, once he finally gathers the courage to ask her, she rejects him, since she has already been invited by the wonderful, dashing, charming Captain Chipmunk. But of course, the special ends with both Alvin and Brittany finally going together and being voted King and Queen Valantine.\n\n* Songs: ÃƒÂ¯Ã‚Â¿Ã‚Â½Captain Chipmunk,ÃƒÂ¯Ã‚Â¿Ã‚Â½ &quot;I Give Up on Love,&quot; &quot;Tell Him&quot; (originally performed by The Exciters)\n* Aired 2/12/84\n* Due to come to DVD on January 23, 2007.\n* This special was included in the syndication package.\n* As of this special, Simon starts wearing blue-framed glasses, whilst Jeanette wears pink-framed glasses.\n* First appearance of the Chipette's treehouse. It will be their residence until &quot;Help Wanted: Mommy&quot;, when they move in with Miss Miller.\n* Mishap for Jeanette: Getting glue on herself.","torrent":{"xt":"urn:btih:d8d24d8923652d46585a1b302b9f3cb3cf0dc0de","amp;dn":"Cartoon+-+Alvin+and+the+Chipmunks+-+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d24d8923652d46585a1b302b9f3cb3cf0dc0de","infoHashBuffer":{"type":"Buffer","data":[216,210,77,137,35,101,45,70,88,90,27,48,43,159,60,179,207,13,192,222]},"announce":[],"urlList":[]}}