{"title":"IPhoto Library Manager v3.5.8","uid":5939609,"size":3228416,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d925e546a693cfbf40bed75fb82ea280bdc5bfa1&amp;dn=IPhoto+Library+Manager+v3.5.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gkarma","files":5,"time":1289095224,"description":"Name: iPhoto Library Manager\nVersion: - 3.5.8\n\nMac Platform: UB\nIncludes: KG\n\nOS version: Mac OS X version 10.3.9 or higher (10.6 compatible)\n\nLink for more information: http://www.fatcatsoftware.com/iplm/\n\nDescription:\n\niPhoto Library Manager... Apple's iPhoto is a convenient application to use to organize and edit your digital photos, but it restricts you to having to keep all of your photos in a single, monolithic library. iPhoto Library Manager adds an additional level of control over your iPhoto collection by allowing you to keep your photos in multiple libraries and transfer them back and forth without losing your keywords, ratings, and all the other information you've worked to assign to your photos.\n\nLibraries can be split into smaller ones, or smaller libraries can be merged together into one large library. You can keep your photos on an external drive or another computer on your network, share them with other users on your machine, sync them all with your iPod, and use iPhoto Library Manager to keep track of it all.\n\n\n\n\n\nAdditional Relevant Information:\n\n- TSwitch to another library with one click by using shortcut files\n- Copy photos from one library to another while retaining titles, comments, keywords, ratings, and dates\n- Split a large library apart into smaller, more manageable libraries\n- Merge multiple libraries together into one\n- Rebuild or extract photos from corrupted iPhoto libraries\n- Create multiple iPhoto libraries, instead of having to keep all your photos in a single library\n- See at a glance what albums are in each of your libraries, as well as their version, modification date, and size\n- Set your library's permissions so that it can be used by multiple users on the same machine\n- Sync photos from multiple libraries with your iPod\n- Customize your photo workflow using built-in Applescript support and Automator actions\n- Import photos directly into a particular library with filtering and metadata options","torrent":{"xt":"urn:btih:d925e546a693cfbf40bed75fb82ea280bdc5bfa1","amp;dn":"IPhoto+Library+Manager+v3.5.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d925e546a693cfbf40bed75fb82ea280bdc5bfa1","infoHashBuffer":{"type":"Buffer","data":[217,37,229,70,166,147,207,191,64,190,215,95,184,46,162,128,189,197,191,161]},"announce":[],"urlList":[]}}