{"title":"Big Bang Disruption: Strategy in the...  (2014) Larry Downes (mu","uid":9549168,"size":7024624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d96ac1ec701d81899a06626f61bfa0f36051ffcb&amp;dn=Big+Bang+Disruption%3A+Strategy+in+the...++%282014%29+Larry+Downes+%28mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"7","files":-1,"time":1391202713,"description":"Big Bang Disruption: Strategy in the Age of Devastating Innovation by Larry Downes, Paul Nunes\n\n\nFormat: mobi/epub/azw3\nLength: 272 pages\nGenre: Non-Fiction/Business/Technology\nDate: 7 January 2014\n\nIt used to take years or even decades for disruptive innovations to dethrone dominant products and services. But now any business can be devastated virtually overnight by something better and cheaper.\n\nJust a few years ago, drivers happily spent more than $200 for a GPS unit. But as smartphones exploded in popularity, free navigation apps exceeded the performance of stand-alone devices. Eighteen months after the debut of the navigation apps, leading GPS manufacturers had lost 85 percent of their market value.\n\nConsumer electronics and computer makers have long struggled in a world of exponential technology improvements and short product life spans. But until recently, hotels, taxi services, doctors, and energy companies had little to fear from the information revolution.\n\nThose days are gone forever. Software-based products are replacing physical goods. And every service provider must compete with cloud-based tools that offer customers a better way to interact.\n\nBased on extensive research by the Accenture Institute for High Performance and in-depth interviews with entrepreneurs, investors, and executives from more than thirty industries, Big Bang Disruption will arm you with strategies and insights to thrive in this brave new world.\n\nAuthors:\n\nLarry Downes is a consultant and author of Unleashing the Killer App. He is a columnist for both Forbes and CNET, and writes regularly for other publications including Slate, the Wall Street Journal, The Harvard Business Review and USA Today. Paul Nunes is the Global Managing Director of Research at the Accenture Institute for High Performance. His research findings have been featured in the New York Times, the Wall Street Journal, USAToday, Los Angeles Times, and Chicago Tribune.","torrent":{"xt":"urn:btih:d96ac1ec701d81899a06626f61bfa0f36051ffcb","amp;dn":"Big+Bang+Disruption%3A+Strategy+in+the...++%282014%29+Larry+Downes+%28mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d96ac1ec701d81899a06626f61bfa0f36051ffcb","infoHashBuffer":{"type":"Buffer","data":[217,106,193,236,112,29,129,137,154,6,98,111,97,191,160,243,96,81,255,203]},"announce":[],"urlList":[]}}