{"title":"Michael Herr - Dispatches. (ePUB)","uid":7969623,"size":1958197,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9734f7da4ac0ed2c29b93910e738e0324f89f73&amp;dn=Michael+Herr+-+Dispatches.+%28ePUB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"SectorVector","files":1,"time":1356795979,"description":"Dispatches is a New Journalism book by Michael Herr that describes the author's experiences in Vietnam as a war correspondent for Esquire magazine. First published in 1977, Dispatches was one of the first pieces of American literature that allowed Americans to understand the experiences of soldiers in the Vietnam War. At a time when many veterans would say little about their experiences during the war, Dispatches allowed for an experience and understanding of the war like no other source to date. The book is noted for a visceral, literary style which distinguishes it from more mundane and accurate historical accounts.\n\nFeatured in the book are fellow war correspondents Sean Flynn and Dana Stone and the photojournalist Tim Page. Only at the end does Herr mention that the first two were captured and presumed dead.\n\nDispatches was reprinted in 2009 by Everyman's Library as a contemporary classic.\n\nSeveral of the fictional (composite character) soldiers mentioned in the book were used as the basis for characters in the movies Apocalypse Now and Full Metal Jacket.\n\n\nInfo courtesy wikipedia.\n\n-_-\n","torrent":{"xt":"urn:btih:d9734f7da4ac0ed2c29b93910e738e0324f89f73","amp;dn":"Michael+Herr+-+Dispatches.+%28ePUB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9734f7da4ac0ed2c29b93910e738e0324f89f73","infoHashBuffer":{"type":"Buffer","data":[217,115,79,125,164,172,14,210,194,155,147,145,14,115,142,3,36,248,159,115]},"announce":[],"urlList":[]}}