{"title":"ABC of Arterial and Venous Disease, 3E [PDF] [StormRG]","uid":11173782,"size":5665079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d99f9c95fa952aa1afd7017170df109444623965&amp;dn=ABC+of+Arterial+and+Venous+Disease%2C+3E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":-1,"time":1412743131,"description":"TITLE/EDITIONABC of Arterial and Venous Disease\nAuthor: Tim England (Editor), Akhtar Nasim (Editor)\nSeries: ABC Series\nPaperback: 120 pages\nPublisher: BMJ Books; 3 edition (November 24, 2014)\nLanguage: English\nISBN-10: 1118740688\nISBN-13: 978-1118740682\nFormat: Retail PDF\n\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n________________________________________________________________________________\n\n\nABC of Arterial and Venous Disease provides a structured, practical approach to clinical assessment, investigation and management of the most commonly presenting arterial and venous disorders.\n\nStructural and functional abnormalities of arteries and veins manifest clinically in a broad spectrum of disorders, including cerebrovascular and carotid artery disease, abdominal aortic aneurysms, acute and chronic limb ischaemia, vasculitis and varicose veins. This revised edition incorporates new chapters on coronary artery disease and acute coronary syndrome, visceral artery stenosis and mesenteric ischaemia, and arteriovenous malformations. Many of these common or chronic conditions first present for initial assessment by primary health care professionals. Case vignettes have been added to relevant chapters to aid understanding and decision making.\n\nFully up to date and from an expert editor and contributor team, ABC of Arterial and Venous Disease remains a useful resource for non-specialist doctors such as general practitioners, family physicians and junior doctors in training. It is also a relevant guide for all other primary health care professionals working within the multidisciplinary teams responsible for patients with chronic arterial and venous disorders.","torrent":{"xt":"urn:btih:d99f9c95fa952aa1afd7017170df109444623965","amp;dn":"ABC+of+Arterial+and+Venous+Disease%2C+3E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d99f9c95fa952aa1afd7017170df109444623965","infoHashBuffer":{"type":"Buffer","data":[217,159,156,149,250,149,42,161,175,215,1,113,112,223,16,148,68,98,57,101]},"announce":[],"urlList":[]}}