{"title":"VEGAS Tycoon","uid":4759441,"size":353217925,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:da708c7eef7eb4f6e919c11ae793993dbec8a9eb&amp;dn=VEGAS+Tycoon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Scream162","files":24,"time":1236636064,"description":"Vegas Tycoon puts you in the shoes of a budding developer in Las Vegas, the gambling capital of the world. You are tasked with buying lots on one of several different streets off the strip, and you must build up on those lots. From the world view, you can construct various buildings to suit your intended clientele, from hotels (small hotels for families or large hotels with high-roller suites), restaurants, magic shows, rollercoaster, circus, bars, nightclubs, beauty parlors, and more. You need to take care of these buildings, which will require you to construct buildings for your mechanics and cleaners.\n\nThe main part of the game is your casino. You choose a size of casino you wish to build (small to large), and you build it. You then enter your casino to design the interior. You can change wallpaper, carpeting, and floor height (to create raised or sunken areas). When it comes time to build, you have a wealth of stuff to choose from. You get the standard tables, like Blackjack, Five Card Stud, Pai Gow, Baccarat, Roulette, and Backgammon. You also have access to a variety of slot machines, from your standard slots, to video poker, to group slots, even to large slots where you can make a car the jackpot, like an SUV or a sports car.\n\nYou can also choose the theme of your resort. Will everything have an American pride them? Will it be futuristic? Will it be set in space? Or will it look like something straight out of the age of dinosaurs?\n\nYou will be required to construct special buildings to serve the gamblers, like a buffet (and accompanying kitchen), cashier booth, ATM machines, security office, pit boss stations, and more.\n\nEach building and game has it's own factors, including smell and noise. You won't want to put the restroom right beside a row of slots, and your high-stakes gamblers won't appreciate screaming loud slot machines next to their quiet, $250 minimum Blackjack tables.\n\nVegas Tycoon offers a campaign mode, as well as sandbox play.","torrent":{"xt":"urn:btih:da708c7eef7eb4f6e919c11ae793993dbec8a9eb","amp;dn":"VEGAS+Tycoon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da708c7eef7eb4f6e919c11ae793993dbec8a9eb","infoHashBuffer":{"type":"Buffer","data":[218,112,140,126,239,126,180,246,233,25,193,26,231,147,153,61,190,200,169,235]},"announce":[],"urlList":[]}}