{"title":"Android Phones For Dummies (3rd Ed)(gnv64)","uid":12510030,"size":14516700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dab494a9079d69d486eca1a8d8ba058f5726e1da&amp;dn=Android+Phones+For+Dummies+%283rd+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":5,"time":1443521876,"description":"Android Phones For Dummies (3rd Ed)\r\nBy Dan Gookin\r\nFor Dummies | September 2015 | ISBN-10: 1119126002 | 352 Pages | ePUB/converted PDF | 4.74/9 mb\r\n\r\nAn updated edition of the bestselling guide to Android phones. Don't let that amazing Android intimidate you! Here's the simple, straightforward scoop\r\nHow can something called a smartphone make you feel so dumb? Well, nobody can solve that problem better than Dan Gookin! Here's the friendly, jargon-free guide to everything your Android can do, from texting and email to shooting video, updating social media, downloading apps, networking via Wi-Fi, and more. Oh—and you can even make phone calls!\r\n-  Meet your Android Phone — master basic setup, lock and unlock the screen, use the touchscreen, work with apps, and get onscreen keyboard typing tips\r\n-  Keep up with your friends — manage your address book, make and receive calls, choose a texting app, and configure email\r\n-  Go places — use Maps to navigate roads and locate restaurants and businesses near you-   Let's hang out — talk or video chat with friends on a Google Hangout, make Skype calls, tweet, and update\n\r\nOpen the book and find:\r\n-  Hints for snapping pictures, editing images and sharing photos\r\n-  How to get music, create a playlist and delete tunes from your device\r\n-  Instructions on activating and connecting your Bluetooth\r\n-  Tips for downloading apps and adding widgets to your home screen\r\n-  How to customize the phone's home screen, lock screen, display, keyboard and audio\r\n-  How to cut, copy, and paste text\r\n-  Tips on using a USB connection to synchronize your goodies\r\n-  Info for using maps and navigation\r\n\r\nAbout the Author\r\nDan Gookin has been writing about technology for over 20 years. He wrote the very first For Dummies book in 1991 and now has more than 11 million copies of books in print. He combines his love of writing with his gizmo fascination to create books that are informative, entertaining, and not boring. Having written more over 120 titles with 12 million copies in print translated into over 30 languages, Dan can attest that his method of crafting computer tomes seems to work.\r\nPerhaps his most famous title is the original DOS For Dummies, published in 1991. It became the world's fastest-selling computer book, at one time moving more copies per week than the New York Times #1 bestseller (though as a reference, it could not be listed on the NYT Bestseller list). From that book spawned the entire line of For Dummies books, which remains a publishing phenomena to this day.\r\nDan holds a degree in Communications/Visual Arts from the University of California, San Diego. Presently, he lives in the Pacific Northwest, where he enjoys spending time with his sons playing video games inside while they watch the gentle woods of Idaho.\r\n \nhttp://s28.postimg.org/4b0xhrlx9/Android_Phones_For_Dummies_3rd_Ed.jpg","torrent":{"xt":"urn:btih:dab494a9079d69d486eca1a8d8ba058f5726e1da","amp;dn":"Android+Phones+For+Dummies+%283rd+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab494a9079d69d486eca1a8d8ba058f5726e1da","infoHashBuffer":{"type":"Buffer","data":[218,180,148,169,7,157,105,212,134,236,161,168,216,186,5,143,87,38,225,218]},"announce":[],"urlList":[]}}