{"title":"The Complete Dead Sea Scrolls in English (Geza Vermes, ed.)","uid":9446183,"size":28806067,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db0ac85624de9d18c35f00318473d0e036211bef&amp;dn=The+Complete+Dead+Sea+Scrolls+in+English+%28Geza+Vermes%2C+ed.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1389054830,"description":"\nThe Complete Dead Sea Scrolls in English (Penguin Classics, 2011).  Revised 7th edition.  Translated by Geza Vermes.\n\nISBN: 9780141197319 | 720 pages | EPUB + PDF\n\n\nThe discovery of the Dead Sea Scrolls in the Judaean desert between 1947 and 1956 transformed our understanding of the Hebrew Bible, early Judaism and the origins of Christianity.  These extraordinary manuscripts appear to have been hidden in the caves at Qumran by members of the Essene community, a Jewish sect in existence before and during the time of Jesus.  Some sixty years after the Scrolls' first discovery, this revised and much expanded edition of THE DEAD SEA SCROLLS IN ENGLISH crowns a lifetime of research by the great Qumran scholar Geza Vermes (1924-2013).\n\nAs well as superb translations of all non-biblical texts sufficiently well preserved to be rendered into English, there are also a number of previously unpublished texts, and a new preface.\n\nSince its first publication in 1962, THE DEAD SEA SCROLLS IN ENGLISH has established itself as the standard English translation of the non-biblical Qumran Scrolls and as giving an astonishing insight to the organization, customs, history and beliefs of the community responsible for them.  This seventh edition will contain new material, together with extensive new introductory material and notes.\n\n============================\n\nFor an alternative translation of the Dead Sea Scrolls by Michael O. Wise, Martin G. Abegg, and Edward M. Cook, see:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8881565/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8881565/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:db0ac85624de9d18c35f00318473d0e036211bef","amp;dn":"The+Complete+Dead+Sea+Scrolls+in+English+%28Geza+Vermes%2C+ed.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0ac85624de9d18c35f00318473d0e036211bef","infoHashBuffer":{"type":"Buffer","data":[219,10,200,86,36,222,157,24,195,95,0,49,132,115,208,224,54,33,27,239]},"announce":[],"urlList":[]}}