{"title":"The Complete Alias by Brian Michael Bendis (UPDATED)","uid":8631921,"size":531471492,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:db0b35835739019f51d5cdf3e609b63169326eb4&amp;dn=The+Complete+Alias+by+Brian+Michael+Bendis+%28UPDATED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MrclScns","files":2,"time":1372649425,"description":"** This is the second attempt at this torrent - ignore the first **\n\nThe Complete Alias by Brian Michael Bendis is a new digital collection of Bendis's complete run on the Marvel MAX series Alias in one easy-to-read volume. As of the time of this release, the series omnibus is out of print, the trade paperbacks are either out of print or nearly so, and the comics are not available for digital purchase or in the Marvel Unlimited digital subscription service (and probably won't be).\n\nSeries summary: &quot;Meet Jessica Jones. Once upon a time, she was a costumed super hero. But not a very good one. Her powers were unremarkable compared to the amazing abilities of the costumed icons that populate the Marvel Universe. In a city of Marvels, Jessica Jones never found her niche. Now a chain-smoking, self-destructive alcoholic with a mean inferiority complex, Jones is the owner and sole employee of Alias Investigations - a small, private-investigative firm specializing in superhuman cases&quot;\n\nThe pages of these volumes are comprised of existing scans which have been heavily edited to fix minor flaws, color correction, and sequencing errors. Many thanks to the original scanners for their excellent work.\n\nThis unique digital omnibus collects the entire series in 594 pages, including:\n\n- Alias 1-28\n- What If Jessica Jones Had Joined The Avengers?\n- Bonus artwork by series artist Michael Gaydos\n- Articles on the series including a great Newsarama interview/series intro by Bendis no longer available on their site\n\nIf you like what you read here, please support the artists and publisher and ensure further works like this by going out and purchasing the back issues from your local retailer, the trade paperbacks or hardcovers, or the digital comics.\n\nThis collection follows these available MiracleScans releases:\n\n- The Complete Fantastic Four by Jonathan Hickman (2 volumes)\n- The Complete Fantastic Four by Mark Millar\n- The Complete Seven Soldiers of Victory by Grant Morrison\n- The Complete Miracleman by Alan Moore\n- The Complete Marvelman in Warrior\n\nAll of these releases can be found on Pirate Bay under username &quot;MrclScns&quot;.\n\nMiracleScans specializes in digital omnibus volumes of complex comic runs organized for easy reading, &amp; we also do new scans of older material. Follow on Twitter for news on future releases as there are a number of few cool projects in the pipeline -- @miraclescans","torrent":{"xt":"urn:btih:db0b35835739019f51d5cdf3e609b63169326eb4","amp;dn":"The+Complete+Alias+by+Brian+Michael+Bendis+%28UPDATED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0b35835739019f51d5cdf3e609b63169326eb4","infoHashBuffer":{"type":"Buffer","data":[219,11,53,131,87,57,1,159,81,213,205,243,230,9,182,49,105,50,110,180]},"announce":[],"urlList":[]}}