{"title":"International Terrorism 02of26 The Al Qaeda Menace DVDRip x264 A","uid":9184844,"size":262258354,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db39c3feea5d10c6fedd111b98f3dae650d97bf8&amp;dn=International+Terrorism+02of26+The+Al+Qaeda+Menace+DVDRip+x264+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1384278885,"description":"International Terrorism\n\nWar Documentary hosted by Robert Powell, published by BBC in 2008 - English narration\n\n\nInformation\n------------------------------\n\nInternational Terrorism: The Global War on Terror\nThe terrorist is by no means a new actor on the world stage. However, thanks to startling developments in military and communications technology, this perennial threat to freedom and security has taken a quantum leap forward during the past thirty years. In many cases, these vicious and determined men and women have supplanted nation states on the globe's &quot;most wanted&quot; list! This extraordinary 26-episode series provides a comprehensive look at these modern masters of political murder and extortion. From the I.R.A. to al-Qaeda, Global Terror runs the gamut of groups that have pledged themselves to destroy the stability that we cling to so tenuously-examining their goals, their methods and their terrifying prospects for success!\n\n\n\n2)  The Al Qaeda Menace (Bin Laden) \nAfter the First Gulf War, Islamic Fundamentalism in Saudi Arabia was handed a gift by the extended presence of coalition troops close to the Holy sites of Mecca and Medina. The Wahabi sect from the West of Saudi were particularly incensed and devised a plan to strike back at Western interests and the USA in particular. They were led by a wealthy Arab graduate named Osama Bin Laden, whose knowledge of architecture gave rise to a plan to destroy one of the most potent symbols of American power. With colossal funds supplied by wealthy Arab benefactors, The Al-Qaeda Menace looks at how Bin Laden built an international network of trained terrorists.\n\n\n14)  The Oklahoma Bomber \nThe Oklahoma Bomber looks at the events on the morning of 19 April 1995, when a massive bomb exploded outside a US government building in Oklahoma City. The blast, which could be heard and felt up to 55 miles away, reduced the building to rubble and killed 168 people, 19 of whom were children. In addition, more than 800 people were injured in the worst domestic attack in American history.\n\n15)  The Ku Klux Klan \nOn 12 June 1963, the renowned black civil rights campaigner Medgar Evers was killed with a single rifle shot to the back as he walked towards his front door in Jackson, Mississippi. His murderer, Byron De La Beckwith, was arrested a short time later, but he was acquitted at his subsequent trial in front of an all-white jury. It would take nearly 30 years before he was finally brought to justice. Beckwith was a member of the U Klux Klan, one of the world's oldest and deadliest terrorist organisations. Founded in Texas in the mid-19th century, the Klan was ruthlessly dedicated to white supremacy over Black American citizens, particularly in the Southern States.\n\n16)  Japanese Sarin Cult \nOn 20 March 1995, a group of terrorists released a deadly nerve gas called Sarin (developed by the Nazis in World War II) into the Tokyo subway system. It was the height of rush hour, so it caused the maximum panic and chaos. It also killed 12 people and resulted in another 50 falling seriously ill. Thousands more suffered from the after-effects. Just two days after the Tokyo subway attack, more than 1,000 Japanese police stormed the Aum headquarters. Here they discovered a huge stockpile of deadly chemical and biological warfare agents, including enough Sarin ingredients to kill four million people.\n\n17)  The Mahdi Army \nOn 25 March 2008, some 15,000 Iraqi troops moved in Basra. Their aim was to drive out the terrorists who had held the city in a murderous grip since the fall of Iraqi dictator, Saddam Hussein. But, even though the troops were backed up with US and British airpower, it still took them about three weeks to regain control of Basra. Fortunately, it ended in failure. The once-seemingly invincible Mahdi Army is now in complete disarray and al-Sadr has gone into hiding in neighbouring Iran. It's been a long time coming, but for now, at least, peace of a kind is slowly returning to Iraq after years of death and destruction.\n\n18)  Che Guevara \nDuring his short life, Ernesto (Che) Guevara became the world's best known and most charismatic revolutionary, revered as a great hero for his part in the Cuban revolution. In reality, however, he was a cold-blooded killer who played a central role in sending thousands of Cuban citizens to their death in the aftermath of the revolution during the early 1960s. But, since he met his own end while trying to start a revolution in Bolivia, many of the less-palatable aspects of his life have been airbrushed from history and he has become a popular, worldwide, cultural revolutionary icon. This is thanks in no small part to a famous photograph of him, taken at the height of his fame, which continues to adorn countless bedroom walls the world over.\n\n19)  Fidel Castro \nWhen Fidel Castro stepped down as president of Cuba in February 2008, he was the world's longest-serving political leader. He was also the man who, in October 1962, together with Soviet premier Nikita Khrushchev, brought the world to the brink of all-out nuclear war during what became known as the Cuban Missile Crisis., Fidel Castro is revered by many as a great revolutionary. But in winning his reputation he brought death, destruction and misery to countless numbers of people.\n\n20)  Somali Warlords \nSomali Warlords looks at the events on the afternoon of 03 October 1993. A team of crack US troops abseiled down from helicopters onto the roof of a house in the centre of Mogadishu, the capital of Somalia, in the east horn of Africa. Their mission: to snatch two notorious terrorists and bring them to justice. But it all went horribly wrong. The troops - outnumbered 20 to one - were pinned down in a 17-hour gun-battle which left 18 of them dead and 80 wounded. Then in a daring rescue mission with ground troops and helicopters, US Marines paid a terrible price. During the fire-fight, two US Blackhawk helicopters were brought down with rockets and crashed into the narrow streets.\n\n21)  The Taliban \nUntil 11 September 2001 when 3,000 people died in New York's Twin Towers during the world's worst terrorist attack, most people in the West had scant knowledge about what was going on in Afghanistan. Shortly after, the US Government declared that Osama bin Laden, the al-Qaeda leader behind the outrage, was holed up in Afghanistan under the protection of the Taliban, and President Bush vowed to go after them with a vengeance.\n\n22)  The Tamil Tigers \nThe Tamil Tigers are one of the deadliest and most ruthless terrorist's organisations the world has ever known. Since embarking on their campaign of violence in the early 1980s, they have killed almost 60,000 people - more than the rest of the world's terrorist organisations put together - and displaced hundreds of thousands of Sri Lankans.\n\n23)  Chechen Extremism \nChechen Extremist examines the events on 22 October 2002, a large gang of heavily armed terrorists seized a theatre in the heart of Moscow, holding more than 800 people hostage, as they demanded the withdrawal of Russian troops from Chechnya, their homeland. Four days later, the siege ended in a tragedy that shocked the world as 130 of the hostages died when the Russian security forces pumped a powerful knockout gas into the theatre. All 42 of the terrorists were shot dead when the security forces stormed the building.\n\n24)  The Moluccan Separatists \nOn 23 May 1977, in North-East Holland, nine ruthless and fanatical South Moluccan terrorists hijacked a train en route from Utrecht to Groningen - their second train hijacking in two years - and demanded independence for their distant homeland in the western Pacific. At the same time, four more terrorists had seized a primary school in the nearby village of Bovensmilde. The lives of 55 train passengers, 105 schoolchildren and four teachers now hung in the balance.\n\n25)  The Mau Mau \nThe Mau Mau was one of the world's shortest-lived terrorist organisations, but it was also one of the most violent. Formed in the early 1950s to force the British to grant independence to Kenya in East Africa, the Mau Mau consisted mainly of dissident Kikuyu tribesmen who carried out a number of shocking atrocities as they targeted white settlers on their remote farms. But the Mau Mau also attacked native black Kenyans too, especially those whom they regarded as traitors for supporting the British administration. Whole villages were wiped out.\n\n26)  The Red Brigade \nFormed in 1970, the Brigate Rosse (Red Brigades) sought to create a revolutionary state through armed struggle and to separate Italy from the Western Alliance (NATO). The Red Brigades' main aim was the overthrow of the Italian government, the weakening of NATO and the creation of a Marxist state. On 16 March 1978, the former Italian Prime Minister Aldo Moro was kidnapped in a violent ambush, which left five men dead at the scene. Two days later, his kidnappers revealed themselves as the Red Brigades, a notorious terrorist group which had bombed and shot its way across Italy since the early 1970s. Eight weeks later, Moro's dead body was dumped in downtown Rome. In December 1981, the Red Brigades kidnapped another high profile victim: a senior NATO staff officer, US Brigadier-General James Dozier. He was freed 42 days later in a daring raid by Italian commandos.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img837.imageshack.us/img837/9026/8xfa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img837.imageshack.us/img837/9026/8xfa.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img543.imageshack.us/img543/2772/od0b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img543.imageshack.us/img543/2772/od0b.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img202.imageshack.us/img202/599/duhn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img202.imageshack.us/img202/599/duhn.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img690.imageshack.us/img690/9793/cnnz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img690.imageshack.us/img690/9793/cnnz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img716.imageshack.us/img716/796/r9zq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img716.imageshack.us/img716/796/r9zq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img35.imageshack.us/img35/792/f6ta.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img35.imageshack.us/img35/792/f6ta.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img854.imageshack.us/img854/2215/s1u4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img854.imageshack.us/img854/2215/s1u4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/2566/upyg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/2566/upyg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img96.imageshack.us/img96/5206/i0mg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img96.imageshack.us/img96/5206/i0mg.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e5a8848c8ba5a9d6cbd5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1335 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 28mins\n * Framerate: 29fps\n * Number of Parts: 26\n * Part Size: average 249 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbcactivevideoforlearning.com/1/SeriesDetails.aspx?SeriesID=957&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbcactivevideoforlearning.com/1/SeriesDetails.aspx?SeriesID=957&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:db39c3feea5d10c6fedd111b98f3dae650d97bf8","amp;dn":"International+Terrorism+02of26+The+Al+Qaeda+Menace+DVDRip+x264+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db39c3feea5d10c6fedd111b98f3dae650d97bf8","infoHashBuffer":{"type":"Buffer","data":[219,57,195,254,234,93,16,198,254,221,17,27,152,243,218,230,80,217,123,248]},"announce":[],"urlList":[]}}