{"title":"Pat Boone In A Metal Mood [320](Big Papi)","uid":9626206,"size":128223035,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db68b59e0d3b8799eeab2ee03dd0067f5a0ed50c&amp;dn=Pat+Boone+In+A+Metal+Mood+%5B320%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1392596268,"description":"---------------------------------------------------------------------\nSource: 1997 CD HIPD-40025\n---------------------------------------------------------------------\n\nIf you know anything about the history of heavy metal then this compilation was bound to happen and who could have done a better job pulling this off than Pat Boone? lol So the next time your buddy comes over and has a hankering for Crazy Train, pop this version in and wait for the tears of laughter to flow. On the upside, we can actually understand the lyrics in these famous metal and classic rock songs.\n\nI had a friend over while ripping this who loves classic rock. She insisted I play every song. Maybe it's like listening to a train wreck...this is a &quot;must have&quot; in your collection.\n\n- Big Papi\n\n---------------------------------------------------------------------\n\n\nRobert\n \nYou just have to love the concept here: aging crooner takes up metal with his own, shall we say unique, stylings. I have listened extensively to Shatner and Nimoy sing. I have heard all the Golden Throats CDs (and love them all.) I even have listened to an album called &quot;The Wit and Wisdom of Spiro Agnew.&quot; (Really.) But nothing prepared me for this. From the leather studded album cover with regulation glint in the eye, to the funny, yet ponderous liner notes, to the songs themselves, this is a masterwork of some sort. What sort, exactly, I'm not sure, but it demands to be listened to.\n\nI guess this should be obvious, but if you are a metal fan hoping to hear a generic cover version of some of your metal and hard rock favorites, this CD is not for you. If you want to laugh until your sides hurt, it most definitely is. Standouts here include Metallica's &quot;Enter Sandman&quot;, the seminal power rock anthem &quot;Stairway to Heaven&quot;, and a stab at Hendrix with &quot;Wind Cries Mary.&quot; All these are great, but do not even come close to the two best songs on the CD &quot;Smoke on the Water&quot; (you can for once actually understand all the lyrics, not that that's a ringing endorsement, mind you), and the greatest of them all, &quot;Crazy Train.&quot; I have never in all my life laughed so hard at a song. The Ozzy classic comes across as something from a paunchy lounge singer in a purple crushed velour tux with a bad combover. This one song is enough to warrant the purchase of the CD. The funny thing is that despite the stupendous campy awfulness of this version, I could not stop hearing it in my head (occasionally resulting in inappropriate humming) for about two weeks: it is that powerful!\n\nBuy this CD today and prepare to have a musical experience even more surreal than Shatner singing &quot;Mister Tambourine Man.&quot; &quot;In a Metal Mood&quot; is truly out of this world.\n\n\n---------------------------------------------------------------------\nPat Boone - In a Metal Mood: No More Mr. Nice Guy\n---------------------------------------------------------------------\n\nArtist...............: Pat Boone\nAlbum................: In a Metal Mood: No More Mr. Nice Guy\nGenre................: Pop/Rock\nSource...............: CD\nYear.................: 1997\n\nMP3 320cbr\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Pat Boone - You've Got Another Thing Comin' [04:18]\n2. Pat Boone - Smoke on the Water [03:53]\n3. Pat Boone - It's a Long Way to the Top (If You Wanna Rock 'n Roll)[04:36]\n4. Pat Boone - Panama [05:15]\n5. Pat Boone - No More Mr. Nice Guy [03:05]\n6. Pat Boone - Love Hurts [04:56]\n7. Pat Boone - Enter Sandman [03:52]\n8. Pat Boone - Holy Diver [04:43]\n9. Pat Boone - Paradise City [04:41]\n10. Pat Boone - The Wind Cries Mary [04:11]\n11. Pat Boone - Crazy Train [04:32]\n12. Pat Boone - Stairway to Heaven [04:58]\n\nPlaying Time.........: 53:04\nTotal Size...........: 122.25 MB","torrent":{"xt":"urn:btih:db68b59e0d3b8799eeab2ee03dd0067f5a0ed50c","amp;dn":"Pat+Boone+In+A+Metal+Mood+%5B320%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db68b59e0d3b8799eeab2ee03dd0067f5a0ed50c","infoHashBuffer":{"type":"Buffer","data":[219,104,181,158,13,59,135,153,238,171,46,224,61,208,6,127,90,14,213,12]},"announce":[],"urlList":[]}}