{"title":"Tarpley - 911 Synthetic Terrorism Made In Usa (America-911-WTC-B","uid":3630355,"size":2418737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc2354ab10032e5f0943a6d0a933ff45e59c1546&amp;dn=Tarpley+-+911+Synthetic+Terrorism+Made+In+Usa+%28America-911-WTC-B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sampooran","files":1,"time":1172857559,"description":"Product Description\nThe thesis of Webster Tarpley&amp;#039;s 911 Synthetic Terror: Made in USA has been enthusiastically received with its working model of the 9/11 plot: a covert network of moles, patsies, and a commando cell in the privatized intelligence services, backed by corrupt political and corporate media elites. Buttressed by historical examples like the Baader-Meinhof Gang and the Gunpowder Plot, this model makes it clear how such a monstrous false-flag or self-terror exploit is possible even under a largely benign government. That paradox is the incredibility gap that has made most Americans reject the evidence about 9/11 as paranoid fantasy. Tarpley brings decades of expertise to the 9/11 issue. In 1978 he exposed the terrorist Red Brigades as patsies of Italy&amp;#039;s fascist P2 shadow government, and 9/11 is on the same pattern. The forthright subtitle, Made in USA, is backed up by an analysis of key figures who behave like moles working for the insidious network. 9/11 Synthetic Terror highlights the salient points of sheer physical impossibility of the official 9/11 conspiracy theory. It makes clear that figures like Osama bin Laden are patsies, dupes or double agents, selected for their ethnic coloring as the basis for launching a &quot;Clash of Civilizations,&quot; and how absurd it is to imagine that such tools of US intelligence agencies could turn around and infiltrate or overwhelm US defenses unaided. Tarpley shows that the wars on the Islamic world, the Soviet-Afghan, Kosovo and Chechen conflicts, as well as US-UK-NATO synthetic terror incidents like 9/11, Beslan or 3/11 in Madrid, have been contrived to continue the Cold War, in pursuit of the centuries-long campaign for Anglo hegemony over Eurasia and the world. The preface to the second edition explains the significance and superiority of &quot;MIHOP&quot; vs &quot;LIHOP,&quot; and the many drills on 9/11 and on 7/7, which were cover and conduit for those false-flag operations. The third edition preface makes clear that 9/11 is the only issue that can stop a new world war and the descent into a police state. It shows up the cowardice of the &quot;left gatekeepers&quot; on this score. The analysis of Moussaoui on trial as a classic weak-minded patsy -- part double agent, part fanatic -- again shows the unique power of Tarpley&amp;#039;s mole-patsy model to debunk the lies put out by the war party. For a principled refutation of the 9/11 propaganda myth in all its parts, Tarpley&amp;#039;A bombshell, brilliant book - I strongly recommend 911 Synthetic Terror. Should be required reading for all honest truth seekers, s work is indispensable. \n\nAbout the Author\nThe humanist contemporary political philosopher Webster Griffin Tarpley is our most incisive critic of Anglo-American hegemony. As an activist historian he is best known for his George Bush: The Unauthorized Biography (1992), a masterpiece of research which is still must reading. He is a 9/11 Truth Scholar and activist; AB Princeton 1966, summa cum laude and Phi Beta Kappa; Fulbright Scholar at University of Turin, Italy; and MA in humanities from Skidmore College. He is fluent in Italian, German, French, Latin and Russian. A decades-long expert on international terrorism, his 1978 study for the Italian parliament &quot;Chi ha ucciso Aldo Moro?&quot; (Who Killed Aldo Moro?) broke open the ownership of the &quot;Red Brigades&quot; by NATO&amp;#039;s clandestine &quot;stay-behind&quot; networks. \n\n\n(America-911-WTC-Bush-Neocons-Terrorism-Fascism)","torrent":{"xt":"urn:btih:dc2354ab10032e5f0943a6d0a933ff45e59c1546","amp;dn":"Tarpley+-+911+Synthetic+Terrorism+Made+In+Usa+%28America-911-WTC-B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2354ab10032e5f0943a6d0a933ff45e59c1546","infoHashBuffer":{"type":"Buffer","data":[220,35,84,171,16,3,46,95,9,67,166,208,169,51,255,69,229,156,21,70]},"announce":[],"urlList":[]}}