{"title":"D16.Group.Nepheton.VSTi.v1.4.0.Incl.Keygen-AiR","uid":5185362,"size":9133140,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:dd1a07de62292d4de89016fab478f538ae97fd4d&amp;dn=D16.Group.Nepheton.VSTi.v1.4.0.Incl.Keygen-AiR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TvTeam","files":5,"time":1259438784,"description":"PROUDLY PRESENTS\n\n                   D16.Group.Nepheton.VSTi.v1.4.0.Incl.Keygen \n\n                            SUPPLIER ..: TEAM AiR   \n                            PROTECTION : KEYFiLE      \n                            SIZE ......: 02 * 4,77MB\n                            DATE ......: 11/2009 \n                            URL........: http://www.d16.pl \n\n                              \n                    \n                         \n             \n            \n\n   Synthesis \n             \n   Nepheton contains 17 fully synthesized instruments perfectly emulating  the \n   famous 808  drum machine.  All the  nuances and  details of the instruments \n   sounds are  captured perfectly.  The instruments  models are  equipped with \n   additional controls giving you possibility to tweak the sound much  better. \n   Listen to the audio examples or just download the demo and try it out.  \n             \n   Outputs   \n             \n   Nepheton  has a  flexible output  configuration. Every  instrument's audio \n   signal can be routed to any of the 17 outputs. This allows users to further \n   shape sounds individually or in  groups via their favourite plug-ins.  Each \n   individual output can be set to  mono or stereo. For the greatest  808 fans \n   we've  added also  original Trigger  output (configurable  as well).  Every \n   instrument also has  a Mute, Solo  button and Activity  led. Mute will  not \n   just silence the sound, it will  stop the sound being triggered. Solo  will \n   stop all other instruments from being triggered and only allow the selected \n   sound(s) to play. \n             \n   Control   \n             \n   Nepheton has extensive midi control. Midi notes can be used to trigger each \n   individual sound. Alternatively, the  internal sequencer can be  used. This \n   can be set to  play using Nepheton's internal  clock or set to  synchronize \n   perfectly  to the  host sequencer.  Most of  Nepheton's parameters  can be \n   automated within the host and also controlled using MidiCC with an external \n   controller. An easy-to-use Midi  Learn function allows reassignment  of any \n   of the parameters. \n             \n   Internal Sequencer \n             \n   Internal  sequencer's memory  contains two  banks of  patterns: simple  and \n   extended. There is  16 extended and  96 simple patterns  which both can  be \n   edited traditionally  using the  step buttons  or using  the tap  function. \n   Simple patterns are  used in Host  Mode where each  pattern location has  a \n   midi note number assigned  to it. With these  notes you can control  freely \n   the order of played patterns. Extended pattern differs from the simple  one \n   in it has  4 segments (variation  A/B and part  1/2). The whole  bank of 16 \n   extended  patterns  is  divided  into  two  groups  of  Basic  Patterns and \n   Intro/Fill In Patterns.  You can choose  freely from played  patterns, used \n   variations, and  fill in  modes (triggered  automatically or  manually). It \n   also can  be defined  whether the  starting pattern  should be  preceded by \n   introduction pattern and  many many more.  Extended patterns are  used when \n   Host  Mode  is off.  A  Randomizer function  is  also provided  within  the \n   internal sequencer. It can be used  to make simple changes to a  pattern or \n   create  a  whole  new one  -  ideal  when your  creativity  needs  a boost! \n   Randomizing can  be applied  to specific  instruments and  the frequency of \n   occurrence can also be adjusted easily  to give you just the right  amount. \n   All  external  files are  stored  in the  XML  format. This  allows  single \n   patterns or whole  banks to be  exchanged between users  easily. XML allows \n   the files to be edited in a text editor. Ideal if you want to post or share \n   a pattern on a web site - just post the text! \n             \n             \n   Full Features: \n             \n             \n   17 fully synthesized instruments  \n             \n   perfectly scaled knob ranges  \n             \n   exhanced control of instruments' sounds  \n             \n   dynamic signal routing from instruments to outputs  \n             \n   user  defined  outputs  configuration  (Master  out,  instruments  outputs, \n   Trigger output)  \n             \n   mutes/solos for each instrument (affect triggerring not just the signal)  \n             \n   fully controllable via MidiCC  \n             \n   quick midiCC assignation with MidiLearn function  \n             \n   many ways of controlling the device:  \n             \n   external mode (note mode)  \n             \n   internal sequencer (pattern mode) with 2 submodes  \n             \n   external mode:  \n             \n   user defined midi map (default set equal to General Midi)  \n             \n   note velocity controls instruments' levels  \n             \n   internal sequencer:  \n             \n   96 simple patterns  \n             \n   16  extended  patterns (12  basic  rythms and  4  intros/fill ins)  with  4 \n   segments per pattern  \n             \n   each segment can be defined with one of four available measures  \n             \n   each step can be defined normal or accented  \n             \n   shuffle mode  \n             \n   tap mode  \n             \n   built in Randomizer  (selection of instruments  to random and  frequency of \n   the randomized notes)  \n             \n   patterns import/export via human readable xml files  \n             \n   two modes of synchronization:  \n             \n   precise synchronization to the host tempo  \n             \n   synchronization to internal  clock - tempo  controlled in the  range 30-303 \n   BPM (+-0.1)  \n             \n   preset manager  \n             \n             \n             \n   Changes in v1.4.0 \n             \n             \n   fixed issue with preset name keyboard focus  \n             \n   fixed hanging GUI issue during simultaneous work with other d16 plugins  \n             \n   fixed issue with loading/saving current pattern \n\n\n                                                          \n                         \n                                   \n                  \n                                        \n                  1) Unzip, Unrar and run Setup.exe \n                            \n                  2) Use Keygen to create your Nepheton.key \n                     and copy it into installation folder \n                            \n                  3) Enjoy this fine Team AiR release !!! \n\n\n                       \n                                      \n               \n                                                    nFO bY ThE AiRBEARS 2009","torrent":{"xt":"urn:btih:dd1a07de62292d4de89016fab478f538ae97fd4d","amp;dn":"D16.Group.Nepheton.VSTi.v1.4.0.Incl.Keygen-AiR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1a07de62292d4de89016fab478f538ae97fd4d","infoHashBuffer":{"type":"Buffer","data":[221,26,7,222,98,41,45,77,232,144,22,250,180,120,245,56,174,151,253,77]},"announce":[],"urlList":[]}}