{"title":"Instant HTML5 2D Platformer [PDF] [StormRG]","uid":11023532,"size":12681369,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd5bca16a22ce037539b31ffe9a0ea2c5eaf0760&amp;dn=Instant+HTML5+2D+Platformer+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"steelballz","files":-1,"time":1410633829,"description":"Description\nInstant HTML5 2D Platformer\nAuthor:Temple, Aidan\nPublisher and Published Date:Packt Publishing (Aug. 26 2013)\nASIN:B00ESX1AR2\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nIn Detail\n\nGame development has traditionally only been accessible to those with experience in computer science and access to the best or most expensive development tools. However, with the advent of technologies such as HTML5 and the ability to self-publish, web-based games such as those on Facebook and smartphones are becoming more attractive to develop than ever before. Through the use of open technologies such as HTML5, anyone with even a basic understanding of games development can begin to develop video games in their spare time and publish them to the Web or as an application for mobile devices.\n\nInstant HTML5 2D Platformer is a practical, hands-on guide that provides you with a number of clear, step-by-step, task-based exercises, which are used to discuss game development and put into practice development techniques through the use of HTML5 and JavaScript. This book looks at the creation of a 2D platform-based game using the HTML5 canvas element.\n\nInstant HTML5 2D Platformer introduces you to HTML5 canvas through a number of exercises, which show what the canvas is capable of. The book contains a number of clear, practical, hands-on tasks that incrementally build on the concepts of game creation and result in a 2D HTML5 platform-based game.\n\nBy undertaking the tasks within this book, you will learn how to develop your own 2D HTML5 game framework that you can use in the creation of your own video games, not just the game developed within this book. Alongside this framework you will learn how to develop and understand 2D animation, game logic, and how to handle user input devices.\nApproach\n\nFilled with practical, step-by-step instructions and clear explanations for the most important and useful tasks. The step-by-step approach taken by this book will show you how to develop a 2D HTML5 platformer-based game that you will be able to publish to multiple devices.\nWho this book is for\n\nThis book is great for anyone who has an interest in HTML5 games development, and who already has a basic to intermediate grasp on both the HTML markup and JavaScript programming languages. Therefore, due to this requirement, the book will not discuss the inner workings of either of these languages but will instead attempt to describe the functionality of the code present within this book.\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:dd5bca16a22ce037539b31ffe9a0ea2c5eaf0760","amp;dn":"Instant+HTML5+2D+Platformer+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd5bca16a22ce037539b31ffe9a0ea2c5eaf0760","infoHashBuffer":{"type":"Buffer","data":[221,91,202,22,162,44,224,55,83,155,49,255,233,160,234,44,94,175,7,96]},"announce":[],"urlList":[]}}