{"title":"Teaching Kids to Think - Darlene Sweetland","uid":14466851,"size":1014576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd6e1c3723597adb878a3432e3d89de48c895e6a&amp;dn=Teaching+Kids+to+Think+-+Darlene+Sweetland&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461869824,"description":"Why Do Kids These Days Expect Everything to be Given to Them?\r\n\r\nToday's kids don't know how to read a map. They can Google the answer to any question at lightning speed. If a teen forgets his homework, a quick call to mom or dad has it hand-delivered in minutes. Fueled by the rapid pace of technology, the Instant Gratification Generation not only expects immediate solutions to problems―they're more dependent than ever on adults. Today's kids are being denied opportunities to make mistakes, and more importantly, to learn from them. They are being taught not to think.\r\n\r\nIn Teaching Kids to Think, Dr. Darlene Sweetland and Dr. Ron Stolberg offer insight into the social, emotional, and neurological challenges unique to this generation. They identify the five parent traps that cause adults to unknowingly increase their children's need for instant gratification, and offer practical tips and easy-to-implement solutions to address topics relevant to children of all ages.\r\n\r\nA must-read for parents and educators, Teaching Kids to Think will help you understand where this sense of entitlement comes from―and how to turn it around in order to raise children who are confident, independent, and thoughtful","torrent":{"xt":"urn:btih:dd6e1c3723597adb878a3432e3d89de48c895e6a","amp;dn":"Teaching+Kids+to+Think+-+Darlene+Sweetland","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd6e1c3723597adb878a3432e3d89de48c895e6a","infoHashBuffer":{"type":"Buffer","data":[221,110,28,55,35,89,122,219,135,138,52,50,227,216,157,228,140,137,94,106]},"announce":[],"urlList":[]}}