{"title":"Fundamentals of Nuclear Science and Engineering","uid":15560604,"size":28006483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd729d4acbf5cf74e76ccd057387d8545ad619d0&amp;dn=Fundamentals+of+Nuclear+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471123653,"description":"Fundamentals of Nuclear Science and Engineering - J. Kenneth Shultis, Richard E. Faw (Marcel Dekker, 2002).pdf\r\n\r\nFundamentals of Nuclear Science and Engineering provides an ideal introduction to the subject. The first half of the text reviews the important results of &quot;modern&quot; physics and introduces the fundamentals of nuclear science. The second half introduces the theory of nuclear reactors and its application in electrical power production and propulsion. It also surveys many other applications of nuclear technology encountered in space research, industry, and medicine. Each chapter contains extensive problem sets, and appendices at the end of the text furnish large amounts of practical data that enable students to perform a wealth of calculations.\r\n\r\nAmong the myriad concepts, principles, and applications addressed in this text, Fundamentals of Nuclear Science and Engineering \r\n\r\nDescribes sources of radiation, radiation interactions, and the results of such interactions\r\nSummarizes developments in the creation of atomic and nuclear models\r\nDevelops the kinematics and energetics of nuclear reactions and radioactivity\r\nIdentifies and assesses biological risks associated with ionizing radiation\r\nPresents the theory of nuclear reactors and their dynamic behavior\r\nDiscusses the design and characteristics of modern nuclear power reactors\r\nSummarizes the nuclear fuel cycle and radioactive waste management\r\nDescribes methods for directly converting nuclear energy into electricity \r\nPresents an overview of nuclear propulsion for ships and space crafts\r\nExplores the use of nuclear techniques in medical therapy and diagnosis\r\nCovers basic concepts in theory of special relativity, wave-particle duality, and quantum mechanics\r\n\r\nFundamentals of Nuclear Science and Engineering builds the background students embarking on the study of nuclear engineering and technology need to understand and quantify nuclear phenomena and to move forward into higher-level studies","torrent":{"xt":"urn:btih:dd729d4acbf5cf74e76ccd057387d8545ad619d0","amp;dn":"Fundamentals+of+Nuclear+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd729d4acbf5cf74e76ccd057387d8545ad619d0","infoHashBuffer":{"type":"Buffer","data":[221,114,157,74,203,245,207,116,231,108,205,5,115,135,216,84,90,214,25,208]},"announce":[],"urlList":[]}}