{"title":"Secrets to Winning at Office Politics: How to Achieve Your Goals","uid":9596965,"size":7215782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda180842ce339a07807de0f340ca15b32882c90&amp;dn=Secrets+to+Winning+at+Office+Politics%3A+How+to+Achieve+Your+Goals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MucGar","files":-1,"time":1392041569,"description":"Secrets to Winning at Office Politics: How to Achieve Your Goals and Increase Your Influence at Work\n\n\nISBN: 0312332181 | 2010 | EPUB, MOBI, PDF | 288 pages | 6,9 MB\n\n\n\net Ahead, Gain Influence, Get What You Want\n\nOffice politics are an unavoidable fact of life in every workplace. To accomplish your personal and business goals, you must learn to successfully play the political game in your organization. Whether you are a new player or a seasoned veteran, Secrets to Winning at Office Politics can help you increase your personal power without compromising your integrity or taking advantage of others. This smart, practical guide shows you how to stop wasting energy on things you can't change and start taking steps to get what you want.\n\nWritten by an organizational psychologist and corporate consultant, Secrets to Winning at Office Politics uses real-life examples of political winners and losers to illustrate the behaviors that contribute to success or failure at work. You will be shown techniques for managing your boss more effectively, improving your influence skills, changing the way you are perceived, and dealing with difficult people. Using these proven strategies for political success, you will then be able to create a Political Game Plan that outlines the steps necessary to accomplish your own individual goals.\n","torrent":{"xt":"urn:btih:dda180842ce339a07807de0f340ca15b32882c90","amp;dn":"Secrets+to+Winning+at+Office+Politics%3A+How+to+Achieve+Your+Goals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda180842ce339a07807de0f340ca15b32882c90","infoHashBuffer":{"type":"Buffer","data":[221,161,128,132,44,227,57,160,120,7,222,15,52,12,161,91,50,136,44,144]},"announce":[],"urlList":[]}}