{"title":"WET WILLIE - Discography - Mp3","uid":4695931,"size":475260732,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ddef0e487927db02a7985ade7b1e6d7b05091815&amp;dn=WET+WILLIE+-+Discography+-+Mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ludger62","files":-1,"time":1233558512,"description":"Biography \tby Bruce Eder\n\nWet Willie were, after the Allman Brothers Band and Lynyrd Skynyrd, the hardest-rocking of the Southern bands to come to national attention in the early '70s. For seven years, from 1971 until 1978, they produced an enviable array of albums awash in good-time music, rollicking high-energy blues-rock, and white Southern soul, and for their trouble they racked up just one Top Ten hit (&quot;Keep On Smilin'&quot;) and a lot of admirers. In contrast to the Allman Brothers Band, whose jumping-off point was really Cream and who based their music on long jams, Wet Willie were closer in spirit to Booker T. &amp; the MG's and perhaps the Mar-Keys, of Stax/Volt fame, much more steeped in sweaty, good-time R&amp;B than the blues-rock of the Allmans or the country-rock of the Marshall Tucker Band. Think of what Lynyrd Skynyrd might have sounded like with but one lead guitar on a white chitlin circuit, if such a thing had existed.The band, originally called Fox, got together in Mobile, AL, in 1969 behind the powerful vocals and distinctive sax of Jimmy Hall, with Jimmy's brother Jack on bass and banjo, Ricky Hirsch on lead and slide guitars and mandolin (as well as writing a lot of the songs), Lewis Ross on the skins, and John Anthony (later succeeded by Mike Duke) playing the keyboards. They counted the Rolling Stones and the Animals among their influences, but their sound was closer in spirit to early Otis Redding or Little Richard -- which made the move to Macon, GA, in early 1970 a natural one, the town being Richard Penniman's onetime home, as well as the headquarters of Capricorn Records, the company run by Redding's onetime manager, Phil Walden. Wet Willie auditioned for Capricorn that summer and were at work on their debut album by the fall of that same year.Despite sharing the same label as the Allmans and the Marshall Tucker Band, Wet Willie wasn't like either of those groups. They jammed, but usually not for stretches of more than ten or 12 minutes, and they weren't laid-back Southerners. Rather, Wet Willie played an intense, very vocal-oriented brand of white Southern soul. Indeed, they were probably the only white group that one could imagine doing a song such as, say, &quot;Papa Was a Rolling Stone,&quot; and not embarrassing themselves in the process; the group probably most like them in later years was Southside Johnny &amp; the Asbury Jukes, and they were much less defined regionally.Their first two albums were released with barely a ripple, and their third, a live concert document called Drippin' Wet, was the first to scrape the lower reaches of the Top 200 albums. The group's third studio release, Keep On Smilin', finally gave them a hit with the title track, and yielded a handful of other popular tracks. The addition of the female backing group the Williettes only opened the group's sound out further with a gospel and soul sensibility. Dixie Rock and Wetter the Better followed in short order, but neither of those albums matched Keep On Smilin' in the songwriting department, and the band suffered a gradual decline in its album sales, despite getting a hit single out of &quot;Dixie Rock.&quot; The band issued one final album on Capricorn in 1977, which was followed, perhaps too closely, by Wet Willie's Greatest Hits (Capricorn by that time had run into severe financial problems and was releasing anything that looked like it might sell).Around this time, the group went through a series of internal shifts and it next emerged in 1978 with new lineup and a new contract with Epic Records. Jimmy and Jack Hall were still there, only now they were joined by three additional singers -- in addition to keyboardist Mike Duke, guitarist Marshall Smith and drummer Theophilus K. Lively contributed seriously to the vocalizing, and, to top it off, the band now had another guitar player in Larry Berwald. The result was the gorgeous Manorisms album, which showed off harmony singing like nobody's business and a pop side to the soul stylings that occasionally had the group crossing successfully close to Motown territory, only a lot hotter and sweatier than, say, the Grass Roots (who also had a kind of white Motown sound) ever got. Sad to say, while their concert audiences were healthy and they were at no loss for gigs, Manorisms never sold, lacking the hit single to get it a foothold on AM radio. The band released one more album, Which One's Willie?, in 1979, which performed just as poorly or worse. The group finally broke up in 1980 after nearly a decade of great records and even better shows.In the 1990s, Wet Willie re-formed around a core of keyboardist John Anthony, guitarist Ricky Hirsch, and Jimmy Hall, with other musicians -- including Smith, Duke, and Lively -- filling out their ranks. Wet Willie's recording efforts have been intermittent at best, but they've been very busy performing on-stage. In 1996, they were inducted into the Georgia Music Hall of Fame and, in March of 2001, were inducted into the Alabama Music Hall of Fame. They remain an active performing band in two distinct incarnations -- with Jimmy Hall in their lineup, they're billed as Wet Willie, while for shows and on records for which Hall is unable to participate, they work as the Wet Willie Band, with guitarist Ric Seymour as lead singer.\n\nSource: AMG\n\n+-------------------------------------------------+\nWet Willie Discography\n+-------------------------------------------------+\n\nLeft Coast Live\n--------------------------------------------------------------------------------\n1. 01 -  Shame, Shame, Shame.mp3\n2. 02 -  Baby Fat.mp3\n3. 03 -  Girts Ain't Groceries.mp3\n4. 04 -  Everything That Cha Do.mp3\n5. 05 -  Teaser.mp3\n6. 06 -  Jelly Jelly.mp3\n7. 07 -  Country Side Of Life.mp3\n8. 08 -  Ring You Up.mp3\n9. 09 -  Lucy Was In Trouble.mp3\n10. 10 -  Keep On Smilin'.mp3\n11. 11 -  No, No, No.mp3\n12. Left Coast Live.jpg\n13. Wet Willie. Left Coast Live.bmp\n14. www.rockbits.rollover.at.URL\n\nDixie Rock\n--------------------------------------------------------------------------------\n15. AMG review.txt\n16. cover.jpg\n17. Wet Willie - 01 - Dixie Rock - She's My Lady.mp3\n18. Wet Willie - 02 - Dixie Rock - Ain't He A Mess.mp3\n19. Wet Willie - 03 - Dixie Rock - Dixie Rock.mp3\n20. Wet Willie - 04 - Dixie Rock - Poor Judge Of Character.mp3\n21. Wet Willie - 05 - Dixie Rock - Mama Didn't Raise No Fools.mp3\n22. Wet Willie - 06 - Dixie Rock - It's Gonna Stop Rainin' Soon.mp3\n23. Wet Willie - 07 - Dixie Rock - Jailhouse Moan.mp3\n24. Wet Willie - 08 - Dixie Rock - He Set Me Free.mp3\n25. Wet Willie - 09 - Dixie Rock - Leona.mp3\n26. Wet Willie - 10 - Dixie Rock - Take It To The Music.mp3\n\nDrippin' Wet \n--------------------------------------------------------------------------------\n27. Drippin' Wet.jpg\n28. Wet Willie - Drippin' Wet - 01 - Thats alright.mp3\n29. Wet Willie - Drippin' Wet - 02 - Mule to ride.mp3\n30. Wet Willie - Drippin' Wet - 03 - No Good woman blues.mp3\n31. Wet Willie - Drippin' Wet - 04 - Red Hot Chicken.mp3\n32. Wet Willie - Drippin' Wet - 05 - Airport.mp3\n33. Wet Willie - Drippin' Wet - 06 - I'd rather be blind.mp3\n34. Wet Willie - Drippin' Wet - 07 - Macon hambine blues.mp3\n35. Wet Willie - Drippin' Wet - 08 - Shout Bamalama.mp3\n36. Wet Willie - Keep On Smilin'.mp3\n\nKeep On Smilin'\n--------------------------------------------------------------------------------\n37. 01 Wet Willie - Country Side Of Life.mp3\n38. 02 Wet Willie - Keep On Smilin'.mp3\n39. 03 Wet Willie - Trust In The Lord.mp3\n40. 04 Wet Willie - Soul Sister.mp3\n41. 05 Wet Willie - Alabama.mp3\n42. 06 Wet Willie - Lucy Was In Trouble.mp3\n43. 07 Wet Willie - Soul Jones.mp3\n44. 08 Wet Willie - Don't Wait To Long.mp3\n45. 09 Wet Willie - Spanish Moss.mp3\n46. 10 Wet Willie - In Our Hearts.mp3\n47. Keep On Smilin'.jpg\n\nThe Wetter The Better\n--------------------------------------------------------------------------------\n48. Wet Willie_The Wetter The Better_01_No No No.mp3\n49. Wet Willie_The Wetter The Better_02_Teaser.mp3\n50. Wet Willie_The Wetter The Better_03_Baby Fat.mp3\n51. Wet Willie_The Wetter The Better_04_Ring You Up.mp3\n52. Wet Willie_The Wetter The Better_05_Comic Book Hero.mp3\n53. Wet Willie_The Wetter The Better_06_Walkin' by Myself.mp3\n54. Wet Willie_The Wetter The Better_07_Everything That 'Cha Do (Will Come Back to You).mp3\n55. Wet Willie_The Wetter The Better_08_Everybody's Stoned.mp3\n56. Wetter The Better.jpg\n\nWet Willie - Manorisms (1978)\n--------------------------------------------------------------------------------\n57. 01  - Rainman.mp3\n58. 02  - Make You Feel Love Agian.mp3\n59. 03  - So Blue.mp3\n60. 04  - We Got Lovin'.mp3\n61. 05  - Don't Turn Me Away.mp3\n62. 06  - Street Corner Serenade.mp3\n63. 07  - One Track Mind.mp3\n64. 08  - How 'Bout You.mp3\n65. 09  - Doin' All The Right Things (The Wrong Way).mp3\n66. 10  - Let It Shine.mp3\n67. Wet Willie - Manorisms (1978).txt\n68. Wet Willie - Manorisms.m3u\n\nWet Willie - Manorisms (1978)Cover\n--------------------------------------------------------------------------------\n69. Back.jpg\n70. Front.jpg\n71. Inlay.jpg\n\nWet Willie - Wet Willie\n--------------------------------------------------------------------------------\n72. 01 Have A Good Time.mp3\n73. 02 Dirty Leg.mp3\n74. 03 Faded Love.mp3\n75. 04 Spinning Round.mp3\n76. 05 Low Rider.mp3\n77. 06 Rock And Roll Band.mp3\n78. 07 Pieces.mp3\n79. 08 Shame, Shame, Shame.mp3\n80. 09 Beggar Song.mp3\n81. 10 Fool On You.mp3\n82. Wet Willie.jpg\n\n===================================================================\nFiles: 82   Total Size: 453.25MB   List Created: 1/31/2009 6:52:25 PM\n\n\n\n\n","torrent":{"xt":"urn:btih:ddef0e487927db02a7985ade7b1e6d7b05091815","amp;dn":"WET+WILLIE+-+Discography+-+Mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddef0e487927db02a7985ade7b1e6d7b05091815","infoHashBuffer":{"type":"Buffer","data":[221,239,14,72,121,39,219,2,167,152,90,222,123,30,109,123,5,9,24,21]},"announce":[],"urlList":[]}}