{"title":"Miles Davis Complete Live At The Plugged Nickel","uid":3724952,"size":439703110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:de305e075f08230430e3e8872c6728bd39149e50&amp;dn=Miles+Davis+Complete+Live+At+The+Plugged+Nickel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Oni_Hiro","files":39,"time":1182885044,"description":"The second Miles Davis Quintet:\n\nMiles Davis (trumpet)\nWayne Shorter (tenor saxophone)\nHerbie Hancock (piano)\nRon Carter (bass)\nTony Williams (drums)\n\nThe Complete Live At The Plugged Nickel 1965\n\n8 Discs\n39 Songs\n7.5 Hours\n\nTorrent made by the.rosh.man\n\n Temperamental, passionate, standoffish, reticent... all of these adjectives describe the Miles Davis of the mid-1950s on. Like Beethoven, Davis considered himself an artist to be accepted on his own terms and a servant to no one. This did not endear Davis to his audiences, but that was no matter. Forget that Miles Davis was not the clown-showman Louis Armstrong or Dizzy Gillespie were, or the gracious musical host Edward Kennedy Ellington was. Forget that he was not like Bill Basie. Miles Davis was cool, icily so.\n\n When Miles brought his second great quintet to the Plugged Nickel in Chicago shortly before Christmas 1965 for a two night engagement, the quintet had already been recording together for a number of years. So, it is interesting, that with the exception of ?Agitation,? Davis chose rather to concentrate on radical explorations of his old band book. ?Walkin\\&amp;#039;,? ?My Funny Valentine,? ?I Fall In Love Too Easily,? ?If I Were a Bell, ?Stella By Starlight,? and ?So What? dominate the sets and are presented in multiple forms.\n\n All of the performances have characteristics that were turning from transitional to Davis status quo. The tempi tended to be fast, different time signatures were employed in each piece, the arrangements were less about the head and more about the solo body of the songs. All of the pieces performed at the Plugged Nickel were a look at the old stuff through radically different glasses, glasses that Davis had been working on since the dissolution of the first great quintet and sextet in 1958.\n\n There were many live Mile Davis recordings to consider for this number 3 space in this list. But, none of those other discs, and there were many fine ones, captured Davis at the absolute ground zero of his creativity. Prior to these recordings, Davis had already begun to move into the looser constraints of modal composition with ?Mile Stones? and then Kind of Blue. He continued this tend with the early second quintet recordings, E.S.P., Miles Smiles, Nefertiti. Miles was moving in a freedom direction with compositional discipline and restraint. The Plugged Nickel recordings represent Davis\\&amp;#039; effort to return to the classics and recast them in the new mode he was creating. The results were?and are- fantastic. \t\t","torrent":{"xt":"urn:btih:de305e075f08230430e3e8872c6728bd39149e50","amp;dn":"Miles+Davis+Complete+Live+At+The+Plugged+Nickel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de305e075f08230430e3e8872c6728bd39149e50","infoHashBuffer":{"type":"Buffer","data":[222,48,94,7,95,8,35,4,48,227,232,135,44,103,40,189,57,20,158,80]},"announce":[],"urlList":[]}}