{"title":"Code Lyoko Evolution E01-E10 720p English subtitle x264","uid":8259623,"size":3272312989,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:de8717b0d192c3146730a736a597cebb5b249c4b&amp;dn=Code+Lyoko+Evolution+E01-E10+720p+English+subtitle+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Vchat20","files":10,"time":1363306754,"description":"&quot;Code Lyoko: Evolution is the sequel to the French animated series Code Lyoko. On 31 May 2011, production company MoonScoop revealed onthat the show is returning with a fifth season, rebranded as Code Lyoko Evolution, that premiered on December 19, 2012 in France.&quot;\n\nLong story made short I was appalled at the dismal efforts in the fanbase for this show for providing quality material. Most everyone seems to be completely content with low quality hardsubbed yotube uploads. As one of the original longtime uploaders of the original series I took it upon myself to rectify this.\n\nAs of the time of this writing there are 10 episodes available. All are available and softsubbed in this torrent. Though there are 1080p sources available, sources have noted that the show is aired in 720p and I have noticed no quality difference between the two so went with 720 to cut overhead.\n\nActual video and subtitle sources are not my own. Sadly I do not have proper credits to give at this time. Episode 5 has a small treat with an added English audio track in addition to the French track as the dubbed version of this episode has been run on Kabillion. I will probably continue this trend as more dubbed episodes air.\n\nAs always, please seed and share with your friends!","torrent":{"xt":"urn:btih:de8717b0d192c3146730a736a597cebb5b249c4b","amp;dn":"Code+Lyoko+Evolution+E01-E10+720p+English+subtitle+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8717b0d192c3146730a736a597cebb5b249c4b","infoHashBuffer":{"type":"Buffer","data":[222,135,23,176,209,146,195,20,103,48,167,54,165,151,206,187,91,36,156,75]},"announce":[],"urlList":[]}}