{"title":"James Brown-Live At The Apollo-1962-mp3","uid":4104846,"size":98724484,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:debca85d83781ccedc3b2b8a05e3e400d7cf0f93&amp;dn=James+Brown-Live+At+The+Apollo-1962-mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nimbulus","files":16,"time":1206749679,"description":"mp3 files @320kbps\n\n&amp;#039;The Apollo Theater Presents, In Person, The James Brown Show&amp;#039;\nRecorded Live at the Apollo Theater, Harlem, New York City, October 24,1962.\nRemastered and expanded edition.\n\nAmazon.co.uk Review\nThank God someone thought to record the Godfather in concert at this vital stage of his career--and at the ultimate shrine of black American music to boot. There is no more exciting document of live performance in the history of R&amp;B: powered by tireless drummer Clayton Fillyau, James Brown and the Famous Flames tear their way through a slew of King hits--from &quot;Please, Please, Please&quot; to &quot;Night Train&quot;--taking soul power to the very edge of gospel abandon in the process. The Apollo audience, hysterical with adulation, plays as big a part in Live at the Apollo as Brown himself. The shrieking build-up and sudden drop down into &quot;Lost Someone&quot; is one of the most heart-stopping moments in soul. --Barney Hoskyns \n\nDescription\nMany albums are hyped as legendary; few deserve the accolade. LIVE AT THE APOLLO 1962 is one of those rare albums that lives up to the hype. Released despite label misgivings, LIVE AT THE APOLLO cemented James Brown&amp;#039;s reputation as the unchallenged master of soul music. Deejays played the entire album at one stretch--this in an era when radio programmers rejected four-minute singles because they were too long--and the record reached number two on the Billboard pop chart, a previously unheard-of achievement for a gritty R&amp;B album.\nLIVE AT THE APOLLO is more than a pop phenomenon, however; it is a document of one of America&amp;#039;s greatest performers at the peak of his artistic powers. Brown&amp;#039;s singing is orgasmic--just listen to the opening squeal on &quot;I Go Crazy&quot;--and the intensity never lets up. Brown drives his crack band throughbreakneck versions of early hits before dragging them through the 11-minute bump-and-grind of &quot;Lost Someone&quot;, the high point of a show that is nothing but high points. Decades later, this is still one of the greatest live albums of all-time. \n________________________________________\n","torrent":{"xt":"urn:btih:debca85d83781ccedc3b2b8a05e3e400d7cf0f93","amp;dn":"James+Brown-Live+At+The+Apollo-1962-mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"debca85d83781ccedc3b2b8a05e3e400d7cf0f93","infoHashBuffer":{"type":"Buffer","data":[222,188,168,93,131,120,28,206,220,59,43,138,5,227,228,0,215,207,15,147]},"announce":[],"urlList":[]}}