{"title":"Sams Teach Yourself Shell Programming in 24 Hours","uid":4718418,"size":5438245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:def1dddf6691d49eeb4ade1904c9f5c15a5c40d0&amp;dn=Sams+Teach+Yourself+Shell+Programming+in+24+Hours&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"VasiaZozulia","files":1,"time":1234390521,"description":"The vast majority of users utilize the Korn Shell or some variant of the Bourne Shell, such as bash. Sams Teach Yourself Shell Programming in 24 Hours covers these shells. It begins with a generalized tutorial of Unix and tools and then moves into detailed coverage of shell programming. Sams Teach Yourself Shell Programming in 24 Hours is one of the best values because it provides readers with more information for less money. This book uses the effective and proven 'Teach Yourself' format to instruct the reader how to make their shell work for them. It covers useful information including: managing input/output, manipulating text filters, understanding and debugging shell scripts, creating and utilizing variables, tools, processes, and customizing the shell. Sams Teach Yourself Shell Programming in 24 Hours is a tutorial aimed at assisting Unix and Linux users to get optimal performance out of their operating system. It shows them how to take control of their systems and work efficiently by har4nessing the power of the shell to solve common problems.","torrent":{"xt":"urn:btih:def1dddf6691d49eeb4ade1904c9f5c15a5c40d0","amp;dn":"Sams+Teach+Yourself+Shell+Programming+in+24+Hours","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def1dddf6691d49eeb4ade1904c9f5c15a5c40d0","infoHashBuffer":{"type":"Buffer","data":[222,241,221,223,102,145,212,158,235,74,222,25,4,201,245,193,90,92,64,208]},"announce":[],"urlList":[]}}