{"title":"A Split Second -  From The Inside","uid":3917736,"size":151540996,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:defd865305ee549e38e65229c2510e6e9a844eee&amp;dn=A+Split+Second+-++From+The+Inside&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"80zforever","files":15,"time":1196590973,"description":"A Split Second Formed 1985, Ghent, Belgium.\n\nOne of the formative New Beat groups -- arguably the first, due to DJ Marc Grouls spinning the band\\&amp;#039;s debut single Flesh at 33rpm instead of 45rpm, thus inventing the genre -- A Split Second quickly turned to more industrial sounds, merging heavy use of synthesizers with distorted guitars and Marc Ickx\\&amp;#039;s distinctive vocals.  After distributing a handful of demos, the band was soon signed to Antler-Subway for the release of their first two singles and the full-length Ballistic Statues. \n\nHighly successful in European dance clubs, the band was then picked up by the influential American label Wax Trax!, a move that granted them a much wider audience.  Wax Trax! compiled their American debut, the self-titled A Split Second, from early singles and selections off Ballistic Statues, then released the 1989 full-length ...From the inside.  By 1990, however, the band was dropped from Wax Trax! and moved to Caroline for American distribution, while remaining on the Antler-Subway label in Europe. After the 1990 tour supporting Kiss of Fury, creative differences prompted a long hiatus, with only occasional remixes of their early singles keeping the band\\&amp;#039;s name alive.   \n\nFrom 1991 to 1993 Mark Ickx worked on solo material as well as collaborations with other artists, notably Gitane Demone, while Chrismar Chayell joined in other bands without much public attention.  By 1993 it was clear that the band would not be reformed as a group, so Marc Ickx decided to continue with the name A Split Second on his own.  He returned in 1993 with Vengeance C.O.D, relying far more heavily on guitar-based tracks than on dance-oriented synthesizers.  This trend continued on 1995\\&amp;#039;s Megabite, which sold very badly and garnered dismal reviews.  The current status of the band is unknown, though they did play several live gigs in 2001 and 2002.\n\n\n","torrent":{"xt":"urn:btih:defd865305ee549e38e65229c2510e6e9a844eee","amp;dn":"A+Split+Second+-++From+The+Inside","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"defd865305ee549e38e65229c2510e6e9a844eee","infoHashBuffer":{"type":"Buffer","data":[222,253,134,83,5,238,84,158,56,230,82,41,194,81,14,110,154,132,78,238]},"announce":[],"urlList":[]}}