{"title":"The Well-Grounded Rubyist, 2nd Edition (pdf/mobi/epub + source)","uid":13028678,"size":15102861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df327f7fa86f8d2436f8692afd3f31c8748d00c1&amp;dn=The+Well-Grounded+Rubyist%2C+2nd+Edition+%28pdf%2Fmobi%2Fepub+%2B+source%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":4,"time":1450430177,"description":"The purpose of The Well-Grounded Rubyist is to give you a broad and deep understanding of how Ruby works and a considerable toolkit of Ruby techniques and idioms that you can use for real programming.\r\nThe Well-Grounded Rubyist, Second Edition is optimized for a reader who’s done some programming and perhaps even some Ruby and wants to learn more about the Ruby language—not only the specific techniques (although the book includes plenty of those), but also the design principles that make Ruby what it is. I’m a great believer in knowing what you’re doing. I also believe that knowing what you’re doing doesn’t mean you have to compose a treatise in your head every time you write a line of code; it means you know how to make the most out of the language, and understand how to analyze problems when they arise.\r\nThe Well-Grounded Rubyist, Second Edition is a serious, extensive look at the Ruby language. But it isn’t a complete language reference. There are core classes that I say little or nothing about, and I discuss only a modest number of standard library packages. That’s by design. You don’t need me to spell out for you how to use every standard-library API, and I don’t. What you do need, in all likelihood, is someone to explain to you exactly what class","torrent":{"xt":"urn:btih:df327f7fa86f8d2436f8692afd3f31c8748d00c1","amp;dn":"The+Well-Grounded+Rubyist%2C+2nd+Edition+%28pdf%2Fmobi%2Fepub+%2B+source%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df327f7fa86f8d2436f8692afd3f31c8748d00c1","infoHashBuffer":{"type":"Buffer","data":[223,50,127,127,168,111,141,36,54,248,105,42,253,63,49,200,116,141,0,193]},"announce":[],"urlList":[]}}