{"title":"America's Bitter Pill - Steven Brill- Audiobook MP3","uid":11691019,"size":495091653,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df749be14c74b39d98d1b2958cafbc3f81dcb51c&amp;dn=America%27s+Bitter+Pill+-+Steven+Brill-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":15,"time":1423530917,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nAmerica's Bitter Pill: Money, Politics, Backroom Deals, and the Fight to Fix Our Broken Healthcare System\n\nWritten by: Steven Brill\nNarrated by: Dan Woren\nLength: 17 hrs and 10 mins\nUnabridged Audiobook\nRelease Date:01-05-15\n\nAmerica's Bitter Pill is Steven Brill's much-anticipated, sweeping narrative of how the Affordable Care Act, or Obamacare, was written, how it is being implemented, and, most important, how it is changing - and failing to change - the rampant abuses in the healthcare industry. Brill probed the depths of our nation's healthcare crisis in his trailblazing Time magazine Special Report, which won the 2014 National Magazine Award for Public Interest. Now he broadens his lens and delves deeper, pulling no punches and taking no prisoners.\nIt's a fly-on-the-wall account of the fight, amid an onslaught of lobbying, to pass a 961-page law aimed at fixing America's largest, most dysfunctional industry - an industry larger than the entire economy of France.\nIt's a penetrating chronicle of how the profiteering that Brill first identified in his Time cover story continues, despite Obamacare.\nAnd it is the first complete, inside account of how President Obama persevered to push through the law, but then failed to deal with the staff incompetence and turf wars that crippled its implementation.\nBrill questions all the participants in the drama, including the president, to find out what happened and why.\nHe asks the head of the agency in charge of the Obamacare website how and why it crashed.\nAnd he tells the cliffhanger story of the tech wizards who swooped in to rebuild it.\nBrill gets drug lobbyists to open up on the deals they struck to protect their profits in return for supporting the law.\nAnd he buttresses all these accounts with meticulous research and access to internal memos, emails, notes, and journals written by the key players during all the pivotal moments.\nBrill is there with patients when they are denied cancer care at a hospital, or charged $77 for a box of gauze pads. Then he asks the multimillion-dollar executives who run the hospitals to explain why","torrent":{"xt":"urn:btih:df749be14c74b39d98d1b2958cafbc3f81dcb51c","amp;dn":"America%27s+Bitter+Pill+-+Steven+Brill-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df749be14c74b39d98d1b2958cafbc3f81dcb51c","infoHashBuffer":{"type":"Buffer","data":[223,116,155,225,76,116,179,157,152,209,178,149,140,175,188,63,129,220,181,28]},"announce":[],"urlList":[]}}