{"title":"God, Guns, Grits, and Gravy - Mike Huckabee - Audiobook MP3","uid":11693682,"size":232988130,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e005b47ee683c80b7c91815f3fe346be5c5cd60b&amp;dn=God%2C+Guns%2C+Grits%2C+and+Gravy+-+Mike+Huckabee+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Squiddy82","files":9,"time":1423627589,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nGod, Guns, Grits, and Gravy\n\nWritten by: Mike Huckabee\nNarrated by: Mike Huckabee\nLength: 8 hrs and 2 mins\nUnabridged Audiobook\nRelease Date:01-20-15\n\nIn Mike Huckabee's new book God, Guns, Grits and Gravy, he asks the question, &quot;Have I been taken to a different planet than the one on which I grew up?&quot; The New York Times best-selling author explores today's American culture, drawing from his travels as a presidential candidate to present average, small-town people and families, and their optimistic resilience in the face of hard times; their stories, says Huckabee, &quot;will inspire readers to think about their own values and rediscover what makes America great.&quot; At times lighthearted, at others bracingly realistic, Huckabee's brand of optimistic patriotism lends itself to discussing the reintroduction of fundamental American values, as well as a bright outlook for future generations","torrent":{"xt":"urn:btih:e005b47ee683c80b7c91815f3fe346be5c5cd60b","amp;dn":"God%2C+Guns%2C+Grits%2C+and+Gravy+-+Mike+Huckabee+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e005b47ee683c80b7c91815f3fe346be5c5cd60b","infoHashBuffer":{"type":"Buffer","data":[224,5,180,126,230,131,200,11,124,145,129,95,63,227,70,190,92,92,214,11]},"announce":[],"urlList":[]}}