{"title":"Perfume - A HistÃƒÂ³ria de um Assassino (dublado) DVDrip .avi","uid":5132566,"size":734253056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e06e8e1e14cbcdded615f974e11c2ec4f8cb41e7&amp;dn=Perfume+-+A+Hist%C3%83%C2%B3ria+de+um+Assassino+%28dublado%29+DVDrip+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Prathero","files":1,"time":1256160100,"description":"Perfume: A HistÃƒÂ³ria de um Assassino conta a histÃƒÂ³ria em flashback do aprendiz de perfumista Jean-Baptiste Grenouille (Ben Whishaw) que estava a ponto de ser guilhotinado, acusado de assassinar vÃƒÂ¡rias mulheres, na Paris de 1738. Grenouille nasceu com um dom fora do comum: um olfato super sensÃƒÂ­vel, que lhe permite distinguir vÃƒÂ¡rios cheiros da natureza e fragrÃƒÂ¢ncias de cosmÃƒÂ©ticos. Sua vida foi muito solitÃƒÂ¡ria, marcada, desde o nascimento pelo abandono da mÃƒÂ£e e, mais tarde, em um orfanato, pelo do das outras crianÃƒÂ§as ao seu redor. Grenouille fechou-se muito em seu mundo, nÃƒÂ£o conversava com ninguÃƒÂ©m e, portanto, nÃƒÂ£o conseguiu exercer os atos da linguagem e da comunicaÃƒÂ§ÃƒÂ£o. Passou a vida inteira como um &quot;lixo&quot; social, sendo maltratado, incompreendido e excluÃƒÂ­do por todos. Em uma noite, Grenouille avistou uma pobre vendedora de frutas na rua e ficou extasiado com o perfume que exalava de seu corpo. E, quando aproximou-se dela, ela se assustou e antes mesmo de gritar, Grenouille tapou a boca da moÃƒÂ§a de uma tal maneira que acabou matando-a sufocada. No entanto, o que mais admirou Grenouille nÃƒÂ£o foi ter eliminado uma vida, mas o fato de apesar de morta, o cheiro dela permanecer no seu corpo inerte e nas suas prÃƒÂ³prias mÃƒÂ£os de assassino.\n\nAntes de conhecer o Mestre Baldini (Dustin Hoffman), perfumista de relativa reputaÃƒÂ§ÃƒÂ£o, Grenouille trabalhava como curtidor. ApÃƒÂ³s demonstrar seu dom a Baldini, Grenouille ÃƒÂ© aceito no seu ateliÃƒÂª e acaba detendo a arte de confeccionar perfumes.\n\nNo entanto, o jovem e impetuoso aprendiz tinha uma ambiÃƒÂ§ÃƒÂ£o (ou compulsÃƒÂ£o?) por querer impregnar nos frascos o cheiro dos mais diversos elementos da natureza(a ÃƒÂ¡gua, as pedras, as folhas, a terra e, atÃƒÂ© mesmo, o odor dos animais), mas apesar disso, queria saber como extrair os cheiro, porque ele queria extrair o cheiro das mulheres, para fazer o mais belo perfume. Apesar de ser repreendido por Baldini por ter assassinado o seu gato, Grenouille nÃƒÂ£o abandonou essa obsessÃƒÂ£o. Foi mandado por Baldini ÃƒÂ  cidade de Paris. Grenouille ÃƒÂ©, por causa de seu olfato apuradÃƒÂ­ssimo, um ser capaz de perceber (e se encantar) com cheiros imperceptÃƒÂ­veis pela maioria dos seres humanos. Uma vez que Grenouille aprendeu a tÃƒÂ©cnica para a extraÃƒÂ§ÃƒÂ£o da essÃƒÂªncia dos elementos, ele resolve aplicÃƒÂ¡-la ao seu novo item bizarro: os corpos das mulheres mortas. Grenouille utilizava-se de um imenso decantador para atirar em seu interior os corpos das mulheres mortas no intuito de, assim, extrair a doce essÃƒÂªncia delas. Mas tal experiÃƒÂªncia resultava em fracassso e, entÃƒÂ£o, Grenouille tentou outro mÃƒÂ©todo: ele fazia a depilaÃƒÂ§ÃƒÂ£o das mulheres mortas, pois, de certa forma, percebeu que o cheiro delas provinha da epiderme.","torrent":{"xt":"urn:btih:e06e8e1e14cbcdded615f974e11c2ec4f8cb41e7","amp;dn":"Perfume+-+A+Hist%C3%83%C2%B3ria+de+um+Assassino+%28dublado%29+DVDrip+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e06e8e1e14cbcdded615f974e11c2ec4f8cb41e7","infoHashBuffer":{"type":"Buffer","data":[224,110,142,30,20,203,205,222,214,21,249,116,225,28,46,196,248,203,65,231]},"announce":[],"urlList":[]}}