{"title":"Killing Joke - Night Time (1985) (FLAC - EAC)","uid":6511784,"size":275607349,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e0836120e325ddc5e0b91ba06bf91a129324e071&amp;dn=Killing+Joke+-+Night+Time+%281985%29+%28FLAC+-+EAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1309652613,"description":"\n\nSeminal post-punk band who have gone through numerous internal conflicts and line-up changes,\nas well as a variety of different styles and sounds.Formed in Notting Hill in 1978 by Jaz Coleman,\nGeordie Walker, Youth and Paul Ferguson, their dark experimental style provided one of the main\nsteps on from punk rock. Massively influential on a range of different styles of music, they pioneered\nthe industrial metal style with 1990's Extremities, Dirt And Various Repressed Emotions.\n\n\n\nAlbum Reviews (c/o amazon)\n\nWhile many consider that at this point KJ had lost their way and decided that money\nwas needed to fund the wagon, I disagree. The music shows a massive desire to change, to finally\nstretch the intellectual muscles, away from the tribal moevments that helped establish them. Such tracks\nas Love Like Blood and Eighties may have been specifically penned/chosen for their sole purpose as\nmoney spinners, with their catchy lines and hard to resist melodies, there are real gems such as\nDarkness Before Dawn, Multitudes and the hideous and dark Europe (which will be the first part of the\nCD to fade at this rate!), these on their own hint at the promise of later works like Democracy and Millenium.\nThe music remnicinant of the sharp, multi-layered, crisp eighties guitar sound, but used to devaststating\neffect by one of the greatest unsung guitar heroes of modern rock music. The whole band made a decision\nto try something different and make it work, this album might have shocked fans at the time but when held\nin context with the rest of the collection, sets a milestone. I would advise anyone who appreciates the\nmid/late eighties guitar orientated music of bands like Sisters and Spear of Destiny to ensure that this is in\ntheir collection. Anyway, the cover shot of the band, trying very hard to look like Spandau Ballet, is a classic!\n\nBy 1984-1985 the, Killing Joke's 'mad years' were behind them, the impending apocalypse\nhad'nt happened and their collective trips to Iceland (to escape the coming of Armageddon) were perhaps\nbecoming a tad expensive.Nevertheless, with all this going on, they still managed to produce some fine\nalbums in the form of Revelations (1982) and Fire Dances (1983). Thus 1984 saw a change of direction in\nterms of their music and the introduction of a tighter production team. Their 1984 track A New Day produced\na more accessable, even commercial sound whilst not letting-up on the quality control. The outcome was their\nclassic Night Time album, and their biggest hit single to date. It was a Top 10 album (peaking at #9) and the\nclassic Love Like Blood single (a Top 20 hit) flooded the club scene across the world as it's riff was,\nincredibly, 'danceable'. It was the album that people bought in (relative) droves and brought the\nJoke to the attention of the dreaded 'mainstream'.\n\nHowever, Night Time is perhaps the Joke's darkest album in terms of lyrical content. There are some classic\ncuts here. The fabulous, breakneck and cutting opening of the title track is the perfect intro, Darkness Before\nDawn is bleak and deadly and Europe is the hit single that never was. The closing track, the brilliant Eighties,\nwas the song that characterised the anti-establisment generation in Thatcher's 'Me First' Britain, yet amazingly\nit was not a big hit, and only just made the Top 60. There's not a dud track in sight although eight tracks is\nperhaps a little lazy, and the inclusion of A New Day etc may have been a good idea (although perhaps it was\ndeemded a little out of sync with the rest of the album). Overall, you'd be hard-pressed to find a more brooding,\nexciting album emanating from the mid-1980's, and this album has been much-copied but never bettered.\nThe success of Night Time led to their era-defining Brighter Than a Thousand Suns album the following year.\nBuy these two albums and you have bought-into two of the finest British albums ever made.\n\n\n\n---------------------------------------------------------------------\nKilling Joke - Night Time\n---------------------------------------------------------------------\n\n\nArtist..............................: Killing Joke\nAlbum.................................: Night Time\nGenre...................................: New Wave\nSource........................................: CD\nYear........................................: 1985\n\nRipper: Exact Audio Copy V1.0 b1 &amp; HP DVD RW AD-7701H\n\nCodec...........: Free Lossless Audio Codec (FLAC)\nVersion.........: reference libFLAC 1.2.1 20070917\nQuality.......: Lossless, (avg. compression: 62 %)\nChannels..............: Stereo / 44100 HZ / 16 Bit\nTags...............................: VorbisComment\n\nInformation..: Original 1985 European Pressing\n\nRipped by..............: BSW on 7/2/2011\nPosted by..............: BSW on 7/2/2011\nNews Server..........: news.astraweb.com\n\nNews Group(s).: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded....: NFO, SFV, M3U, LOG, CUE\nCovers................: Front Back CD\n\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n\n1. Night Time [04:57]\n2. Darkness Before Dawn [05:21]\n3. Love Like Blood [06:50]\n4. Kings And Queens [04:40]\n5. Tabazan [04:36]\n6. Multitudes [04:59]\n7. Europe [04:37]\n8. Eighties [03:51]\n\n\nPlaying Time............: 39:55\nTotal Size..........: 250.83 MB\n\nNFO generated on.....: 7/2/2011 10:43:24 PM\n\n\n\n---------------------------------------------------------------------\n\nCat No: EGCD 61\nMarketed by Virgin\nBarcode: 5 012985 306126\n\n---------------------------------------------------------------------\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::\n","torrent":{"xt":"urn:btih:e0836120e325ddc5e0b91ba06bf91a129324e071","amp;dn":"Killing+Joke+-+Night+Time+%281985%29+%28FLAC+-+EAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0836120e325ddc5e0b91ba06bf91a129324e071","infoHashBuffer":{"type":"Buffer","data":[224,131,97,32,227,37,221,197,224,185,27,160,107,249,26,18,147,36,224,113]},"announce":[],"urlList":[]}}