{"title":"Bill Evans - Everybody Digs Bill Evans (1958)  [FLAC]","uid":9680414,"size":233998005,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e1175d3cc5f426ff78ac908cf78cd0ba4c28db84&amp;dn=Bill+Evans+-+Everybody+Digs+Bill+Evans+%281958%29++%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jayb","files":-1,"time":1393658593,"description":"Bill Evans Trio - Everybody Digs Bill Evans\n\nRecording Date:\tDecember 15, 1958\nOriginal CD:\t1987 OJC#1860682\nDuration:\t42:56\nGenre:\t\tJazz\nStyles:\t\tPost-Bop, Jazz Instrument, Modal Music, Piano Jazz\n\nThis Release:\tOriginal Jazz Classics/Riverside\n\t\t#OJCCD-068-2\n\t\tDigitally Remastered\n\t\tDecember 31, 1991\n\nTrack Listing:\n01 Minority\t\t\tGigi Gryce\t\t\t05:21\n02 Young and Foolish\t\tA Hague/AB Horwitt\t\t05:53\n03 Lucky to Be Me\t\tL Bernstein/B Comden/A Green\t03:39\n04 Night and Day\t\tCole Porter\t\t\t07:34\n05 Epilogue\t\t\tBill Evans\t\t\t00:39\n06 Tenderly\t\t\tWalter Gross\t\t\t03:32\n07 Peace Piece\t\t\tBill Evans\t\t\t06:42\n08 What Is There to Say?\tV Duke/EY &quot;Yip&quot; Harburg\t\t04:53\n09 Oleo\t\t\t\tSonny Rollins\t\t\t04:07\n10 Epilogue\t\t\tBill Evans\t\t\t00:41\n11 Some Other Time\t\tL Bernstein/B Comden/A Green\t06:09\n\nAllMusic Review by Michael G. Nastos:\nEverybody Digs Bill Evans was a landmark recording for the young pianist and sported a unique album cover, featuring written-out endorsements from Miles Davis, George Shearing, Ahmad Jamal, and Cannonball Adderley. At a time approximate to when Evans was performing with the famous Kind of Blue band of Davis, Adderley, and John Coltrane, and actually departing the band, Evans continued to play the trio music he was ultimately best known for. With the unmatched pair of former Miles Davis drummer Philly Joe Jones and bassist Sam Jones (no relation), Evans was emerging not only as an ultra-sensitive player, but as an interpreter of standards second to none. The drummer is quite toned down to match the dynamics of the session, while the ever-reliable bassist lays back even more than usual, but at the expense of his soul. Of the covers, the solo &quot;Lucky to Me&quot; and the melancholy &quot;What Is There to Say?&quot; with the trio evoke the cool, smoldering emotionalism Evans was known for. He's even more starkly reserved on his solo version of &quot;Young and Foolish.&quot; But Evans also knows how to play vigorous bop, tearing up the complicated &quot;Oleo,&quot; and he modestly tackles the Gigi Gryce icon &quot;Minority,&quot; though if you listen closely, the takes are slightly imprecise and a bit thin. Evans is hyperactive on a clattery calypso version of &quot;Night and Day,&quot; with the melody almost an afterthought, powered by the precise drumming of Philly Joe Jones. Taking &quot;Tenderly&quot; in waltz time, Evans makes this familiar theme inimitably all his own. There are three more solos: two Asian-inspired interludes titled &quot;Epilogue&quot; and the demure and ultimately quiet &quot;Peace Piece,&quot; a timeless, meditational, reverent, prayer-inspired composition that, in time, set a standard for chamber/classical European-tailored jazz. In an alternate/second-version bonus track, Evans superimposes this theme under the standard &quot;Some Other Time,&quot; and it fits beautifully. Though not his very best effort overall, Evans garnered great attention, and rightfully so, from this important album of 1958.","torrent":{"xt":"urn:btih:e1175d3cc5f426ff78ac908cf78cd0ba4c28db84","amp;dn":"Bill+Evans+-+Everybody+Digs+Bill+Evans+%281958%29++%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1175d3cc5f426ff78ac908cf78cd0ba4c28db84","infoHashBuffer":{"type":"Buffer","data":[225,23,93,60,197,244,38,255,120,172,144,140,247,140,208,186,76,40,219,132]},"announce":[],"urlList":[]}}