{"title":"GNS3-0.8.6-all-in-one.exe","uid":10264620,"size":62360515,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e16ea6cd74486829de0b613c8f645932b47ee65b&amp;dn=GNS3-0.8.6-all-in-one.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"klisetj","files":1,"time":1401503925,"description":"GNS3 is an open source (GNU GPL) software that simulates complex networks while being as close as possible from the way real networks perform, all of this without having dedicated network hardware such as routers and switches.\n\nGNS3 provides an intuitive graphical user interface to design and configure virtual networks, it runs on traditional PC hardware and may be used on multiple operating systems, including Windows, Linux, and Mac OS X.\n\nIn order to provide complete and accurate simulations, GNS3 actually uses the following emulators to run the very same operating systems as in real networks:\n\n    Dynamips, the well known Cisco IOS emulator.\n    VirtualBox, runs desktop and server operating systems as well as Juniper JunOS.\n    QEMU, a generic open source machine emulator, it runs Cisco ASA, PIX and IPS.\n\nGNS3 is an excellent alternative or complementary tool to real labs for network engineers, administrators and people studying for certifications such as Cisco CCNA, CCNP and CCIE as well as Juniper JNCIA, JNCIS and JNCIE.\n\nIt can also be used to experiment features or to check configurations that need to be deployed later on real devices.\n\nGNS3 also includes other features like connection of the virtual network to real ones or packet captures using Wireshark. Finally, thanks to the VirtualBox support, system administrators and engineers can use GNS3 to make labs, test network features.","torrent":{"xt":"urn:btih:e16ea6cd74486829de0b613c8f645932b47ee65b","amp;dn":"GNS3-0.8.6-all-in-one.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e16ea6cd74486829de0b613c8f645932b47ee65b","infoHashBuffer":{"type":"Buffer","data":[225,110,166,205,116,72,104,41,222,11,97,60,143,100,89,50,180,126,230,91]},"announce":[],"urlList":[]}}