{"title":"Guillaume de Machaut - Motets - The Hilliard Ensemble","uid":5072758,"size":295080893,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e17e8a52846a622ff6d3e1c7f6672c02cefd4277&amp;dn=Guillaume+de+Machaut+-+Motets+-+The+Hilliard+Ensemble&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sheila6","files":40,"time":1251556994,"description":"Celebrating their 30th anniversary, the Hilliard Ensemble turns to the Motets of Machaut, 18 exquisitely wrought works that explore a wide range of human emotions within the context of a timeless style, as piercing today as it must have been to 14th Century Parisians. \n\nThe texts range from darker variations of courtly romances to the vagaries of love and fortune, reflections on envy, deceit, morality, death, and salvation. Machaut clothes these in long, flowing musical lines, often florid ones whose complex patterns reveal bold harmonic twists and turns, an exhilarating combination of austerity and rich complexity. \n\nThe Hilliard Ensemble - here five well-tuned voices, two countertenors, two tenors, and baritone - sing with an intensity often missing from more formalistic performances of medieval music, though never violating stylistic strictures. Perhaps these short masterpieces best retain their freshness when heard in chunks of three or four, but there's no question this is an essential acquisition for lovers of early music. Completing the recommendation, the engineers beautifully capture the glow of the church acoustic.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e17e8a52846a622ff6d3e1c7f6672c02cefd4277","amp;dn":"Guillaume+de+Machaut+-+Motets+-+The+Hilliard+Ensemble","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17e8a52846a622ff6d3e1c7f6672c02cefd4277","infoHashBuffer":{"type":"Buffer","data":[225,126,138,82,132,106,98,47,246,211,225,199,246,103,44,2,206,253,66,119]},"announce":[],"urlList":[]}}