{"title":"2k to 10k: Writing Faster, Writing Better by Rachel Aaron","uid":9979293,"size":227341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1dd4d87b47fe24d3c58e2b8432d0d645518e240&amp;dn=2k+to+10k%3A+Writing+Faster%2C+Writing+Better+by+Rachel+Aaron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1397715348,"description":"&quot;Have you ever wanted to double your daily word counts? Do you sometimes feel like you're crawling through your story? Do you want to write more every day without increasing the time you spend writing or sacrificing quality? It's not impossible; it's not even that hard. This is the book explaining how, with a few simple changes, I boosted my daily writing from 2000 words to over 10k a day, and how you can, too.&quot; \n\nNew Revised and Corrected Edition for Fall, 2013! \n\nExpanding on her highly successful system for doubling daily word counts, this book--a combination of reworked blog posts and new material--offers practical writing advice for anyone who's ever longed to increase their daily writing output. In addition to updated information for Rachel's popular 2k to 10k writing efficiency process, 5 step plotting method, and easy editing tips, this book includes all new chapters on creating characters who write their own stories, plot structure, and learning to love your daily writing. Full of easy to follow, practical advice from a professional author who doesn't eat if she doesn't produce good books on a regular basis, 2k to 10k focuses not just on writing faster, but writing better, and having more fun while you do it. \n\nThis updated edition has been professional edited to correct the errors and typos found in the original text.","torrent":{"xt":"urn:btih:e1dd4d87b47fe24d3c58e2b8432d0d645518e240","amp;dn":"2k+to+10k%3A+Writing+Faster%2C+Writing+Better+by+Rachel+Aaron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dd4d87b47fe24d3c58e2b8432d0d645518e240","infoHashBuffer":{"type":"Buffer","data":[225,221,77,135,180,127,226,77,60,88,226,184,67,45,13,100,85,24,226,64]},"announce":[],"urlList":[]}}