{"title":"SPINeRVALS - 27.0 Threshold Test and Suffer Fest.avi","uid":6761760,"size":615771144,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e1ef833db62b695c4dc646100d7bfc95a8165219&amp;dn=SPINeRVALS+-+27.0+Threshold+Test+and+Suffer+Fest.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"johndavidj99","files":1,"time":1319231092,"description":"Spinervals 27.0 - Threshold Test and Suffer Fest\nCompetition 27.0 - Threshold Test &amp; Suffer Fest\n  \nDVD - All Regions\nDuration: 60 Minutes\nIntensity: 9.5 \nPurpose: Determine your training zones, monitor your progress and increase your threshold. \n\n\n\nGETTING THE MOST OUT OF YOUR THRESHOLD TEST!\nThis workout is designed to provide the competitive cyclist with training zones relative to their Functional Threshold Power. After completing the test, plug your numbers into the calculator found HERE. Retest yourself using this method once every 6 weeks to monitor your progress and to reset your zones. For training plans using Spinervals DVDs, click HERE. Good luck! \n\nDiscover your HEART RATE and POWER TRAINING ZONES while boosting your threshold with this Amazing Workout! \n\nSpinervals 27.0 - Threshold Test &amp; Suffer Fest serves dual purposes. A great threshold building workout designed to boost your anaerobic threshold and sustainable power output for time trialing events including triathlons, this workout also functions as a repeatable 'field test' used by many prominent coaches and exercise physiologists to determine an athletes 'Functional Threshold', or that output of work (power) one can sustain on average over a 20 minute period. \n\nBy learning one's functional threshold and retesting it every 6-8 weeks, an athlete can accurately determine the proper training zones as well as assess their training progress over time. This form of performance testing is critical for anyone interested in getting faster on the bike and achieving optimal results through a structured training program. \n\nJoin Coach Troy Jacobson and the athletes from the New Jersey cycling and multisport community in this useful and effective workout that will help you go faster in your next race!\n\n\n","torrent":{"xt":"urn:btih:e1ef833db62b695c4dc646100d7bfc95a8165219","amp;dn":"SPINeRVALS+-+27.0+Threshold+Test+and+Suffer+Fest.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ef833db62b695c4dc646100d7bfc95a8165219","infoHashBuffer":{"type":"Buffer","data":[225,239,131,61,182,43,105,92,77,198,70,16,13,123,252,149,168,22,82,25]},"announce":[],"urlList":[]}}