{"title":"'Til Tuesday - Voices Carry","uid":3718237,"size":81888429,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e227f3beeb4a8d3d6205360d99ad5b8ea0416132&amp;dn=%5C%27Til+Tuesday+-+Voices+Carry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"marckos","files":13,"time":1182270196,"description":"Artist : &amp;#039;Til Tuesday\nTitle : Voices Carry\nGenre : Pop\nSource : CD\nRipper : EAC 0.95b (Secure mode)\nCodec : MP3\nEncoder : LAME 3.97\nCommand line : -V 0 --vbr-new -m s\nBitrate : VBR ~250kbps\nMode : Stereo\nFrequency : 44100Hz\nTags : ID3v2.3 (With covers images)\n\nReview:\n&amp;#039;Til Tuesday&amp;#039;s debut album, Voices Carry, contains hip photo imagery (Aimee Mann&amp;#039;s smile on the back is priceless and beautiful) and excellent songwriting, all credited to drummer Michael Hausman, guitarist Robert Holmes, keyboard player Joey Pesce, and bassist/singer Aimee Mann. The follow-up would be more specific as to who wrote what. While most bands from Boston suffered from lack of production, Mike Thorne does a decent job on much of the album and excellent work on the title track. Former manager Randall Barbera spoke with this writer prior to the album&amp;#039;s recording, when Human League/Pete Shelley producer Martin Rushent was being considered for the task. The question for fans was, like the Cars before them, what was wrong with the hit demo of &quot;Love in a Vacuum,&quot; which saturated Boston airwaves prior to the record deal? As good a job as Mike Thorne did on the song &quot;Voices Carry,&quot; the world at large has not heard the inspired and innovative recording that was the original &quot;Love in a Vacuum.&quot; If memory serves, Will Garrett did the production work, and like certain tracks by the band Private Lightning, the demo to &quot;Love in a Vacuum&quot; was superior to what came out on Epic. As Roy Thomas Baker polished &quot;Just What I Needed&quot; for the Cars, filling it with Queen-style thickness, the new wave edge of the demo, on release on Rhino&amp;#039;s Cars Deluxe, will give a good example of the transition these songs go through. The big difference is that the original &quot;Love in a Vacuum&quot; was perfect and needed no changing, and the Mike Thorne version is over-produced, creating a good album track when the true follow-up hit was actually in hand. Epic/Legacy simply has to expand this disc with the original &amp;#039;Til Tuesday demos. &quot;Don&amp;#039;t Watch Me Bleed&quot; has the same kind of mesmerizing bass that makes &quot;Voices Carry&quot; so captivating, while the final track, &quot;Sleep,&quot; could be the Human League going deep into the underground. The song would also work well with a girl group hero like Barbara Harris of the Toys, showing the versatility of this unique ensemble. Aimee Mann&amp;#039;s major-label debut shows rapid maturity when compared to her Bark Along With the Young Snakes EP, and there&amp;#039;s something about this combination of Pesce, Hausman, and the brilliant Robert Holmes that would make a &amp;#039;Til Tuesday reunion a welcome thing. The haunting lyrics and dark tones of the keys and bass on songs like &quot;I Could Get Used to This&quot; or &quot;No More Crying&quot; separate this recording from the work of similar &amp;#039;80s bands. &quot;Looking Over My Shoulder&quot; has a bubbling intensity which Holmes&amp;#039; guitar adds drama to. Voices Carry may have achieved success because of the MTV video, but there were nine other songs to go along with the hit, and this album and its follow-ups should have had as much commercial success as the Cars, because artistically, they are equal to that band&amp;#039;s dynamic debut.\n\nAll Music: http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kpfqxq95ldje\n\nSample: http://media.putfile.com/01---Love-In-a-Vacuum","torrent":{"xt":"urn:btih:e227f3beeb4a8d3d6205360d99ad5b8ea0416132","amp;dn":"%5C%27Til+Tuesday+-+Voices+Carry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e227f3beeb4a8d3d6205360d99ad5b8ea0416132","infoHashBuffer":{"type":"Buffer","data":[226,39,243,190,235,74,141,61,98,5,54,13,153,173,91,142,160,65,97,50]},"announce":[],"urlList":[]}}