{"title":"Mafia.II.Crackfix-SKIDROW","uid":5788454,"size":16454761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e29f24bdee26d50f94d9f77a1a7a8fe5ba31de6f&amp;dn=Mafia.II.Crackfix-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MAFIAA.","files":3,"time":1282743455,"description":"\nS  K  i  D  R  O  W\n\n-  T H E  L E A D i N G  F O R C E  -\n\nproudly presents\nMafia II Crackfix\n\nRELEASE DATE : 25-08-2010              PROTECTION : Steam  CEG\nGAME TYPE    : Action                  DISKS      : CRACKFIX\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nCrackfix Notes:\n\nThere were a little issue with previous crack. Fixed now\n\nWe apologize\n\nAs a bonus we have included the DLC package called Made Man.\n\nCopy everything to you Mafia II/pc/ folder and overwrite\n\nOn with the game release information:\n\nVito Scaletta has started to make a name for himself on the\nstreets of Empire Bay as someone who can be trusted to get a\njob done. Together with his buddy Joe, he is working to prove\nhimself to the Mafia, quickly escalating up the family ladder\nwith crimes of larger reward, status and consequence... the\nlife as a wise guy isn't quite as untouchable as it seems.\n\nAction-Packed Gameplay: Intense gunplay, white-knuckle car\nchases and visceral hand-to-hand combat - it will take all\nthat and more to become a &quot;made man&quot;.\n\nEpic Gangster Story: Inspired by iconic mafia drama, the\ncompelling characters and cinematic presentation will pull\nplayers into the allure and impossible escape of life in the\nMafia.\n\nImmersive World and Period: Enter the world of Empire Bay -\nWorld War II is raging in Europe and the architecture, cars,\nmusic and clothing all echo the period in stunning detail. As\ntime passes, hot rod cars, 50s fashion and some of the era's\nbest music reflect the birth of a cool new era.\n\nIllusion Engine: 2K Czech's proprietary Illusion Engine,\nallows gamers to explore\nEmpire Bay's 10 square miles of beautifully rendered outdoor\nenvironments and intricately designed interiors.\n\nSoundtrack Reflects the Mood of the Era: Players will be\nimmersed in the Golden Era of America as Mafia II features\ntracks from some of the era's most influential artists.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to the\n/pc/ folder inside the main installation dir and overwrite\n5. Play the game\n\nAdditional Notes:\n\nIf you have used any of these hacked demo cracks out there,\nthen make sure you start a new game, as your old saves will\nmake the game crash. The main reason why it wont work, is\nbecause those &quot;cracks&quot; are modified demo exes.\n\nSupport the companies, which software you actually enjoy\n\nNice job Valve on updating CEG, but as you can see that didn't\nhelp much. Good luck in wasting more money for the next update\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by XXX","torrent":{"xt":"urn:btih:e29f24bdee26d50f94d9f77a1a7a8fe5ba31de6f","amp;dn":"Mafia.II.Crackfix-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29f24bdee26d50f94d9f77a1a7a8fe5ba31de6f","infoHashBuffer":{"type":"Buffer","data":[226,159,36,189,238,38,213,15,148,217,247,122,26,122,143,229,186,49,222,111]},"announce":[],"urlList":[]}}