{"title":"The Silk Roads: A New History of the World","uid":12563746,"size":9217139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2a96f4fa1b1d0958ea555dcb9060e00e4fec421&amp;dn=The+Silk+Roads%3A+A+New+History+of+the+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"mdusanjay","files":1,"time":1444753009,"description":"The Silk Roads: A New History of the World by Peter Frankopan\r\n\r\nOverview: The sun is setting on the Western world. Slowly but surely, the direction in which the world spins has reversed: where for the last five centuries the globe turned westwards on its axis, it now turns to the east.\r\n\r\nFor centuries, fame and fortune was to be found in the west in the New World of the Americas. Today, it is the east which calls out to those in search of adventure and riches. The region stretching from eastern Europe and sweeping right across Central Asia deep into China and India, is taking centre stage in international politics, commerce and culture and is shaping the modern world.\r\n\r\nThis region, the true centre of the earth, is obscure to many in the English-speaking world. Yet this is where civilization itself began, where the world's great religions were born and took root. The Silk Roads were no exotic series of connections, but networks that linked continents and oceans together. Along them flowed ideas, goods, disease and death. This was where empires were won and where they were lost. As a new era emerges, the patterns of exchange are mirroring those that have criss-crossed Asia for millennia. The Silk Roads are rising again","torrent":{"xt":"urn:btih:e2a96f4fa1b1d0958ea555dcb9060e00e4fec421","amp;dn":"The+Silk+Roads%3A+A+New+History+of+the+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2a96f4fa1b1d0958ea555dcb9060e00e4fec421","infoHashBuffer":{"type":"Buffer","data":[226,169,111,79,161,177,208,149,142,165,85,220,185,6,14,0,228,254,196,33]},"announce":[],"urlList":[]}}