{"title":"Richard Hollingham - Blood and Guts. A History of Surgery [2008]","uid":10427140,"size":14599421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3233772f519dd394b3ce2dfcc634806c2b2c695&amp;dn=Richard+Hollingham+-+Blood+and+Guts.+A+History+of+Surgery+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":-1,"time":1403718946,"description":"Description\nProduct Details\nBook Title: Blood and Guts: A History of Surgery\t\nBook Author: Richard Hollingham (Author)\nHardcover: 320 pages\nPublisher: BBC Books; hardcover edition (September 23, 2008)\nLanguage: English\nISBN-10: 1846075033\nISBN-13: 978-1846075032\n\n===================================================================================\nBook Description\nPublication Date: September 23, 2008\nToday, astonishing surgical breakthroughs are making face transplants, limb transplants and a host of other previously undreamed of operations possible. But getting here has not been a simple story of selfless men working tirelessly in the pursuit of medical advancement. Instead it's a bloodstained tale of blunders, arrogance, mishap and murder. In trying to keep us alive, surgeons have all too often killed us off, and life-saving solutions have often come from the most surprising places.\nAccompanying a BBC series, Blood and Guts is an incredible story of stolen corpses, medical fraud, lobotomized patients - and every now and then courageous advances that have saved the lives of millions around the world.\nYou may think twice before going under the knife...\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nGlove up and dive in to what Hollingham describes as a whistle-stop tour of a gruesome and fascinating field. The BBC journalist and author (How to Clone the Perfect Blonde) is a deft storyteller who probably never met a dry fact he couldn't infuse with juicy detail. But there's more here than the drive, energy and bravery of medical pioneers, both doctors and patients, from Galen treating gladiators in the second century B.C.E. to Stuart Carter, the first person to have electrical brain implants to treat Parkinson's disease. Hollingham gives us a tribute not only to saving lives but to making them better. Still, it's the missteps that remind us of the human fallibility of even the greatest doctors. [Robert] Liston's operations were messy, bloody and traumatic, Hollingham writes of Britain's most famous 19th-century surgeon, describing a procedure in which Liston accidentally lopped off an assistant's fingers. The patient died of infection, as did the assistant, and an observer died of shock. It was the only operation in surgical history with a 300 percent mortality rate. What better medical history than one that recounts both successes and failures with honesty and gratitude. 16 pages of b&amp;w photos. (Dec. 8)\n\n===================================================================================\nReview\nBlood and Guts is an excellent history of surgery... a highly readable book, full of gripping anedcotes. Irish Mail on Sunday\n\n===================================================================================\nAbout the Author\nRICHARD HOLLINGHAM is a science journalist, author, and BBC radio presenter. He has written and presented a number of radio series on science, the environment, and international politics. His popular science book, How to Clone the Perfect Blonde, was longlisted for the coveted Aventis Science Prize in 2004.\n===================================================================================","torrent":{"xt":"urn:btih:e3233772f519dd394b3ce2dfcc634806c2b2c695","amp;dn":"Richard+Hollingham+-+Blood+and+Guts.+A+History+of+Surgery+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3233772f519dd394b3ce2dfcc634806c2b2c695","infoHashBuffer":{"type":"Buffer","data":[227,35,55,114,245,25,221,57,75,60,226,223,204,99,72,6,194,178,198,149]},"announce":[],"urlList":[]}}