{"title":"Soldier of Fortune Guide to How to Disappear and Never Be Found ","uid":9207876,"size":9553329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3880fcefbd07ccba9f4f339d134d94eab7ce42f&amp;dn=Soldier+of+Fortune+Guide+to+How+to+Disappear+and+Never+Be+Found+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":1,"time":1384728628,"description":":No matter if you're being followed or stalked or need to get away as soon as possible, being able to disappear without a trace is something that you will need to know. Whether you're an ordinary civilian or a military operative, having this skill is imperative to ultimate survival . . . and there's nobody better at knowing how to vanish at a moment's notice than a former SAS expert.\n\nBarry Davies has produced a solution to all of these problems and more with the Soldier of Fortune Guide to How to Disappear and Never Be Found. Davies divulges the secret ways to disappear that only a military-trained soldier could know. Formerly serving in the British Special Air Service, Davies was trained in this secret art and will inform you of the many companies to call in order to erase all records, how to give false information, how to disappear in our social media environment, and much more.\n\nIn this priceless guide, readers can learn how to protect themselves, their friends, and their families, all with the secret ways that Davies reveals. By following this model, one never has to feel unsafe or afraid ever again. \nGenre: Non Fiction , General","torrent":{"xt":"urn:btih:e3880fcefbd07ccba9f4f339d134d94eab7ce42f","amp;dn":"Soldier+of+Fortune+Guide+to+How+to+Disappear+and+Never+Be+Found+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3880fcefbd07ccba9f4f339d134d94eab7ce42f","infoHashBuffer":{"type":"Buffer","data":[227,136,15,206,251,208,124,203,169,244,243,57,209,52,217,78,171,124,228,47]},"announce":[],"urlList":[]}}