{"title":"Return of the Living Dead Complete Collection 1985 - 2005 - unhi","uid":6499926,"size":3751585272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e413dc8b07a7b84a336169a8b11cf07508c858e3&amp;dn=Return+of+the+Living+Dead+Complete+Collection+1985+-+2005+-+unhi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"TPBAgri","files":-1,"time":1309211205,"description":"The Return of the Living Dead (1985)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089907/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089907/&lt;/a&gt;\n\nWhen a bumbling pair of employees at a medical supply warehouse accidentally release a deadly gas into the air,\n\nthe vapors cause the dead to re-animate as they go on a rampage through Louisville, Kentucky seeking their favorite food, brains.\n\n\n\nReturn of the Living Dead Part II ( 1988 )\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095990/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095990/&lt;/a&gt;\n\nIn this first sequel to The Return of the Living Dead, a group of kids discover one of the drums containing a rotting corpse and release\n\nthe 2-4-5 Trioxen gas into the air, causing the dead to once again rise from the grave and seek out brains.\n\n\n\nReturn of the Living Dead III (1993)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0107953/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0107953/&lt;/a&gt;\n\nColonel Reynolds and his group of government scientists continue their work on re-animating the dead for military use. His son Curt and his girlfriend Julie use Dad\\'s security pass to sneak in and watch the proceedings. Later when father and son have a disagreement, Curt and Julie take off on a motorcycle and Julie is killed in an accident. Grief-stricken, Curt takes her body to the lab and brings her back to life. Curt must help Julie deal with her new existence as military agents and local gang members try to find them.\n\n\n\nReturn of the Living Dead: Necropolis (2005)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0411805/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0411805/&lt;/a&gt;\n\nThe scientist of the powerful and evil corporation Hybra-Tech Charles goes to Chernobyl to buy some gallons of toxic waste to perform experiments with zombies. When a teenager has an accident with his motorcycle and vanishes, his teenager\\'s friends, leaded by Charles\\' nephew, find that he was moved to Hybra-Tech. They break in the facility trying to find their friend and accidentally release a group of zombies starving for brains.\n\n\n\nReturn of the Living Dead: Rave to the Grave (2005)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0411806/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0411806/&lt;/a&gt;\n\nJulian and his few friends that actually managed to escape Necropolis have all enrolled in college and are trying to put their experiences with Hybratech behind them forever. Soon after, Jenny and Julian find a strange chemical container in a hidden room. In an effort to find out what this chemical, labeled as Trioxyin-5 is, they take it to their friend Cody for screening. However, Cody soon finds a way to make party drugs from it and try to earn some quick cash. Cody then makes a huge quantity of a drug called \\'Z\\' that he begins to sell to the college kids. Soon, Halloween approaches, and almost all of the college kids have already taken \\'Z\\'. After the drug takes effect and turns the kids into zombies, the Halloween costumes everyone is wearing make it hard to distinguish the living from the undead.\n","torrent":{"xt":"urn:btih:e413dc8b07a7b84a336169a8b11cf07508c858e3","amp;dn":"Return+of+the+Living+Dead+Complete+Collection+1985+-+2005+-+unhi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e413dc8b07a7b84a336169a8b11cf07508c858e3","infoHashBuffer":{"type":"Buffer","data":[228,19,220,139,7,167,184,74,51,97,105,168,177,28,240,117,8,200,88,227]},"announce":[],"urlList":[]}}