{"title":"The Two Babylons - Alexander Hislop","uid":10333719,"size":33716302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4433e7ab15be8a53b21c3ebc4c74057b11560c7&amp;dn=The+Two+Babylons+-+Alexander+Hislop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"starxteel","files":4,"time":1402442079,"description":"Where did the practices and beliefs of Roman Catholicism come from? In this scholarly classic Alexander Hislop reveals that many Roman Catholic teachings did not originate with Christ or the Bible, but were adopted from ancient pagan Babylonian religion, and given Christian names.\nAlthough difficult reading, this book accurately provides a fascinating historical in-depth examination of the shocking similarities between the practices of ancient Babylonian religion and those of today's Roman Catholic church.\nMadonna and Child See how a religion that was started by Nimrod and his wife spread to various regions, taking on different names, but keeping the same pagan rituals and trappings. These same rituals embody the Catholic church of today.\nLearn the true origins of:\n-The Mother and Child\n-The Mass\n-The Wafer (Eucharist)\n-Purgatory\n-The Sovereign Pontiff\n-Prayers for the Dead\n-The Rosary\n-The Sign of the Cross\n-The Confessional\n-Clothing and Crowning of Images\n-Priests, Monks, and Nuns\n-Relic Worship\n-Worship of the Sacred Heart\n-Extreme Unction and much more!\n\nOriginally a pamphlet published in 1853, The Two Babylons is Hislop's most famous work. In this book he argues that the Roman Catholic Church is nothing more than pagan cult, with roots in Babylonian mystery cults, which have a bank of secret knowledge only available to those who have been formally accepted into the cult. Roman Catholics, Hislop argues, are descendants from early Christians who adopted the Roman religion descended from the worship of Semiramis, the wife of the founder of Babylon. By discrediting the true Christianity of Catholics, Hislop hoped to bolster the legitimacy of the Protestant and Scottish Reformations. Students of theology and those interested in the complex history of Christianity will find Hislop's arguments provocative enough that they may be moved to further research of their own.\n","torrent":{"xt":"urn:btih:e4433e7ab15be8a53b21c3ebc4c74057b11560c7","amp;dn":"The+Two+Babylons+-+Alexander+Hislop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4433e7ab15be8a53b21c3ebc4c74057b11560c7","infoHashBuffer":{"type":"Buffer","data":[228,67,62,122,177,91,232,165,59,33,195,235,196,199,64,87,177,21,96,199]},"announce":[],"urlList":[]}}