{"title":"Our Worlds at War Storyline (DC Comics)","uid":5176838,"size":651392918,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e4832256c981ec47fa6eaaec4444ecea39ac525f&amp;dn=Our+Worlds+at+War+Storyline+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"brodahisou","files":-1,"time":1259018175,"description":"Our Worlds at War was a comic book crossover, published by DC Comics during the summer of 2001. It was was written by Jeph Loeb, Joe Casey, Mark Schultz, Joe Kelly, Phil Jimenez, and Peter David. Pencillers were Mike Wieringo, Ed McGuinness, Doug Mahnke, Ron Garney, and Leonard Kirk.\n\nThe crossover, which occurred mainly through the monthly Superman titles, Wonder Woman, and a series of character themed one-shot specials, dealt with the heroes of the DC Universe facing the threat of the cosmic force known as Imperiex, who attacked Earth for the purpose of using the planet as the staging ground for the &quot;hollowing&quot; of the entire universe.\n\nOur Worlds At War came to a close just weeks before the attacks of September 11, 2001. In a sobering occurrence of synchronicity, Adventures of Superman #596 was released one day after the attack, featuring the image of Lex Luthor's twin LexTowers heavily damaged by alien attacks on the issue's second page. The book's writer, Joe Casey, could not have intentionally referenced the attacks on the World Trade Center, as the story was written well before September. DC acknowledged that it mirrored the devastation so vividly that they made the books returnable without penalty to retailers.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:e4832256c981ec47fa6eaaec4444ecea39ac525f","amp;dn":"Our+Worlds+at+War+Storyline+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4832256c981ec47fa6eaaec4444ecea39ac525f","infoHashBuffer":{"type":"Buffer","data":[228,131,34,86,201,129,236,71,250,110,170,236,68,68,236,234,57,172,82,95]},"announce":[],"urlList":[]}}