{"title":"Eric Clapton - Unplugged - (1992)[EAC-MP3@320KBPS]","uid":4243747,"size":163452158,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e48f882182d6a78aa1f8acb1837837fa3ee63d4e&amp;dn=Eric+Clapton+-+Unplugged+-+%281992%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"seanprince","files":24,"time":1213684307,"description":"Eric Clapton - Unplugged - (1992)[EAC-MP3@320KBPS]\n\nTrack list\n\nEric Clapton - Unplugged\n\n01.\tSigne\t\t\t\t\t\t03:14\n02.\tBefore You Accuse Me\t\t\t\t03:44\n03.\tHey Hey\t\t\t\t\t\t03:16\n04.\tTears In Heaven\t\t\t\t\t04:36\n05.\tLonely Stranger\t\t\t\t\t05:27\n06.\tNobody Knows You When You&amp;#039;re Down &amp; Out\t\t03:49\n07.\tLayla\t\t\t\t\t\t04:46\n08.\tRunning On Faith\t\t\t\t06:29\n09.\tWalkin&amp;#039; Blues\t\t\t\t\t03:37\n10.\tAlberta\t\t\t\t\t\t03:42\n11.\tSan Francisco Bay Blues\t\t\t\t03:23\n12.\tMalted Milk\t\t\t\t\t03:36\n13.\tOld Love\t\t\t\t\t07:53\n14.\tRollin&amp;#039; &amp; Tumblin&amp;#039;\t\t\t\t04:11\n\nBiography\tby William Ruhlmann\n\nBy the time Eric Clapton launched his solo career with the release of his self-titled debut album in mid-1970, he was long established as one of the world&amp;#039;s major rock stars due to his group affiliations -- the Yardbirds, John Mayall&amp;#039;s Bluesbreakers, Cream, and Blind Faith -- which had demonstrated his claim to being the best rock guitarist of his generation. That it took Clapton so long to go out on his own, however, was evidence of a degree of reticence unusual for one of his stature. And his debut album, though it spawned the Top 40 hit &quot;After Midnight,&quot; was typical of his self-effacing approach: it was, in effect, an album by the group he had lately been featured in, Delaney &amp; Bonnie &amp; Friends.\nNot surprisingly, before his solo debut had even been released, Clapton had retreated from his solo stance, assembling from the D&amp;B&amp;F ranks the personnel for a group, Derek &amp; the Dominos, with which he played for most of 1970. Clapton was largely inactive in 1971 and 1972, due to heroin addiction, but he performed a comeback concert at the Rainbow Theatre in London on January 13, 1973, resulting in the album Eric Clapton&amp;#039;s Rainbow Concert (September 1973). But Clapton did not launch a sustained solo career until July 1974, when he released 461 Ocean Boulevard, which topped the charts and spawned the number one single &quot;I Shot the Sheriff.&quot;\nThe persona Clapton established over the next decade was less that of guitar hero than arena rock star with a weakness for ballads. The follow-ups to 461 Ocean Boulevard, There&amp;#039;s One in Every Crowd (March 1975), the live E.C. Was Here (August 1975), and No Reason to Cry (August 1976), were less successful. But Slowhand (November 1977), which featured both the powerful &quot;Cocaine&quot; (written by J.J. Cale, who had also written &quot;After Midnight&quot;) and the hit singles &quot;Lay Down Sally&quot; and &quot;Wonderful Tonight,&quot; was a million-seller. Its follow-ups, Backless (November 1978), featuring the Top Ten hit &quot;Promises,&quot; the live Just One Night (April 1980), and Another Ticket (February 1981), featuring the Top Ten hit &quot;I Can&amp;#039;t Stand It,&quot; were all big sellers.\nClapton&amp;#039;s popularity waned somewhat in the first half of the &amp;#039;80s, as the albums Money and Cigarettes (February 1983), Behind the Sun (March 1985), and August (November 1986) indicated a certain career stasis. But he was buoyed up by the release of the box set retrospective Crossroads (April 1988), which seemed to remind his fans of how great he was. Journeyman (November 1989) was a return to form. It would be his last new studio album for nearly five years, though in the interim he would suffer greatly and enjoy surprising triumph. On March 20, 1991, Clapton&amp;#039;s four-year-old son was killed in a fall. While he mourned, he released a live album, 24 Nights (October 1991), culled from his annual concert series at the Royal Albert Hall in London, and prepared a movie soundtrack, Rush (January 1992). The soundtrack featured a song written for his son, &quot;Tears in Heaven,&quot; that became a massive hit single.\nIn March 1992, Clapton recorded a concert for MTV Unplugged that, when released on an album in August, became his biggest-selling record ever. Two years later, Clapton returned with a blues album, From the Cradle, which became one of his most successful albums, both commercially and critically. Crossroads, Vol. 2: Live in the Seventies, a box set chronicling his live work from the &amp;#039;70s, was released to mixed reviews. In early 1997, Clapton, billing himself by the pseudonym &quot;X-Sample,&quot; collaborated with keyboardist/producer Simon Climie as the ambient new age and trip-hop duo T.D.F. The duo released Retail Therapy to mixed reviews in early 1997.\nClapton retained Climie as his collaborator for Pilgrim, his first album of new material since 1989&amp;#039;s Journeyman. Pilgrim was greeted with decidedly mixed reviews upon its spring 1998 release, but the album debuted at number four and stayed in the Top Ten for several weeks on the success of the single &quot;My Father&amp;#039;s Eyes.&quot; In 2000, Clapton teamed up with old friend B.B. King on Riding with the King, a set of blues standards and material from contemporary singer/songwriters. Another solo outing, entitled Reptile, followed in early 2001. Three years later, Clapton issued Me and Mr. Johnson, a collection of tunes honoring the Mississippi-born bluesman Robert Johnson. 2005&amp;#039;s Back Home, Clapton&amp;#039;s 14th album of original material, reflected his ease with fatherhood. The Road to Escondido from 2006 paired him with the man behind &quot;Cocaine&quot; and &quot;After Midnight,&quot; J.J. Cale.\n\nReview\tby Stephen Thomas Erlewine\n\nEric Clapton&amp;#039;s Unplugged was responsible for making acoustic-based music, and Unplugged albums in particular, a hot trend in the early &amp;#039;90s. Clapton&amp;#039;s concert was not only one of the finest Unplugged episodes, but was also some of the finest music he had recorded in years. Instead of the slick productions that tainted his &amp;#039;80s albums, the music was straightforward and direct, alternating between his pop numbers and traditional blues songs. The result was some of the most genuine, heartfelt music the guitarist has ever committed to tape. And some of his most popular -- the album sold over seven million copies in the U.S. and won several Grammies. \n\nEnjoy. \n","torrent":{"xt":"urn:btih:e48f882182d6a78aa1f8acb1837837fa3ee63d4e","amp;dn":"Eric+Clapton+-+Unplugged+-+%281992%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e48f882182d6a78aa1f8acb1837837fa3ee63d4e","infoHashBuffer":{"type":"Buffer","data":[228,143,136,33,130,214,167,138,161,248,172,177,131,120,55,250,62,230,61,78]},"announce":[],"urlList":[]}}