{"title":"B.B. King - 2009 - Live on SoundStage - 5.1","uid":15522465,"size":3882732763,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e4fb92ef1865d833319fbdd99dbb8ded7281316b&amp;dn=B.B.+King+-+2009+-+Live+on+SoundStage+-+5.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"GRNS3","files":20,"time":1470762168,"description":"Here is a very nice bootleg. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\nB.B. King - SoundStage - PBS - 29/01/2009\r\n\r\nDig.Cable Set-top &gt; FireWire &gt; Hauppage-TVR4400 &gt; HD &gt; TMPG suite &gt; DVD &gt; You\r\n\r\nVIDEO: NTSC - 720 x 480 - 29.970 frps - 8768 kbps - MPEG-2\r\nAUDIO: AC3 - 448 kb/s - 6 ch - 48000 Hz\r\n\r\nLive registration of B.B. King - aired on PBS 29/01/2009\r\n\r\nThe man needs no introduction. Truly the reigning king of blues, over the last 60 years B.B. King has developed one of the world's most identifiable guitar styles and has influenced thousands of musicians. Known for integrating precise and complex string bends with left hand vibrato, King has a uniquely regal and velvety tone making every note count.  \r\n\r\nWith trademark Gibson Lucille settled on his lap, B.B. King presents a set filled with staggering guitar jams on hits like The Thrill Is Gone and One Kind Favor. In between songs, Kings characteristic affable persona shines through as he introduces the band hes always toured with and shares stories from his life. Throughout the show special guests Terrence Howard, Solange, and guitarist Richie Sambora stop by to jam and pay tribute to this renowned blues master. Dont miss legend B.B. King in his element on this episode of Soundstage!\r\n\r\nSetlist:\r\n\r\nEveryday I Have the Blues\r\nSee That My Grave is Kept Clean\r\nHow Many More Years\r\nDownhearted\r\nTerrence and BB improv: I Need You So\r\nI Got Some Help I Dont Need\r\nThrill Is Gone\r\nNobody Loves Me But My Mother\r\nLet the Good Times Roll\r\nKey To the Highway\r\nThrill is Gone\r\nGuess Who\r\nWhen The Saints Go Marching In\r\n\r\nAt age 83, B.B. King is still light on his feet, singing and playing the blues with relentless passion. Time has no apparent effect on B.B., other than to make him more popular, more cherished, and more relevant than ever. For more than half a century, Riley B. King - better known as B.B. King - has defined the blues for a worldwide audience. Since he started recording in the 1940s, he has released over fifty albums, many of them classics. He was born September 16, 1925, on a plantation in Itta Bena, Mississippi, near Indianola. In his youth, he played on street corners for dimes, and would sometimes play in as many as four towns a night. In 1947, he hitchhiked to Memphis, TN, to pursue his music career.\r\n\r\nB.B.'s first big break came in 1948 when he performed on Sonny Boy Williamson's radio program on KWEM out of West Memphis. This led to steady engagements at the Sixteenth Avenue Grill in West Memphis, and later to a ten-minute spot on Memphis radio station WDIA. &quot;King's Spot,&quot; became so popular, he soon needed a catchy radio name. What started out as Beale Street Blues Boy was shortened to Blues Boy King, and eventually B.B. King. Soon after his number one hit, &quot;Three O'Clock Blues,&quot; B.B. began touring nationally. In 1956, B.B. and his band played an astonishing 342 one-night stands.\r\n\r\nB.B. was inducted into the Blues Foundation Hall of Fame in 1984 and into the Rock and Roll Hall of Fame in 1987. He received NARAS' Lifetime Achievement Grammy Award in 1987, and has received honorary doctorates from Tougaloo(MS) College in 1973; Yale University in 1977; Berklee College of Music in 1982; Rhodes College of Memphis in 1990; Mississippi Valley State University in 2002 and Brown University in 2007. In 1992, he received the National Award of Distinction from the University of Mississippi.\r\n\r\nB.B. continues to tour extensively, averaging over 250 concerts per year around the world. Classics such as &quot;Payin' The Cost To Be The Boss,&quot; &quot;The Thrill Is Gone,&quot; How Blue Can You Get,&quot; &quot;Everyday I Have The Blues,&quot; and &quot;Why I Sing The Blues&quot; are concert (and fan) staples. Over the years, the Grammy Award-winner has had two #1 R&amp;B hits, 1951's &quot;Three O'Clock Blues,&quot; and 1952's &quot;You Don't Know Me,&quot; and four #2 R&amp;B hits, 1953's &quot;Please Love Me,&quot; 1954's &quot;You Upset Me Baby,&quot; 1960's &quot;Sweet Sixteen, Part I,&quot; and 1966's &quot;Don't Answer The Door, Part I.&quot; B.B.'s most popular crossover hit, 1970's &quot;The Thrill Is Gone,&quot; went to #15 pop","torrent":{"xt":"urn:btih:e4fb92ef1865d833319fbdd99dbb8ded7281316b","amp;dn":"B.B.+King+-+2009+-+Live+on+SoundStage+-+5.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4fb92ef1865d833319fbdd99dbb8ded7281316b","infoHashBuffer":{"type":"Buffer","data":[228,251,146,239,24,101,216,51,49,159,189,217,157,187,141,237,114,129,49,107]},"announce":[],"urlList":[]}}