{"title":"Facial Workout - Because the Muscles Don't End at the Neck","uid":8778797,"size":629442560,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e51962e633409fdafb00039b09122e7be32b2956&amp;dn=Facial+Workout+-+Because+the+Muscles+Don%27t+End+at+the+Neck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"acer47x","files":1,"time":1375629025,"description":"The Tal Reinhart: Facial Workout\nBecause the Muscles Don't End at the Neck (2006)\navi format\n\nAs the other reviews attest, most users of the Tal Reinhart Facial Workout DVD will be women anxious to avoid plastic surgery (or reluctant or unwilling to consider it). Facial musculature, and its slippage over time however, is identical for both sexes and few males can deny that if we're fortunate enough to last to &quot;a certain age&quot; (49 in my case) we could most likely benefit from this sort of a program.\n\nAnd the good news for us aging XY's is that if you can overcome your &quot;hell no I won't ask for directions&quot; stubbornness, this program can REALLY do you some good. Tal Reinhart is not my first facial exercise guide; I've also done Carole Maggio and a couple other books, and those ARE helpful. Nevertheless I would recommend this as the place to start. First because VIDEO is by far the best way to learn these exercises. Although I do the Carole Maggio workout faithfully I am never 100% sure I'm doing everything correctly. Even the best descriptions and still photos can't demonstrate a facial move as well as video can. Second because Tal Reinhart is VERY well organized and presented. First time viewers can learn the individual exercises, practice them in isolation, then (quickly) advance to the full workout, offered without interruption at the end of the DVD. This is an EXCELLENT way to organize the material and demonstrates considerable foresight on the part of the producers to optimize our use of this material.\n\nThe first part of Tal Reinhart focuses on each individual exercise, explaining not only the technique but also showing via computer graphics how age and neglect cause facial muscles to sag. It's a horror show indeed! House of Wax part 2! See once-supple faces turn into cranky grandmothers before your eyes! More than anything else these visuals reinforce why facial exercise is IMPORTANT to personal self-confidence and general ongoing maintenance. Indeed, if you're reading this, you are most likely getting much of that motivation already from your own saggy visage staring uncomfortably back at you every morning from the bathroom mirror.\n\nIn addition to these eye-opening graphics (yes-intentional pun), the demonstrations are very slickly done and reasonably easy to follow. It sure doesn't hurt that the individual exercise demos are split between three gorgeous young Israeli models (actually the entire production is from Israel) whose faces are alabaster perfection to begin with. But who can fault the producers for using the beauty to which we aspire to motivate us? All three ladies are well experienced in the exercises they are demonstrating and as indicated earlier are easy to follow along with.\n\nBut the critical question is of course does it work? My short answer is YES however I must qualify that response by adding that I am continuing with much of the Carole Maggio workout alongside this one so it's impossible to say where one leaves off and the other begins. The eye &amp; upper face exercises are MUCH more comprehensible in Reinhart than Carole's books so anything above the nose I credit to Reinhart.\n\nIn evaluating this question we need to carefully consider exactly WHAT counts as success. I realize no amount of exercise will shrink my Darth Vader helmet of a skull; I must also accept that pattern baldness is just an indignity that life commands me to endure, and like a woman refusing plastic surgery I will NEVER glue a rug to my scalp (or anything equally ridiculous). In other words, my expectations have to be in line with what can be achieved.\n\nEven within those limitations I'm satisfied that the results justify the effort. I started facial exercise (Maggio) back in June '06 and only picked up Reinhart in early '07. I have been doing both daily and fairly quickly saw my face firm up and take on a chiseled shapeliness that certainly wouldn't have happened on its own. Taming my tendency to a double chin has taken somewhat longer but with ongoing effort it is DEFINITELY receding and I'm convinced that this too is an important battle that can be won. I am slightly amused by other reviewers complaining that facial workouts create more lines than they erase. What you're seeing here (for the first time) is muscular definition; would you gripe if you could see a six pack on your abs after months of effort? EVERY change I've observed on my own face has been an improvement!\n\nAn IMPORTANT (and possibly overlooked) point made on the video is that the &quot;full routine&quot; closing the DVD serves as a basis for constructing your own personalized facial workout (the full routine on the video takes about 20 minutes). In other words, don't just follow along with the &quot;full routine&quot; and wonder why things aren't shaping up as quickly as you'd like. I suspect most men (like myself) will require extra work and effort to sharpen the mouth and jawline. Be prepared to DO EXTRA reps for the areas you're particularly concerned about. This is where it might be useful for you to have a second book or video for another perspective. However I believe you CAN get good results using only the exercises demonstrated here, provided you'll customize your routine to match your needs.","torrent":{"xt":"urn:btih:e51962e633409fdafb00039b09122e7be32b2956","amp;dn":"Facial+Workout+-+Because+the+Muscles+Don%27t+End+at+the+Neck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e51962e633409fdafb00039b09122e7be32b2956","infoHashBuffer":{"type":"Buffer","data":[229,25,98,230,51,64,159,218,251,0,3,155,9,18,46,123,227,43,41,86]},"announce":[],"urlList":[]}}