{"title":"The Cold War: A Military History - David Miller","uid":9844601,"size":12156968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e51e6437baf80607e7d9466645d2f2884a2c419a&amp;dn=The+Cold+War%3A+A+Military+History+-+David+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Robin1966","files":5,"time":1396052500,"description":"Books : History : English\n\n\nFrom 1949 to 1991 the terrible potential of the Cold War loomed over the United States, the Soviet Union, and by extension, the rest of the world. The seeming-certainty of global nuclear conflict defined and articulated the cultural, political, and in particular, the military evolution of both nations. The Cold War provoked an unprecedented military build-up, and the rapidly advancing technology of warfare inspired fundamental changes in military strategy and tactics.\n\nMany books have been written about the politics of this turbulent period, but none have so comprehensively examined the conflict's military strategy and tactics. Using newly declassified information, David Miller, a noted military historian, reveals not only the vast effect that Cold War technology had on the military, but also how the threat of war very nearly became a terrible reality. Chillingly, Miller reveals that while the menace of nuclear war dominated the military theory of the time, there was little in reality that corresponded to these theories. The book goes on to examine each military area in turn, covering the formation of the two great alliances, NATO and the Warsaw Pact, and the strategies and major weapons in the rival navies, armies and air forces. Finally, his in-depth analysis of how military strategy shaped events, and his accounts of crises which could have turned the Cold War hot--the suppression of the Budapest uprising in 1956, and the imposition of martial law in Poland in 1981--are essential to an understanding of this definitive period in history.\n\nThat the Cold War ended without a conflict was due to professionalism on both sides. The result, Miller suggests, would have impressed the Chinese military strategist, Sun Tzu, who, writing in the fifth century BC, said that &quot;to subdue the enemy without fighting is the acme of skill.&quot;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e51e6437baf80607e7d9466645d2f2884a2c419a","amp;dn":"The+Cold+War%3A+A+Military+History+-+David+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e51e6437baf80607e7d9466645d2f2884a2c419a","infoHashBuffer":{"type":"Buffer","data":[229,30,100,55,186,248,6,7,231,217,70,102,69,210,242,136,74,44,65,154]},"announce":[],"urlList":[]}}