{"title":"MTVs.The.Best.Of.The.Tom.Green.Show.1999.DVDRiP.XViD-BLAZiNGDAYZ","uid":5555867,"size":732467968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e57a6751cb4dc12634bf0165c9d526dd174bf3f0&amp;dn=MTVs.The.Best.Of.The.Tom.Green.Show.1999.DVDRiP.XViD-BLAZiNGDAYZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TvTeam","files":5,"time":1273682111,"description":". \n \n  -    Your Key To The Scene.\n\nNow TvTeam with [No-RAR] Releases.\n\n(((((((((((((= Enjoy No RAR releases =))))))))))))))))))))\n\n...................................NFO:....................................\n\n.\n\n  \n.::BLAZiNG-DAYZ::...:PRESENTS:..MTVS.The.Best.Of.The.Tom.Green.Show.1999.DVDRiP.XViD\n\n\n.::iNFO::.\n\nGenre...............: Comedy | Talk-Show \nFile size...........: 698 MB\nFiLES...............: 48x14MB WiNRAR\nLanguage............: English\nYear................: 1999\nIMDB................: http://www.imdb.com/title/tt0162118/\n\n\n\n\n.::TECHNiCAL SPECS::.\n\n\nAUDiO...............: 128 KBPS CBR MP3 (Joint Stereo) \nViDEO...............: 688x512 XViD\nASPeCT RATiO........: 4:3 (Fullscreen) Progressive\nBiTRATE.............: 1,946 kbps\nFRAMe RATe..........: 25.000 fps\nLeNGHT..............: 46 Minutes 52 Seconds\n\n\n\n\n\n.::Summary::.\n\nThe Tom Green Show picked up by MTV in January 1999, where he gained popularity in the United States\n and worldwide,  would be similar to his original show where the show would be hosted by Green and \nco-hosted by two of his long-time friends, Glenn Humplik, who occupied the couch, and Phil Giroux, \nwho sat behind a window at the back of the set and became known as &quot;the guy in the window&quot; usually \ndrinking cups of coffee. Derek Harvie, who co-wrote the show with Green, occasionally appeared in the \nsegments. Many of the sketches were targeted at his parents, both of whom appear to be not impressed \nand embarrassed by their son's antics.\n\nThe Tom Green Show was renowned for Green's version of shock humour. Some of Green's most notable \nskits include pretending to &quot;hump&quot; a dead moose (also referenced by rapper Eminem in The Real Slim \nShady), having an X-rated lesbian scene painted on his father's car (labeled the &quot;Slut Mobile&quot;), \ndrinking milk by sucking on a cow's teat, and putting a cow head in his parents' bed while they slept \nbecause his father was a fan of The Godfather films. Green also hung his own unauthorized piece of art \nin the National Gallery of Canada (which remained untouched for days) with the added twist of later \ncoming back and vandalizing it to the horror of onlooking patrons.\nIn a segment, Green went to the press conference of Grey Owl where he serenaded and kissed Pierce \nBrosnan. Brosnan, thinking Green was a journalist, advised him not to give up his day job. Green also \ndid many segments humiliating his co-host and longtime friend Glenn Humplik; even after the pair had \nbecome well-known, Humplik continued working at his phone company job, fearing that his entertainment \ncareer might not last. Green teased him about this often and once gave out Humplik's office phone number \non the air.\nGreen eventually wrote a song called &quot;Lonely Swedish (The Bum Bum Song)&quot;, which he composed during MTV's \nSpring Break while doing a show on a cruise ship. After airing the music video on his show and appealing \nto his audience to request it, the song became an instant number one hit on Total Request Live and was \nalso referred to in Eminem's song The Real Slim Shady. He quickly called for the video to be retired \nbecause &quot;it's not fair to 98 Degrees.&quot; Later, in his autobiography, he revealed that MTV had pressured \nhim to do so in order to maintain the image that Total Request Live was, in fact, a live request show \n(the next week's episodes had been pre-taped on location, and the producers of the show were completely \nunaware of &quot;The Bum Bum Song&quot; at the time).\n\nGreen's increasing fame made it harder for him to ambush people during man-on-the-street segments, \nleading him to target mostly senior citizens and non-English speakers. After he was diagnosed with testicular\ncancer in March 2000, he stopped production on his TV show, but he continued to appear on the channel via \nreruns and other promotional materials. Green's popularity during this time led to him gracing the cover of \nthe June 8, 2000 issue of Rolling Stone Magazine","torrent":{"xt":"urn:btih:e57a6751cb4dc12634bf0165c9d526dd174bf3f0","amp;dn":"MTVs.The.Best.Of.The.Tom.Green.Show.1999.DVDRiP.XViD-BLAZiNGDAYZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e57a6751cb4dc12634bf0165c9d526dd174bf3f0","infoHashBuffer":{"type":"Buffer","data":[229,122,103,81,203,77,193,38,52,191,1,101,201,213,38,221,23,75,243,240]},"announce":[],"urlList":[]}}