{"title":"The Romantic Piano Concertos Collection - Hyperion  (FLAC)","uid":6096152,"size":13256682323,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e660e837ac6f0c7f223bf233c6a203a7b6fd8e3c&amp;dn=The+Romantic+Piano+Concertos+Collection+-+Hyperion++%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"Lucy1948","files":1144,"time":1294784912,"description":"Music : Classical : Lossless\n\nThere is quite a lack of good classical music torrents on demonoid. This contains Volumes 1 - 42 of Hyperion's Romantic Piano Concerto Series. I'd love to take credit for this torrent, but it was actually a download fromAll I've done is thrown in Volume 44 that I downloaded somewhere else, as it wasn't in the original torrent. And renamed a few things to make everything clearer.\n\nDon't be fooled into thinking that these are the only good piano concertos, however. If you enjoy these, then I would highly recommend the Piano Concertos by Tchaikovsky, Chopin, Rachmaninoff, Schumann, Liszt, Gershwin, Grieg, Scriabin, Amy Beach, Dvorak, Franck, Lalo, Brahms, Beethoven, Barber, and Hurlstone, among others.\n\nIf you can't seem to find those other ones, let me know and I'd be happy to upload my collection of them. Also, you might enjoy some of the other files that I've uploaded, such as all five of the Rubinstein Piano Concertos, and some assorted Grimaud recordings.\n\nAnyways, all lossless! Sweet! I haven't listened to them all yet, myself.\n\nFile format is FLAC, except for Vol. 44, which is APE. Make sure you know how to convert them! Personally, I convert them all to mp3 with dBpoweramp (which I have already uploaded!)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e660e837ac6f0c7f223bf233c6a203a7b6fd8e3c","amp;dn":"The+Romantic+Piano+Concertos+Collection+-+Hyperion++%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e660e837ac6f0c7f223bf233c6a203a7b6fd8e3c","infoHashBuffer":{"type":"Buffer","data":[230,96,232,55,172,111,12,127,34,59,242,51,198,162,3,167,182,253,142,60]},"announce":[],"urlList":[]}}