{"title":"A Winged Victory for the Sullen - A Winged Victory For The Sulle","uid":8128673,"size":181423751,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8140a49d08e12f5acb2928c72e8f166bb0bc779&amp;dn=A+Winged+Victory+for+the+Sullen+-+A+Winged+Victory+For+The+Sulle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":10,"time":1360541754,"description":"Artist: A Winged Victory For The Sullen\nRelease: A Winged Victory For The Sullen\nDiscogs: 3113733\nReleased: 2011-09-08 / 2011-09-12\nLabel: Erased Tapes Records / Kranky\nCatalog#: ERATP032CD / KRANK157\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Classical, Electronic, Contemporary\n\n\n\n01. We Played Some Open Chords And Rejoiced, For The Earth Had Circled The Sun Yet Another Year\n02. Requiem For The Static King Part One\n03. Requiem For The Static King Part Two\n04. Minuet For A Cheap Piano Number Two\n05. Steep Hills Of Vicodin Tears\n06. A Symphony Pathetique\n07. All Farewells Are Sudden\n\nProvided a Pitchfork review,as usual dont understand a word of it.\n\nWhen I heard Adam Wiltzie, known for his ambient work with Stars of the Lid, and Dustin O'Halloran, a Berlin-based pianist/composer and member of the dream pop band Devics, were teaming up for a new project, I knew what to expect. Which isn't a bad thing. Wiltzie makes sonorous and droning music with static harmonies in Stars of the Lid (and has played in Windsor for the Derby); O'Halloran writes melancholy piano music built around the repetition of chords and phrases. A Winged Victory for the Sullen, it turns out, is an exact halfway point between the two.\nWhat's interesting about the sound they've hit on isn't so much what the two musicians bring to each other's styles, as it is what each sacrifices from his own. In Stars of the Lid, Wiltzie and Brian McBride have a particular way of massing instruments into a big, pulmonary drone-- the individual timbres of the instruments rarely rise out of the overall shape. You can hear him do some of this on A Winged Victory for the Sullen, making new sounds out of many sub-sounds, but he also lets certain individual tones take over. It creates small, noticeable details in otherwise large, fairly monolithic compositions.\nO'Halloran is a synesthete, and I wonder what this music looks like to him. Certainly, it has different colors from his own work, though his usual palette is present. He's used to the repetitive harmonic structures favored by Wiltzie, but in his own music there is typically more movement. When his music includes more than piano, he's usually chosen those instruments for their unique timbres. Here, he's giving a bit of that away to Wiltzie. The strings-- and even to some extent the piano-- move in and out of focus. The duo did some of the principle recording at Berlin's Grunewald Church and overdubbed some of the strings in East Germany's old state radio studios, so some of this blurring and refocusing can be attributed to acoustic spaces in which the recordings were made-- like Wiltzie's other duo, A Winged Victory creates all these otherworldly sounds using only traditional instruments.\nThe band was named in reference to a Greek statue in the Louvre called &quot;Winged Victory of Samothrace,&quot; a long-beheaded depiction of Nike, the winged goddess of victory, found on the Greek island of Samothrace. It portrays the striding, triumphant figure, an image of arrested motion that ties nicely to this record: A Winged Victory's music, more active than drone and thicker than minimalism, captures movement and freezes it.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:e8140a49d08e12f5acb2928c72e8f166bb0bc779","amp;dn":"A+Winged+Victory+for+the+Sullen+-+A+Winged+Victory+For+The+Sulle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8140a49d08e12f5acb2928c72e8f166bb0bc779","infoHashBuffer":{"type":"Buffer","data":[232,20,10,73,208,142,18,245,172,178,146,140,114,232,241,102,187,11,199,121]},"announce":[],"urlList":[]}}