{"title":"The Basics of Information Security, 2E (Syngress) [PDF] [StormRG","uid":10643057,"size":2883978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9068eaf8596aaf752ce3a4c631378b4ff14fcf8&amp;dn=The+Basics+of+Information+Security%2C+2E+%28Syngress%29+%5BPDF%5D+%5BStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"steelballz","files":-1,"time":1406503550,"description":"Description\nBasics of Information Security, The, Second Edition\nAuthor:Andress, Jason\nPublisher and Published Date:Syngress; 2 edition (June 9 2014)\nISBN-10:0128007443\nISBN-13:9780128007440\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nAs part of the Syngress Basics series, The Basics of Information Security provides you with fundamental knowledge of information security in both theoretical and practical aspects. Author Jason Andress gives you the basic knowledge needed to understand the key concepts of confidentiality, integrity, and availability, and then dives into practical applications of these ideas in the areas of operational, physical, network, application, and operating system security.\n\nThe Basics of Information Security gives you clear-non-technical explanations of how infosec works and how to apply these principles whether you're in the IT field or want to understand how it affects your career and business. The new Second Edition has been updated for the latest trends and threats, including new material on many infosec subjects.\n\nLearn about information security without wading through a huge textbook\nCovers both theoretical and practical aspects of information security\nProvides a broad view of the information security field in a concise manner\nAll-new Second Edition updated for the latest information security trends and threats, including material on incident response, social engineering, security awareness, risk management, and legal/regulatory issues\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:e9068eaf8596aaf752ce3a4c631378b4ff14fcf8","amp;dn":"The+Basics+of+Information+Security%2C+2E+%28Syngress%29+%5BPDF%5D+%5BStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9068eaf8596aaf752ce3a4c631378b4ff14fcf8","infoHashBuffer":{"type":"Buffer","data":[233,6,142,175,133,150,170,247,82,206,58,76,99,19,120,180,255,20,252,248]},"announce":[],"urlList":[]}}