{"title":"Bajrangi.Bhaijaan.(2015)-BD.Rip-720p-HEVC-x265.AAC.Esubs-DDR","uid":12518269,"size":3219787414,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e9408f1724a64ea44cef955324703e163017eac0&amp;dn=Bajrangi.Bhaijaan.%282015%29-BD.Rip-720p-HEVC-x265.AAC.Esubs-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"SaM","files":1,"time":1443799419,"description":"DDR Presents\r\n\r\nA DDR EXCLUSIVE\r\n\r\n\r\nBajrangi.Bhaijan (2015)\r\n(A film by Kabir Khan)\r\n\r\nHindi - BD.Rip - 1280x544 (720p) (2.35:1)- 3.0 GB- x.265.AC3 (5.1 Ch) - 2 Hrs:33 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n  \nhttp://extraimago.com/image/hMR  \nhttp://extraimago.com/image/hMh  \nhttp://extraimago.com/image/hMQ  \nhttp://extraimago.com/image/hMl  \nhttp://extraimago.com/image/hMb  \nhttp://extraimago.com/image/hMd  \nhttp://extraimago.com/image/hMi  \nhttp://extraimago.com/image/hMI  \nhttp://extraimago.com/image/hMm  \nhttp://extraimago.com/image/hM3  \nhttp://extraimago.com/image/hM9\r\n\r\n Tech Specifications: \r\n  \nhttp://extraimago.com/image/hzC\r\n\r\nSynopsis:\r\nPawan Kumar Chaturvedi a.k.a Bajrangi (Salman Khan), comes across a little girl, who cannot speak and is lost. He befriends her, Calls her Munni (Harshaali Malhotra) and virtually adopts her, thinking she is a Hindu and a Brahmin. Later he finds out, through a series of incidents, that She is a Muslim and a Pakistani at that. He decides to restore her to her parents. He has no Passport, no visa and no contacts, only his faith and his love for Munni. He crosses over to Pakistan illegally.\r\n\r\nIn Pakistan he is befriended by a journalist, Chand Nawab (Nawazuddin Siddiqui), who believes his tale. This unlikely trio now faces danger and many adventures as Bajrangi is labelled an Indian Spy. What they do next is the story of Bajrangi Bhaijaan.\r\n\r\nComments:\r\nIt is an unusual theme - restoring a lost child to her parents across a hostile border and perhaps it is the pent up goodwill among the peoples of the two countries that made this film the superhit it became. The other reason was probably Harshaali Malhotra, with her dimpled cheeks and winning ways. She effortlessly wins your heart, not just that of Bajrangi Bhaijaan. Fortunately, we don't meet such little girls everyday, or a continuous cross-border traffic would emerge!\r\n\r\nSalman Khan is his usual self. Part heroic, part naive and with an unalloyed golden heart. The role is written with him in mind and he hams his way through. Nawazuddin Siddiqui is outstanding as the Pakistani journalist. Kareena Kapoor has little to do except look pretty, which she manages to be in occasional scenes.\r\n\r\nYet, despite the crazy tale, the Director makes the film almost believable, thanks to a very taut screenplay. Remember, this film goes on for about 2½ hours. It repeatedly touches your heartstrings with some incidents that are commonplace but seeks to show that people are the same everywhere.\r\n\r\nMusic adds to the film, despite the accusations of copyright violation. Editing is excellent and so is camera work.\r\n\r\nIts not a film for rational thought. Its really a fairy tale, but everyone of us is a little child inside and everyone loves a good fairy tale!\r\n\r\n\r\nUploader's Notes:\r\nThis is the first HEVC rip from the Blu-Ray of Bajrangi Bhaijan and we at DDR are proud to bring it to you. The Blu-Ray original was unfortunately of very poor quality, with considerable color bleeding. I have rarely come across a Blu-Ray which had so much of detail masked by some very poor authoring mainly a failure to correct luma levels. The chroma was off too, with the reds being overemphasized, leading to a pinkish hue.\r\n\r\nWe have corrected the BD for luma and enhanced detail, thus bringing out greater depth in the visuals. The detail has been enhanced to the extent that the video almost looks remastered. The banding and excess blocking in the original video was also reduced through this encoding. Please check the sample which is from a dark scene to get an idea of what we are saying.\r\n\r\nI have used the original 5.1 Channel AC3 sound, adjusted for delays and synchronisation. If anybody wants the full DTS, please ask and we will provide that as well.\r\n\r\nThis is a 10-bit HEVC encoding. This encoding and its higher compressibility has also allowed me to reduce the file size to just 3GB even though the visual quality would be equivalent to a 5-6 Gb X264 rip. On the flip side, Please note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link:  \nhttp://www.imdb.com/title/tt3863552/\r\nSample (2 minutes): Download from here","torrent":{"xt":"urn:btih:e9408f1724a64ea44cef955324703e163017eac0","amp;dn":"Bajrangi.Bhaijaan.%282015%29-BD.Rip-720p-HEVC-x265.AAC.Esubs-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9408f1724a64ea44cef955324703e163017eac0","infoHashBuffer":{"type":"Buffer","data":[233,64,143,23,36,166,78,164,76,239,149,83,36,112,62,22,48,23,234,192]},"announce":[],"urlList":[]}}