{"title":"TransForming Gender: Transgender Practices of Identity, Intimacy","uid":4717960,"size":982156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9c328955b68b104d12412d7e385363f9a68acb8&amp;dn=TransForming+Gender%3A+Transgender+Practices+of+Identity%2C+Intimacy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234375249,"description":"This book is a major contribution to contemporary gender and sexuality studies. At a time when transgender practices are the subject of increasing social and cultural visibility, it marks the first UK study of transgender identity formation. It is also the first examination - anywhere in the world - of transgender practices of intimacy and care. The author addresses changing government legislation concerning the citizenship rights of transgender people. She examines the impact of legislative shifts upon transgender people's identities, intimate relationships and practices of care and considers the implications for future social policy. The book encompasses key approaches from the fields of psychoanalysis, anthropology, lesbian and gay studies, sociology and gender theory. Drawing on extensive interviews with transgender people, &quot;TransForming Gender&quot; offers engaging, moving, and, at times, humorous accounts of the experiences of gender transition. Written in an accessible style, it provides a vivid insight into the diversity of living gender in today's world. The book will be essential reading to students and professionals in cultural studies, gender studies and sexuality studies as well as those in sociology, social policy, law, politics and philosophy. It will also be of interest to health and educational students, trainers and practitioners.","torrent":{"xt":"urn:btih:e9c328955b68b104d12412d7e385363f9a68acb8","amp;dn":"TransForming+Gender%3A+Transgender+Practices+of+Identity%2C+Intimacy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c328955b68b104d12412d7e385363f9a68acb8","infoHashBuffer":{"type":"Buffer","data":[233,195,40,149,91,104,177,4,209,36,18,215,227,133,54,63,154,104,172,184]},"announce":[],"urlList":[]}}