{"title":"The Quiet Hours - City Photographs by Melman Mike (Photography E","uid":8338741,"size":9533050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9dd4862a8f27b55a531ed6aebdc3052a06e5fcc&amp;dn=The+Quiet+Hours+-+City+Photographs+by+Melman+Mike+%28Photography+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1365034349,"description":"The Quiet Hours: City Photographs by Mike Melman (Repost)\nUniv Of Minnesota Press | English | 2003 | ISBN: 0816643288 | 94 pages | PDF | 9.09 MB\n\nA milling district along the Mississippi River. A railroad bridge on Washington Avenue. Jim's Hamburgers in Duluth. A spiral staircase in the Schmidt Brewery. These are the spaces that capture the moods of Minnesota's prewar era. These are the everyday places where ordinary people lived and worked. These are the images that show us the remnants of a city's past.\n\nIn The Quiet Hours, Mike Melman records a vanishing era of Minnesota's towns and cities through a series of seventy black-and-white photographs taken from 1985 to 2002. Working in the half-light of predawn hours, Melman brings a new perspective to familiar places, one shaped by his training as an architect and his particular affinity for old buildings. Melman's atmospheric photographs give us insight into the bygone life of a city where we had not thought to look for one before.\n\nIn his essay, Bill Holm compares Melman's work to that of Walt Whitman and Carl Sandburg, artists who embrace and celebrate the urban experience. Holm writes, &quot;These photographs take us a long way toward an understanding of that mighty heart of a city. . . . These are very American pictures in their stubbornness, their integrity, and their dogged affection for the working-class life buried inside them.&quot;\n\nThrough his artistic and historic images, Melman exposes the speed at which American cities change and presents a gritty yet contemplative portrait of urban Minnesota.\n\nMike Melman's photographs have been exhibited in numerous galleries and museums in the Twin Cities and have appeared in Architecture Minnesota and Minnesota History.\n\nBill Holm is a poet and essayist living in Minneota, Minnesota. Among his recent books are Eccentric Islands: Travels Real and Imaginary (2000) and The Heart Can Be Filled Anywhere on Earth: Minneota, Minnesota (1996).","torrent":{"xt":"urn:btih:e9dd4862a8f27b55a531ed6aebdc3052a06e5fcc","amp;dn":"The+Quiet+Hours+-+City+Photographs+by+Melman+Mike+%28Photography+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9dd4862a8f27b55a531ed6aebdc3052a06e5fcc","infoHashBuffer":{"type":"Buffer","data":[233,221,72,98,168,242,123,85,165,49,237,106,235,220,48,82,160,110,95,204]},"announce":[],"urlList":[]}}