{"title":"Real.Housewives.of.Melbourne.s01e01.PDTV.x264.Hector.mp4","uid":9654649,"size":360769332,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea1d397b5b166e51d587e7ba01e35c24fc40424a&amp;dn=Real.Housewives.of.Melbourne.s01e01.PDTV.x264.Hector.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GaryBradbury2012","files":-1,"time":1393163967,"description":"Beautiful designer Lydia, the wife of a top architect, is fashionably late meeting friends Andrea and Gina for a catch up. Gina's a successful barrister, whose long term partner recently relocated to the States. Andrea's the owner of the Toorak based skin center Liberty Belle and the wife of plastic surgeon Dr Chris Moss. Andrea invites the girls to an upcoming VIP party at Liberty Belle - among the guests is bubbly Chyka Keebaugh, co-owner of catering and event company The Big Group and wife of her business partner, Bruce. Another guest is the recently single property developer Janet Roach who has just arranged a psychic reading with the new kid in town: Jackie. Jackie's the wife of Silverchair drummer Ben Gillies and they've just relocated to Melbourne from Newcastle. Janet and Jackie immediately hit it off and after her psychic reading, Janet invites Jackie to the Liberty Belle party. So the stage is set for all 6 women to come together for the first time. But as Jackie attempts to break into Melbourne society, she throws a spanner in the works with her unnerving psychic predictions.\n\nIf you see &quot;Hector&quot; on the end of a file it means I capped it.\nEnjoy, Gaz/Hector :)","torrent":{"xt":"urn:btih:ea1d397b5b166e51d587e7ba01e35c24fc40424a","amp;dn":"Real.Housewives.of.Melbourne.s01e01.PDTV.x264.Hector.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea1d397b5b166e51d587e7ba01e35c24fc40424a","infoHashBuffer":{"type":"Buffer","data":[234,29,57,123,91,22,110,81,213,135,231,186,1,227,92,36,252,64,66,74]},"announce":[],"urlList":[]}}