{"title":"School of Phenomenal Memory","uid":6334613,"size":328764224,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ea4b36ab302da5f0f2111732e98921d0eb45b624&amp;dn=School+of+Phenomenal+Memory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"3ljust","files":1,"time":1303416533,"description":" &lt;a href=&quot;http://www.pmemory.com/order/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.pmemory.com/order/&lt;/a&gt;\n\n\n&quot;How Quickly Would Your Life Change If You\nCould Suddenly Learn New Languages Effortlessly,\nMemorize Every Number In Your Phone Book,\nCommand Incredible Focus, And Even Recite\nAn Entire Book Forwards AND Backwards...\nIn As Little As 60 Days From Today... Guaranteed?&quot;\n\nDiscover Why The School Of Phenomenal Memory Is Called\n&quot;The Holy Grail,&quot; &quot;A Godsend For Humanity,&quot;\n&quot;The Next Step In Human Evolution,&quot;\n&quot;An Opportunity For Endless Adventure,&quot; And\n&quot;One Of The Best Lifetime Investments You Can Make&quot;\nBy Individuals Just Like You...\n\nFrom the desk of Ruslan M.\nFounder And Head Instructor\nThe School Of Phenomenal Memory\n\nDear Friend,\n\nImagine how quickly your life would change if you suddenly commanded the same raw, untapped mental power all our graduates now have at their fingertips...\n\nIt's true. After only 60 step-by-step lessons, every one of our graduates can effortlessly memorize:\n\n    * Pages of class notes and study guides\n    * Complex foreign languages with unique alphabets\n    * Address books (all names, numbers, addresses, etc.)\n    * Complete articles, speeches, lectures... word for word\n    * Thousands of detailed facts on any subject\n    * Complicated instruction manuals\n    * Long strings of numbers\n    * And yes, even entire books\n\nThere is no limit to what's possible when you command a phenomenal memory.\n\nAnd in less than 5 minutes from now, you too can begin the journey towards mastering the practical tools needed to perform mental feats that are not only truly stunning, but immediately applicable to your daily life.\n\nThese are tools you will not find anywhere else. Designed from 16 years of rigorous scientific research led by celebrated memnotechnologist Vladimir Kozarenko, our web-based training is revolutionary in the field of memory training.\n\nAnd that's why the results are groundbreaking.\n\nWe've already helped thousands of everyday people like you develop incredible mental power. Now it's your turn. I invite you to...\n\nDiscover The Natural Power Hidden\nUntapped Within Your Own Mind\n\nWould you like to actually experience life as an acknowledged genius?\n\nYou walk around every day not realizing that inside your mind, you possess a supercomputer more powerful than any man-made supercomputer in existence. There is absolutely no limit to how much information you can store.\n\nIt might be easier to understand if you compare your brain to Google's search engine. Google's computers download literally millions of web-pages each day. And all of that data is indexed in incredibly intelligent and functional ways.\n\nAs a result, you can use Google to retrieve search results in a fraction of a second.\n\nBut your mind naturally has the capacity to take it one step farther...\n\nYou don't have to look at the &quot;search results...&quot; You can go straight to the information you're looking for!\n\nAnd the best part is that anybody can learn how to access their untapped &quot;supercomputer:&quot;\n\n    *\n\n      You don't have to be &quot;smart&quot; or have a high IQ\n    *\n\n      You don't have to be certain age (our students range from 14 year-olds all the way to 84 year-olds (and beyond).\n    *\n\n      And it doesn't matter if you think you have a poor memory, a learning disability, or even Attention Deficit Disorder (actually, we're well known for &quot;curing&quot; people with ADD).\n\nBut as you might or might not know, memory training is nothing new. Tens of thousands of people become obsessed with the possibilities and devour every book,CD, course, pill, game, software or conference they can find.\n\n\n.____                           .____    .__              \n|    |    ____   ____    ____   |    |   |__|__  __ ____  \n|    |   /  _ \\ /    \\  / ___\\  |    |   |  \\  \\/ // __ \\ \n|    |__(  &lt;_&gt; )   |  \\/ /_/  &gt; |    |___|  |\\   /\\  ___/ \n|_______ \\____/|___|  /\\___  /  |_______ \\__| \\_/  \\___  &gt;\n        \\/          \\//_____/           \\/             \\/ \n_______________________________ \n\\__    ___/\\______   \\______   \\\n  |    |    |     ___/|    |  _/\n  |    |    |    |    |    |   \\\n  |____|    |____|    |______  /\n                             \\/ \n","torrent":{"xt":"urn:btih:ea4b36ab302da5f0f2111732e98921d0eb45b624","amp;dn":"School+of+Phenomenal+Memory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea4b36ab302da5f0f2111732e98921d0eb45b624","infoHashBuffer":{"type":"Buffer","data":[234,75,54,171,48,45,165,240,242,17,23,50,233,137,33,208,235,69,182,36]},"announce":[],"urlList":[]}}