{"title":"Chic &amp; Produced by Chic - Discography 1977-1992+","uid":4985752,"size":3275931782,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb19d4fca13a11f829a20f3399f9e84acb554caf&amp;dn=Chic+%26+Produced+by+Chic+-+Discography+1977-1992%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"musicalibera","files":523,"time":1246672589,"description":"CHIC &amp; PRODUCED BY CHIC - Discography 1977-1992+\n================================================\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTag types: ID3V1 &amp; ID3V2.\nSource formats: CD, 3 trks vinyl (unreleased on CD)*\nTotal number of tracks: 266.\nPlaylists: original studio albums + main compilations.\n\nAllmusic biography:\n\n&quot;There can be little argument that Chic was disco's greatest band; and, working in a heavily producer-dominated field, they were most definitely a band. By the time Chic appeared in the late '70s, disco was already slipping into the excess that eventually caused its downfall. Chic bucked the trend by stripping disco's sound down to its basic elements; their funky, stylish grooves had an organic sense of interplay that was missing from many of their overproduced competitors. Chic's sound was anchored by the scratchy, James Brown-style rhythm guitar of Nile Rodgers and the indelible, widely imitated (sometimes outright stolen) bass lines of Bernard Edwards; as producers, they used keyboard and string embellishments economically, which kept the emphasis on rhythm. Chic's distinctive approach not only resulted in some of the finest dance singles of their time, but also helped create a template for urban funk, dance-pop, and even hip-hop in the post-disco era. Not coincidentally, Rodgers and Edwards wound up as two of the most successful producers of the '80s.\n\nRodgers and Edwards first met in 1970, when both were jazz-trained musicians fresh out of high school. Edwards had attended New York's High School for the Performing Arts and was working in a Bronx post office at the time, while Rodgers' early career also included stints in the folk group New World Rising and the Apollo Theater house orchestra. Around 1972, Rodgers and Edwards formed a jazz-rock fusion group called the Big Apple Band. This outfit moonlighted as a backup band, touring behind smooth soul vocal group New York City in the wake of their 1973 hit &quot;I'm Doin' Fine Now.&quot; After New York City broke up, the Big Apple Band hit the road with Carol Douglas for a few months, and Rodgers and Edwards decided to make a go of it on their own toward the end of 1976. At first they switched their aspirations from fusion to new wave, briefly performing as Allah &amp; the Knife Wielding Punks, but quickly settled into dance music. They enlisted onetime LaBelle drummer Tony Thompson and female vocalists Norma Jean Wright and Alfa Anderson, and changed their name to Chic in summer 1977 so as to avoid confusion with Walter Murphy &amp; the Big Apple Band (who'd just hit big with &quot;A Fifth of Beethoven&quot;).\n\nAugmented in the studio by keyboardists Raymond Jones and Rob Sabino, Chic recorded the demo single &quot;Dance, Dance, Dance (Yowsah, Yowsah, Yowsah)&quot; and shopped it around to several major record companies, all of which declined it. The small Buddah label finally released it as a 12&quot; in late 1977, and as its club popularity exploded, Atlantic stepped in, signed the group, and re-released the single on a wider basis. &quot;Dance, Dance, Dance&quot; hit the Top Ten, peaking at number six, and made Chic one of the hottest new groups in disco. Chic scrambled to put together their self-titled first album, which spawned a minor follow-up hit, &quot;Everybody Dance,&quot; in early 1978. At this point, Wright left to try her hand at a solo career (with assistance from Rodgers and Edwards), and was replaced by Luci Martin. It was a good time to come onboard; &quot;Le Freak,&quot; the first single from sophomore album C'est Chic, was an out-of-the-box smash, spending five weeks on top of the charts toward the end of 1978 and selling over four-million copies (which made it the biggest-selling single in Atlantic's history). Follow-up &quot;I Want Your Love&quot; reached number seven, cementing the group's new star status, and C'est Chic became one of the rare disco albums to go platinum.\n\n1979's RisquÃƒÂ© was another solidly constructed LP that also went platinum, partly on the strength of Chic's second number one pop hit, &quot;Good Times.&quot; &quot;Good Times&quot; may not have equaled the blockbuster sales figures of &quot;Le Freak,&quot; but it was the band's most imitated track: Queen's number one hit &quot;Another One Bites the Dust&quot; was a clear rewrite, and the Sugarhill Gang lifted the instrumental backing track wholesale for the first commercial rap single, &quot;Rapper's Delight,&quot; marking the first of many times that Chic grooves would be recycled into hip-hop records. Also in 1979, Rodgers and Edwards took on their first major outside production assignment, producing and writing the Sister Sledge smashes &quot;We Are Family&quot; and the oft-sampled &quot;He's the Greatest Dancer.&quot; This success, in turn, landed them the chance to work with Diana Ross on 1980's Diana album, and they wrote and produced &quot;Upside Down,&quot; her first number one hit in years, as well as &quot;I'm Coming Out.&quot;\n\nThe disco fad was fading rapidly by that point, however, and 1980's Real People failed to go gold despite another solid performance by the band. Changing tastes put an end to Chic's heyday, as Rodgers and Edwards' outside production work soon grew far more lucrative, even despite aborted projects with Aretha Franklin and Johnny Mathis. Several more Chic LPs followed in the early '80s, with diminishing creative and commercial returns, and Rodgers and Edwards disbanded the group after completing the lackluster Believer in 1983. Later that year, both recorded solo LPs that sank without a trace. Hungry for acceptance and respect in the rock mainstream (especially after accusations that they had ripped off Queen instead of the other way around), both Rodgers and Edwards sought out high-profile production and session work over the rest of the decade. Rodgers produced blockbuster albums like David Bowie's Let's Dance, Madonna's Like a Virgin, and Mick Jagger's She's the Boss. Edwards wasn't as prolific as a producer, but did join the one-off supergroup the Power Station along with Tony Thompson as well as Robert Palmer and members of avowed Chic fans Duran Duran; he later produced Palmer's commercial breakthrough, Riptide. Edwards also worked with Rod Stewart (Out of Order), Jody Watley, and Tina Turner, while Rodgers' other credits include the Thompson Twins, the Vaughan Brothers, INXS, and the B-52's' comeback Cosmic Thing.\n\nRodgers and Edwards re-formed Chic in 1992 with new vocalists Sylver Logan Sharp and Jenn Thomas, and an assortment of session drummers in Thompson's place; they toured and released a new album, Chic-ism. In 1996, the reconstituted Chic embarked on a tour of Japan; sadly, on April 18, Edwards passed away in his Tokyo hotel room due to a severe bout of pneumonia. Rodgers continued to tour occasionally with a version of Chic, and, in 1999, his Sumthing Else label issued a recording of Edwards' final performance with the band, Live at the Budokan.&quot; \n\n\n\nTRACK LIST:\n \nCHIC: Chic (1977)\n=================\n01. Dance, Dance, Dance (Yowsah, Yowsah, Yowsah)\n02. SÃƒÂ£o Paulo\n03. You Can Get By\n04. Everybody Dance\n05. Est-ce que c'est chic?\n06. Falling In Love With You\n07. Strike Up The Band\n+\n09. Dance, Dance, Dance (Yowsah, Yowsah, Yowsah) (7&quot; Version), 10. Everybody Dance (7&quot; Version), 11. Everybody Dance (Alternate 7&quot; Version), 12. Everybody Dance (12&quot; Version), 13. Dance, Dance, Dance (Yowsah, Yowsah, Yowsah) (Pal Joey Mix), 14. Everybody Dance (Glenn Friscia Hardhouse Mix), 15. Everybody Dance (Motiva RPL Mix), 16. Strike Up The Band (Hifana Copa Mix).\n\nNORMA JEAN (WRIGHT): Norma Jean (1978)\n======================================\n01. Saturday\n02. Having A Party\n03. I Believe In You\n04. Sorcerer\n05. So I Get Hurt\n06. This Is The Love\n07. I Like Love\n+\n08. Hold Me Lonely Boy, 09. High Society (12&quot; Mix), 10. Saturday (Single Mix), 11. Sorcerer (12&quot; Mix), 12. Having A Party (Extended Mix), 13. High Society (Single Mix)\n\n\nCHIC: C'est Chic (1978)\n=======================\n01. Chic Cheer\n02. Le Freak\n03. Savoir Faire\n04. Happy Man\n05. I Want Your Love\n06. At Last I Am Free\n07. Sometimes You Win\n08. (Funny) Bone\n+\n09. Le Freak (7&quot; Version), 10. I Want Your Love (7&quot; Version), 11. Chic Cheer (1984 Remix), 12. Jack Le Freak (7&quot; Version), 13. Jack Le Freak (12&quot; Version), 14. I Want Your Love (Stonebridge Remix), 15. Chic Cheer (Silent Propaganda Remix), 16. Le Freak (FPM's Feel The Rhythm Mix), 17. I Want Your Love (Kreva's CDJ-1000 Remix), 18. Le Mix C'est Freak (Radio Edit Mix), 19. Le Mix C'est Freak\n\n\nSISTER SLEDGE: We Are Family (1979)\n===================================\n01. He's The Greatest Dancer\n02. Lost In Music\n03. Somebody Loves Me\n04. Thinking Of You\n05. We Are Family\n06. Easier To Love\n07. You're A Friend To Me\n08. One More Time\n+\n09. We Are Family (7&quot; Version), 10. He's The Greatest Dancer (7&quot; Version), 11. He's The Greatest Dancer (Alternate 7&quot; Version), 12. Lost In Music (7&quot; Version), 13. We Are Family (Bernard Edwards Radio Remix), 14. We Are Family (Sure Is Pure Remix Edit), 15. We Are Family (Sure Is Pure Remix), 16. We Are Family (Steve Anderson DMC Remix), 17. We Are Family (Marley's Tribute To Larry Levan Mix), 18. We Are Family (Daz-I-Kue Remix), 19. He's The Greatest Dancer (Brutal Bill Remix), 20. Lost In Music (Nile Rodgers Remix), 21. Lost In Music (Nile Rodgers 12&quot; Remix), 22. Lost In Music (Sure Is Pure Remix Edit), 23. Lost In Music (Sure Is Pure Remix), 24. Lost In Music (Philip Kelsey DMC Remix), 25. Thinking Of You (Ramp Radio Remix), 26. Thkning Of You (Ramp Club Mix), 27. Thinking Of You (Original Re-Touch), 28. Thinking Of You (Ramp Hard Remix), 29. Thinking Of You (Conversion Mix).\n\n\nCHIC: RisquÃƒÂ© (1979)\n===================\n01. Good Times\n02. A Warm Summer Night\n03. My Feet Keep Dancing\n04. My Forbidden Lover\n05. Can't Stand To Love You\n06. Will You Cry (When You Hear This Song)\n07. What About Me\n+\n08. Good Times (7&quot; Version), 09. Good Times (Alternate 7&quot; Version), 10. My Feet Keep Dancing (7&quot; Version), 11. My Forbidden Lover (7&quot; Version), 12. My Forbidden Lover (12&quot; Version)*, 13. Good Times (A Touch Of Jazz Remix), 14. Good Times (A Touch Of Jazz Original Mix With Cuts), 15. Good Times (Stonebridge Club Mix), 16. My Feet Keep Dancing (Cool Feet Remix), 17. Good Times (DJ Hasabe Remix), 18. Good Times (Captain Funk Movin' Mix), 19. A Warm Summer Night (King Britt Remix)\n\nCHIC: Les Plus Grands SuccÃƒÂ¨s De Chic - Chic's Greatest Hits (1979)\n==================================================================\n01. Le Freak (7&quot; Version)\n02. I Want Your Love (7&quot; Version)\n03. Dance, Dance, Dance (Yowsah, Yowsah, Yowsah) (7&quot; Version)\n04. Everybody Dance (12&quot; Version)\n05. Chic Cheer\n06. Good Times\n07. My Feet Keep Dancing\n\n\nSHEILA &amp; B. DEVOTION: King Of The World (1980)\n==============================================\n01. Spacer\n02. Mayday\n03. Charge Plates And Credit Cards\n04. Misery\n05. King Of The World\n06. Cover Girls\n07. Your Love Is Good\n08. Don't Go\n+\n09. King Of The World (7&quot; Version), 10. King Of The World (Alternate 7&quot; Version), 11. Your Love Is Good (Original US 7&quot; Promo Version), 12. Your Love Is Good (Original US 12&quot; Promo Version), 13. US Radio Commercial For Spacer, 14. Spacer (7&quot; Version), 15. Spacer (Alternate 7&quot; Version #1), 16. Spacer (Alternate 7&quot; Version #2), Spacer (12&quot; Version), 17. Spacer (1992 Remix Radio Edit), 18. Spacer (Down To Earth Mix) 19. Spacer (Lost In Space Mix), 20. Spacer (Lost In Space Dub), 21. Spacer  (DMC Remix), 22. Spacer (Instrumental Demo, 1980), 23. Spacer (The Freak Out Remix - Respect To Chic). \n\n\nCHIC: Real People (1980)\n========================\n01. Open Up\n02. Real People\n03. I Loved You More\n04. I Got Protection\n05. Rebels Are We\n06. 26\n07. Chip Off The Old Block\n08. You Can't Do It Alone\n+\n09. Rebels Are We (7&quot; Version), 10. Real People (7&quot; Version)\n\n\nDIANA ROSS: Diana (1980)\n========================\n01. Upside Down\n02. Tenderness\n03. Friend To Friend\n04. I'm Coming Out\n05. Have Fun (Again)\n06. My Old Piano\n07. Now That You're Gone\n08. Give Up\n+\n09. Upside Down (7&quot; Version), 10. I'm Coming Out (7&quot; Version), 11. Upside Down (Unreleased Chic Mix), 12. Tenderness (Unreleased Chic Mix), 13. Friend To Friend (Unreleased Chic Mix), 14. I'm Coming Out (Unreleased Chic Mix), 15. Have Fun (Again) (Unreleased Chic Mix), 16. My Old Piano (Unreleased Chic Mix), 17. Now That You're Gone (Unreleased Chic Mix), 18. Give Up (Unreleased Chic Mix), 19. Upside Down (Satoshi Tomiie &amp; David Morales Mix), 20. I'm Coming Out (Maurice Joshua Remix). 21. Upside Down (Instrumental), 22. I'm Coming Out (Instrumental).\n\n\nSISTER SLEDGE: Love Somebody Today (1980)\n=========================================\n01. Got To Love Somebody\n02. You Fooled Around\n03. I'm A Good Girl\n04. Easy Street\n05. Reach Your Peak\n06. Pretty Baby\n07. How To Love\n08. Let's Go On Vacation\n+\n09. Got To Love Somebody (7&quot; Version), 10. Reach Your Peak (7&quot; Version), 11. Let's Go On Vacation (7&quot; Version).\n\n\nDEBBIE HARRY: Koo Koo (1981)\n============================\n01. Jump Jump\n02. The Jam Was Moving\n03. Chrome\n04. Surrender\n05. Inner City Spilover\n06. Backfired\n07. Now I Know You Know\n08. Under Arrest\n09. Military Rap\n10. Oasis\n+\n11. The Jam Was Moving (Debbie Harry &amp; Chris Stein Remix), 12. The Jam Was Moving (12&quot; Version), 13. Backfired (7&quot; Version), 14. Backfired (12&quot; Version), 15. Backfired (Forest &amp; Heller Remix).\n\n\nCHIC: Take It Off (1981)\n========================\n01. Stage Fright\n02. Burn Hard\n03. So Fine\n04. Flash Back\n05. Telling Lies\n06. Your Love Is Cancelled\n07. Would You Be My Baby\n08. Take It Off\n09. Just Out Of Reach\n10. Baby Doll\n+\n11. Stage Fright (7&quot; Version), 12. Burn Hard (7&quot; Version).\n\n\nO.S.T.: Soup For One (1982)\n===========================\n01. Chic: Soup For One\n02. Carly Simon: Why\n03. Teddy Pendergrass: Dream Girl*\n04. Fonzi Thornton: I Work For A Livin'*\n05. Chic: I Want Your Love\n06. Sister Sledge: Let's Go On Vacation\n07. Chic: Tavern On The Green\n08. Debbie Harry: Jump Jump\n+ \n09. Chic: Burn Hard, 10. Chic: Open Up, 11. Chic: Soup For One (7&quot; Version), 12. Chic: Soup For One (12&quot; Version), 13. Chic: Soup For One (WOG Remix).14. Carly Simon: Why (7&quot; Version), 15. Carly Simon: Why (12&quot; Version)*\n\n\nCHIC: Tongue In Chic (1982)\n===========================\n01. Hangin'\n02. I Feel Your Love Comin' On\n03. When You Love Someone\n04. Chic (Everybody Say)\n05. Hey Fool\n06. Sharing Love\n07. City Lights\n+\n08. Hangin' (7&quot; Version), 09. I Feel Your Love Comin' On (7&quot; Version)\n\n\nCHIC: Believer (1983)\n=====================\n01. Believer\n02. You Are Beautiful\n03. Take A Closer Look\n04. Give Me The Lovin'\n05. Show Me Your Light\n06. You Got Some Love For Me\n07. In Love With Music\n08. Party Everybody\n+\n09. Give Me The Lovin' (7&quot; Version), 10. Party Everybody (7&quot; Version), 11. Megachic Megamix.\n\n\nCHIC: Chic-Ism (1992)\n=====================\n01. Chic Mystique\n02. Your Love\n03. Jusagroove\n04. Something You Can Feel\n05. One And Only One\n06. Doin' That Thing To Me\n07. Chicism\n08. In It To Win It\n09. My Love's For Real\n10. Take My Love\n11. High\n12. M.M.F.T.C.F.\n13. Chic Mystique (Reprise)\n+\n14. Chic Mystique (Single Version), 15. Chic Mystique (Club Mix), 16. Chic Mystique (Brothers In Rhythm Mix), 17. Chic Mystique (Lovely Club Mix), 18. Chic Mystique (4 A.M. Mix), 19. Chic Mystique (12&quot; Remix Extended Album Version), 20. Chic Mystique (Taramasalta &amp; Jam Dub), 21. Chic Mystique (Club Dub), 22. Chic Mystique (Lovely Radio Edit), 23. Chic Mystique (Bonus Accapella), 24. Your Love (Album Edit), 25. Your Love (12&quot; Remix), 26. Your Love (Hank's Mix), 27. Your Love (Extended Album Version), 28. Your Love (Remix Instrumental)\n\n\nEnjoy - and thanks in advance for seeding.","torrent":{"xt":"urn:btih:eb19d4fca13a11f829a20f3399f9e84acb554caf","amp;dn":"Chic+%26+Produced+by+Chic+-+Discography+1977-1992%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb19d4fca13a11f829a20f3399f9e84acb554caf","infoHashBuffer":{"type":"Buffer","data":[235,25,212,252,161,58,17,248,41,162,15,51,153,249,232,74,203,85,76,175]},"announce":[],"urlList":[]}}