{"title":"Autodesk Sketchbook Pro (2011) + Key ","uid":6079557,"size":133780003,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec187dda3b9869a65e5b19620f196e9ce6207c51&amp;dn=Autodesk+Sketchbook+Pro+%282011%29+%2B+Key+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"webchella","files":8,"time":1294049616,"description":"Autodesk Sketchbook Pro (2011) + Key \n &lt;a href=&quot;\nhttp://usa.autodesk.com/adsk/servlet/pc/index?siteID=123112&amp;id=6848332&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://usa.autodesk.com/adsk/servlet/pc/index?siteID=123112&amp;id=6848332&lt;/a&gt; &lt;a href=&quot;\nhttp://www.autodesk.es/adsk/servlet/home?siteID=455755&amp;id=458320&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.autodesk.es/adsk/servlet/home?siteID=455755&amp;id=458320&lt;/a&gt;\n\n===========\n::English::\n===========\nLanguage: Multi, English\nPlatform: Windows All\nTreatment: Complete\nDeveloper: usa.autodesk.com\n\nAutodesk SketchBook Pro 2011 - a program that offers advanced tools of conceptual drawing for designers and artists, regardless of the industry in which they operate. Designed specifically for the Tablet PC and Tablet PC, Autodesk SketchBook Pro 2011 provides all the tools necessary for the transition from pen and paper to a digital environment.\n\nThe program allows the user to create and save your own brushes, erasers, airbrushes, etc. These properties of brushes, such as size, transparency, roundness, slant and spacing of brush strokes are adjusted individually. In addition, as a form of brush strokes, you can specify any image, in which case the motion of the brush is put custom textures. The program interface is easy to learn, and those who have already mastered it can operate at high speed and maximum efficiency. Customizable menus provide easy access to key functions - for example, set the color and the choice of brushes. The canvas, which is drawing, you can resize, move and rotate. The program can generate from the user touches the straight lines and ellipses. Tools to specify the size of the brush is always at hand - to open the editor of brushes is not necessary. You can expand the capabilities of traditional painting, creating custom brushes to add texture.\n\nAdditional Information:\nKey features:\nSupport the format of PSD (compatibility with Adobe Photoshop)\nInteraction with other means of graphic design\nBuilt-in ability to send electronic messages\nAbility to make notes and add comments\nCreating custom brushes to paint\nEasy to understand and explore the interface\n\nUsing the program:\nAdding notes and review\nStoryboard\nDesign development\nImage Search\nCreation of illustrations\nDeveloping the concept of products\n\nSystem requirements:\n* 800 MHz processor\n* 256 MB of RAM\n* Graphics card capable of 1,024 x 768 display\n* Pressure-sensitive tablet and pen recommended for optimal experience.\n\n===========\n::Spanish::\n===========\nIdioma: Multilenguaje\nPlataforma: Windows Todos\nTratamiento: Completa\nDesarrollador: usa.autodesk.com\n\nAutodesk SketchBook Pro 2011 - un programa que ofrece herramientas avanzadas de dibujo conceptual para diseÃƒÂ±adores y artistas, independientemente del sector en el que operan. DiseÃƒÂ±ado especÃƒÂ­ficamente para el Tablet PC y Tablet PC, Autodesk SketchBook Pro 2011 ofrece todas las herramientas necesarias para la transiciÃƒÂ³n de la pluma y el papel a un entorno digital.\n\nEl programa permite al usuario crear y guardar sus propios pinceles, gomas de borrar, aerÃƒÂ³grafos, etc Estas propiedades de los pinceles, tales como el tamaÃƒÂ±o, la transparencia, la redondez, la inclinaciÃƒÂ³n y el espaciamiento de los trazos de pincel se ajustan individualmente. AdemÃƒÂ¡s, como una forma de pinceladas, puede especificar cualquier imagen, en cuyo caso el movimiento del cepillo se coloca texturas personalizadas. La interfaz del programa es fÃƒÂ¡cil de aprender, y los que ya han dominado, puede funcionar a alta velocidad y mÃƒÂ¡xima eficiencia. menÃƒÂºs personalizables proporcionan acceso fÃƒÂ¡cil a las funciones clave - por ejemplo, ajustar el color y la elecciÃƒÂ³n de los pinceles. El lienzo, que es el dibujo, puede cambiar el tamaÃƒÂ±o, mover y girar. El programa puede generar a partir de que el usuario toca las lÃƒÂ­neas rectas y elipses. Herramientas para especificar el tamaÃƒÂ±o de la brocha estÃƒÂ¡ siempre a mano - para abrir el editor de pinceles no es necesario. Puede ampliar las capacidades de la pintura tradicional, la creaciÃƒÂ³n de pinceles personalizados para agregar textura.\n\nInformaciÃƒÂ³n adicional:\nCaracterÃƒÂ­sticas principales:\nCompatible con el formato de PSD (compatibilidad con Adobe Photoshop)\nInteracciÃƒÂ³n con otros medios de diseÃƒÂ±o grÃƒÂ¡fico\nConstruido en capacidad de enviar mensajes electrÃƒÂ³nicos\nCapacidad para tomar notas y aÃƒÂ±adir comentarios\nCreaciÃƒÂ³n de pinceles personalizados para pintar\nFÃƒÂ¡cil de entender y explorar la interfaz\n\nUtilizando el programa:\nAÃƒÂ±adir notas y revisiÃƒÂ³n\nStoryboard\nDiseÃƒÂ±o de desarrollo\nBÃƒÂºsqueda de imÃƒÂ¡genes\nCreaciÃƒÂ³n de ilustraciones\nDesarrollo del concepto de productos\n\nRequisitos del sistema:\n* Procesador a 800 MHz\n* 256 MB de RAM\n* GrÃƒÂ¡ficos con una capacidad de 1.024 x 768 tarjeta de\n* Tableta sensible a la presiÃƒÂ³n y la pluma se recomienda para una experiencia ÃƒÂ³ptima.","torrent":{"xt":"urn:btih:ec187dda3b9869a65e5b19620f196e9ce6207c51","amp;dn":"Autodesk+Sketchbook+Pro+%282011%29+%2B+Key+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec187dda3b9869a65e5b19620f196e9ce6207c51","infoHashBuffer":{"type":"Buffer","data":[236,24,125,218,59,152,105,166,94,91,25,98,15,25,110,156,230,32,124,81]},"announce":[],"urlList":[]}}