{"title":"Dr_Syntax-Self_Taught-Advance-2007-R3D","uid":4202891,"size":55976289,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ec31d44db58fd1780133e2d4ad484e393deb4c52&amp;dn=Dr_Syntax-Self_Taught-Advance-2007-R3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ltgig","files":19,"time":1211601438,"description":"Dr Syntax - &amp;#039;Self Taught&amp;#039; (Beer &amp; Rap)\n \nReleased 28th May 2007 \n\n\n\nAfter numerous guest appearances on tracks by notable hip hop artists in the UK, and having built up an ever growing and enthusiastic fanbase, one of Brighton&amp;#039;s number one hip hop sons - Dr Syntax - releases his debut album this month.\n\nSingles &amp;#039;Subcultures&amp;#039; and &amp;#039;She&amp;#039;s Quite Some Picture&amp;#039; have already opened up the ears of listeners to his &quot;myopic visions&quot; and &amp;#039;Seff-Taught&amp;#039;is the work of an artist reaching maturity in fine style. In an age of bland, sales-orientated copycat rappers, Syntax refuses to follow fashion; instead showcasing a knack for witty social commentary, strikingly original concepts and straight-up tight rhyming in the truest sense.\n\nThe album romps through light-hearted brag-rap on &amp;#039;My Night&amp;#039;, sagely advice about treacherous fema!es. court esy of &amp;#039;She&amp;#039;s Quite Some Picture&amp;#039;, arld earnest philosophical musings over &amp;#039;Slow Down&amp;#039;s lavishly stringed soundscape. The fairytale lumber of critically acclaimed first single &amp;#039;Subcultures&amp;#039; roams through the worlds of everyone from hippies to hooligans, indie kids to UK heads, and Syntax even finds time to name check old school Eastenclers Sanjay and Geeta on the opener &amp;#039;Arrival&amp;#039;. What remain consistent throughout the LP are a charismatic, relaxed delivery, top-notch lyricism and a high standard of rhyming skills.\n\nGuest verbals come courtesy of Stig Of The Dump, Orifice Vulgatron (Foreign Beggars), Wordsmith, Enlish, Koaste and Mole, each adding their own distinct style and voice to proceedings. Production duties fall to Brighton&amp;#039;s finest crate-diggers Ido and The Evil Sun, as well as Foreign Beggars&amp;#039; heavyweight Dog Nabbit, and are no less diverse: ranging from laid back, lo-fi head-nodders such as &amp;#039;Seaside Postcard, to all-out, raucous b-boy anthems like &amp;#039;Pack Mentality&amp;#039;.\n\nDr Syntax has been making noise on the underground hip hop scene for years, cementing his reputation as the most prolific and hungry emcee on the south coast by smashing every open mic and battle he attended. He first came to widespread attention as a guest on &amp;#039;Asylum Speakers&amp;#039;, the critically acclaimed 2003 debut LP by UK crew Foreign Beggars, where he appeared on standout tracks, &amp;#039;Glacial&amp;#039;and &amp;#039;What Goes Up&amp;#039;, showcasing a knack for tight rhyme patterns and catchy hooks, together with his inimitable deep cadence. Since then he has performed with the Beggars countless times at every major hip hop night across the UK, as well as their headlining spot at the Hip Hop Kemp Festival 2005 and a prestigious appearance at Glastonbury 2005.\n\nAs a solo artist he has supported acts such as Wu Tong Clan, People Under The Stairs, Pharcyde and Slum Village, and has headlined the annual Brighton Hip Hop Festival live day for the past 3 years with his crew The Menagerie. Syntax also hooked up with Geordie battle veteran and label mate Stig Of The Dump late last year to create the Beer &amp; Rap Roadshow. Alongside DJ Newborn, the duo (collectively known as Fatty and Speccy) tore up venues from Ireland to Norway, with the promise of more to come in 2007...\n","torrent":{"xt":"urn:btih:ec31d44db58fd1780133e2d4ad484e393deb4c52","amp;dn":"Dr_Syntax-Self_Taught-Advance-2007-R3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec31d44db58fd1780133e2d4ad484e393deb4c52","infoHashBuffer":{"type":"Buffer","data":[236,49,212,77,181,143,209,120,1,51,226,212,173,72,78,57,61,235,76,82]},"announce":[],"urlList":[]}}