{"title":"Kings Bounty Crossworlds GOTY [GoG]","uid":8411224,"size":2553693079,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eca5a63250dac8e1b57296e9e04adbdbaca00699&amp;dn=Kings+Bounty+Crossworlds+GOTY+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"GOG-Upp","files":9,"time":1366921499,"description":"REQUESTED BY ViolenceJack\n\n &lt;a href=&quot;\nhttp://www.gog.com/gamecard/kings_bounty_crossworlds_goty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/gamecard/kings_bounty_crossworlds_goty&lt;/a&gt;\n\nWhat's cool about it:\nKing's Bounty: Crossworlds GOTY includes King's Bounty: Armored Princess and two mini-campaigns: Champion of the Arena, where you'll fight bosses in a gladiatorial tournament and Defender of the Crown which features battles in unique tactical arenas with a random selection of enemies and allies.\nKing's Bounty: Armored Princess features its own expansion - Orcs on the March, featuring new units, spells, and quests.\nAn editor for King's Bounty: Armored Princess is also included for you to make your own mods and share them with your friends!\nOverview:\nThe renowned knight and Defender of the Crown, Bill Gilbert, leaves the realm in search of new adventures after saving the world of Endoria from the demon Baal and his hordes. The only problem with demons is that they don't tend to stay dead. Baal has made his return, vowing even more cruelty upon the besieged realm. The kingdom is need of its fabled hero! Princess Amelie decides to do what's best for her people and goes to search for Bill Gilbert to help stop Baal once again. Her first step is through a portal to another world, what happens next is up to you.\n\nKing's Bounty: Crossworlds Game of the Year Edition draws you into the role of Princess Amelie, who was but a child in King's Bounty: The Legend. You'll take part in tactical, turn-based battles, complete quests for experience and gold. Assisting you in your noble endeavor will be your pet Dragon, a royal gift, who will lend his aid to you in battle. Take the reigns of your magical Pegasus and find the Defender of the Crown!\n\n\n-------------\n\nIF YOU HAVE ANY REQUESTS, PLEASE WRITE THEM IN COMMENTS, ENJOY AND DON'T FORGET TO SEED IT BACK.\n\nWAITING ON THE REQUEST LIST TO BE UPLOADED:\n\nFAR CRY\nFAR CRY 2: FORTUNE'S EDITION\nMEDAL OF HONOR: ALLIED ASSAULT WAR CHEST\t\nGOTHIC 1, 2, 3\nIN COLD BLOOD\n\n--------------\nREQUESTS THAT I CAN'T FULLFILL AT THE MOMENT\n\nLeisure Suit Larry Language Pack\nDon't Starve\nKing of Dragon Pass\nGalactic Civilizations I Ultimate Edition\nThe Cat Lady\n\n--------------\n\nIF POSSIBLE, DON'T FORGET TO SUPPORT THE COMPANIES AND GOG.COM FOR THEIR GREAT SERVICE.\n\n","torrent":{"xt":"urn:btih:eca5a63250dac8e1b57296e9e04adbdbaca00699","amp;dn":"Kings+Bounty+Crossworlds+GOTY+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca5a63250dac8e1b57296e9e04adbdbaca00699","infoHashBuffer":{"type":"Buffer","data":[236,165,166,50,80,218,200,225,181,114,150,233,224,74,219,219,172,160,6,153]},"announce":[],"urlList":[]}}