{"title":"Switch-Mode Power Converters - Design and Analysis (Malestrom)","uid":4830565,"size":3283719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecb3a9228ebed5a8dc37eefcd43cb94a4a4546c7&amp;dn=Switch-Mode+Power+Converters+-+Design+and+Analysis+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239113987,"description":" &lt;a href=&quot;http://www.image-upload.net/images/9stfsi5jeiu7xhnijsc.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/9stfsi5jeiu7xhnijsc.jpeg&lt;/a&gt;\n\nKeng C. Wu, &quot;Switch-Mode Power Converters: Design and Analysis&quot;\nAcademic Press | 2005 | ISBN: 0120887959 | 408 pages | PDF\n\nThis book introduces an innovative, highly analytical approach to symbolic, closed-form solutions for switched-mode power converter circuits. This is a highly relevant topic to power electronics students and professionals who are involved in the design and analysis of electrical power converters. The author uses extensive equations to explain how solid-state switches convert electrical voltages from one level to another, so that electronic devices (e.g., audio speakers, CD players, DVD players, etc.) can use different voltages more effectively to perform their various functions. Most existing comparable books published as recently as 2002 do not discuss closed-loop operations, nor do they provide either DC closed-loop regulation equations or AC loop gain (stability) formulae. The author Wu, a leading engineer at Lockheed Martin, fills this gap and provides among the first descriptions of how error amplifiers are designed in conjunction with closed-loop bandwidth selection.\n\nReaders will gain a mathematically rigorous introduction to numerous, closed-form solutions that are readily applicable to the design and development of various switch-mode power converters.\n* Provides symbolic, closed-form solutions for DC and AC studies\n* Provides techniques for expressing close-loop operation\n* Gives readers the ability to perform closed-loop regulation and sensitivity studies\n* Gives readers the ability to design error amplifiers with precision\n* Employs the concept of the continuity of states in matrix form\n* Gives accelerated time-domain, steady-state studies using Laplace transform\n* Gives accelerated time-domain studies using state transition\n* Extensive use of matrix, linear algebra, implicit functions, and Jacobian determinants\n* Enables the determination of power stage gain that otherwise could not be obtained ","torrent":{"xt":"urn:btih:ecb3a9228ebed5a8dc37eefcd43cb94a4a4546c7","amp;dn":"Switch-Mode+Power+Converters+-+Design+and+Analysis+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecb3a9228ebed5a8dc37eefcd43cb94a4a4546c7","infoHashBuffer":{"type":"Buffer","data":[236,179,169,34,142,190,213,168,220,55,238,252,212,60,185,74,74,69,70,199]},"announce":[],"urlList":[]}}