{"title":"[E-book-Ita-poliziesco]Gli arancini di Montalbano","uid":4597511,"size":506343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed2e8a739ae3062793dafe0bb4d86443803f92de&amp;dn=%5BE-book-Ita-poliziesco%5DGli+arancini+di+Montalbano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mitimex","files":1,"time":1230062703,"description":"Gli arancini di Montalbano ÃƒÂ¨, come si ÃƒÂ¨ detto, una raccolta di brevi racconti, tutti relativi a eventi delittuosi o strani il cui mistero trova sempre una logica soluzione grazie all'intuito del commissario e alla sua sensibilitÃƒÂ  di uomo, forse piÃƒÂ¹ che di investigatore. ÃƒË† proprio questa autenticitÃƒÂ  del personaggio che non viene mai presentato come un super eroe o un genio dalle sovrumane doti intellettuali, che lo caratterizza e lo rende cosÃƒÂ¬ familiare.\nLa brevitÃƒÂ  di alcuni racconti perÃƒÂ² non ÃƒÂ¨ sempre utile allo sviluppo della narrazione che talvolta cade nell'aneddoto, o porta alla costruzione di personaggi che rasentano un po' la macchietta. Nell'insieme tuttavia la gradevolezza (e anche qualcosa di piÃƒÂ¹) della lettura ÃƒÂ¨ assicurata.\nChe dire ad esempio del racconto Referendum popolare? Delizioso quadro di provincia siciliana in cui anche le battaglie politiche utilizzano le corna come strumento d'offesa.\nOppure di Come fece Alice in cui le debolezze tutte da maschio latino (sia del pregiudicato da catturare che della &quot;forza pubblica&quot;), sono &quot;giocate&quot; da Montalbano (con qualche vergogna) per giungere all'arresto del ricercato.\nDolcissimo ÃƒÂ¨ il racconto che apre la raccolta, La prova generale, sia per l'inconsueto rapporto affettivo tra il commissario e il ladro &quot;buono&quot;, sia per l'episodio in sÃƒÂ©: una struggente e tenera storia d'amore di due vecchi sposi, due attori uniti da una intera vita di passioni condivise.\nMa particolarmente felici mi paiono La pÃƒÂ²vira Maria Castellino, Amore e fratellanza e il geniale Montalbano si rifiuta.\nNel primo di questi tre racconti una vecchia prostituta assassinata avvia un'indagine che porta alla conclusione di come anche la professione piÃƒÂ¹ antica del mondo possa essere svolta con grande dignitÃƒÂ , buon gusto e &quot;rispettabilitÃƒÂ &quot;, tanto che la settantenne Maria Castellino ÃƒÂ¨ ricordata da tutti con grande stima e affetto, mentre l'insospettabile assassino...\nAnche in Amore e fratellanza, l'elemento che mi pare piÃƒÂ¹ interessante ÃƒÂ¨ il rovesciamento dei piÃƒÂ¹ diffusi canoni etici: chi ÃƒÂ¨ il buono e chi il malvagio? Le forme piÃƒÂ¹ astute di mimetizzazione del crimine sono davvero quelle che utilizzano la copertura dell'approvazione e della stima sociale.\nMa ÃƒÂ¨ in Montalbano si rifiuta che Camilleri tocca l'apice della sua capacitÃƒÂ  di ironia e di dissacrazione. Da piÃƒÂ¹ punti di vista: mostra come puÃƒÂ² essere facile essere pulp e sconvolgere il lettore, gioca con la fama di &quot;buonista&quot; che parte della critica gli ha attribuito, utilizza il pirandelliano rapporto con la creatura letteraria, aumentandone l'autonomia e nello stesso tempo concedendo a se stesso un momento polemico di ottimo gusto. Per fortuna esistono dei settantini cosÃƒÂ¬ giovani!\n","torrent":{"xt":"urn:btih:ed2e8a739ae3062793dafe0bb4d86443803f92de","amp;dn":"%5BE-book-Ita-poliziesco%5DGli+arancini+di+Montalbano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed2e8a739ae3062793dafe0bb4d86443803f92de","infoHashBuffer":{"type":"Buffer","data":[237,46,138,115,154,227,6,39,147,218,254,11,180,216,100,67,128,63,146,222]},"announce":[],"urlList":[]}}