{"title":"Captains And The Kings (1976 TV miniseries) Complete.mp4","uid":14431868,"size":8022651585,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed35bfcbb1c8720705bd2987a6ac6d60dc5f171a&amp;dn=Captains+And+The+Kings+%281976+TV+miniseries%29+Complete.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Invader97","files":1,"time":1461616561,"description":"From Wikipedia: Captains and the Kings is a 1972 historical novel by Taylor Caldwell chronicling the rise to wealth and power of an Irish immigrant, Joseph Francis Xavier Armagh, who emigrates as a penniless teenager to the United States, along with his younger brother and baby sister, only for their parents to die shortly afterwards. Joseph Armagh befriends a Lebanese immigrant, and both are taken under the tutelage of an American plutocrat. An inter-generational saga focusing on the themes of the American dream, discrimination and bigotry in American life, and of history as made by a cabal of the rich and powerful, through Armagh's attempt to make his eldest son, who eventually becomes a senator, the first Catholic President of the United States.\r\n\r\nThe book was adapted into an eight-part television miniseries by NBC in the 1976 broadcast season - which were broadcast in ten hours (including the time for TV commercials). The first and last episodes were two hours each, while the other six were one hour each. In a couple of places on the internet it states that there were nine episodes, but I believe that this is incorrect.\r\n\r\nInvader97","torrent":{"xt":"urn:btih:ed35bfcbb1c8720705bd2987a6ac6d60dc5f171a","amp;dn":"Captains+And+The+Kings+%281976+TV+miniseries%29+Complete.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed35bfcbb1c8720705bd2987a6ac6d60dc5f171a","infoHashBuffer":{"type":"Buffer","data":[237,53,191,203,177,200,114,7,5,189,41,135,166,172,109,96,220,95,23,26]},"announce":[],"urlList":[]}}