{"title":"High-Efficiency Car Fuel Plans for Survival [pack]","uid":8216867,"size":1545027995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edea45a55227a6ddbbfe601068ec54f236decc77&amp;dn=High-Efficiency+Car+Fuel+Plans+for+Survival+%5Bpack%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"mikem777","files":74,"time":1362358840,"description":"High-Efficiency Car Fuel Plans for Survival [pack]\n\nThis system can be built easily by anyone with conventional tools and materials and at little cost. This torrent contains everything required to build your own system in a reasonable amount of time and with a moderate degree of proficiency. This may sound like a hoax to many but it's not.\n\nThe Multi-Fuels Processor (GEET) is an internationally patented technology (Patent US005794601A1) whose inventor is Paul Pantone. This revolutionary system allows the common 4 stroke-car-engines to run on a water-hydrocarbons mixture. This system is capable of using all types of fuels (gasoline, diesel, kerosene, crude oils and others derived from hydrocarbons) with its endothermic plasma-reactor. The Multi-Fuels Processor also results in a significant reduction in pollution by almost 85 percent compared to a conventional engine. Tests carried out by many commercial experts and private researchers have shown that it is possible to make function an engine equipped by this device with a mixture of 20 percent gas and 80 percent water without any loss in output power. This means a reduction in gasoline consumption by up to 80 percent. Both gasoline and decomposed water (hydrogen and oxygen) are used as a fuel by this system.\n\nPatent: &quot;A fuel system for improved fuel efficiency may include a fuel injector to transmit fuel in droplet form to a reaction region. A reaction rod may be positioned in the reaction region, where the reaction rod may have a convex end and a concave end. The fuel system may be used with engines such as gasoline engines, turbine engines, diesel engines, and steam engines.&quot;\n\ntags: car, fuel, gas, gasoline, petrol, survival, energy, geet, pantone, water, hydrogen, oxygen, engine","torrent":{"xt":"urn:btih:edea45a55227a6ddbbfe601068ec54f236decc77","amp;dn":"High-Efficiency+Car+Fuel+Plans+for+Survival+%5Bpack%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edea45a55227a6ddbbfe601068ec54f236decc77","infoHashBuffer":{"type":"Buffer","data":[237,234,69,165,82,39,166,221,187,254,96,16,104,236,84,242,54,222,204,119]},"announce":[],"urlList":[]}}