{"title":"Miles Davis - Four and More (1964) [Jazz][mp3 320][schon55]","uid":5644303,"size":131776969,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee1f34e1785495dc93fa91a4eef8ccdaa32c855a&amp;dn=Miles+Davis+-+Four+and+More+%281964%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"schon55","files":15,"time":1277235917,"description":"Miles Davis - Four &amp; More\nYear:  1964 \nRelease Date:  Mar 15, 2005 \nLabel:  Columbia \nQuality: 320 kbps\n\nThis session bristles with energy. The pace is exhilarating! Aside from the astonishing virtuosity, the sheer verve of the music is uplifting - literally - it's hard not to have both feet tapping and find yourself leaning towards the edge of your seat. The remastered sound is excellent - great depth and breadth to the sound-stage, punch and drive from the bass, clarity and bite in the upper registers without any digital harshness - terrific immediacy - the sister recording, &quot;My Funny Valentine&quot;, shares these virtues. \n* \nMiles is supercharged throughout. He deploys staccato volleys and wavering glissandos, going for an urgency rarely equalled on other recordings. George Coleman is of the same spirit, although he prefers a more classical, clean delivery of his torrents of notes - in the liner essay Miles is quoted as judging this night to be Coleman's best-ever performance. The entire essay by John Ephland is very interesting and has many nice turns of thought - for example, &quot;Imagine, if you can, the sheer ecstasy, the rush of playing faster than you can think, the magical, perfect blend of technique with feeling spiralling out this way and that.&quot; A good summation of the listening experience. Tony Williams is a dynamic powerhouse - coupled with Ron Carter, the rhythm is impossible to ignore. In this context, Herbie Hancock is in danger of being overwhelmed, and while his work is fine and adds to the fire, this is not the best showcase of his wide talents. \n* \nThe selection of these tracks from the February 1964 night at the Lincoln centre makes for a wild and exhausting listen - mixed with a few of the more reflective numbers played that night, from &quot;My Funny Valentine&quot;, the ride becomes more comfortable and even more engaging. A stunning night's music. ~ Robert Bezimienny\n\nPersonnel:\nMiles Davis - trumpet\nTony &quot;Ruption&quot; Williams\nHerbie Hancock, Ron Carter, George Coleman \n\nMiles Davis - Four &amp; More Tracks:\n01  So What   \n02  Walkin' \n03  Joshua\n04  Go-Go (Theme and Announcement)\n05  Four \n06  Seven Steps to Heaven\n07  There Is No Greater Love\n08  Go-Go (Theme and Announcement) \n","torrent":{"xt":"urn:btih:ee1f34e1785495dc93fa91a4eef8ccdaa32c855a","amp;dn":"Miles+Davis+-+Four+and+More+%281964%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee1f34e1785495dc93fa91a4eef8ccdaa32c855a","infoHashBuffer":{"type":"Buffer","data":[238,31,52,225,120,84,149,220,147,250,145,164,238,248,204,218,163,44,133,90]},"announce":[],"urlList":[]}}