{"title":"PMDG Boeing 747-400 Passenger and Boeing 747-400F Cargo with ALL","uid":3536203,"size":180935776,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee5b1af7f1bc1028ce432a2ecabef793b51ed576&amp;dn=PMDG+Boeing+747-400+Passenger+and+Boeing+747-400F+Cargo+with+ALL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"raf-aldergrove","files":1,"time":1160380115,"description":"After the great success of PMDG&amp;#039;s 737 The Next Generation series, the latest production of PMDG 747-400 Queen of the Skies is destined to become every airliner enthusiast&amp;#039;s favorite Flight Simulator aircraft. \n\n\n\nIn order to provide the sophistication, technical details and challenge of commercial airline flying to the enthusiast, we have ensured that PMDG 747-400 Queen of the Skies meets exacting standards for quality and completeness. From the photo-real cockpit to systems programmed after engineering schematics, no effort has been spared during the extensive development process. This has been verified by our dedicated beta test team, comprised of aviation professionals, airline pilots and Flight Simulator experts. (For more information on the PMDG team and beta team, click here.)\n\n \n\nNot sure about the PMDG 747-400 Queen of the Skies yet? This is what PCPilot Magazine has to say about it:\n\n \n\n?The most breathtakingly realistic airliner expansion to date ? this is currently as close as you can get to experiencing the Boeing 747-400 on a desktop.?\n\n \n\nPMDG 747-400 Status\n \nCurrent 747-400 Version for sale: version 1.1\n \n\n \nA comprehensive service update for current customers of the 747-400 is now available. For a complete list of all additions and fixes, click here. To download it, click here.\n \n \n\n--------------------------------------------------------------------------------\n\n747-400 Queen of the Skies Product Details\n\n747-400 Product Details with Screenshots\n\nExterior Model\n\nExterior Model in Detail\n\nGMax 747-400 Model - Accurately modeled down to the smallest detail complete with high resolution textures and three different engine variants \nAirplane Animations - Hundreds of animated parts on the exterior model bring the 747-400 to life, with realistic gear, flap and slat movement, all passenger and cargo doors operable (with corresponding indications in the cockpit) and all control surfaces moving like their real-world counterparts \n\n\nVirtual Cockpit\n\nVirtual Cockpit In Detail\n\nDynamic Virtual Cockpit - Accurate within inches of the real flight deck, complete with photo-real textures, animated switches and knobs and beautiful night lighting \nVirtual Cabin - The upper deck cabin and crew rest area is provided to allow the virtual pilots to stretch their legs during those very long flights \nCockpit Features \n\nWeekend Update Screenshots\n\nPanel Perspectives - You can now start flying the 747 from the First Officer&amp;#039;s perspective and work your way up to the familiar Captain&amp;#039;s perspective; the main panel perspectives provide large display space to provide clear views of the primary CRT displays with all necessary information for flight \n  \n\nComplete Avionics - Sharp vector graphic cockpit displays matching their real world counterparts, all EICAS functions and lower displays working interactively with the aircraft&amp;#039;s systems \nAircraft / Cockpit Systems - Functionality at the highest accuracy, programmed after engineering schematics to ensure everything behaves like on the real plane \nSome Aircraft Systems Details \nCustom Engine Model\n Auto-Start (auto-relight) and Windmill Modeled \n Engine Flame-Outs during heavy precipitation and at V speeds possible\n \nFuel Management System with Accurate Cross-feed and Balancing Variable Damage Factors for Systems and Engines Excessive Braking will cause Brake Pad Overheat \n\nNew Night Lighting Technique - At night, this airliner cockpit will illuminate in all its glory, with three different intensities and complete standardization between the virtual cockpit and 2D panel night appearance \nPanel State Loading - From cold and dark to cruising level, the airplane can be loaded to be configured in different setups \nFlight Management Computer (FMC) - Interactive FMC operating to real world standards with highly accurate fuel/distance/time predictions \n\nSome FMC Features \nSID/STAR Procedures\n Two Independent FMCs Operative\n IRS Position Interaction\n \n  Accurate Cost Index Functionality   \n\nProfessional Features - Complete IRS system, Autopilot includes VNAV, LNAV, FL CHG and is capable of performing full autoland in the strongest of crosswinds \nSome Autopilot Features \nCertification standard model of sideslip control during final stage of approach and runway centerline tracking on the ground (rollout) during fully automatic CATII/III type approach  \nCustom designed parameters for most realistic behavior\n LNAV/VNAV accurately modeled\n \n\nCustomizable Options - Change units, flight director styles, IRS alignment times, engine variants and more \nFlight Performance ModelTM\n\nFlight Model - Developed from scratch by our own aeronautics professional, the flight characteristics operate within a narrow margin of operator&amp;#039;s specifications \nAdditional Features\n\nNew Failures Module - Set failures at random intervals or target specific systems with variable and progressive damage factors \nSound Set - Recorded from the real flight deck, the sounds are complete from the powerful jet engines to the fire warning bells \nVirtual Cabin - In addition to the virtual cockpit, a virtual Upper Deck cabin in a First Class layout is available when using Active Camera 2004 (www.anticyclone.be) \nOperating Manual - Hundreds of pages including operating procedures, limitations and more \nFree Add-on Liveries - Dozens of colorful airline liveries will be made available for download upon product release  \n\n\nCustomer feedback has indicated a clear interest in the cargo variant of the 747-400 so PMDG is pleased to present to you the 747-400F CARGO. Due to the popularity of this variant, PMDG has decided to develop a dedicated product to bring this cargo airliner to life. With the rapid expansion of the world&amp;#039;s cargo carriers, the -400F will allow you to recreate the dynamic world of flying freight. Fly to exotic destinations with a highly detailed representation of this versatile freighter, complete with its prominent opening nose. \n\n\n\nBased on PMDG&amp;#039;s 747-400 Queen of the Skies simulator, 747-400F CARGO is an expansion product that adds new visual models and updated systems to reflect those of the real -400F airplane. Please consult the features list below for a complete description of the contents of this exciting product. Don&amp;#039;t miss your chance to enter the world of cargo flying!\n\n \n\n\n \n\n--------------------------------------------------------------------------------\n\n747-400F CARGO\n\nExterior Model\n\nGMax 747-400F Model - Accurately modeled down to the smallest detail complete with high resolution textures and three different engine variants \nBONUS YAL-1A Model - U.S. Air Force Airborne Laser 747 variant with detailed telescope and other special modifications \n\n\n\nAirplane Animations - Hundreds of animated parts on the exterior model bring the 747-400 to life, with realistic gear, flap and slat movement, as well as opening cargo nose and doors \n\nPMDG Cargo Ops - experience cargo loading operations with details such as a palette loaders, rear-fuselage load support, opening cargo doors and air stairs for the crew to enter the plane ( \nnote: for cargo palettes to be visible, user must use the included Cargo Load Manager program to add cargo before loading the airplane)\n\n   \n\nVirtual Cockpit\n\nDynamic Virtual Cockpit - Accurate within inches of the real flight deck, complete with photo-real textures, animated switches and knobs and beautiful night lighting \n[new] Updated Textures - the VC textures have been enhanced to reflect the more rugged look of a freighter airplane \nVirtual Cabin - The upper deck cabin is modeled to recreate the short upper deck of the -400F with space for the crew, load manager and other passengers. \nBONUS YAL-1A Cabin - Modified upper deck cabin with ABL control station \n  \n\n  \n\nCockpit Features \n\nLCD Displays - Optional LCD style displays as featured on newer built -400F models \nDigital MCP readouts - the MCP features digital readouts as found on newer built -400F models \nCompact Standby Gauge - All-in-one digital standby instrument as featured on newer built -400 models \nAdditional Engine Indications - P&amp;W and RR EICAS indications are realistically represented \n  \n\n[new] Cargo Specific System Differences - 747-400F specific pneumatics systems are correctly modeled and the stabilizer tanks have been removed\n\n\n\nAdditional Features \n\n[new] Enhanced Sound Set - New sounds for all three engine variants for improved audio quality and performance \nInteractive Cargo Load Manager - Adjust the weight of the cargo load for customized freight missions \n\n\nCargo Liveries - free add-on liveries are available for all real-world 747-400F operators \n   \n\nFor a detailed listing of all product features and updates for the 747-400 Queen of the Skies base product, please click here.\n \n","torrent":{"xt":"urn:btih:ee5b1af7f1bc1028ce432a2ecabef793b51ed576","amp;dn":"PMDG+Boeing+747-400+Passenger+and+Boeing+747-400F+Cargo+with+ALL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5b1af7f1bc1028ce432a2ecabef793b51ed576","infoHashBuffer":{"type":"Buffer","data":[238,91,26,247,241,188,16,40,206,67,42,46,202,190,247,147,181,30,213,118]},"announce":[],"urlList":[]}}