{"title":"The Mark of Athena (Heroes of Olympus, Book 3) (Audiobook) - (Ma","uid":7790922,"size":316799698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee80a4a3523e95c88e0a1ac7afa71ce1f9e97fc6&amp;dn=The+Mark+of+Athena+%28Heroes+of+Olympus%2C+Book+3%29+%28Audiobook%29+-+%28Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1352023916,"description":"The Mark of Athena (Heroes of Olympus, Book 3) (Audiobook) By Rick Riordan\nEnglish | 2012 | ISBN: 0449014509 | ASIN: B009SESFY2 | MP3 \n\nAnnabeth is terrified. Just when she's about to be reunited with Percy-after six months of being apart, thanks to Hera-it looks like Camp Jupiter is preparing for war. As Annabeth and her friends Jason, Piper, and Leo fly in on the Argo II, she can't blame the Roman demigods for thinking the ship is a Greek weapon. With its steaming bronze dragon figurehead, Leo's fantastical creation doesn't appear friendly. Annabeth hopes that the sight of their praetor Jason on deck will reassure the Romans that the visitors from Camp Half-Blood are coming in peace. And that's only one of her worries.\n\nIn her pocket, Annabeth carries a gift from her mother that came with an unnerving command: Follow the Mark of Athena. Avenge me. Annabeth already feels weighed down by the prophecy that will send seven demigods on a quest to find-and close-the Doors of Death. What more does Athena want from her? Annabeth's biggest fear, though, is that Percy might have changed. What if he's now attached to Roman ways? Does he still need his old friends? As the daughter of the goddess of war and wisdom, Annabeth knows she was born to be a leader-but never again does she want to be without Seaweed Brain by her side.","torrent":{"xt":"urn:btih:ee80a4a3523e95c88e0a1ac7afa71ce1f9e97fc6","amp;dn":"The+Mark+of+Athena+%28Heroes+of+Olympus%2C+Book+3%29+%28Audiobook%29+-+%28Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee80a4a3523e95c88e0a1ac7afa71ce1f9e97fc6","infoHashBuffer":{"type":"Buffer","data":[238,128,164,163,82,62,149,200,142,10,26,199,175,167,28,225,249,233,127,198]},"announce":[],"urlList":[]}}