{"title":"Le Salaire de la Peur aka The Wages of Fear 1953 DVDRip Sonata P","uid":9174023,"size":1045753501,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eeb157db1c1c71363d65756931b2c1a5b8ba326f&amp;dn=Le+Salaire+de+la+Peur+aka+The+Wages+of+Fear+1953+DVDRip+Sonata+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"klinho","files":3,"time":1384116620,"description":"Together with Diabolique, The Wages of Fear (Le Salaire de la Peur) earned Henri-Georges Clouzot the reputation as a &quot;French Hitchcock.&quot; In truth, Clouzot's ability to sustain suspense may have even exceeded Hitchcock's; when originally released, Wages ran 155 tension-filled minutes. Based on the much-imitated novel by Georges Arnaud, the film is set in Central America. The Southern Oil Company, which pretty much rules the roost in the impoverished village of Las Piedras, sends out a call for long-distance truck drivers. Southern Oil's wages of 2,000 dollars per man are, literally, to die for -- the drivers are obliged to transport highly volatile nitroglycerine shipments across some of the most treacherous terrain on earth. Through expository dialogue, tense interactions and flashbacks, we become intimately acquainted with the four drivers who sign up for this death-defying mission: Corsican Yves Montand, Italian Folco Lulli, German Peter Van Eyck, and Frenchman Charles Vanel. The first half of the film slowly, methodically introduces the characters and their motivations. The second half -- the drive itself -- is a relentless, goosebump-inducing assault on the audience's senses. The winner of the Grand Prix at the Cannes Festival, The Wages of Fear was remade by William Friedkin as Sorcerer (1977). \n\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:eeb157db1c1c71363d65756931b2c1a5b8ba326f","amp;dn":"Le+Salaire+de+la+Peur+aka+The+Wages+of+Fear+1953+DVDRip+Sonata+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb157db1c1c71363d65756931b2c1a5b8ba326f","infoHashBuffer":{"type":"Buffer","data":[238,177,87,219,28,28,113,54,61,101,117,105,49,178,193,165,184,186,50,111]},"announce":[],"urlList":[]}}