{"title":"Moby Grape 1967-2009 Complete Discography","uid":10711576,"size":2774593646,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:efdf39cbe4c93bbc368f5ac604d256d67f4f2f12&amp;dn=Moby+Grape+1967-2009+Complete+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"KatSucks","files":440,"time":1407362301,"description":"Just copying this over from another website since it wasn't here previously.  I didn't create it and am downloading it now just like you all.\n\nComplete Albums of Moby Grape 1967-2009\n\n\nMoby Grape\n\nYet another unjustly forgotten 60s group. This is a weird story all around. Skip Spence, a budding singer-songwriter, was recruited by the Jefferson Airplane to play drums (!) in their original lineup. He cut one record with them and quit in mid-1966, at which point he and the Airplane's manager hatched a scheme of forming a new band in the same mold. Like the Airplane, Byrds, and Buffalo Springfield, the new group was to be a harmonizing alliance of singer-songwriters with a fan following of rebellious teenage girls. And like those groups, Moby Grape was to go within just a few months from initial rehearsals to full-blown recording sessions.\n\n\n\nThe plan almost worked: Spence landed four talented songwriters, all from the West Coast and all with extensive gigging credentials. The group's first album was a careful blend of compositions by all five band members. Released within weeks of Sgt. Pepper's Lonely Heart's Club Band, it was full of trendy pseudo-psychedelic two-minute pop songs. At this point, however, everything fell apart. The record company's efforts to hype the album's release (e.g., foolishly releasing five debut singles at once) were a total flop. The same week, three of the band members were busted for drug possession and (ahem) contributing to the delinquency of minors. The album's cover photo had to be modified when someone noticed that it showed a band member flashing a finger.\n\n\n\nAnd so on. Things got worse and worse, with the group falling out with its manager, its performances deteriorating, and Spence consuming enough hallucinogenics to kill a stadium full of Deadheads. In early '68 Spence flipped out completely, running amok with a fire axe and landing in Bellevue for six months (!), which needless to say weakened the group's second album. The Grape cut a third album without him, and later a bizarre country-western fourth album with only three of the original band members, but the spark - and opportunity to cash in on the nation's Summer of Love cultural detour - was gone forever. Nonetheless, Spence cut a solo record in 1969; the other members released their own solo records throughout the 70s, 80s, and 90s; and various combinations of the five founders have regrouped to cut no less than four reunion records, all of them hard to get except by mail order - I've listed them, but omitted most of the solo records.\n\n\n\nI've only seen the band's first album on CD - the others can be had for a price, I'm told. But there's a good, nationally-released two-disk compilation (Vintage) that includes all the stuff from their regular records you'll want to hear, plus a pile of pretty good bonus tracks. It's also got endless liner notes, which explains why I know way too much about these guys.\n\n\n\nThere used to be a full-blown, non-commerical Moby Grape web site with lyrics, photos, a really good discography, etc., but it has disappeared and I can't find anything comparable to it. (JA)\n\n\n\nLineup: Peter Lewis (guitar, vocals); Jerry Miller (lead guitar, some vocals); Bob Mosley (bass, vocals); Skip Spence (guitar, vocals); Don Stevenson (drums). Spence died of multiple medical problems, April 1999.","torrent":{"xt":"urn:btih:efdf39cbe4c93bbc368f5ac604d256d67f4f2f12","amp;dn":"Moby+Grape+1967-2009+Complete+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efdf39cbe4c93bbc368f5ac604d256d67f4f2f12","infoHashBuffer":{"type":"Buffer","data":[239,223,57,203,228,201,59,188,54,143,90,198,4,210,86,214,127,79,47,18]},"announce":[],"urlList":[]}}