{"title":"The Family Jewels - The CIA, Secrecy And Presidential Power By J","uid":9569077,"size":7639871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f00a184f989db63ac7abe7f8d02fe68a1cccb281&amp;dn=The+Family+Jewels+-+The+CIA%2C+Secrecy+And+Presidential+Power+By+J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391588288,"description":"Format: mobi/epub/azw3\nLength: 400 pages\nGenre: Non-Fiction/History/Politics\nDate: 15 September 2013\n\nIn December 1974, a front-page story in the New York Times revealed the explosive details of illegal domestic spying by the Central Intelligence Agency. This included political surveillance, eavesdropping, detention, and interrogation. The revelation of illegal activities over many years shocked the American public and led to investigations of the CIA by a presidential commission and committees in both houses of Congress, which found evidence of more abuse, even CIA plans for assassinations. Investigators and the public soon discovered that the CIA abuses were described in a top-secret document agency insiders dubbed the &quot;Family Jewels.&quot; That document became ground zero for a political firestorm that lasted more than a year. \n\nThe Family Jewels probes the deepest secrets of the CIA and its attempts to avoid scrutiny. John Prados recounts the secret operations that constituted &quot;Jewels&quot; and investigators' pursuit of the truth, plus the strenuous efforts - by the agency, the executive branch, and even presidents - to evade accountability. Prados reveals how Vice President Richard Cheney played a leading role in intelligence abuses and demonstrates that every type of &quot;Jewel&quot; has been replicated since, especially during the post-9/11 war on terror. \n\nAuthor:\n\nJohn Prados is a senior fellow of the National Security Archive in Washington, DC, where he helps bring newly declassified government records to public attention. He is the award-winning author of twenty-one books, including Islands of Destiny: The Solomons Campaign and the Eclipse of the Rising Sun. He also lectures widely on security, freedom of information, and other issues; analyzes combat processes; serves as a historical adviser to filmmakers; and designs strategy board games, including the well-known Third Reich and other award-winning titles. ","torrent":{"xt":"urn:btih:f00a184f989db63ac7abe7f8d02fe68a1cccb281","amp;dn":"The+Family+Jewels+-+The+CIA%2C+Secrecy+And+Presidential+Power+By+J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f00a184f989db63ac7abe7f8d02fe68a1cccb281","infoHashBuffer":{"type":"Buffer","data":[240,10,24,79,152,157,182,58,199,171,231,248,208,47,230,138,28,204,178,129]},"announce":[],"urlList":[]}}