{"title":"Surf's Up - Music from the Motion Picture","uid":9406884,"size":350383550,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f06c13b66bc17cbd8f543c3a4de76d72968f4261&amp;dn=Surf%27s+Up+-+Music+from+the+Motion+Picture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388181318,"description":"Source: 2007 CD\n\n\n\nBy Kevin O\nI am not a big fan of the recent CGI kids animated film trend. I am not a fan of Penguins, and I am not a fan of surfing. So why would I go to three different stores on this albums release day to try and find/pick it up? The music of course! There are plenty of good tracks on this CD, but I must be frank, I think I'm a little biased.\n\nI am a HUGE fan of 311, if they werent on this album, I probably wouldn't have picked it up, but I'm glad that I did. I was surprised that the 311 track didn't even end up being my favorite track. My favorite actually was the Dirty Heads track &quot;Stand Tall.&quot; This si an awesome song with plenty of styles and genre's mixed into it.\n\nAs for the 311 song, it is a cover of a Toots song (I believe) and it is executed fairly well. My only gripe was the mention of the movie's characters within the song. Its nothing to big, but it sort of ruins the magic of the song, and makes it feel more commercialized. Thats not to say it isn't great, which it certainly is, it jsut feels a little forced.\n\nIn the end, its about the music, The new Sugar Ray track is also great, as long as all the classics that you love to hear and missed, or missed out on when they came around the first time (Radicals, Romantics, Big Nose, Pearl Jam, etc.)\n\nOverall, great selections, but if your not a fan of any of the bands, I'd wait until it reaches the bargain section of a local CD store. But if you like 311, Sugar Ray, The Dirty Heads, and anyone else on this CD, buy it, because you will most likely love the rest of the album as well.","torrent":{"xt":"urn:btih:f06c13b66bc17cbd8f543c3a4de76d72968f4261","amp;dn":"Surf%27s+Up+-+Music+from+the+Motion+Picture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f06c13b66bc17cbd8f543c3a4de76d72968f4261","infoHashBuffer":{"type":"Buffer","data":[240,108,19,182,107,193,124,189,143,84,60,58,77,231,109,114,150,143,66,97]},"announce":[],"urlList":[]}}