{"title":"Eating Animals - Jonathan Safran Foer  (Epub &amp; MOBI)","uid":6062620,"size":2365893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0e82c13ad1080fdf97ee9f3475efa468d825fcc&amp;dn=Eating+Animals+-+Jonathan+Safran+Foer++%28Epub+%26+MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LouisLC","files":-1,"time":1293150826,"description":"The latest from novelist Foer is a surprising but characteristically brilliant memoir-investigation, boasting an exhaustively-argued account of one man-child's decade-long struggle with vegetarianism. \n\nOn the eve of becoming a father, Foer takes all the arguments for and against vegetarianism a neurotic step beyond and, to decide how to feed his coming baby, investigates everything from the intelligence level of our most popular meat providers - cattle, pigs, and poultry - to the specious self-justifications (his own included) for eating some meat products and not others. \n\nFoer offers a lighthearted counterpoint to his investigation in doting portraits of his loving grandmother, and her meat-and-potatoes comfort food, leaving him to wrestle with the comparative weight of food's socio-cultural significance and its economic-moral-political meaning. Without pulling any punches-factory farming is given the full expose treatment - Foer combines an array of facts, astutely-written anecdotes, and his furious, inward-spinning energy to make a personal, highly entertaining take on an increasingly visible (and book-selling) moral question; call it, perhaps, An Omnivore's Dilemma.\n\nINCLUDES BOTH MOBI AND EPUB FORMAT. NO DRM.","torrent":{"xt":"urn:btih:f0e82c13ad1080fdf97ee9f3475efa468d825fcc","amp;dn":"Eating+Animals+-+Jonathan+Safran+Foer++%28Epub+%26+MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e82c13ad1080fdf97ee9f3475efa468d825fcc","infoHashBuffer":{"type":"Buffer","data":[240,232,44,19,173,16,128,253,249,126,233,243,71,94,250,70,141,130,95,204]},"announce":[],"urlList":[]}}