{"title":"PCSX2 0.9.6 + Bios + Plugins [h33t] [dopeboy]","uid":4757143,"size":16632397,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f107dee66317a598755b7657be966c730c7a5048&amp;dn=PCSX2+0.9.6+%2B+Bios+%2B+Plugins+%5Bh33t%5D+%5Bdopeboy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tamer1009","files":2,"time":1236519833,"description":"After nearly 16 months, here comes a new Pcsx2 version. Pcsx2 0.9.6\n\nThese months were somewhat problematic for pcsx2, due to an initial slowdown of the development process. Then, last fall, the Playground branch was created, and development picked up again. Finally, with the merge of Pcsx2 and Pcsx2 playground, the emulator's development returned once again as it was before, and now we can give you a release which should (we hope!) leave you happy.\n\nWe would like to thank everyone that was still waiting for a release, and coming to our forums. We would also like to thank everyone to encouraged and otherwise supported us. This release is especially for you.\n\n\n\n\nImportant note: you NEED to update directx or you won't be able to use the emulator!\nDirectX 9.0c\n\nWhat's new in 0.9.6?\n\n- Huge rewrite, mainly from the new members of the Playground branch! Too many speedups, optimizations and other fixes to write here! Many famous games will now work.\n- Dropped VM build replaced by the all new Vtlb, meaning no more 'Cannot allocate memory' errors at start up, more accurate emulation, slightly lower speeds but with many optimizations to come\n- Full memcard support, working in all games\n- Improved Frameskip/VU-skip\n- Special Game Fixes Section\n- Advanced Options Section for custom tweaking VU/FPU behavior.\n- Rewritten Multithreaded GS (MTGS) mode, with as much as 15% speedup for HT machines (only 3-5% for Dual Core), and fixes many instabilities.\n- Improved VU/FPU Flags and Clamping support (helps fix odd behaviors and SPS in some games)\n- Improved EE/IOP synchronization (fixes many freeze-ups and vmhacks).\n- Improved CDVD support.\n\nINSTALLATION:\n&lt; 1 &gt; Install PCSX2 by running &quot;PCSX2_0.9.6_setup.msi&quot;                                                                \n                                                             \n&lt; 2 &gt; Copy the files from the &quot;Bios&quot; map to the Bios map in Program Files.                                                              \n                                                             \n&lt; 3 &gt; Copy the files from the &quot;Plugin&quot; map to the Plugin map in Program Files                                                            \n                                                         \n&lt; 4 &gt; Enjoy!       ","torrent":{"xt":"urn:btih:f107dee66317a598755b7657be966c730c7a5048","amp;dn":"PCSX2+0.9.6+%2B+Bios+%2B+Plugins+%5Bh33t%5D+%5Bdopeboy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f107dee66317a598755b7657be966c730c7a5048","infoHashBuffer":{"type":"Buffer","data":[241,7,222,230,99,23,165,152,117,91,118,87,190,150,108,115,12,122,80,72]},"announce":[],"urlList":[]}}