{"title":"Michael Lewis - The Big Short [V0 mp3] Unabridged","uid":7225143,"size":1088852801,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f252b37f5d5310e46d464f6649f1225259869f03&amp;dn=Michael+Lewis+-+The+Big+Short+%5BV0+mp3%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":-1,"time":1335647060,"description":"Michael Lewis is a great writer, and for reading pleasure this is head and shoulders above any of the other crisis books. It's also an accurate account of Wall Street (the metaphysical place, not the geographic one). He gets the good and the bad; the sense in which markets are honest and the sense in which they are not; the groupthink and how iconoclasts thrive; the subtlety of the choices and the pain. Just as Liar's Poker &quot;Herman the German&quot; created an indelible shorthand for the difference between salesperson and customer, The Big Short fixes important aspects of recent financial events in permanent form, with the skill of a great sculptor.\n\nTo do this, Lewis isolates a story that was at the core. He does not try to explain every event, every institution. This is what overwhelms other accounts. Years from now a great historian might distill a deeper truth from a broader view, but until then this will be the best portrait we have. Like Moneyball and The New New Thing it brings you inside a world and gives you a mental snapshot to carry forever.\n\nI am personally more tolerant of the flaws of Wall Street, and more appreciative of its virtues, than Lewis, but he does not impose his views. He lays out the story. Some will be revolted, others won't. He also mentions only briefly the political follies and dishonesties, and completely ignores the contributions from Main Street. That's okay, those aren't his story. That others did bad things is no excuse for Wall Street. But it does make for an uneven picture. Those in search of ammunition for banker bashing will find it here, but then it's hardly in short supply. Those who want to understand what happened on a human level will find something far more valuable.\n\nEveryone should read this book, lover or hater of Wall Street or just curious. You'll get a great story and you'll learn something.\n &lt;a href=&quot;\nhttp://www.jroller.com/bookreview/entry/the_big_short_inside_the&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jroller.com/bookreview/entry/the_big_short_inside_the&lt;/a&gt;\n\nAudible Audio Edition\nListening Length: 9 hours and 27 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Simon &amp; Schuster Audio\nAudible.com Release Date: March 15, 2010\nLanguage: English\nASIN: B003CN7E42","torrent":{"xt":"urn:btih:f252b37f5d5310e46d464f6649f1225259869f03","amp;dn":"Michael+Lewis+-+The+Big+Short+%5BV0+mp3%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f252b37f5d5310e46d464f6649f1225259869f03","infoHashBuffer":{"type":"Buffer","data":[242,82,179,127,93,83,16,228,109,70,79,102,73,241,34,82,89,134,159,3]},"announce":[],"urlList":[]}}