{"title":"The Long Hope (Rock Climbing)","uid":6932339,"size":2202649467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2f6538ca433e43b4d62f97368e76207beac071c&amp;dn=The+Long+Hope+%28Rock+Climbing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Zuul","files":2,"time":1325700646,"description":"People\\\\\\'s Choice Award - Kendal Mountain Film Festival\n\n\\\\\\&quot;It\\\\\\'s simply one of the best climbing films I\\\\\\'ve seen.\\\\\\&quot; - Jack Geldard, UKC \n\nSt John\\\\\\'s head on the Island of Hoy is a wild and remote 1150 foot sea cliff. It was first climbed in 1970 by climber and poet Ed Drummond together with Oliver Hill. They took 7 days to climb the cliff, sleeping on ledges and in hammocks along the way. Now, 40 years later, one of the World\\\\\\'s top climbers, Dave MacLeod, sets out to climb the cliff in a single day, finishing with a new desperately hard final pitch up the headwall.\n\nMacleod\\\\\\'s historic new climb, The Longhope Route Direct (E11), is captured close-up with the latest HD cameras and contrasted with the challenges of Drummond\\\\\\'s first ascent through interviews and archive material. The film also follows Drummond, now in his late sixties and suffering from Parkinson\\\\\\'s disease, as he makes a pilgrimage back to St John\\\\\\'s Head to look upon the route one last time.\n\\\\\\&quot;...this is the stuff of dreams...and nightmares! The stream of expletives rattles out like machine gun fire as the bold Scot powers up the mind blowing face with the rasping waves far below.\\\\\\&quot; - John Appleby, Footless Crow \n\n\\\\\\&quot;The Long Hope is a superb production, which has a real story, magnificent climbing, great characters, amazing locations, stunning cinematography, engaging interviews, emotionally charged reflections, professional editing and above all a happy and heart-warming ending. How climbing films should be done.\\\\\\&quot; - Jack Geldard, UKC","torrent":{"xt":"urn:btih:f2f6538ca433e43b4d62f97368e76207beac071c","amp;dn":"The+Long+Hope+%28Rock+Climbing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2f6538ca433e43b4d62f97368e76207beac071c","infoHashBuffer":{"type":"Buffer","data":[242,246,83,140,164,51,228,59,77,98,249,115,104,231,98,7,190,172,7,28]},"announce":[],"urlList":[]}}