{"title":"The Rough Guide to India (9th Ed)(gnv64)","uid":14654064,"size":89200848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f31d3e591772c929f96bf7969498e1c5fca11c4b&amp;dn=The+Rough+Guide+to+India+%289th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":5,"time":1463682909,"description":"The Rough Guide to India (9th Ed)\r\nby David Abram and Nick Edwards\r\nRough Guides | September 2013 | ISBN: 1409366707 | ePUB | 84.6 mb\r\n\r\nThe Rough Guide to India is the definitive travel guide to this captivating country.\r\nMore a continent than a county, India is an overload for the senses. From the Himalayan peaks of Sikkim to the tropical backwaters of Kerala, the desert forts of Rajasthan to the mangroves of West Bengal, India's breathtaking diversity of landscapes is matched only by its range of cultures, cuisines, religions and languages.\r\n\r\nThe Rough Guide to India gives you the lowdown on this beguiling country, whether you want to hang out in hyper-modern cities or explore thousand-year-old temples, track tigers through the forest or take part in age-old festivals, get a taste of the Raj or watch a cricket match. And easy-to-use maps, reliable transport advice, and expert reviews of the best hotels, restaurants, bars, clubs, and shops for all budgets ensure that you won't miss a thing.\r\n\r\nMake the most of your time with The Rough Guide to India.\r\nSeries Overview: For more than thirty years, adventurous travelers have turned to Rough Guides for up-to-date and intuitive information from expert authors. With opinionated and lively writing, honest reviews, and a strong cultural background, Rough Guides travel books bring more than 200 destinations to life. Visit RoughGuides.com to learn more.\r\n\r\nAbout the Author\r\nNick Edwards is a cartoonist, illustrator, and character designer from London, UK. He earned his illustration degree at Brighton University. Nick's work can be seen on Cartoon Network and the Disney Channel, as well as in Dinopopolous, his first comic with Blank Slate Books. \r\n\r\nCONTENTS \r\n- HOW TO USE\r\n- INTRODUCTION Where to go When to go Author picks Things not to miss Itineraries \r\n- BASICS Getting there Entry requirements Getting around Accommodation Food and drink Health The media Festivals and holidays Sports Trekking and outdoor activities Yoga, meditation and ashrams Culture and etiquette Shopping Travelling with children Travel essentials \r\n- THE GUIDE 1 Delhi 2 Rajasthan 3 Uttar Pradesh 4 Uttarakhand 5 Madhya Pradesh and Chhattisgarh 6 Himachal Pradesh 7 Jammu and Kashmir 8 Haryana and Punjab 9 Gujarat 10 Mumbai 11 Maharashtra 12 Goa 13 Kolkata and West Bengal 14 Bihar and Jharkhand 15 Sikkim 16 The Northeast 17 Odisha 18 Andhra Pradesh 19 Andaman Islands 20 Tamil Nadu 21 Kerala 22 Karnataka \r\n- CONTEXTS History Religion Wildlife Music Books Glossary \r\n- MAPS AND SMALL PRINT\r\n \nhttps://s32.postimg.org/5inp51s4l/The_Rough_Guide_to_India.jpg","torrent":{"xt":"urn:btih:f31d3e591772c929f96bf7969498e1c5fca11c4b","amp;dn":"The+Rough+Guide+to+India+%289th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f31d3e591772c929f96bf7969498e1c5fca11c4b","infoHashBuffer":{"type":"Buffer","data":[243,29,62,89,23,114,201,41,249,107,247,150,148,152,225,197,252,161,28,75]},"announce":[],"urlList":[]}}