{"title":"The Walker [2007] Paul Schrader","uid":6323306,"size":781594370,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f37b5bc2bc587cc466da4450a92f744da2c98205&amp;dn=The+Walker+%5B2007%5D+Paul+Schrader&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1303020507,"description":" &lt;a href=&quot;http://bayimg.com/eAhpLAadJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eAhpLAadJ&lt;/a&gt;\n\nThe Walker (2007) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0783608/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0783608/&lt;/a&gt;\n\nThe Walker is a 2007 drama film that was written and directed by Paul Schrader. It is a British-American independent production and was proclaimed to be the latest installment in Schrader's night workers series of films, starting with Taxi Driver in 1976, and then followed by American Gigolo in 1980 and Light Sleeper in 1992.\n\n  Woody Harrelson  ...  Carter Page III  \n  Kristin Scott Thomas  ...  Lynn Lockner  \n  Lauren Bacall  ...  Natalie Van Miter  \n  Ned Beatty  ...  Jack Delorean  \n  Moritz Bleibtreu  ...  Emek Yoglu  \n  Mary Beth Hurt  ...  Chrissie Morgan  \n  Lily Tomlin  ...  Abigail Delorean  \n  Willem Dafoe  ...  Larry Lockner  \n  William Hope  ...  Mungo Tenant  \n  Geff Francis  ...  Detective Dixon  \n  Steven Hartley  ...  Robbie Kononsberg  \n  Garrick Hagon  ...  Mungo Tenant  \n  Michael J. Reynolds  ...  Ethan Withal  \n  Allen Lidkey  ...  Andrew Salesperson  \n  Stewart Alexander  ...  Edgar  \n\n\nIf Paul Schrader's The Walker were made in the 1940s, it would probably be playing at next month's film noir festival - there's a murder, but the movie is really about betrayal and the dark side of the human soul.\n\nIt also has a wicked sense of humor, with a bizarre yet accomplished performance by Woody Harrelson as Carter, a nattily dressed gay Washington insider apparently living off an inheritance from Daddy, whose job seems to be to keep the bored wives of Washington - Kristin Scott Thomas, Lauren Bacall and Lily Tomlin among them - occupied while their rich, powerful husbands make deals inside the Beltway.\n\nSchrader considers this the completion of a lonely-man trilogy, after American Gigolo (1980) and Light Sleeper (1992). The Walker doesn't have the bite of those movies, or of his relatively recent masterwork, Auto Focus. Its gentle, languid pacing matches Carter's drawl - all da bettah ta get da witty Southern humah - but sometimes the drawl becomes too much of a crawl, even with all the scenery chewing by a stable full of wonderful character actors.\n\nThere is good writing here, and Thomas is very good as always, but the movie works because of Harrelson's performance. With not a hair in his toupee out of place, nor a wrinkle in his finely tailored suits, he plays Carter as a specimen suitable for mounting in a wax museum, until an amusing thought occurs and Botoxed skin crinkles at the corner of his eye and his mustached lips part to drop another witticism.\n\nCarter seems blissfully unaware of the tightening noose of the murder investigation, but that's actually not true. He's not naive, nor superficial. He's a Washington survivor. \n\nNote: The press notes list Schrader's inspiration as Jerry Zipkin, who coined the term the walker; he squired Nancy Reagan and Betsy Bloomingdale to events and on shopping trips.\n\nSchrader completed the script for The Walker in 2002. Initially the film was to be a direct sequel to American Gigolo, with Julian Kaye (played by Richard Gere) as the lead character. The director originally wanted Kevin Kline to play the lead.\n\n","torrent":{"xt":"urn:btih:f37b5bc2bc587cc466da4450a92f744da2c98205","amp;dn":"The+Walker+%5B2007%5D+Paul+Schrader","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37b5bc2bc587cc466da4450a92f744da2c98205","infoHashBuffer":{"type":"Buffer","data":[243,123,91,194,188,88,124,196,102,218,68,80,169,47,116,77,162,201,130,5]},"announce":[],"urlList":[]}}