{"title":"FileMaker Pro 11 - The Missing Manual","uid":6489115,"size":21291311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f38f342e53a7067ac4790abae4a4f39a3bf2dc82&amp;dn=FileMaker+Pro+11+-+The+Missing+Manual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308817617,"description":"FileMaker Pro 11: The Missing Manual\n\nThis hands-on, friendly guide shows you how to harness FileMakers power to make your information work for you. With a few mouse clicks, the FileMaker Pro 11 database helps you create and print corporate reports, manage a mailing list, or run your entire business. FileMaker Pro 11: The Missing Manual helps you get started, build your database, and produce results, whether youre running a business, pursuing a hobby, or planning your retirement. Its a thorough, accessible guide for new, non-technical users, as well as those with more experience.\n\nStart up: Get your first database up and running in minutes\nCatalog your data: Organize contacts, to-do items, and product information with speedy data-entry and sorting tools\nCreate professional documents: Publish reports, invoices, and more, with ease\nAdd visual power and clarity: Create colorful charts to illustrate and summarize your data\nHarness processing power: Crunch numbers and search text with dozens of built-in formulas\nLearn advanced topics: Explore the high-level features of FileMaker Pro Advanced and FileMaker Server\n","torrent":{"xt":"urn:btih:f38f342e53a7067ac4790abae4a4f39a3bf2dc82","amp;dn":"FileMaker+Pro+11+-+The+Missing+Manual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f38f342e53a7067ac4790abae4a4f39a3bf2dc82","infoHashBuffer":{"type":"Buffer","data":[243,143,52,46,83,167,6,122,196,121,10,186,228,164,243,154,59,242,220,130]},"announce":[],"urlList":[]}}