{"title":"MedCalc v12.5.0.0 (x86-x64) Cracked-EAT [TorDigger]","uid":8376144,"size":35885974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f3c072733eb841d4b0df463a2d20504935e17db2&amp;dn=MedCalc+v12.5.0.0+%28x86-x64%29+Cracked-EAT+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TorDigger","files":13,"time":1366052657,"description":"MedCalc\n\nMedCalc - User-friendly statistical software\n\nMedCalc is a complete statistical program for Windows designed to closely match the requirements of biomedical researchers. It is fast, user-friendly and reliable.\nMedCalc is the most user-friendly software for Receiver Operating Characteristic curve (ROC curves) analysis. The MedCalc ROC module includes comparison of up to 6 ROC curves.\nThe software also includes Bland &amp; Altman plot, Passing and Bablok and Deming regression for method comparison studies.\n\nMedCalc for Windows description\n\nData management\n\nIntegrated spreadsheet with 16384 columns and up to 100000 rows.\nCorrect handling of missing data.\nOutliers can easily be excluded.\nBuilt-in WYSIWYG text editor.\nImports Excel, Excel 2007, SPSS, DBase and Lotus files, and files in SYLK, DIF or plain text format.\nEasy selection of subgroups for statistical analysis.\nDocumentation\n\nComprehensive help file.\nManual in PDF format (go to download area).\nComplete HTML manual on MedCalc web site.\nContext help in dialog boxes.\nROC curve analysis\n\nArea under the curve (AUC) with standard error, 95% confidence interval, P-value. Offers choice between methodology of DeLong et al. (1988) and Hanley &amp; McNeil (1982, 1983).\nList of sensitivity, specificity, likelihood ratios, and positive and negative predictive values for all possible threshold values.\nROC curve graph with 95% Confidence Bounds.\nThreshold values can be selected in an interactive dot diagram with automatic calculation of corresponding sensitivity and specificity.\nPlot of sensitivity and specificity versus criterion values.\nInterval likelihood ratios.\nComparison of up to 6 ROC curves: difference between the areas under the ROC curves, with standard error, 95% confidence interval and P-value.\nSample size calculation for area under ROC curve and comparison of ROC curves.\nGo to the ROC curve analysis section of the MedCalc manual for more information on ROC curve analysis in MedCalc.\nGraphs\n\nLots of graphs, see Graph gallery.\nData point identification in graphs.\nDraw text boxes, lines, arrows and connectors.\nName, save and recall graphs and statistics.\nStatistical info in graph windows.\nSave graphs as BMP, PNG, GIF, PCX, JPG or TIF files, or as PowerPoint slides (*.pptx).\n\nSystem requirements\n\nPC with Windows XP, Windows Server 2003, Windows Vista, Windows 7 or Windows 8 (32-bit and 64-bit versions).\n512 Mb of memory.\n20 Mb free space on the hard disk.\n\nHomepage: http://www.medcalc.org/\n\nInstallation Instructions:\n\n- Install program.\n- Copy &quot;MedCalc.exe&quot; from crack folder and paste into default installation directory.\n- Run &quot;Regme&quot; and merge it to System registry.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:f3c072733eb841d4b0df463a2d20504935e17db2","amp;dn":"MedCalc+v12.5.0.0+%28x86-x64%29+Cracked-EAT+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3c072733eb841d4b0df463a2d20504935e17db2","infoHashBuffer":{"type":"Buffer","data":[243,192,114,115,62,184,65,212,176,223,70,58,45,32,80,73,53,225,125,178]},"announce":[],"urlList":[]}}