{"title":"Medical Examination Videos Talley &amp; O'Connor, Bates' Clini","uid":4329128,"size":1699906158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3d1f8ac14d6cfdd3b6fcb3ec3636893e9644d76&amp;dn=Medical+Examination+Videos+Talley+%26+O%5C%27Connor%2C+Bates%5C%27+Clini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Serrin","files":117,"time":1217948355,"description":"For all you budding doctors out there.\nThere are two sets of videos to accompany their respective textbooks.\n\nThe first from the textbook Nicholas J Talley and Simon O'Connor's Clinical Examination: A Systematic Guide to Physical Diagnosis 5th Edition (also found in Examination Medicine : A Guide To Physician Training by the same authors) ripped by myself, encoded in h264/AAC. There are two versions, one for iPod (which should work on all gen 5.5+ iPod classic). If you're going to use Quicktime to play the video I recommend you use this version. The second version is a higher quality version meant for general use on computers. I recommend [url=http://www.cccp-project.net/]CCCP[/url] to play this version on Windows and [url=http://www.mplayerhq.hu/]MPlayer[/url] on OSX or *nix. It is of higher quality and makes use of higher profile features that the iPod version doesn't and as such looks even worse on Quicktime because it doesn't seem to how to deal with it. It's a miracle that it even works on the excuse of h264 implementation that is Quicktime.\nThe other set accompanies Bates' guide to physical examination and history taking and was downloaded from their website. Unfortunately it's pretty poor quality but it's the only one I can get a hold of. If someone can get a hold of a better quality version leave a message here. It is presented in its original format as Quicktime movie files in *.mov containers. You'll need either Quicktime or [url=http://www.free-codecs.com/download/QuickTime_Alternative.htm]Quicktime Alternative[/url] (I highly recommend Quicktime Alternative over Quicktime) to watch this.\n\nIf 1.58GB is a bit too much for you use a torrent client that lets you select which files to download and you'll only need to download half of it (high resolution version or iPod version). Recommended clients include [url=http://www.vuze.com/app]Vuze[/url] for those who desire ultimate control, [url=www.utorrent.com/]utorrent[/url] for the less technically minded and [url=http://www.bitcomet.com/]bitcomet[/url] for those who like to steal candy from babies and don't like to upload.\n\nOk a little bit of soapboxing now:\nIf you like it I highly recommend you get the accompanying books. That or pirate them; the authors are rolling in cash in account of them being doctors so I doubt that your piracy of their books really matters.\nBut if you pirate anything, like it and the original creator is not in such a great financial state, consider buying it or else they might never make any more of whatever it is you like; be it music, film, book, game etc.\nAll I'm asking is that you think about it.\nOk time to hop off my soapbox.\n\nFSM damn it; can you use links in PirateBay descriptions or is it disabled? My pretty description. :(","torrent":{"xt":"urn:btih:f3d1f8ac14d6cfdd3b6fcb3ec3636893e9644d76","amp;dn":"Medical+Examination+Videos+Talley+%26+O%5C%27Connor%2C+Bates%5C%27+Clini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3d1f8ac14d6cfdd3b6fcb3ec3636893e9644d76","infoHashBuffer":{"type":"Buffer","data":[243,209,248,172,20,214,207,221,59,111,203,62,195,99,104,147,233,100,77,118]},"announce":[],"urlList":[]}}