{"title":"Elizabeth Moon - Vatta's War [1-5] (Graphic Audio Version)","uid":11676172,"size":3331678451,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f43ec0a034eb25736a28b85f3f6976c70e9885c7&amp;dn=Elizabeth+Moon+-+Vatta%27s+War+%5B1-5%5D+%28Graphic+Audio+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":127,"time":1422884613,"description":"1 Trading In Danger\nKylara Vatta is the only daughter in a family full of sons, and her father's only child to buck tradition by choosing a military career instead of joining the family business. For Ky, it's no contest: Even running the prestigious Vatta Transport Ltd. shipping concern can't hold a candle to shipping out as an officer aboard an interstellar cruiser. It's adventure, not commerce, that stirs her soul. And despite her family's misgivings, there can be no doubt that a Vatta in the service will prove a valuable asset. But with a single error in judgment, it all comes crumbling down.\n\nExpelled from the Academy in disgrace-and returning home to her humiliated family, a storm of high-profile media coverage, and the gaping void of her own future-Ky is ready to face the inevitable onslaught of anger, disappointment, even pity. But soon after opportunity's door slams shut, Ky finds herself with a ticket to ride-and a shot at redemption-as captain of a Vatta Transport ship.\n\nIt's a simple assignment: escorting one of the Vatta fleet's oldest ships on its final voyage...to the scrapyard. But keeping it simple has never been Ky's style. And even though her father has provided a crew of seasoned veterans to baby-sit the fledgling captain on her maiden milk run, they can't stop Ky from turning the routine mission into a risky venture-in the name of turning a profit for Vatta Transport, of course.\n\nBy snapping up a lucrative delivery contract defaulted on by a rival company, and using part of the proceeds to upgrade her condemned vehicle, Ky aims to prove she's got more going for her than just her family's famous name. But business will soon have to take a backseat to bravery, when Ky's change of plans sails her and the crew straight into the middle of a colonial war. For all her commercial savvy, it's her military training and born-soldier's instincts that Ky will need to call on in the face of deadly combat, dangerous mercenaries, and violent mutiny...\n\n2 Marque and Reprisal\nAlthough the exciting military career she hoped for never got off the ground, Ky Vatta ended up seeing plenty of combat when she took the helm of one of the commercial transport vessels in her family's fleet...and steered it into a full-blown war. Now the lessons she learned in that trial by fire are about to pay off - because this time, the war has come to her. Someone has launched a full-throttle offensive against Vatta Transport Ltd., Ky's father's interstellar shipping empire. In short order, most of Ky's family is killed, and subsequent attacks sever vital lines of communication, leaving Ky fighting, in every sense, to survive.\n\nKy is determined to identify the ruthless mystery enemy and avenge her family's name, but she needs not only firepower but information. And she gets both in spades-from the band of stranded mercenaries she hooks up with; from her black-sheep cousin, Stella, who has been leading a secret life; and from Stella's roguish ex-lover, Rafe. Together they struggle to penetrate the tangled web of political intrigue that is wreaking havoc within InterStellar Communications, on whose effective operation their own livelihoods-and perhaps lives-depend.\n\nBut the infighting proves to be infectious, and it isn't long before Ky's hired military muscle are turning their suspicions on the enigmatic Rafe, whose wealth of knowledge about ISC's clashing factions and startling new technologies has begun to make him smell like a rat...or a mole. With swift, violent destruction a very real possibility, the last thing Ky needs is a crew divided against itself-and she's prepared to take whatever measures are necessary to ensure that Vatta stays in business, as well as in one piece.\n\nWhat she is not prepared for is the shocking truth behind the terror-and a confrontation with murderous treachery from a source as unexpected as it is unrelenting.\n\n3 Engaging the Enemy\nIn the aftermath of the cold-blooded assassinations that killed her parents and shattered the Vatta intersteller shipping empire, Kylara Vatta sets out to avenge the killings and salvage the family business. Ky soon discovers a conspiracy of terrifying scope, breathtaking audacity, and utter ruthlessness. The only hope against such powerful evil is for all the space merchants to band together. Unfortunately, because she commands a ship that once belonged to a notorious pirate, Ky is met with suspicion, if not outright hostility...even from her own cousin. Before she can take the fight to the enemy, Kylara must survive a deadly minefield of deception and betrayal.\n\n4 Command Decision\nKylara had to leave a bright future as a military cadet, and was thrown into the brutal world of off-world trading. This subsequent career in the family business was tough: marked by war, mutiny and attempted assassination. But then her home was attacked and her parents killed - their trading empire left in ruins. Now she must save what is left of the family and the business, with few friends and too few assets.\n\nShe must make full use of her hard-won experience to not just survive, but to restore the shattered fortunes of the Vatta family and their allies.\n\nNow, Kylara Vatta, space-trader and sometime privateer, has destined herself for a dangerous and unpredictable future. She will muster an interplanetary taskforce and forge them into a lethal weapon: one that the pirates who destroyed her family will never forget...\n\n5 Victory Conditions\nFor Ky, it's not just about liberating the star systems subjugated by Turek and defending the rest of the galaxy's freedom. There's also a score to be settled and payback to be meted out for the obliteration of the Vatta Transport dynasty . . . and the slaughter of Ky's family. But the enemy have their own escalation efforts under way-including the placement of covert agents among the allies with whom Ky and the surviving Vattas are collaborating in the war effort. And when a spy ring linked to a wealthy businessman is exposed, a cracked pirate code reveals a galaxywide conspiracy fueling the proliferation of Turek's warship fleet.\n\nMatching the invaders' swelling firepower will mean marshaling an armada of battle-ready ships for Ky to lead into combat. But a violent skirmish leaves Ky reeling-and presumed dead by her enemies. Now, as Turek readies an all-out attack on the Nexus system-a key conquest that could seal the rest of the galaxy's doom-Ky must rally to the challenge, draw upon every last reserve of her strategic skills, and reach deep if she is to tear from the ashes of tragedy her most decisive victory.\n\nFormat: MP3\nDramatization","torrent":{"xt":"urn:btih:f43ec0a034eb25736a28b85f3f6976c70e9885c7","amp;dn":"Elizabeth+Moon+-+Vatta%27s+War+%5B1-5%5D+%28Graphic+Audio+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f43ec0a034eb25736a28b85f3f6976c70e9885c7","infoHashBuffer":{"type":"Buffer","data":[244,62,192,160,52,235,37,115,106,40,184,95,63,105,118,199,14,152,133,199]},"announce":[],"urlList":[]}}