{"title":"Best Little Stories from the Civil War by C. Brian Kelly.epub","uid":8866951,"size":885103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6445124db60c81dcf1c382200bbc021d5a16bf9&amp;dn=Best+Little+Stories+from+the+Civil+War+by+C.+Brian+Kelly.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":1,"time":1377942349,"description":"Best Little Stories from the Civil War: More Than 100 True Stories\n\nBy C. Brian Kelly\nPublished by Sourcebooks in 2010\nTags: nonfiction, history, american civil war\nEPUB, Retail, English (1402239165)\n\nThe Civil WAR You Never Knew...\n\nBehind the bloody battles, strategic marches, and decorated generals lie more than 100 intensely personal, true stories you haven't heard before. In Best Little Stories from the Civil War, soldiers describe their first experiences in battle, women observe the advances and retreats of armies, spies recount their methods, and leaders reveal the reasoning behind many of their public actions. Fascinating characters come to life, including:\n\nFormer U.S. Senator Robert Toombs of Georgia, who warned the Confederate cabinet not to fall for Lincoln's trap by firing on reinforcements, thereby allowing Lincoln to claim the South had fired the first shots of the war at Fort Sumter.\n\nBrig. Gen. Stephen A. Hurlbut, who disbanded the 13th Independent Battery, Ohio Light Artillery, scattered its men, gave its guns to other units, and ordered its officers home, accusing all of cowardly performance in battle.\n\nThomas N. Conrad, a Confederate spy operating in Washington, who warned Richmond of both the looming Federal Peninsula campaign in the spring of 1863 and the attack at Fredericksburg later that year.\n\nPrivate Franklin Thomson of Michigan, born as Sarah Emma Edmonds, who fought in uniform for the Union during the war and later was the only female member of the postwar Union Grand Army of the Republic.","torrent":{"xt":"urn:btih:f6445124db60c81dcf1c382200bbc021d5a16bf9","amp;dn":"Best+Little+Stories+from+the+Civil+War+by+C.+Brian+Kelly.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6445124db60c81dcf1c382200bbc021d5a16bf9","infoHashBuffer":{"type":"Buffer","data":[246,68,81,36,219,96,200,29,207,28,56,34,0,187,192,33,213,161,107,249]},"announce":[],"urlList":[]}}