{"title":"Gary Wright - The Dream Weaver [1975][320 KBPS]","uid":7899396,"size":90127409,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f749210ee0d2e20b227cf840dce66aed6e3300d7&amp;dn=Gary+Wright+-+The+Dream+Weaver+%5B1975%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LameDuck69","files":12,"time":1354922984,"description":"Gary Wright - The Dream Weaver [1975]\n\n\n\n\n01. Love Is Alive    \n02. Let It Out    \n03. Can't Find The Judge    \n04. Made To Love You    \n05. Power Of Love    \n06. Dream Weaver    \n07. Blind Feeling   \n08. Much Higher   \n09. Feel For Me \n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\nFrom Wikipedia:\n\n\n\n\nGary Malcolm Wright (born April 26, 1943) is an American musician, best known for his songs &quot;Dream Weaver&quot; and &quot;Love Is Alive&quot;.\n\nWright was born and raised in Cresskill, New Jersey. He attended Tenafly High School in Tenafly, New Jersey.\n\nA former child actor, Wright appeared in the 1954 original Broadway production of the long-running musical, Fanny (888 performances), having originated the role of Acolyte and then subsequently replacing Lloyd Reese in the role of Cesario, the son of Fanny. The title role of Fanny was originated by Florence Henderson who later gained worldwide fame as matriarch Carol Brady in the long-running TV series, The Brady Bunch. According to Henderson, Reese had to be replaced by Wright because (in her own words): &quot;He (Reese) was a New York boy and puberty struck very early. It wasn't long till he looked like my boyfriend!&quot;\n\nWright resides in Palos Verdes Estates, California with wife Rose. He has two adult sons, Dorian and Justin. Justin is a member of the band Intangible.\n\n-----------------------------------------------------------------------------------\n\nThe Dream Weaver is a hit solo album by one-time Spooky Tooth keyboard player Gary Wright released in June 1975.\n\nThe album was said by Wright to be the first-ever all-synthesizer/keyboard album (though there were many all-synthesizer LPs before this, including Switched-On Bach by Wendy Carlos, in 1968) - it features Wright on vocals and keyboards and Jim Keltner and Andy Newmark on drums. The only track to feature any guitar was &quot;Power Of Love&quot; which featured fellow labelmate Ronnie Montrose on electric guitar.\n\nThe album's success was a slow but steady accomplishment as the album eventually peaked at #7 on Billboard album chart in the Spring of 1976. The album's title cut and &quot;Love is Alive&quot; both peaked at #2 on the Billboard Hot 100 singles chart.\n\n","torrent":{"xt":"urn:btih:f749210ee0d2e20b227cf840dce66aed6e3300d7","amp;dn":"Gary+Wright+-+The+Dream+Weaver+%5B1975%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f749210ee0d2e20b227cf840dce66aed6e3300d7","infoHashBuffer":{"type":"Buffer","data":[247,73,33,14,224,210,226,11,34,124,248,64,220,230,106,237,110,51,0,215]},"announce":[],"urlList":[]}}