{"title":"T.G.B.Bake.Off-S07E01.-.Extra.Slice-S03E01--w.subs-540p-MP4","uid":15711878,"size":1108958745,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f79fc8cd5edd8f6e8d51e9edda9fe4d16a45a3b3&amp;dn=T.G.B.Bake.Off-S07E01.-.Extra.Slice-S03E01--w.subs-540p-MP4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"uggauga","files":4,"time":1472584013,"description":"The Great British Bake Off - S07E01\r\n&amp;\r\nThe Great British Bake Off: An Extra Slice - S03E01\r\n\r\nBBC (2016)\r\n \nhttp://www.bbc.co.uk/programmes/b07r2pr0 \nhttp://www.bbc.co.uk/programmes/b07r1ff2\r\n_______________________________________\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n_______________________________________\r\n\r\nThe Great British Bake Off, Series 7 Episode 1 of 11\r\nCake Week\r\nTwelve new amateur bakers don their aprons and head for the iconic tent in the heart of the British countryside. Mel Giedroyc and Sue Perkins are back, as are Mary Berry and Paul Hollywood, who have devised 30 new challenges to test the bakers' knowledge, skill and creativity.\r\nThe competition begins with cake week. The group first take on a British classic and are then faced with Mary's technical challenge - a popular little cake with a fatless sponge and tricky chocolate work. Finally, the bakers have the opportunity to show the judges what they can do with their showstopper.\r\nThe best of the bunch will be crowned star baker, while one contestant will be leaving the tent.\r\n-----\r\nThe Great British Bake Off: An Extra Slice, Series 3 Episode 1\r\nThe Great British Bake Off is back and joined by An Extra Slice on BBC Two.\r\nEach week, host Jo Brand chats to a panel of celebrity Bake Off fans, looking at all the shenanigans in the tent. Jo shines a spotlight on the best, the worst and the 'must try harder next time' bakes from the latest episode, with chat, exclusive footage from the BBC One show and an interview with the baker who left the tent that week.\r\nThe studio audience of Bake Off fans are challenged to bring a bake from home and reveal their efforts on the show, and viewers are invited to share photos of their efforts too - the delightful, the delicious and the downright disastrous.\r\nKicking off the series, Jo and her panel of Bake Off fans give us their take on the 12 brand new bakers and their attempts in cake week.\r\nAn Extra Slice - when one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:f79fc8cd5edd8f6e8d51e9edda9fe4d16a45a3b3","amp;dn":"T.G.B.Bake.Off-S07E01.-.Extra.Slice-S03E01--w.subs-540p-MP4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f79fc8cd5edd8f6e8d51e9edda9fe4d16a45a3b3","infoHashBuffer":{"type":"Buffer","data":[247,159,200,205,94,221,143,110,141,81,233,237,218,159,228,209,106,69,163,179]},"announce":[],"urlList":[]}}