{"title":"Factorio v0.13.15 - Linux","uid":15511402,"size":281355448,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f7fb985da9d530e133bf1c50cd184c33ac7f1825&amp;dn=Factorio+v0.13.15+-+Linux&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"BlueMane","files":3,"time":1470643017,"description":"Factorio v0.13.15\r\n\r\n\r\nRemember to Buy the Software you Like to Support the Developers.\r\n\r\n\r\nChangelog:\r\nv0.13.15\r\n\r\nBugfixes\r\n    Fixed that rotating the quickbar would make the headless server crash. (30535)\r\n\r\nv0.13.14\r\n\r\nChanges\r\n\r\n    Surplus items from crafting are again available for crafting other items. For example, crafting two green circuits will no longer result in two extra copper wires in the player's inventory. This only applies to items that are automatically crafted as a prerequisite; items the player has explicitly requested to craft will not be used to satisfy the dependencies of any further orders.\r\n    Factorio will output to console window in UTF8 on Windows.\r\n\r\n\r\nBugfixes\r\n\r\n    Fixed crash when trying to connect copper wire to invalid entities out of range in the latency state. (30201)\r\n    Fixed burner fuel sources would keep their energy when dying and being rebuilt by robots. (30283)\r\n    Fixed inserters would try to grab items from rails instead of chests/entities when build in specific setups. (30286)\r\n    Fixed disconnecting chests or constant combinators not correctly clearing circuit network. (30167)\r\n    Fixed a crash that sometimes happened after canceling manual crafting. (29910).\r\n    Fixed a bug where canceling a prerequisite product would cancel more than necessary. (29910)\r\n    Fixed crash when trying to connect power switches in map editor. (30260)\r\n    Don't force Vsync off on OpenGL. (30246)\r\n    Fixed error in tight spot level 5. (29724)\r\n    Fixed a bug where a player's GUI would be reset when any other player in MP pressed the &quot;switch active quickbar&quot; button. (29116)\r\n    Don't allow sideloading onto a disabled belt. (29436)\r\n    Fixed game hanging with certain train configurations (loop where last rolling stock touches the first).\r\n    Fixed chain signal colors not being updated when setting signal states from the circuit network (27985)\r\n    Fixed mod updates sometimes not being found with a large amount of mods.\r\n    Fixed mods browser not being sorted after searching. (29496)\r\n    Fixed regenerating entities on map (28129)\r\n    Fixed watch-your-step achievement for real this time. (30434)\r\n    Fixed &quot;failed to create display&quot; error when switching to another window immediately after launching Factorio. (30481)\r\n    Fixed isses with saving to NTFS junctions. (28858)\r\n\r\n\r\nOptimizations\r\n\r\n    Significantly reduced the high CPU usage caused by the main loop logic from 0.13.10.\r\n\r\n\r\nModding\r\n\r\n    Fixed input loader didn't resume loading after being deactivated due to full target container. (28280)\r\n    Fixed crash when loader connected to splitter is destroyed. (28616)\r\n\r\n\r\nScripting\r\n\r\n    Fixed map corruption and crashes caused by some API functions allowing entities to be used across surfaces when they aren't setup to handle it. (30187)\r\n    Fixed evolution_factor could be set to a negative number resulting in base build errors. (30264)\r\n    Fixed crash when using entity of type 'flame-thrower-explosion' with 'create-entity' trigger effect. (28467)\r\n    Fixed LuaGameScript::take_screenshot() would fail if destination file contained non-english character in its path. (30431)\r\n    Added LuaEntity::filter_slot_count read.\r\n    Added LuaEntityPrototype::mining_drill_radius read.\r\n    Added LuaTrain::station read.\r\n    Added LuaDamagePrototype and LuaGameScript::damage_prototypes read.\r\n    Added LuaEntity::loader_type read.\r\n    Added LuaRemote::remove_interface(name).\r\n    Changed LuaRemote so interface names must be unique to maintain save/load determinism.\r\n    LuaEntity::revive() will return the revived entity as a second return value if successful and if the ghost was an entity","torrent":{"xt":"urn:btih:f7fb985da9d530e133bf1c50cd184c33ac7f1825","amp;dn":"Factorio+v0.13.15+-+Linux","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7fb985da9d530e133bf1c50cd184c33ac7f1825","infoHashBuffer":{"type":"Buffer","data":[247,251,152,93,169,213,48,225,51,191,28,80,205,24,76,51,172,127,24,37]},"announce":[],"urlList":[]}}