{"title":"CoCo: The Colorful History of Tandy's Underdog Computer ","uid":11691524,"size":97024295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f836a2c31acb1dc3a3e3532c01a664fd15e19a86&amp;dn=CoCo%3A+The+Colorful+History+of+Tandy%27s+Underdog+Computer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MANTESH","files":2,"time":1423562178,"description":"\n[b][quote][color=Green]\n CoCo: The Colorful History of Tandy's Underdog Computer - 2014 - Boisy G Pitre , Bill Loguidice \n\nPublisher: CRC Press\n2014\nLanguage: English\nISBN-10: 1466592478\nISBN-13: 978-1466592476\n\nCoCo: The Colorful History of Tandy's Underdog Computer is the first book to document the complete history of the Tandy Color Computer (CoCo), a popular 8-bit PC series from the 1980s that competed against the era's biggest names, including the Apple II, IBM PC, and Commodore 64. The book takes you inside the interesting stories and people behind this unique, underdog computer.\n\nBoth noted computer science and technology advocates, authors Pitre and Loguidice reveal the story of a pivotal period in the home computing revolution from the perspective of Tandy's CoCo. As these computers were sold in Radio Shack stores throughout the United States and other countries, they provide a critical point of reference for key events in the unprecedented evolutionary period for the PC industry in the 1980s. The book also features first-hand accounts from the people who created and promoted the CoCo, from the original Tandy executives and engineers to today's active product creators and information keepers.\n\nThe CoCo impacted many lives, and this book leaves no stone unturned in recounting this fascinating slice of the PC revolution that is still in play today. From early telecommunications experiments to engineering and budgetary challenges, it covers all the aspects that made the CoCo a truly personal, useful computing experience in as small and inexpensive a package as possible.\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:f836a2c31acb1dc3a3e3532c01a664fd15e19a86","amp;dn":"CoCo%3A+The+Colorful+History+of+Tandy%27s+Underdog+Computer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f836a2c31acb1dc3a3e3532c01a664fd15e19a86","infoHashBuffer":{"type":"Buffer","data":[248,54,162,195,26,203,29,195,163,227,83,44,1,166,100,253,21,225,154,134]},"announce":[],"urlList":[]}}