{"title":"Strongholds of the Picts: The Fortifications of Dark Age Scotlan","uid":11865926,"size":33144810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8a773c10274f7d5304e08af0c8a283d3d21cfdc&amp;dn=Strongholds+of+the+Picts%3A+The+Fortifications+of+Dark+Age+Scotlan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1430349073,"description":"When the Romans left Britain around AD 410 the island had not been fully subjugated. In the Celtic fringe of Caledonia - now Northern Scotland - these unconquered native peoples were presented with the opportunity to pillage what remained of Roman Britain. By way of response the Post-Roman Britons of what is now Scotland did their best to defend themselves from attack, and to preserve what they could of the economic and administrative systems left behind by the Romans. While some old Roman forts were maintained, the Post-Roman Britons in the area created new strongholds, or re-occupied some of the long-abandoned hill-forts first built by their ancestors before the coming of the Romans. Meanwhile the Caledonians - who evolved into the Picts - relied on fortifications to maintain control over their land.\n\nThen a new wave of invaders arrived from across the Irish Sea. The Scots came first to conquer, then to settle. In their wake came the Angles and Saxons, driving north to occupy most of Scotland as far as the Firth of Forth, and later the Vikings arrived from the north and east. During the variety of ensuing struggles, the Picts, Scots, Vikings, Northumbrians and North Britons made extensive use of fortifications, the remains of which still dot the modern landscape.\n\nThis book traces the origins and development of these North British forts. It also touches on the way they served as secular or religious centers, seats of power, or as barriers against invasion. It will also discuss the mystery surrounding the Picts, and show how modern archaeology has done much to reveal the way these enigmatic people waged war, and defended their strongholds","torrent":{"xt":"urn:btih:f8a773c10274f7d5304e08af0c8a283d3d21cfdc","amp;dn":"Strongholds+of+the+Picts%3A+The+Fortifications+of+Dark+Age+Scotlan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a773c10274f7d5304e08af0c8a283d3d21cfdc","infoHashBuffer":{"type":"Buffer","data":[248,167,115,193,2,116,247,213,48,78,8,175,12,138,40,61,61,33,207,220]},"announce":[],"urlList":[]}}