{"title":"Tariq Ramadan - In the Footsteps of the Prophet (pdf)","uid":10311818,"size":10779838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8c0de7d3631eb208a925622a5beacff38499f52&amp;dn=Tariq+Ramadan+-+In+the+Footsteps+of+the+Prophet+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pharmakate","files":-1,"time":1402191283,"description":"Tariq Ramadan - In the Footsteps of the Prophet: Lessons from the Life of Muhammad (Oxford UP, 2007). 242 pp.\n\nImproved version of an older scan. Page images completely reprocessed.  Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nNamed by Time magazine as one of the 100 most important innovators of the century, Tariq Ramadan is a leading Muslim scholar, with a large following especially among young European and American Muslims. Now, in his first book written for a wide audience, he offers a marvelous biography of the Prophet Muhammad, one that highlights the spiritual and ethical teachings of one of the most influential figures in human history.\n\nIn the Footsteps of the Prophet is a fresh and perceptive look at Muhammad, capturing a life that was often eventful, gripping, and highly charged. Ramadan provides both an intimate portrait of a man who was shy, kind, but determined, as well as a dramatic chronicle of a leader who launched a great religion and inspired a vast empire. More important, Ramadan presents the main events of the Prophet's life in a way that highlights his spiritual and ethical teachings. The book underscores the significance of the Prophet's example for some of today's most controversial issues, such as the treatment of the poor, the role of women, Islamic criminal punishments, war, racism, and relations with other religions. Selecting those facts and stories from which we can draw a profound and vivid spiritual picture, the author asks how can the Prophet's life remain -- or become again -- an example, a model, and an inspiration? And how can Muslims move from formalism -- a fixation on ritual -- toward a committed spiritual and social presence?\n\nIn this thoughtful and engaging biography, Ramadan offers Muslims a new understanding of Muhammad's life and he introduces non-Muslims not just to the story of the Prophet, but to the spiritual and ethical riches of Islam.\n\n----\n\nThis book perhaps complements Karen Armstrong's Muhammad, available here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10311481&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f8c0de7d3631eb208a925622a5beacff38499f52","amp;dn":"Tariq+Ramadan+-+In+the+Footsteps+of+the+Prophet+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8c0de7d3631eb208a925622a5beacff38499f52","infoHashBuffer":{"type":"Buffer","data":[248,192,222,125,54,49,235,32,138,146,86,34,165,190,172,255,56,73,159,82]},"announce":[],"urlList":[]}}