{"title":"The pH Miracle: Balance Your Diet, Reclaim Your Health -Mantesh","uid":5965095,"size":67334672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8dad896bad684018213adfc023ff84afd7f2315&amp;dn=The+pH+Miracle%3A+Balance+Your+Diet%2C+Reclaim+Your+Health+-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MANTESH","files":3,"time":1290085942,"description":" &lt;a href=&quot;http://img444.imageshack.us/img444/6228/74590943.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img444.imageshack.us/img444/6228/74590943.jpg&lt;/a&gt;\n\n\n\n\n\nThe pH Miracle: Balance Your Diet, Reclaim Your Health By Robert O. Young, Shelley Redford Young\n\n\n\nPublisher: Warner Books 2002 \n\n662 Pages  \n\nISBN: 0446528099 , 044669049X \n\nENGLISH \n\nPDF \n\n64.2 MB\n\n\n\nIn many ways, The pH Miracle is reminiscent of an earlier generation of diet books. Much of the focus is on an intestinal cleansing program, followed by a diet that is 70 to 80 percent vegetables, coupled with a tremendous selection of supplements that authors Robert and Shelley Young recommend to everyone, no matter what their age, gender, or state of health. \nThe Youngs point their fingers at candida as a main culprit in the poor health of many people. Unfortunately, they back up their claims with only vague references, such as &quot;a 1991 study&quot; and &quot;a leading cancer researcher.&quot; Many readers may wish for more specific evidence, but instead will have to make do with enthusiastic recommendations, alphabetized lists of vegetables, and pleasing chapters with vegetarian recipes that taste good no matter how you feel about the diet as a whole. \nSprinkled throughout the book are short testimonials of people who were able to reverse cancer, improve their digestion, and lower their cholesterol by following these recommendations, and it's hard to argue with the cholesterol-lowering results that a 70 percent vegetable diet will achieve. Still, the medical value of much else in the book remains hotly contested, and as always, it's wise to check with your doctor before starting off in search of miracles...\n\n\n\n[/color][/b]","torrent":{"xt":"urn:btih:f8dad896bad684018213adfc023ff84afd7f2315","amp;dn":"The+pH+Miracle%3A+Balance+Your+Diet%2C+Reclaim+Your+Health+-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8dad896bad684018213adfc023ff84afd7f2315","infoHashBuffer":{"type":"Buffer","data":[248,218,216,150,186,214,132,1,130,19,173,252,2,63,248,74,253,127,35,21]},"announce":[],"urlList":[]}}