{"title":"The Crook Factory - Dan Simmons","uid":9100886,"size":2371052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f91d49357ab1201bf6dd6c3b8292c44b19ded0fe&amp;dn=The+Crook+Factory+-+Dan+Simmons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1382764291,"description":"&quot;Wonderful...brilliantly realized...a gripping narrative.&quot;\n- Iain Pears, &quot;New York Times&quot; bestselling author of &quot;An Instance of the Fingerpost&quot;\n\nIn 1942, at the height of World War Two, the famous writer Ernest Hemingway sought permission from the U.S. government to operate a spy ring out of his house in the Cuban countryside. This much is true...\n\nIt is the summer of '42, and FBI agent Joe Lucas has come to Cuba at the behest of the Director to keep an eye on Ernest Hemingway, who has recklessly decided to play spy in the Caribbean. Lucas has been instructed to somehow gain the great writer's trust and friendship, but all the agent's cool intellect and training has left him unprepared to withstand the human whirlwind known as &quot;Papa.&quot;\n\nHemingway has assembled a spy ring that he calls the &quot;Crook Factory&quot;--including an American millionaire, a twelve-year-old Cuban orphan, a Spanish jai alai champion, a priest, and a fisherman, among others--to play a dangerous game of amateur espionage. Then, against all odds, Hemingway uncovers a critical piece of intelligence, and the game turns deadly for himself, Lucas, and for untold innocents.\n\nIn &quot;THE CROOK FACTORY,&quot; Dan Simmons weaves an unforgettable tale of riveting suspense, peopled by larger-than-life characters who inhabit the sensual, intoxicating Cuban landscape of the 1940s. It is a novel of honor, passion and chilling conspiracy.\n\nAnd it could very well have happened...","torrent":{"xt":"urn:btih:f91d49357ab1201bf6dd6c3b8292c44b19ded0fe","amp;dn":"The+Crook+Factory+-+Dan+Simmons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91d49357ab1201bf6dd6c3b8292c44b19ded0fe","infoHashBuffer":{"type":"Buffer","data":[249,29,73,53,122,177,32,27,246,221,108,59,130,146,196,75,25,222,208,254]},"announce":[],"urlList":[]}}