{"title":"Tattoo Realities: Ink Master-1-2-3 and Best Ink-1-2","uid":9043109,"size":18309001670,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f9b960a9d4a10efd6a30cc7d78300a5fe3b907ac&amp;dn=Tattoo+Realities%3A+Ink+Master-1-2-3+and+Best+Ink-1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"an_buy","files":-1,"time":1381685639,"description":"&quot;Ink Master&quot;: \nTattoo artists compete in various challenges that not only test their technical skills, but also their on-the-spot creativity, where they must create and execute an original tattoo on a 'human canvas.' These 'human canvases' range from tattoo virgins to connoisseurs to those who want to cover up a prior tattoo misstep. The challenges focus on different tattooing techniques such as contrast, adaptability, balance and dimension as well as styles including New School, photorealism, American traditional and pin-up. After every challenge the contestants face a tough panel made up of Navarro, Nunez, and Peck and a roster of guest judges. Each individual artists' work is critiqued and one contestant is sent home. The masterpieces these artists create will last forever, but so will their mistakes.\n\n\n&quot;Best Ink&quot;\nThe series follows a group of 10 tattoo artists from various cities in the United States. The winner of the competition wins a $100,000 cash prize and a cover article of a well-known tattoo-related magazine. The show was hosted by Kimberly Caldwell during Season 1 and by Pete Wentz in Season 2. After each challenge, tattoo artist and the shows judges, along with different guest judge every week, critique the tattoos to find the contestant with the &quot;Best Ink&quot;.","torrent":{"xt":"urn:btih:f9b960a9d4a10efd6a30cc7d78300a5fe3b907ac","amp;dn":"Tattoo+Realities%3A+Ink+Master-1-2-3+and+Best+Ink-1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b960a9d4a10efd6a30cc7d78300a5fe3b907ac","infoHashBuffer":{"type":"Buffer","data":[249,185,96,169,212,161,14,253,106,48,204,125,120,48,10,95,227,185,7,172]},"announce":[],"urlList":[]}}