{"title":"Total Gym Ball Workout: Trade Secrets of a Personal Trainer","uid":8855084,"size":8519617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa01844500933a666f0bd5677b9ef9d06e797935&amp;dn=Total+Gym+Ball+Workout%3A+Trade+Secrets+of+a+Personal+Trainer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1377631196,"description":"teve Barrett, &quot;Total Gym Ball Workout: Trade Secrets of a Personal Trainer&quot;\nISBN: 140814199X | 2012 | EPUB\n\nThe ultimate 'one stop' guide to using this bestselling piece of equipment - not just in the gym but at home too. Practical and easily accessible, The Total Gym Ball Workout is perfect for the fitness enthusiast or fitness professional who wants to lightly improve their knowledge and heavily improve the range of exercises they can use in their training. Tried and tested exercises are accompanied by clear photos and illustrations presented in a modern and logical way. The Total Gym Ball Workout is brimming with ideas for using this popular piece of fitness equipment. Packed with clear and easy to use exercises, this how-to reference book also provides adaptations of basic and advanced exercises making it ideal for anyone who wants to get the most out of their fitness gear. - Each exercise idea is organised by fitness level and includes follow-up and extension ideas. - Written in a jargon-free and concise style, this book is light on the science and background, heavy on practicality.","torrent":{"xt":"urn:btih:fa01844500933a666f0bd5677b9ef9d06e797935","amp;dn":"Total+Gym+Ball+Workout%3A+Trade+Secrets+of+a+Personal+Trainer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa01844500933a666f0bd5677b9ef9d06e797935","infoHashBuffer":{"type":"Buffer","data":[250,1,132,69,0,147,58,102,111,11,213,103,123,158,249,208,110,121,121,53]},"announce":[],"urlList":[]}}