{"title":"Robert Alter - Literary Criticism + Bible Translations (17 books","uid":15238975,"size":52352295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa4c438d23f4a7c07a934b2877170035fc5a90f6&amp;dn=Robert+Alter+-+Literary+Criticism+%2B+Bible+Translations+%2817+books&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":37,"time":1467918555,"description":"\nROBERT ALTER (b. 1935) is a renowned American literary critic and translator.  He has written widely on the European novel from the eighteenth century to the present, on contemporary American fiction, and on modern Hebrew literature.   He has devoted book-length studies to Fielding, Stendhal, and the self-reflexive tradition in the novel.\r\n\r\nHe has also written extensively on literary aspects of the Bible.  THE ART OF BIBLICAL NARRATIVE (1981) -- and its companion volume THE ART OF BIBLICAL POETRY (1985) -- radically expanded the horizons of biblical scholarship by recasting the Hebrew Bible as not only a human creation but a work of literary art deserving studied criticism.  Alter presents the Bible as a cohesive literary work, one whose many authors used innovative devices such as parallelism, contrastive dialogue, and narrative tempo to tell one of the most revolutionary stories of human history: the revelation of a single god.\r\n\r\nHis critically acclaimed and ongoing translations of the Hebrew Bible are the magnificent capstone to a lifetime of distinguished scholarly work and have won the PEN Center Literary Award for Translation. With the release of STRONG AS DEATH IS LOVE (2015), Alter has now translated more than 70% of the Hebrew Bible in slightly less than 20 years.  In these volumes, he attempts to clear away the inaccuracies, inelegance and muddiness of past translations and to transmit in English the clarity and literary power of the Hebrew original.  They should not be missed!\r\n\r\n\r\nThe following books are in PDF and/or ePUB format as indicated:\r\n\r\n\r\n                         == LITERARY CRITICISM &amp; BIOGRAPHY ==\r\n\r\n* Art of Biblical Narrative, The (Basic Books, 2011).  Revised and updated edition. -- ePUB\r\n\r\n* Art of Biblical Poetry, The (Basic Books, 2011).  Revised and updated edition. -- PDF + ePUB\r\n\r\n* Defenses of the Imagination: Jewish Writers and Modern Historical Crisis (Jewish Publication Society, 1977) -- PDF\r\n\r\n* Imagined Cities: Urban Experience and the Novel (Yale UP, 2005) -- PDF\r\n\r\n* Lion for Love, A: A Critical Biography of Stendhal [with Carol Cosman] (Basic Books, 1979). -- PDF\r\n\r\n* Literary Guide to the Bible (Harvard UP, 1987).  Edited by Robert Alter and Frank Kermode. -- PDF\r\n\r\n* Motives for Fiction (Harvard UP, 1984). -- PDF\r\n\r\n* Pen of Iron: American Prose and the King James Bible (Princeton, 2010). -- PDF\r\n\r\n* Pleasures of Reading in an Ideological Age (Norton, 1990). -- PDF\r\n\r\n* World of Biblical Literature, The (Basic Books, 1991). -- PDF\r\n\r\n\r\n                              == HEBREW BIBLE TRANSLATIONS ==\r\n\r\n* Ancient Israel: The Former Prophets: Joshua, Judges, Samuel, and Kings A Translation with Commentary (Norton, 2013) -- ePUB\r\n\r\n* Book of Psalms: A Translation with Commentary (Norton, 2007) -- ePUB\r\n\r\n* David Story, The: A Translation with Commentary of I and II Samuel (Norton, 1999) -- PDF + ePUB\r\n\r\n* Five Books of Moses: A Translation with Commentary (Norton, 2004) -- ePUB\r\n\r\n* Genesis: Translation and Commentary (Norton, 1996) -- PDF + ePUB\r\n\r\n* Strong As Death Is Love: Song Of Songs Ruth Esther Jonah And Daniel: A Translation with Commentary (Norton, 2015). -- ePUB\r\n\r\n* The Wisdom Books: Job, Proverbs, and Ecclesiastes: A Translation with Commentary (Norton, 2010) -- ePUB\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                                   \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:fa4c438d23f4a7c07a934b2877170035fc5a90f6","amp;dn":"Robert+Alter+-+Literary+Criticism+%2B+Bible+Translations+%2817+books","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa4c438d23f4a7c07a934b2877170035fc5a90f6","infoHashBuffer":{"type":"Buffer","data":[250,76,67,141,35,244,167,192,122,147,75,40,119,23,0,53,252,90,144,246]},"announce":[],"urlList":[]}}