{"title":"The Library Genesis Repository 2015-01-31 (torrents only)","uid":11674452,"size":152438585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb713402f21e082fee19bfd3c2341ca38da23016&amp;dn=The+Library+Genesis+Repository+2015-01-31+%28torrents+only%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Anomalous","files":1302,"time":1422797326,"description":"\nThe Library Genesis Repository\n\nWith well over a million books, Library Genesis is the worlds largest open online library of books and scientific articles.\n\nAND THEY DON'T RESPOND TO DMCA TAKEDOWN REQUESTS!!\n\nWhat better way to tell The Man to bend over and prepare to be boarded that by helping to spread this great wealth of knowledge.\n \nWhen asked &quot;how can I help&quot;, Bookwarrior of LibGen repeatedly says &quot;Put up mirrors. If you can't put up mirrors, download and seed the content. If you can't do all of it, do some of it. If you can't seed it, then at least store it offline in case of a disaster.&quot; \n\n*************************\nIMPORTANT!! MUST READ!!\n*************************\n\nThis torrent is a collection of 1306 torrent files that point to the MAIN Library Genesis Repository. \n \nNormally, torrents of torrents are forbidden. Because of the exceptional nature of this bundle, I asked Mr.Gooner if an exception might be made. He said &quot;Put it up and I'll take a look at it&quot;. So, until I get further word, I don't know if this would be allowed. I suppose I could upload each of the 1306 torrents individually -- but is there any sense to that?\n---------------------------------------------------------- \nThis bundle is distributed from the LibGen site. \nIt is updated monthly. \nThe database dump and front-end software will work with partial content. That means you don't have to download the entire 12TB in order to get started. You can have a partial mirror.\nThese torrent files are normally compressed. I uncompressed them so you could look at one or two without downloading the whole thing. Also, since I'm no longer VUL, I'm not allowed to up compressed files.\n\nHere is the link to the source of these torrent files: &lt;a href=&quot;\nftp://ftp.libgen.in/repository_torrent/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nftp://ftp.libgen.in/repository_torrent/&lt;/a&gt;\n\nThe database dump: &lt;a href=&quot;\nftp://ftp.libgen.in/dbdumps/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nftp://ftp.libgen.in/dbdumps/&lt;/a&gt;\n\n*************************\nIMPORTANT !! MUST READ!!\n*************************\n \nThere are things that you have to know in order to avoid disappointment.\nYou must read this description in order to understand what you are getting and what to expect.\n \nEach torrent in the bundle has about 1000 files. With over 1300 torrents, that makes close to 1.3 million books. The size of the files varies from a few GB to 30GB or more. The initial LibGen collection focussed on scientific and technical books. By now, the collection is much more extensive. There are a lot of duplicates. There are a lot of files in Russian. There are a lot of .djvu files (a great format that is uncommon outside of math and science).\n \nTHE MOST IMPORTANT THING TO KNOW:\nThe files in the torrents are named with their MD5 checksum.\nThey don't even have an extension.\nThe guys at LibGen are very smart, and they did this for good reasons -- but it makes it much more difficult for the average user to benefit from these files.\n\nIN ORDER TO USE THESE FILES:\nThe Library Genesis has 3 main parts:\n1. The Repository of Books\n2. The Database of Metadata\n3. The Front End Software. (This provides an interface through a web browser for searching the database and accessing the books.)\n \nTHIS UPLOAD ONLY PROVIDES THE FIRST PART: THE BOOKS.\n\nA direct link to the torrents of the repository of books: &lt;a href=&quot;\nftp://ftp.libgen.in/repository_torrent/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nftp://ftp.libgen.in/repository_torrent/&lt;/a&gt;\n \nThe good people ate LibGen also make available a dump of their entire database, and monthly updates. They also provide some sort of front end. \n\nLINK TO THE DATABASE DUMPS: &lt;a href=&quot;\nftp://ftp.libgen.in/dbdumps/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nftp://ftp.libgen.in/dbdumps/&lt;/a&gt;\n \nYou can easily make a mirror. You don't have to download all 12TB. \n \nYou an AMP stack: a web server (Apache, nginx) a database (MySQL) and PHP.\nYou download the database dump and load it up.\nDownload the front-end software (the search works, but the CSS seems broken on my setup).\nEdit the config.php for your database connection parameters and the location of your repository files.\nThat's it.\n \nkarl_karlsson at the LibGen forum has made a portable USBWebserver that requires no installation. It facilitates all the tasks of downloading and updating the database. There is also a Manual in English. I have not tested this because I don't have a Windows installation.\n\nThe link to the USBWebserver thread (which contains links to the download): &lt;a href=&quot;\nhttp://genofond.org/viewtopic.php?f=17&amp;t=607&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://genofond.org/viewtopic.php?f=17&amp;t=607&lt;/a&gt;\n \nI'm not including the database backup because that comes compressed and it's 1.3 GB (uncompressed about 6GB). Don't worry, it only takes 5-10 minutes to load into your database. You can download it from the LibGen site. ftp://ftp.libgen.in/dbdumps/\n \nI'm not including the covers. There are about a million covers available, but that's over 20GB. I've downloaded them. You can get them from the LibGen site.\n\nThe covers can be found on this page: &lt;a href=&quot;\nftp://ftp.libgen.in/repository_torrent/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nftp://ftp.libgen.in/repository_torrent/&lt;/a&gt;\n \nThere is a forum. Most things are in Russian. Some is in English. Google translate does a fair job.\n \nPeople are helpful on the forum. There is a tutorial in English.\n \nIf there is interest, I am willing to help people get going with this.\n \nIt seems that it should be possible to relocate the files in a way that they could be simultaneously used as a mirror (personal or public) and seeding at the same time.\n \nOkay, that's all I'm going to write for now. I'll wait and see if there is any interest. At this point I don't even know if the torrent will be allowed to stay","torrent":{"xt":"urn:btih:fb713402f21e082fee19bfd3c2341ca38da23016","amp;dn":"The+Library+Genesis+Repository+2015-01-31+%28torrents+only%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb713402f21e082fee19bfd3c2341ca38da23016","infoHashBuffer":{"type":"Buffer","data":[251,113,52,2,242,30,8,47,238,25,191,211,194,52,28,163,141,162,48,22]},"announce":[],"urlList":[]}}