{"title":"FolderSizes v6.1.76 Professional (Disk Management and Analyzer)","uid":9009541,"size":19870176,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fbfecdbc2eccf7fec42e50231b26656fcf7a2606&amp;dn=FolderSizes+v6.1.76+Professional+%28Disk+Management+and+Analyzer%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"arMa","files":21,"time":1381098060,"description":"1) Enter any serial.\n2) Done!\n3) Enjoy. \n\n\nAnalyze, Visualize &amp; Manage Disk Space Instantly\n\nDesktop PCs, laptops and servers can quickly end up accumulating large quantities of unused, temporary, and duplicate files. Before you know it, you're out of drive space, backups are taking far too long to run, users can't find what they need, and you're struggling to plan for the future. \n\n Under active development since 2003, FolderSizes goes far beyond the capabilities of competing disk space analysis applications by combining several tools into one amazingly powerful Windows application. Learn why so many customers depend on FolderSizes.\n\n    Duplicate File Report\n    Quickly isolate and manage duplicate files within any folder or volume.\n    Largest Files Report\n    FolderSizes can quickly show you large files that are eating up drive space.\n    Types &amp; Attributes\n    See the distribution of disk usage by file type or attributes (with drill-down search).\n    Report Scheduler\n    Schedule the generation of nearly any report; build a history of file system changes.\n    Integration Ready\n    Deep, powerful command line and data export support.\n    Save and Reload Data\n    Save file system analysis results in XML format, and re-load them at a later date.\n    Email Support\n    Email reports directly to users from the command line or built-in scheduler.\n    File Type Groups\n    View drive space consumed by file type groups (&quot;music&quot;, &quot;image files&quot;, etc.).\n\n    Temporary Files Report\n    Eliminate temp file clutter left over from software installs, downloads &amp; browsing.\n    Scan Filtering\n    Filter file system scans by file name, date, owner name and much more.\n    Integrated Search\n    Search multiple paths for files &amp; folders by nearly any criteria (owner, size, age, etc.).\n    Directory Size Report\n    Awesome directory report view, with stunning graphical bar, pie, and map graphs.\n    Folder Map View\n    View an entire sub-folder hierarchy at once with our folder map visualization.\n    32 &amp; 64 Bit Support\n    FolderSizes provides full compatibility with 32 and 64 bit Windows operating systems.\n    Snapshot Comparison\n    Quickly compare disk space usage results from different points in time.\n    Affordable\n    Professional edition, single-user licenses start at only $55.00 USD.\n    Trend Analyzer\n    Analyze folder and drive space trends across multiple file system scan data snapshots.\n\n    Drive Space Monitor\n    Instant, at-a-glance view of any local, mapped, or removable disk.\n    File Owners Report\n    Discover which users are consuming the most space on local and network drives.\n    Oldest Files Report\n    Use your own criteria to find old files that may no longer be needed.\n    Sizes, Names &amp; Dates\n    Powerful, customizable file reports (age, size, names) with drill-down search support.\n    Unicode Enabled\n    Full Unicode support in all reporting, analysis, and export features.\n    Windows 8 Ready\n    FolderSizes has been tested to meet all of the technical requirements to be Compatible with Windows 8.\n    Multiple Path Support\n    Scan multiple paths in a single pass (and concurrently)!\n    Fast &amp; Efficient\n    FolderSizes runs on workstations and servers. It's fast and resource efficient.\n    Share Discovery\n    Discover and analyze network shares on servers or attached storage devices.\n","torrent":{"xt":"urn:btih:fbfecdbc2eccf7fec42e50231b26656fcf7a2606","amp;dn":"FolderSizes+v6.1.76+Professional+%28Disk+Management+and+Analyzer%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbfecdbc2eccf7fec42e50231b26656fcf7a2606","infoHashBuffer":{"type":"Buffer","data":[251,254,205,188,46,204,247,254,196,46,80,35,27,38,101,111,207,122,38,6]},"announce":[],"urlList":[]}}