{"title":"Walter Isaacson - The Innovators","uid":11173246,"size":5423819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fcc453cb84c0e74963b900c3d21e3204c3229abc&amp;dn=Walter+Isaacson+-+The+Innovators&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1412728832,"description":"Walter Isaacson - The Innovators: How a Group of Hackers, Geniuses, and Geeks Created the Digital Revolution\n\nFollowing his blockbuster biography of Steve Jobs, The Innovators is Walter Isaacson's revealing story of the people who created the computer and the Internet. It is destined to be the standard history of the digital revolution and an indispensable guide to how innovation really happens.\n\nWhat were the talents that allowed certain inventors and entrepreneurs to turn their visionary ideas into disruptive realities? What led to their creative leaps? Why did some succeed and others fail?\n\nIn his masterly saga, Isaacson begins with Ada Lovelace, Lord Byron's daughter, who pioneered computer programming in the 1840s. He explores the fascinating personalities that created our current digital revolution, such as Vannevar Bush, Alan Turing, John von Neumann, J.C.R. Licklider, Doug Engelbart, Robert Noyce, Bill Gates, Steve Wozniak, Steve Jobs, Tim Berners-Lee, and Larry Page.\n\nThis is the story of how their minds worked and what made them so inventive. It's also a narrative of how their ability to collaborate and master the art of teamwork made them even more creative.\n\nFor an era that seeks to foster innovation, creativity, and teamwork, The Innovators shows how they happen.\n\nISBN: 147670869X\nEAN: 9781476708690\nASIN: 147670869X\nPublisher: Simon &amp; Schuster\nPublication Date: 2014-10-07\nNumber of Pages: 560\n\n","torrent":{"xt":"urn:btih:fcc453cb84c0e74963b900c3d21e3204c3229abc","amp;dn":"Walter+Isaacson+-+The+Innovators","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc453cb84c0e74963b900c3d21e3204c3229abc","infoHashBuffer":{"type":"Buffer","data":[252,196,83,203,132,192,231,73,99,185,0,195,210,30,50,4,195,34,154,188]},"announce":[],"urlList":[]}}