{"title":"Plants, Herbs and their uses (food, medicine, magic)","uid":8964522,"size":142430105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fce192f677c7b50c3d16ad436db26150af033ae5&amp;dn=Plants%2C+Herbs+and+their+uses+%28food%2C+medicine%2C+magic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380185689,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\n\nAnyone who found these by searching for something other than Dungeons and Dragons, or by just browsing ebooks, could very likely find books (or shorter materials) worth reading is this collection. I certainly don't mean to exclude anyone with the suggested use. That being said...\n\nFor those of you who are checking this out as part of my Dungeons &amp; Dragons uploads, I can't express to you strongly enough how much detail (to whatever degree you're comfortable), danger and fun these materials can add to your adventure or ongoing campaign. Use them to heal, harm, feed, drug, search for, etc. etc. etc. Entire adventures can be planned around the hunt for a needed plant or antidote. Interesting shamanic characters can be created to use or sell them. Add them into your taverns food, your magic shop's supplies, or dole some out as treasure (with the right amount of forethought and research, a rare herb, spice or plant could be very valuable to a magic user, or even a cook!).  ","torrent":{"xt":"urn:btih:fce192f677c7b50c3d16ad436db26150af033ae5","amp;dn":"Plants%2C+Herbs+and+their+uses+%28food%2C+medicine%2C+magic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce192f677c7b50c3d16ad436db26150af033ae5","infoHashBuffer":{"type":"Buffer","data":[252,225,146,246,119,199,181,12,61,22,173,67,109,178,97,80,175,3,58,229]},"announce":[],"urlList":[]}}