{"title":"The Beatles fifty fabulous years (pdf){Zzzzz}","uid":11421811,"size":10152500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd95b974f5419d925dd5ea22e38b48ff380a1766&amp;dn=The+Beatles+fifty+fabulous+years+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415629092,"description":"Formed in Liverpool in 1960, The Beatles became one of the most commercially successful and critically acclaimed acts in the history of popular music. The group - John Lennon, Paul McCartney, George Harrison and Ringo Starr - built its reputation playing clubs in Liverpool and Hamburg over a three-year period from 1960. Moulded into a professional act by manager Brian Epstein, the creativity of producer George Martin enhanced their musical potential. They gained popularity in the UK after their first single, Love Me Do , became a modest hit in late 1962, and acquired the nickname the Fab Four as Beatlemania grew in Britain over the following year. By early 1964 they had become international stars, leading the British Invasion of the United States pop market.\n\nPublisher: G2 Entertainment/Rights (1 Nov 2013)\nLanguage: English\nISBN-10: 1909768006\nISBN-13: 978-1909768000\n\nBiography\nPop culture historian Robert Rodriguez has written or contributed to nine books. His newest, Fab Four FAQ 2.0: The Beatles' Solo Years 1970-1980, has just been published. Like its predecessor, Fab Four FAQ, it too has received critical and fan acclaim. Be sure to check out the website www.fabfourfaq2.com.\n\nComing in fall 2010: The Beatles - Fifty Fabulous Years\n\nA deluxe gift book in full color, featuring a DVD documentary!\n\nMost Helpful Customer Reviews\n\nANOTHER FAB READ FROM R R 17 Feb 2011\nBy R. W. Nason -\nThis book is a great overview of the Beatles' phenomenon.\nWritten with a 21st century perspective it also has the &quot;corrective lens&quot; of someone truly knowledgeable of the subject. A few accepted myths that have become part of the general lore are gently challenged here.\nA great place for neophytes to discover the FABS and for older fans to re-explore why they love them.\n\n\nOnce again Robert Rodriguez has HIT A HOME RUN! 16 Feb 2011\nBy NIEMSONG -\nThis is my third Robert Rodriguez book that I have and all of them are insightful and always tell me things I never knew about the BEST BAND EVER! Add to the great writing he also includes some great pictures of the FAB as well! I highly recommend to all BEATLE fans and even those who are not because their contributions to MUSIC and everything else is a slice of history that is important and won't be forgotten! Thanks again ROBERT and I can't wait for your next installment to be written and published!\n\nAt last...ONE fabulous Beatles book! 18 Jun 2011\nBy J.D. Guinness -\nOne of the nicest things about collecting the Beatles is that it's Finite. 13 albums, 5 movies, and that's It, you're done. Just be prepared to shell out $200-$300!\n\nWhy then, is there an INfinite number of books on the band, with still more being written? Haven't we heard all about them from every which way? Why buy another one? And if you don't have one, which one should you buy?\n\nTo answer the first question, Beatles merch continues to sell. Secondly, yes, there have already been hundreds of different books analyzing John Lennon, Paul McCartney, George Harrison and Ringo Starr in every possible way. (They are easily four of the most endlessly obsessed-over and dissected celebrities who ever lived, as if, by analyzing them, one could uncover their essence, the secret of their success, and, what? Bottle and sell it? Nonsense. It's Phenomena. And Phenomena, by definition - I think? - can't be explained). Third and fourthly, you should buy this book because it's by far the best one out there on the Beatles' story.\n\nTo me, it's always been the trajectory of their career, the story of their growth and love of experimentation that impresses more than any one particular Beatle, song, or film.\n\nLet me assure you I'm not related to the authors and I've absolutely nothing to gain from plugging this book! It's just that this is THE most colourful, satisfying Beatle book I've ever read, and folks, I have read TONS of `em for over 30 years.\n\nWhat makes this book so wonderful is how Robert Rodriguez can take an over-familiar story like the Beatles' and give it a fresh 21st-century spin with his own talent for storytelling -and indeed the Beatles' career was as distinctive and bizarre as any of the best fairy tales.\n\nRodriguez tells it in such a way that you are bewitched by the Boys yet again, marvelling again at their talent and amused yet again at how astonished THEY were to receive such ridiculously intense adoration.\n\nA cynic reading this or watching the classic newsreel footage of Beatlemania on the enclosed DVD by Les Krantz might conclude that the Beatles were &quot;merely lucky&quot; to have hit upon mass adulation at a time when the world was wanting to go &quot;that nuts&quot; anyway, about SOMETHING (as a way of &quot;cheering up&quot; after the JFK assassination!) and indeed at a time when records, TV, films, newspapers, and advertising were just hitting their stride at the power of Mass Persuasion, but that is all quite beside the point.\n\nI doubt I can explain the phenomenon of the Beatles any better than the many clever folk who have already tried, BUT...I put it to you that success in any field is all about two words: Be Ready.\n\nIt just so happened that John, Paul, George, and Ringo were Ready for us, and we caved.\n\nMaybe that was it?\n\nAs I say, the beauty of this book is not only its obvious, physical beauty, nice typeface and many, many well-chosen evocative pictures of the Fabs (many of which are sharp, clear, perfectly rendered frame blow-ups from the films and TV appearances) as well as tons of Fab memorabilia and genuinely fun Fab Facts, it's how Rodriguez tells the story with perfect accuracy, warmth, and a very admirable economy, complete with artful and not bumpy segues into chapters on the Beatles' Films and the Beatles' Women. Not too short, not too long. And of course the free DVD in an already affordable book is another very attractive incentive to buy! You'll see and hear the Boys yukking it up with the press in that wonderfully sardonic Liverpudlian wit, and there are clips from all their movies, just don't expect to hear any Beatles music on it.\n\nWho cares, though, right? You've already got all the records. Er, CDs, er, mp3s... Anyway! This is a Beatles Companion, with a DVD! Best to keep the DVD in a paper envelope, though, because once you've got the thing out of its plastic casing, it's difficult to put back... a very tight fit. Just a friendly warning.\n\nFor a book that captures the full Beatles story in all its bewitching, oddly serendipitous and inexplicably colourful, mass-repercussion glory, WITHOUT yapping on and on and on, showing John, Paul, George, and Ringo's staggering, super-hero like metamorphosis from struggling musicians to being immortalized as bouncy-but-earnest cartoon characters in The Beatles Rock Band video game, All You Need Is The Beatles: Fifty Fabulous Years By Robert Rodriguez And Les Krantz...for now! :)\n\nInteresting 24 July 2011\nBy Winnie the Pooh -\nI have purchased this ebook fromand I have started reading, but I haven't finished it, but I really loved the Beatles as a teenager and I am very happy to find the early information about this amazing group. I would recommend this to anyone if they would like to go back in time and see and understand when and how the Beatles started. Very informational","torrent":{"xt":"urn:btih:fd95b974f5419d925dd5ea22e38b48ff380a1766","amp;dn":"The+Beatles+fifty+fabulous+years+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd95b974f5419d925dd5ea22e38b48ff380a1766","infoHashBuffer":{"type":"Buffer","data":[253,149,185,116,245,65,157,146,93,213,234,34,227,139,72,255,56,10,23,102]},"announce":[],"urlList":[]}}