{"title":"Integer Algorithms in Cryptology and Information Assurance (2014","uid":11244871,"size":3000041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe7e43ff0a288675c2b5ae94ab4f27b5cfaa5931&amp;dn=Integer+Algorithms+in+Cryptology+and+Information+Assurance+%282014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1413725571,"description":"Book Description:\n\nInteger Algorithms in Cryptology and Information Assurance is a collection of the author's own innovative approaches in algorithms and protocols for secret and reliable communication. It concentrates on the &quot;what&quot; and &quot;how&quot; behind implementing the proposed cryptographic algorithms rather than on formal proofs of &quot;why&quot; these algorithms work.\n\nThe book consists of five parts (in 28 chapters) and describes the author's research results in:\n\nInnovative methods in cryptography (secret communication between initiated parties);\nCryptanalysis (how to break the encryption algorithms based on computational complexity of integer factorization and discrete logarithm problems);\nHow to provide a reliable transmission of information via unreliable communication channels and;\nHow to exploit a synergetic effect that stems from combining the cryptographic and information assurance protocols.\nThis text contains innovative cryptographic algorithms; computationally efficient algorithms for information assurance; new methods to solve the classical problem of integer factorization, which plays a key role in cryptanalysis; and numerous illustrative examples and tables that facilitate the understanding of the proposed algorithms.\n\nThe fundamental ideas contained within are not based on temporary advances in technology, which might become obsolete in several years. The problems addressed in the book have their own intrinsic computational complexities, and the ideas and methods described in the book will remain important for years to come.\n\nReadership: Integer Algorithms in Cryptology and Information Assurance would be a book of interest for researchers and developers working on telecommunication security and/or reliability, in industries such as business and banking, national security agencies, militaries, interplanetary space exploration, and telemedicine. Faculty members in Computer Science, Electrical Engineering, Information Technology, Bio-Engineering and Applied Mathematics Departments, who are planning to teach advanced courses in cryptography; graduate and PhD students; advanced undergraduate students of the same fields; and various national cryptographic societies would also find this book useful.\n\nProduct Details:\n\nPDF: 458 pages\nPublisher: World Scientific Publishing Company (November 5, 2014)\nLanguage: English\nISBN-10: 9814623741\nISBN-13: 978-9814623742\nAmazon Link:\n\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up","torrent":{"xt":"urn:btih:fe7e43ff0a288675c2b5ae94ab4f27b5cfaa5931","amp;dn":"Integer+Algorithms+in+Cryptology+and+Information+Assurance+%282014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7e43ff0a288675c2b5ae94ab4f27b5cfaa5931","infoHashBuffer":{"type":"Buffer","data":[254,126,67,255,10,40,134,117,194,181,174,148,171,79,39,181,207,170,89,49]},"announce":[],"urlList":[]}}