{"title":"The Everly Brothers - 5 Albums [FLAC]","uid":9431326,"size":1425246460,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fef19e7f541499d9f1a033b6bf8184835bd58ecc&amp;dn=The+Everly+Brothers+-+5+Albums+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"politux","files":-1,"time":1388811026,"description":"\n  The Everly Brothers - 5 Albums [FLAC]\n\n  Genre: Pop/Rock, Country\n  Styles: Rockabilly, Folk-Rock, Country-Rock\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n  \n  1960 It's Everly Time\n  1960 Fabulous Style of the Everly Brothers \n  1961 Both Sides of an Evening \n  1972 Stories We Could Tell\n  2006 Love Songs\n\n  The Everly Brothers were not only among the most important and best early rock &amp; roll stars, but also among the most influential rockers of any era. They set unmatched standards for close, two-part harmonies and infused early rock &amp; roll with some of the best elements of country and pop music. Their legacy was and is felt enormously in all rock acts that employ harmonies as prime features, from the Beatles, Simon &amp; Garfunkel, and legions of country-rockers to modern-day roots rockers like Dave Edmunds and Nick Lowe (who once recorded an EP of Everlys songs together).\n\nDon (born February 1, 1937) and Phil (born January 19, 1939) were professionals way before their teens, schooled by their accomplished guitarist father Ike, and singing with their family on radio broadcasts in Iowa. In the mid-'50s, they made a brief stab at conventional Nashville country with Columbia. When their single flopped, they were cast adrift for quite a while until they latched onto Cadence. Don invested their first single for the label, &quot;Bye Bye Love,&quot; with a Bo Diddley beat that helped lift the song to number two in 1957.\n\n&quot;Bye Bye Love&quot; began a phenomenal three-year string of classic hit singles for Cadence, including &quot;Wake Up Little Susie,&quot; &quot;All I Have to Do Is Dream,&quot; &quot;Bird Dog,&quot; &quot;('Til) I Kissed You,&quot; and &quot;When Will I Be Loved.&quot; The Everlys sang of young love with a heart-rending yearning and compelling melodies. The harmonies owed audible debts to Appalachian country music, but were imbued with a keen modern pop sensibility that made them more accessible without sacrificing any power or beauty. They were not as raw as the wild rockabilly men from Sun Records, but they could rock hard when they wanted. Even their midtempo numbers and ballads were executed with a force missing in the straight country and pop tunes of the era. The duo enjoyed a top-notch support team of producer Archie Bleyer, great Nashville session players like Chet Atkins, and the brilliant songwriting team of Boudleaux and Felice Bryant. Don, and occasionally Phil, wrote excellent songs of their own as well.\n\nIn 1960, The Everlys left Cadence for a lucrative contract with the then-young Warner Bros. label (though it's not often noted, The Everlys would do a lot to establish Warners as a major force in the record business). It's sometimes been written that the duo never recaptured the magic of their Cadence recordings, but actually Phil and Don peaked both commercially and artistically with their first Warners releases. &quot;Cathy's Clown,&quot; their first Warners single, was one of their greatest songs and a number one hit. Their first two Warners LPs, employing a fuller and brasher production than their Cadence work, were not just among their best work, but two of the best rock albums of the early '60s. The hits kept coming for a couple of years, some great (&quot;Walk Right Back,&quot; &quot;Temptation&quot;), some displaying a distressing, increasing tendency toward soft pop and maudlin sentiments (&quot;Ebony Eyes,&quot; &quot;That's Old Fashioned&quot;).\n\nDon and Phil's personal lives came under a lot of stress in the early '60s: they enlisted into the Marine Corps Reserves (together), and studied acting for six months but never made a motion picture. More seriously, Don developed an addiction to speed and almost died of an overdose in late 1962. By that time, their career as chart titans in the U.S. had ended; &quot;That's Old Fashioned&quot; (1962) was their last Top Ten hit. Their albums became careless, erratic affairs, which was all the more frustrating because many of their flop singles of the time were fine, even near-classic efforts that demonstrated they could still deliver the goods.\n\n  Virtually alone among first-generation rock &amp; roll superstars, The Everlys stuck with no-nonsense rock &amp; roll and remained determined to keep their sound contemporary, rather than drifting toward soft pop or country like so many others. Although their mid-'60s recordings were largely ignored in America, they contained some of their finest work, including a ferocious Top 40 single in 1964 (&quot;Gone, Gone, Gone&quot;). They remained big stars overseas -- in 1965, &quot;Price of Love&quot; went to number two in the U.K. at the height of the British Invasion. They incorporated jangling Beatle/Byrdesque guitars into some of their songs and recorded a fine album with the Hollies (who were probably more blatantly influenced by The Everlys than any other British band of the time). In the late '60s, they helped pioneer country-rock with the 1968 album Roots, their most sophisticated and unified full-length statement. None of this revived their career as hitmakers, though they could always command huge audiences on international tours and hosted a network TV variety show in 1970.\n\n  The decades of enforced professional togetherness finally took their toll on the pair in the early '70s, which saw a few dispirited albums and, finally, an acrimonious breakup in 1973. They spent the next decade performing solo, which only proved -- as is so often the case in close-knit artistic partnerships -- how much each brother needed the other to sound his best. In 1983, enough water had flowed under the bridge for the two to resume performing and recording together. The tours, with a backup band led by guitarist Albert Lee, proved they could still sing well. The records (both live and studio) were fair efforts that, in the final estimation, were not in nearly the same league as their '50s and '60s classics, although Paul McCartney penned a small hit single for them (&quot;On the Wings of a Nightingale&quot;). One of the more successful and dignified reunions in the rock annals, The Everlys continued to perform live, although they didn't release albums together after the late '80s.","torrent":{"xt":"urn:btih:fef19e7f541499d9f1a033b6bf8184835bd58ecc","amp;dn":"The+Everly+Brothers+-+5+Albums+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef19e7f541499d9f1a033b6bf8184835bd58ecc","infoHashBuffer":{"type":"Buffer","data":[254,241,158,127,84,20,153,217,241,160,51,182,191,129,132,131,91,213,142,204]},"announce":[],"urlList":[]}}