{"title":"Narrow Houses - New Directions in Efficient Design (Art Ebook)","uid":11802499,"size":24061490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff4f572ec065b2695509186ef3cd29bfe8d06ac7&amp;dn=Narrow+Houses+-+New+Directions+in+Efficient+Design+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1428444497,"description":"Avi Friedman, &quot;Narrow Houses: New Directions in Efficient Design&quot;\nISBN: 1568988737 | 2010 | PDF | 240 pages | 23 MB\n\nSince the beginning of the housing boom of the 1950s, the size of the average North American house has steadily grown while the size of the average family has decreased. Today, a growing number of homebuyers seeking smaller, more efficient residential designs are rediscovering a centuries old housing prototype: the narrow house. Measuring twenty-five-feet wide or less, these &quot;infill&quot; or &quot;skinny&quot; houses, as they are often called, are on the rise in cities and suburbs around the world. The benefits of building small and narrow are numerous: greater land-use efficiency, less building material, fewer infrastructure costs, lower utility bills, and flexible layouts. This building type creates environmentally sensible houses that allow homeowners to live within their means. Narrow Houses presents a thorough overview of the practical considerations of designing a narrow-front home, including siting, floor arrangements, footprint, and interior and exterior finishing. The book documents twenty-eight innovative examples of narrow houses from around the world designed by today's foremost architects. Project data including floor plans and extensive interior and exterior photography demonstrate the inherent flexibility of this housing model and the many possibilities for adapting these homes to the constraints of site, climate, budget, family size, and other needs","torrent":{"xt":"urn:btih:ff4f572ec065b2695509186ef3cd29bfe8d06ac7","amp;dn":"Narrow+Houses+-+New+Directions+in+Efficient+Design+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4f572ec065b2695509186ef3cd29bfe8d06ac7","infoHashBuffer":{"type":"Buffer","data":[255,79,87,46,192,101,178,105,85,9,24,110,243,205,41,191,232,208,106,199]},"announce":[],"urlList":[]}}