{"title":"Python Pocket Reference: Fourth Edition","uid":9152604,"size":4407492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff5d18c43ca8ba673c6bdf1a4d1ebbe8249d0903&amp;dn=Python+Pocket+Reference%3A+Fourth+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383721685,"description":"This is the book to reach for when you're coding on the fly and need an answer now. It's an easy-to-use reference to the core language, with descriptions of commonly used modules and toolkits, and a guide to recent changes, new features, and upgraded built-ins - all updated to cover Python 3. X as well as version 2.6. You'll also quickly find exactly what you need with the handy index. Written by Mark Lutz - widely recognized as the world's leading Python trainer - Python Pocket Reference, Fourth Edition, is the perfect companion to O'Reilly's classic Python tutorials, also written by Mark: Learning Python and Programming Python. Built-in object types, including numbers, lists, dictionaries, and more Statements and syntax for creating and processing objects Functions and modules for structuring and reusing code Python's object-oriented programming tools The exception-handling model Built-in functions, exceptions, and attributes Special operator overloading methods Widely used standard library modules and extensions Command-line options and development tools Python idioms and hints","torrent":{"xt":"urn:btih:ff5d18c43ca8ba673c6bdf1a4d1ebbe8249d0903","amp;dn":"Python+Pocket+Reference%3A+Fourth+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff5d18c43ca8ba673c6bdf1a4d1ebbe8249d0903","infoHashBuffer":{"type":"Buffer","data":[255,93,24,196,60,168,186,103,60,107,223,26,77,30,187,232,36,157,9,3]},"announce":[],"urlList":[]}}